(function e(t,n,r){function s(o,u){if(!n[o]){if(!t[o]){var a=typeof require=="function"&&require;if(!u&&a)return a(o,!0);if(i)return i(o,!0);var f=new Error("Cannot find module '"+o+"'");throw f.code="MODULE_NOT_FOUND",f}var l=n[o]={exports:{}};t[o][0].call(l.exports,function(e){var n=t[o][1][e];return s(n?n:e)},l,l.exports,e,t,n,r)}return n[o].exports}var i=typeof require=="function"&&require;for(var o=0;o<r.length;o++)s(r[o]);return s})({1:[function(require,module,exports){
/* 
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */

(function () {
  var Converter = require('./cadXML2GeoJSON.js');
  var data = {

    init: function (map, reproject) {
      data._map = map;
      data.reproject = reproject;
      data._geoContent = {

      };

      data._exportCont = document.getElementById('exportCont');
      data._fileProgress = document.getElementById('fileProgress');
      var exportIcon = null;
      if (navigator.msSaveBlob) { // IE 10+
        exportIcon = L.DomUtil.create('button', 'button', data._exportCont);
      } else {
        exportIcon = L.DomUtil.create('a', 'button', data._exportCont);
        exportIcon.setAttribute('target', '_blank');
        exportIcon.setAttribute('href', '');
      }
      exportIcon.innerHTML = 'Экспорт в GeoJSON';
      var convertCoord = L.DomUtil.get('convertMSK');
      L.DomUtil.removeClass(convertCoord, 'hidden');
      data._countSpan = L.DomUtil.create('span', '', data._exportCont);
      exportIcon.addEventListener('click', function () {
        var obj = data.getBlob(convertCoord.checked);
        if (navigator.msSaveOrOpenBlob) { // IE 10+
          navigator.msSaveOrOpenBlob(obj.blob, obj.file);
        } else {
          exportIcon.setAttribute('download', obj.file);
          exportIcon.setAttribute('href', window.URL.createObjectURL(obj.blob));
        }
        data._countSpan.innerHTML = '(геометрий: <b>' + obj.count + '</b>)';
      }, false);
      L.DomUtil.addClass(data._exportCont, 'hidden');
      data._kptInfo = document.getElementById('kptInfo');
      data._groups = {};
    },

    selectFile: function (el) {
      data._kptInfo.innerHTML = '';
      L.DomUtil.addClass(data._exportCont, 'hidden');
      var reader = new FileReader(),
              file = el.files[0];
      reader.onload = function () {
        data._fileProgress.innerHTML = 'загружено: <b>' + file.size + '</b> байт';
//        Object.keys(data._groups).forEach(function (type) {
//          var group = data._groups[type];
//          group.clearLayers();
//          data._map.removeLayer(group);
//        });
//        data._groups = {};
//        Object.keys(data._groupsMsk).forEach(function (type) {
//          var group = data._groupsMsk[type];
//          group.clearLayers();
//        });
//        data._groupsMsk = {};
        data.parseFile(reader);
      };
      reader.onprogress = function (data) {
        if (data.lengthComputable) {
          L.DomUtil.removeClass(data._resCont, 'hidden');
          var cnt = data.loaded / data.total;
          data._fileProgress.innerHTML = 'загружено: <b>' + data.loaded + '</b> байт' + (cnt === 1 ? '' : '(' + parseInt(cnt * 100, 10) + '%)');
        }
      };
      if (el.files.length) {
        reader.readAsText(file);
      }
    },

    parseFile: function (reader) {
      // https://bitbucket.org/surenrao/xml2json
      // http://www.chrome-allow-file-access-from-file.com/
      var parsedData = Converter.GeoJSON(reader.result);
      console.log(parsedData.geoJSONParcels);
//      $.get('./testdata/doc2161974.xml', function (xml) {
//        //var json = $.xml2json(xml).CadastralBlocks;
//        // $("#data").html('<code>'+JSON.stringify(json)+'</code>');
//        console.log(Converter.GeoJSON);
//        parsedData = Converter.GeoJSON(xml, true);
//      }).success(
//              function () {
//                $('#loading').toggleClass('hidden');
//                var zones = parsedData.geoJSONZones;
//                var quartal = parsedData.geoJSONQuartal;
//                var bounds = parsedData.geoJSONBounds;
//              });
    }
  };
  window.convertedData = data;
})();

},{"./cadXML2GeoJSON.js":3}],2:[function(require,module,exports){
/* 
 * The MIT License
 *
 * Copyright 2015 filippov.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */
'use strict';
// Dicts

// Статус объекта недвижимости
var dStates = {
    '01': 'Ранее учтенный',
    '05': 'Временный',
    '06': 'Учтенный',
    '07': 'Снят с учета',
    '08': 'Аннулированный'
};
// Тип  объекта недвижимости
var dParcels = {
    '01': 'Землепользование',
    '02': 'Единое землепользование',
    '03': 'Обособленный участок',
    '04': 'Условный участок',
    '05': 'Многоконтурный участок',
    '06': 'Значение отсутствует'
};
// Категория земель
var dCategories = {
    '003001000000': 'Земли сельскохозяйственного назначения',
    '003002000000': 'Земли населённых пунктов',
    '003003000000': 'Земли промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, земли для обеспечения космической деятельности, земли обороны, безопасности и земли иного специального назначения',
    '003004000000': 'Земли особо охраняемых территорий и объектов',
    '003005000000': 'Земли лесного фонда',
    '003006000000': 'Земли водного фонда',
    '003007000000': 'Земли запаса',
    '003008000000': 'Категория не установлена'
};
// Ограничения (обременения) прав
var dEncumbrances = {
	'022001000000': 'Сервитут',
	'022001001000': 'Публичный сервитут',
	'022001002000': 'Частный сервитут',
	'022002000000': 'Арест',
	'022003000000': 'Запрещение',
	'022004000000': 'Ограничения прав на земельный участок, предусмотренные статьями 56, 56.1 Земельного кодекса Российской Федерации',
	'022005000000': 'Решение об изъятии земельного участка, жилого помещения',
	'022006000000': 'Аренда (в том числе, субаренда)',
	'022007000000': 'Ипотека',
	'022008000000': 'Ипотека в силу закона',
	'022009000000': 'Безвозмездное (срочное) пользование земельным/лесным участком',
	'022010000000': 'Доверительное управление',
	'022011000000': 'Рента',
	'022012000000': 'Запрет на совершение действий в сфере ГКУ в отношении ОН',
	'022099000000': 'Иные ограничения (обременения) прав'
};
// Единицы измерений
var dUnits = {
	'003': 'Миллиметр',
	'004': 'Сантиметр',
	'005': 'Дециметр',
	'006': 'Метр',
	'008': 'Километр',
	'009': 'Мегаметр',
	'047': 'Морская миля',
	'050': 'Квадратный миллиметр',
	'051': 'Квадратный сантиметр',
	'053': 'Квадратный дециметр',
	'055': 'Квадратный метр',
	'058': 'Тысяча квадратных метров',
	'059': 'Гектар',
	'061': 'Квадратный километр',
	'109': 'Ар (100 м2)',
	'359': 'Сутки',
	'360': 'Неделя',
	'361': 'Декада',
	'362': 'Месяц',
	'364': 'Квартал',
	'365': 'Полугодие',
	'356': 'Час',
	'355': 'Минута ',
	'366': 'Год',
	'383': 'Рубль',
	'384': 'Тысяча рублей',
	'385': 'Миллион рублей',
	'386': 'Миллиард рублей',
	'1000': 'Неопределено',
	'1001': 'Значение отсутствует',
	'1002': 'Рублей за кв. метр',
	'1003': 'Рублей за ар',
	'1004': 'Рублей  за гектар',
	'1005': 'Иные',
	'1006': 'Рублей за кв. км',
	'1007': 'Рабочий день'
};
// Все документы (Сборник классификаторов, коды 8.1, 8.2, 555, 558.1, 558.2, 558.3, 558.4, 558.5, 558.6)
var dAllDocuments = {
	'008001000000': 'Документы, удостоверяющие личность физического лица',
	'008001001000': 'Паспорт гражданина Российской Федерации',
	'008001002000': 'Паспорт гражданина СССР',
	'008001003000': 'Паспорт гражданина иностранного государства',
	'008001004000': 'Общегражданский заграничный паспорт',
	'008001005000': 'Заграничный паспорт Министерства морского флота',
	'008001006000': 'Дипломатический паспорт',
	'008001007000': 'Паспорт моряка (удостоверение личности моряка)',
	'008001008000': 'Военный билет военнослужащего',
	'008001009000': 'Временное удостоверение, выданное взамен военного билета',
	'008001010000': 'Удостоверение личности офицера Министерства обороны Российской Федерации, Министерства внутренних дел Российской Федерации и других воинских формирований с приложением справки о прописке (регистрации) Ф-33',
	'008001011000': 'Свидетельство о рождении',
	'008001012000': 'Свидетельство о рассмотрении ходатайства о признании беженцем на территории Российской Федерации по существу',
	'008001013000': 'Вид на жительство иностранного гражданина или лица без гражданства',
	'008001014000': 'Справка об освобождении из мест лишения свободы',
	'008001015000': 'Временное удостоверение личности гражданина Российской Федерации',
	'008001016000': 'Удостоверение вынужденного переселенца',
	'008001017000': 'Разрешение на временное проживание в Российской Федерации',
	'008001018000': 'Удостоверение беженца в Российской Федерации',
	'008001019000': 'Свидетельство о рассмотрении ходатайства о признании лица вынужденным переселенцем',
	'008001020000': 'Свидетельство о предоставлении временного убежища на территории Российской Федерации',
	'008001099000': 'Иные документы, предусмотренные законодательством Российской Федерации или признаваемые в соответствии с международным договором Российской Федерации в качестве документов, удостоверяющих личность',
	'008002000000': 'Документы, идентифицирующие юридическое лицо',
	'008002001000': 'Свидетельство о государственной регистрации юридического лица',
	'008002002000': 'Свидетельство о внесении записей в ЕГРЮЛ',
	'008002004000': 'Устав',
	'008002005000': 'Учредительный договор',
	'008002006000': 'Положение (общее положение об организации)',
	'008002007000': 'Свидетельство (или уведомление) о постановке на учёт в налоговом органе с указанием ИНН',
	'008002008000': 'Выписка из ЕГРЮЛ',
	'008002099000': 'Иной документ',
	'555001000000': 'Квитанция',
	'555002000000': 'Платёжное поручение',
	'555003000000': 'Чек',
	'555004000000': 'Подтверждение электронного платежа',
	'555005000000': 'Документ, подтверждающий право заявителя на безвозмездное получение сведений',
	'558100000000': 'ЗАЯВЛЕНИЯ',
	'558101000000': 'Заявления и запросы, связанные с государственным кадастровым учётом',
	'558101010000': 'Запрос о предоставлении сведений, внесённых в государственный кадастр недвижимости, в виде кадастровой выписки об объекте недвижимости, кадастрового паспорта объекта недвижимости и кадастрового плана территории, кадастровой справки о кадастровой стоимости объекта недвижимости',
	'558101020000': 'Заявление о постановке на государственный кадастровый учёт объекта недвижимости',
	'558101030000': 'Заявление о государственном кадастровом учёте изменений объекта недвижимости',
	'558101040000': 'Заявление о внесении в Единый государственный реестр объектов капитального строительства (ЕГРОКС) сведений об объекте капитального строительства (ОКС)',
	'558101050000': 'Запрос о предоставлении сведений об ОКС',
	'558101060000': 'Заявление о снятии с государственного кадастрового учёта объекта недвижимости',
	'558101070000': 'Заявление о внесении в государственный кадастр недвижимости сведений о ранее учтённом объекте недвижимости',
	'558101080000': 'Заявление об исправлении кадастровой ошибки',
	'558101090000': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости',
	'558101090100': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости об объекте недвижимости',
	'558101090200': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости о прохождении участка Государственной границы Российской Федерации; о границах между субъектами Российской Федерации; о границах муниципальных образований; о границах населённых пунктов; о территориальных зонах и зонах с особыми условиями использования территорий; о картографической и геодезической основах государственного кадастра недвижимости',
	'558101100000': 'Заявление о представлении дополнительных документов на государственный кадастровый учёт',
	'558101110000': 'Внутриведомственный запрос информации государственного кадастра недвижимости',
	'558101120000': 'Запрос о предоставлении копии документа, на основании которого сведения об объекте недвижимости внесены в государственный кадастр недвижимости',
	'558101130000': 'Запрос о предоставлении сведений, внесённых в государственный кадастр недвижимости, посредством обеспечения доступа к информационному ресурсу, содержащему сведения государственного кадастра недвижимости',
	'558101140000': 'Запрос о предоставлении перечня объектов недвижимости, подлежащих государственной кадастровой оценке',
	'558101150000': 'Заявление о прекращении осуществления кадастрового учёта',
	'558101160000': 'Межведомственный запрос документов в органах государственной власти и органах местного самоуправления',
	'558101170000': 'Запрос документов о ранее учтённом объекте недвижимости в органах государственной власти, органах местного самоуправления или органах и организациях по государственному техническому учёту и (или) технической инвентаризации',
	'558102000000': 'Заявления и запросы, связанные с регистрацией прав',
	'558102010000': 'Заявление о государственной регистрации права на недвижимое имущество, сделки с ним, ограничения (обременения), перехода, прекращения права на недвижимое имущество',
	'558102020000': 'Заявление о государственной регистрации прекращения права (ограничения (обременения) права)',
	'558102030000': 'Заявление о внесении изменений в ЕГРП',
	'558102040000': 'Заявление об исправлении технической ошибки',
	'558102050000': 'Заявление о представлении дополнительных документов для государственной регистрации прав',
	'558102060000': 'Заявление о приостановлении государственной регистрации прав на недвижимое имущество и сделок с ним',
	'558102070000': 'Заявление о возобновлении государственной регистрации',
	'558102080000': 'Заявление о прекращении государственной регистрации',
	'558102090000': 'Заявление о повторной выдаче свидетельства о государственной регистрации права',
	'558102100000': 'Запрос о предоставлении сведений, содержащихся в Едином государственном реестре прав на недвижимое имущество и сделок с ним',
	'558102110000': 'Заявление о постановке на учёт бесхозяйных недвижимых вещей',
	'558102120000': 'Заявление о выдаче закладной (новой закладной, дубликата закладной, аннулированной закладной)',
	'558102130000': 'Запрос о выдаче копий договоров и иных документов, выражающих содержание односторонних сделок, совершенных в простой письменной форме',
	'558102140000': 'Заявление о приостановлении государственной регистрации, возврате документов без проведения государственной регистрации, представлении дополнительных документов, о возобновлении государственной регистрации, ранее приостановленной по заявлению правообладателя, стороны (сторон) сделки, лица, чьё право ограничивается (обременяется), лица, в пользу которого право ограничивается (обременяется), законного владельца закладной (их представителя)',
	'558102150000': 'Заявление о повторной выдаче нового свидетельства о государственной регистрации права, выдаче закладной, внесении изменений в запись Единого государственного реестра прав на недвижимое имущество и сделок с ним, погашении регистрационной записи об ипотеке',
	'558102160000': 'Заявление о принятии объекта недвижимого имущества вновь во владение, пользование и распоряжение (в собственность)',
	'558102170000': 'Заявление о внесении в Единый государственный реестр прав на недвижимое имущество и сделок с ним отметки о наличии судебного спора в отношении зарегистрированного права',
	'558102180000': 'Заявление об исправлении технической ошибки в записях Единого государственного реестра прав на недвижимое имущество и сделок с ним, о наличии возражения в отношении зарегистрированного права на объект недвижимости, о погашении записи в Едином государственном реестре прав на недвижимое имущество и сделок с ним о наличии возражения в отношении зарегистрированного права на объект недвижимости, о невозможности государственной регистрации перехода, ограничения (обременения), прекращения права на объект недвижимости без личного участия собственника (его законного представителя), об отзыве ранее представленного заявления о невозможности государственной регистрации перехода, ограничения (обременения), прекращения права на объект недвижимости без личного участия собственника (его законного представителя)',
	'558102190000': 'Заявление о скреплении добавочного листа (добавочных листов) с закладной',
	'558102200000': 'Запрос о предоставлении сведений, содержащихся в Едином государственном реестре прав на недвижимое имущество и сделок с ним, посредством обеспечения доступа к информационному ресурсу, содержащему сведения Единого государственного реестра прав на недвижимое имущество и сделок с ним',
	'558102210000': 'Заявление о государственной регистрации законного владельца закладной',
	'558102220000': 'Заявление о внесении изменений в запись Единого государственного реестра прав на недвижимое имущество и сделок с ним, погашении регистрационной записи об ипотеке',
	'558103000000': 'Заявления о государственном учёте зданий, сооружений, помещений, объектов незавершённого строительства (объектов учёта) и запросы о предоставлении сведений, внесённых в Единый государственный реестр',
	'558103010000': 'Заявление о постановке на государственный учёт объекта учёта',
	'558103020000': 'Заявление о внесении в ЕГРОКС сведений о ранее учтённом объекте капитального строительства',
	'558103030000': 'Заявление о государственном учёте изменений объекта учёта',
	'558103040000': 'Заявление о снятии с государственного учёта объекта учёта',
	'558103050000': 'Заявление об исправлении технической ошибки',
	'558103060000': 'Заявление об исключении сведений из ЕГРОКС, носящих временный характер',
	'558103070000': 'Запрос о предоставлении копии документа, на основании которого сведения об объекте внесены в Единый государственный реестр',
	'558103080000': 'Запрос о предоставлении сведений, внесенных в Единый государственный реестр',
	'558103090000': 'Заявление о представлении дополнительных документов на государственный учёт',
	'558104000000': 'Заявление о возврате платежа',
	'558199000000': 'Иное заявление',
	'558200000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ ОПИСАНИЕ ОБЪЕКТА',
	'558201000000': 'Описание земельных участков',
	'558202000000': 'Землеустроительное дело',
	'558203000000': 'Межевой план',
	'558204000000': 'Документ (копия), на основании которого сведения об объекте недвижимости внесены в ГКН',
	'558205000000': 'Технический паспорт объекта учёта',
	'558205010000': 'Технический паспорт домовладения',
	'558205020000': 'Технический паспорт здания (строения)',
	'558205030000': 'Технический паспорт жилого помещения (квартиры)',
	'558205040000': 'Технический паспорт объекта индивидуального жилищного строительства',
	'558205050000': 'Технический паспорт сооружения',
	'558205060000': 'Технический паспорт объекта незавершённого строительства',
	'558206000000': 'Выписка из технического паспорта',
	'558206010000': 'Выписка из технического паспорта на здание (строение)',
	'558206020000': 'Выписка из технического паспорта БТИ',
	'558207000000': 'Документ (копия), подтверждающий разрешение земельного спора о согласовании местоположения границ земельного участка',
	'558208000000': 'Документ (копия), подтверждающий принадлежность земельного участка к определенной категории земель',
	'558209000000': 'Документ (копия), подтверждающий установленное разрешенное использование земельного участка',
	'558210000000': 'Кадастровый план земельного участка (выписка из государственного земельного кадастра)',
	'558211000000': 'Планы иных объектов недвижимости',
	'558211010000': 'Технический план здания, сооружения, помещения либо объекта незавершённого строительства',
	'558211020000': 'План участка лесного фонда',
	'558211030000': 'План объекта недвижимости',
	'558211040000': 'Экспликация к поэтажному плану',
	'558212000000': 'Декларация об объекте недвижимости',
	'558213000000': 'Кадастровый паспорт объекта недвижимости',
	'558213010000': 'Кадастровый паспорт земельного участка',
	'558213020000': 'Кадастровый паспорт помещения (выписка из ГКН)',
	'558213030000': 'Кадастровый паспорт здания, сооружения, объекта незавершённого строительства',
	'558214000000': 'Кадастровая выписка об объекте недвижимости',
	'558214010000': 'Кадастровая выписка о земельном участке',
	'558214020000': 'Кадастровая выписка о здании, сооружении, объекте незавершённого строительства',
	'558216000000': 'Документ, подтверждающий изменение назначения здания, помещения или сооружения, наименования сооружения',
	'558217000000': 'Кадастровый план территории',
	'558218000000': 'Кадастровая справка о кадастровой стоимости объекта недвижимости',
	'558219000000': 'Акт обследования, подтверждающий прекращение существования объекта учёта',
	'558220000000': 'Документы, в виде которых предоставляются сведения Единого государственного реестра',
	'558220010000': 'Выписка из Реестра, содержащая относящиеся к информации ограниченного доступа сведения об объекте учета',
	'558220020000': 'Справка, содержащая, внесённые в Единый государственный реестр сведения о прекращении существования объекта учёта',
	'558220030000': 'Выписка из Реестра, подтверждающая факт отсутствия в Реестре сведений об объекте учета',
	'558221000000': 'ПРОЧИЕ',
	'558221010000': 'Решение о необходимости устранения кадастровой ошибки',
	'558221020000': 'Международный договор Российской Федерации, в соответствии с которым установлено или изменено прохождение государственной границы Российской Федерации',
	'558221030000': 'Документ, содержащий необходимые для внесения в государственный кадастр недвижимости сведения о границах между субъектами Российской Федерации, границах муниципального образования, границах населённого пункта',
	'558221040000': 'Документ, содержащий необходимые для внесения в государственный кадастр недвижимости сведения об установлении или изменении территориальной зоны или зоны с особыми условиями использования территорий, либо об отмене установления такой зоны',
	'558221050000': 'Решение о присвоении, изменении адреса',
	'558221060000': 'Документы органов, осуществляющих ведение лесного и водного кадастра, содержащие сведения о природных объектах',
	'558221070000': 'Документ, содержащий сведения об адресе объекта недвижимости',
	'558221080000': 'Акт об утверждении результатов определения кадастровой стоимости',
	'558221990000': 'Иной документ, содержащий описание объекта',
	'558222000000': 'Документ, воспроизводящий сведения, содержащиеся в международном договоре Российской Федерации, в соответствии с которым установлено или изменено прохождение государственной границы Российской Федерации, а также сведения о федеральном законе, которым ратифицирован международный договор Российской Федерации, и об официальном опубликовании такого федерального закона',
	'558223000000': 'Соглашение об изменении границ между субъектами Российской Федерации',
	'558224000000': 'Закон субъекта Российской Федерации об установлении или изменении границ муниципальных образований либо о преобразовании муниципальных образований',
	'558225000000': 'Акт уполномоченного органа об установлении или изменении границ населённых пунктов',
	'558226000000': 'Документ, воспроизводящий необходимые для внесения в государственный кадастр недвижимости сведения о границах между субъектами Российской Федерации, границах муниципального образования, границах населённого пункта, содержащиеся в утверждённых органами власти документах',
	'558227000000': 'Решение об установлении или изменении границ зон с особыми условиями использования территорий',
	'558228000000': 'Правовой акт, которым утверждены или изменены правила землепользования и застройки',
	'558229000000': 'Документ, подтверждающий изменение назначения помещения',
	'558230000000': 'Решение о переводе жилого помещения в нежилое помещение, нежилого помещения в жилое помещение',
	'558231000000': 'Акт приемочной комиссии, подтверждающий завершение переустройства и (или) перепланировки и (или) иных работ',
	'558232000000': 'Документы, воспроизводящие сведения об изменении назначения помещения',
	'558233000000': 'Документ, воспроизводящий сведения, содержащиеся в решении о переводе жилого помещения в нежилое помещение, нежилого помещения в жилое помещение',
	'558234000000': 'Документ, воспроизводящий сведения, содержащиеся в акте приемочной комиссии, подтверждающем завершение переустройства и (или) перепланировки и (или) иных работ',
	'558235000000': 'Документ, подтверждающий изменение назначения здания',
	'558236000000': 'Документ, подтверждающий изменение назначения сооружения',
	'558237000000': 'Решение о предоставлении разрешения на условно разрешенный вид использования',
	'558238000000': 'Решение об определении (изменении) вида разрешенного использования',
	'558239000000': 'Документ (копия), воспроизводящий сведения о предоставлении разрешения на условно разрешенный вид использования, об определении (изменении) вида разрешенного использования',
	'558240000000': 'Документ, воспроизводящий сведения, содержащиеся в решении о присвоении, изменении адреса',
	'558241000000': 'Документ, воспроизводящий содержащиеся в разрешении на ввод объекта капитального строительства в эксплуатацию сведения',
	'558242000000': 'Документ, воспроизводящий сведения, содержащиеся в реестре объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
	'558243000000': 'Документ, воспроизводящий сведения, содержащиеся в акте Правительства Российской Федерации об исключении объекта недвижимости из единого государственного реестра объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
	'558244000000': 'Документ, содержащий сведения о дате поступления документов, предусмотренных статьей 17 Федерального закона "Об объектах культурного наследия (памятниках истории и культуры) народов Российской Федерации", в отношении объекта недвижимости',
	'558245000000': 'Решение (копия решения) соответствующего органа государственной власти об отказе включить объект недвижимости в единый государственный реестр объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
	'558246000000': 'Акт Правительства Российской Федерации об исключении объекта недвижимости из единого государственного реестра объектов культурного наследия',
	'558247000000': 'Документ, воспроизводящий сведения о наименовании водного объекта и установленных параметрах водоохранных зон и прибрежных защитных полос, зон затопления, подтопления и других зон с особыми условиями их использования',
	'558248000000': 'Документ, воспроизводящий содержащиеся в государственном лесном реестре сведения в отношении лесного участка',
	'558249000000': 'Документ, воспроизводящий сведения, содержащиеся во вступившем в силу акте об утверждении результатов определения кадастровой стоимости',
	'558250000000': 'Документ, воспроизводящий сведения, содержащиеся в решении об установлении или изменении границ зон с особыми условиями использования территорий',
	'558251000000': 'Документ, воспроизводящий сведения, содержащиеся в правовом акте, которым утверждены или изменены правила землепользования и застройки, включая сведения о территориальных зонах',
	'558252000000': 'Карта (план) объекта землеустройства',
	'558253000000': 'Декларация заинтересованного лица о выбранном виде разрешенного использования земельного участка',
	'558254000000': 'Документы, определяющие (определявшие) в соответствии с законодательством Российской Федерации местоположение границ земельного участка (земельных участков)',
	'558254010000': 'Землеустроительная документация',
	'558254020000': 'Лесоустроительная документация',
	'558254030000': 'Документы градостроительного зонирования (Правила землепользования и застройки)',
	'558254040000': 'Документация по планировке территории (проекты межевания территорий), в т.ч. документ по планировке территории в планируемых границах искусственного земельного участка',
	'558254050000': 'Копия проекта межевания земельных участков',
	'558254060000': 'Акт отвода земельных участков в натуре',
	'558254070000': 'Проект границ земельных участков',
	'558254080000': 'Проект (копии отдельных составных частей) организации и застройки территорий садоводческих, огороднических или дачных некоммерческих объединений граждан',
	'558254090000': 'Проект (копии отдельных составных частей) перераспределения сельскохозяйственных угодий и иных земель сельскохозяйственного назначения',
	'558254100000': 'Решение о предварительном согласовании мест размещения объектов',
	'558254110000': 'Копия решения общего собрания участников долевой собственности на земельный участок из земель сельскохозяйственного назначения об утверждении проекта межевания земельных участков',
	'558254120000': 'Копия документа, подтверждающего согласование проекта межевания земельного участка',
	'558254130000': 'Возражения заинтересованных лиц по поводу местоположения границ земельного участка',
	'558254140000': 'Документ, свидетельствующий о снятии возражений заинтересованных лиц по поводу местоположения границ земельного участка',
	'558254150000': 'Схема расположения земельных участков на кадастровых планах или кадастровых картах соответствующих территорий',
	'558254990000': 'Прочие документы, определяющие (определявшие) в соответствии с законодательством Российской Федерации местоположение границ земельного участка (земельных участков)',
	'558255000000': 'Картографические материалы',
	'558256000000': 'Материалы картографо-геодезического фонда',
	'558257000000': 'Документы, устанавливающие предельные минимальные и максимальные размеры, соответствующие виду разрешенного использования земельного участка',
	'558257010000': 'Федеральный закон',
	'558257020000': 'Закон субъекта Российской Федерации',
	'558257030000': 'Нормативный правовой акт органа местного самоуправления',
	'558258000000': 'Документ, содержащий информацию о ранее присвоенных государственных учетных номерах объекта недвижимости',
	'558259000000': 'Протокол образования земельных участков',
	'558260000000': 'Чертеж (абрис) помещения',
	'558261000000': 'Проектная документация здания',
	'558262000000': 'Проектная документация сооружения',
	'558263000000': 'Решение комиссии по рассмотрению споров о результатах определения кадастровой стоимости',
	'558264000000': 'Решение суда',
	'558299000000': 'Иной документ, содержащий описание объекта',
	'558300000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ ОПИСАНИЕ ЗАЯВИТЕЛЯ ИЛИ ЕГО ПРЕДСТАВИТЕЛЯ',
	'558301000000': 'Документы, подтверждающие полномочия представителя',
	'558301010000': 'Доверенность',
	'558301020000': 'Свидетельство о рождении',
	'558301030000': 'Свидетельство об усыновлении',
	'558301040000': 'Решение суда',
	'558301050000': 'Определение суда',
	'558301060000': 'Протокол об избрании (единоличного исполнительного органа юридического лица)',
	'558301070000': 'Выписка из протокола об избрании (единоличного исполнительного органа юридического лица)',
	'558301080000': 'Приказ о назначении (руководителя или иного уполномоченного лица)',
	'558301090000': 'Решение органов опеки и попечительства',
	'558301100000': 'Договор коммерческого представительства',
	'558301110000': 'Договор доверительного управления',
	'558301120000': 'Постановление судебного пристава-исполнителя',
	'558301130000': 'Протокол общего собрания',
	'558301140000': 'Акт органа государственной власти или органа местного самоуправления, подтверждающий полномочия представителя заявителя',
	'558301990000': 'Иной документ',
	'558400000000': 'ДОКУМЕНТЫ О ПРАВАХ, СДЕЛКАХ, ОГРАНИЧЕНИЯХ (ОБРЕМЕНЕНИЯХ)',
	'558401000000': 'Правоустанавливающие и правоудостоверяющие документы',
	'558401010000': 'Договоры / соглашения',
	'558401010100': 'Сделки об отчуждении',
	'558401010101': 'Договор купли-продажи',
	'558401010102': 'Договор мены',
	'558401010103': 'Договор дарения',
	'558401010104': 'Договор ренты',
	'558401010105': 'Договор пожизненного содержания с иждивением',
	'558401010106': 'Договор приватизации (договор передачи объекта недвижимости в собственность)',
	'558401010200': 'Другие сделки',
	'558401010201': 'Договор участия в долевом строительстве',
	'558401010202': 'Соглашение об определении (перераспределении) долей в праве общей долевой собственности',
	'558401010203': 'Брачный договор',
	'558401010204': 'Соглашение об отступном',
	'558401010205': 'Соглашение о разделе имущества',
	'558401010206': 'Соглашение о выделе доли',
	'558401010207': 'Инвестиционный договор (договор об инвестировании)',
	'558401010208': 'Мировое соглашение',
	'558401010209': 'Договор аренды (субаренды)',
	'558401010210': 'Договор об ипотеке',
	'558401010211': 'Договор безвозмездного срочного пользования земельным участком',
	'558401010212': 'Кредитный договор',
	'558401010213': 'Договор займа',
	'558401010214': 'Соглашение об установлении сервитута',
	'558401010215': 'Соглашение об изменении содержания закладной',
	'558401010216': 'Дополнительное соглашение (соглашение об изменении условий договора) к договору',
	'558401010217': 'Соглашение о расторжении договора',
	'558401010218': 'Соглашение об уступке прав требования по договору (договор о передаче прав и обязанностей)',
	'558401010219': 'Договор простого товарищества (договор о совместной деятельности)',
	'558401010220': 'Государственный контракт',
	'558401010299': 'Иная сделка',
	'558401020000': 'Акты органов государственной власти или органов местного самоуправления',
	'558401020100': 'Федеральный закон',
	'558401020200': 'Указ Президента Российской Федерации',
	'558401020300': 'Постановление Правительства Российской Федерации',
	'558401020400': 'Закон (законы Российской Федерации, субъекта Российской Федерации)',
	'558401020500': 'Документ о предоставлении земельных участков',
	'558401020600': 'Решение об образовании земельных участков',
	'558401020700': 'Акт об установлении сервитута',
	'558401020800': 'Акт об установлении ограничения (обременения)',
	'558401029900': 'Иные акты органов государственной власти или органов местного самоуправления',
	'558401030000': 'Свидетельство о праве на наследство',
	'558401030100': 'Свидетельство о праве на наследство по закону',
	'558401030200': 'Свидетельство о праве на наследство по завещанию',
	'558401040000': 'Вступившие в силу судебные акты',
	'558401040100': 'Судебный акт, устанавливающий запрет на совершение действий в сфере государственного кадастрового учета в отношении объекта недвижимости',
	'558401040200': 'Судебный акт о восстановлении аннулированных и исключенных из государственного кадастра недвижимости сведений об объекте недвижимости',
	'558401040300': 'Судебный акт об установлении обременения (ограничении) в использовании объекта недвижимости  (части объекта недвижимости)',
	'558401049900': 'Иные предусмотренные законодательством судебные акты',
	'558401050000': 'Акты (свидетельства) о правах на объекты недвижимости',
	'558401050100': 'Регистрационное удостоверение',
	'558401050200': 'Свидетельство о праве на землю',
	'558401050300': 'Государственный акт о праве на землю',
	'558401050400': 'Свидетельство о праве собственности',
	'558401059900': 'Иные акты, свидетельства о правах на объекты недвижимости',
	'558401060000': 'Документы на вновь возведенный (реконструированный) объект',
	'558401060100': 'Разрешение на ввод объекта в эксплуатацию',
	'558401060200': 'Разрешение на строительство',
	'558401060300': 'Акт ввода в эксплуатацию',
	'558401060400': 'Копия решения о создании искусственного земельного участка',
	'558401070000': 'Документы при упрощенном порядке оформления прав граждан на отдельные объекты недвижимого имущества',
	'558401070100': 'Выписка из похозяйственной книги о наличии у гражданина права на земельный участок',
	'558401070200': 'Кадастровый паспорт объекта недвижимости',
	'558401070300': 'Декларация об объекте недвижимого имущества',
	'558401080000': 'Прочие правоустанавливающие документы',
	'558401080100': 'Передаточный акт',
	'558401080200': 'Разделительный баланс',
	'558401080300': 'План приватизации',
	'558401080400': 'Правила доверительного управления',
	'558401080500': 'Акт описи и ареста имущества',
	'558401080600': 'Протокол о выделе земельного участка в счет земельной доли',
	'558401080700': 'Протокол общего собрания собственников помещений в многоквартирном доме',
	'558401080800': 'Отказ одаряемого принять дар (отказ от дара)',
	'558401080900': 'Соглашение о новации',
	'558401081000': 'Соглашение о разделе наследственного имущества',
	'558401081100': 'Соглашение об уплате алиментов',
	'558401081200': 'Документ, подтверждающий наличие, возникновение, переход ограничения (обременения) вещного права на объект недвижимости в пользу заявителя',
	'558401089900': 'Иной документ',
	'558402000000': 'СОПУТСТВУЮЩИЕ И ДОПОЛНИТЕЛЬНЫЕ ДОКУМЕНТЫ',
	'558402010000': 'Согласие супруга на совершение сделки',
	'558402020000': 'Согласие органов опеки и попечительства',
	'558402030000': 'Свидетельство о заключении брака',
	'558402040000': 'Свидетельство о расторжении брака',
	'558402050000': 'Решение об одобрении (о совершении) сделки',
	'558402060000': 'Справка о стоимости (справка о соотношении стоимости отчуждаемого объекта и балансовой стоимости имущества или активов хозяйственного общества)',
	'558402070000': 'Справка о заинтересованных лицах в сделке',
	'558402080000': 'Выписка из домовой книги (сведения о лицах, сохраняющих право проживания в жилом помещении после перехода права на него)',
	'558402090000': 'Выписка из лицевого счета (сведения о лицах, сохраняющих право проживания в жилом помещении после перехода права на него)',
	'558402100000': 'Протокол о результатах торгов',
	'558402110000': 'Лицензия (лицензия на осуществление определенных видов деятельности)',
	'558402120000': 'Проектная декларация',
	'558402130000': 'Отказ от преимущественного права покупки (для участников долевой собственности, для субъекта Российской Федерации при продаже земельного участка из состава земель сельскохозяйственного назначения)',
	'558402140000': 'Решение о создании юридического лица',
	'558402150000': 'Решение о реорганизации юридического лица',
	'558402160000': 'Решение о ликвидации юридического лица',
	'558402170000': 'Решение об утверждении оценки имущества (решение об утверждении оценки неденежных вкладов в уставный капитал общества)',
	'558402180000': 'Исполнительный лист',
	'558402190000': 'Договор поручения',
	'558402200000': 'Бухгалтерский баланс',
	'558402210000': 'Закладная',
	'558402220000': 'Добавочный лист к закладной',
	'558402230000': 'Выписка из реестра муниципальной собственности',
	'558402240000': 'Выписка из реестра собственности субъекта Российской Федерации',
	'558402250000': 'Выписка из реестра федерального имущества',
	'558402260000': 'Жилищный сертификат',
	'558402270000': 'Аудиторское заключение',
	'558402280000': 'Отчет о проведении независимой оценки (акт оценки)',
	'558402390000': 'Акт инвентаризации',
	'558402400000': 'Охранное обязательство собственника объекта культурного наследия',
	'558402990000': 'Иной документ',
	'558403000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ СВЕДЕНИЯ ЕГРП',
	'558403010000': 'Свидетельство о государственной регистрации права',
	'558403020000': 'Выписка о правах на объект недвижимого имущества',
	'558403030000': 'Выписка о переходе прав на объект недвижимого имущества',
	'558403040000': 'Выписка о правах отдельного лица на имеющиеся у него объекты недвижимого имущества',
	'558403050000': 'Выписка о признании правообладателя недееспособным или ограниченно дееспособным',
	'558403060000': 'Справка о содержании правоустанавливающих документов на объект недвижимого имущества',
	'558403070000': 'Справка о лицах, получивших сведения об объекте недвижимого имущества',
	'558403080000': 'Копии договоров и иных документов, выражающих содержание односторонних сделок, совершенных в простой письменной форме',
	'558403090000': 'Выписка из ЕГРП о принятии на учёт бесхозяйного объекта недвижимого имущества',
	'558403100000': 'Выписка из ЕГРП о принятии на учёт бесхозяйного объекта недвижимого имущества, от права собственности на который собственник отказался',
	'558403110000': 'Выписка из ЕГРП о бесхозяйном объекте недвижимого имущества, принятом на учёт',
	'558403120000': 'Выписка из единого государственного реестра прав на недвижимое имущество и сделок с ним, удостоверяющая проведение государственной регистрации возникновения и (или) перехода прав на недвижимое имущество',
	'558403990000': 'Иной документ',
	'558404000000': 'Соглашения и согласия об образовании земельных участков',
	'558404010000': 'Соглашение о разделе, об объединении, о перераспределении земельных участков или о выделе из земельных участков',
	'558404020000': 'Согласие на образование земельных участков',
	'558404030000': 'Соглашение об образовании общей долевой собственности на земельный участок, образуемый при выделе его в счет земельной доли или земельных долей',
	'558404040000': 'Соглашение об образовании общей совместной собственности на земельный участок, образуемый при выделе его в счет земельной доли или земельных долей',
	'558405000000': 'Документы, подтверждающие возникновение права собственности в отношении земельного участка в силу федерального закона вне зависимости от момента государственной регистрации этого права в ЕГРП',
	'558405010000': 'Копия решения о безвозмездной передаче военного недвижимого имущества из федеральной собственности в собственность субъекта Российской Федерации - города федерального значения Москвы или Санкт-Петербурга либо муниципальную собственность',
	'558405020000': 'Подлинник или копия письма органа исполнительной власти субъекта Российской Федерации - города федерального значения Москвы или Санкт-Петербурга либо органа местного самоуправления муниципального образования о согласовании границ образуемого земельного участка с приложением согласованного проекта границ земельного участка в случае, если акт согласования границ земельного участка не заверен подписью уполномоченного должностного лица соответствующего органа',
	'558405030000': 'Решение об изъятии земельных участков и (или) расположенных на них иных объектов недвижимого имущества в целях размещения олимпийских объектов',
	'558405040000': 'Копия акта приема-передачи объектов недвижимого имущества, в отношении которых принято решение об изъятии в целях размещения олимпийских объектов',
	'558405990000': 'Иные документы, подтверждающие возникновение права собственности в отношении земельного участка в силу федерального закона вне зависимости от момента государственной регистрации этого права в ЕГРП',
	'558500000000': 'Решения, уведомления, расписки',
	'558501000000': 'Документы о результатах государственного кадастрового учёта',
	'558501010000': 'РЕШЕНИЯ',
	'558501010100': 'Решение об отказе в предоставлении запрашиваемых сведений',
	'558501010200': 'Решение об отказе в исправлении кадастровой ошибки',
	'558501010300': 'Решение об отказе в исправлении технической ошибки',
	'558501010400': 'Решение об исправлении технической и кадастровой ошибок',
	'558501010500': 'Решение об отказе в осуществлении кадастровой процедуры',
	'558501010600': 'Решение о приостановлении осуществления кадастровой процедуры',
	'558501010700': 'Решение об отказе в снятии приостановления',
	'558501010800': 'Решение о снятии с кадастрового учёта земельных участков со статусом «временные» по заявлению заинтересованного лица',
	'558501010900': 'Решение об отказе в выдаче кадастрового паспорта',
	'558501011000': 'Решение об осуществлении кадастровой процедуры',
	'558501011100': 'Решение об аннулировании кадастровых сведений',
	'558501011200': 'Решение об отклонении заявления об исправлении технической ошибки',
	'558501011300': 'Решение о внесении записи о наличии возражения',
	'558501011400': 'Решение о погашении записи о наличии возражения',
	'558501011500': 'Решение о внесении записи о заявлении о невозможности государственной регистрации',
	'558501011600': 'Решение о погашении записи о заявлении о невозможности государственной регистрации',
	'558501020000': 'УВЕДОМЛЕНИЯ',
	'558501020100': 'Уведомление об отсутствии в ГКН запрашиваемых сведений',
	'558501020200': 'Уведомление об осуществлённом кадастровом учёте',
	'558501020300': 'Уведомление об отказе в приеме документов для внесения в Единый государственный реестр объектов капитального строительства (далее - Единый государственный реестр) сведений об ОКС',
	'558501020400': 'Уведомление об отказе в приеме документов для предоставления из Единого государственного реестра сведений об ОКС',
	'558501020500': 'Уведомление об устранении технической ошибки в сведениях ГКН',
	'558501020600': 'Уведомление об отказе в выдаче сведений об ОКС',
	'558501020700': 'Уведомление о приостановлении осуществления кадастровой процедуры',
	'558501020800': 'Уведомление об отказе в осуществлении кадастровой процедуры',
	'558501020900': 'Уведомление о регистрации права',
	'558501021000': 'Уведомление о приостановлении принятия на учёт имущества в качестве бесхозяйного',
	'558501021100': 'Сообщение об отказе в принятии на учёт имущества в качестве бесхозяйного',
	'558501021200': 'Уведомление о снятии с учёта имущества в качестве бесхозяйного',
	'558501021300': 'Уведомление о возврате заявления о наличии возражения в отношении зарегистрированного права на объект недвижимости без рассмотрения',
	'558501030000': 'ПРОЧИЕ',
	'558501030100': 'Расписка в получении соответствующих документов для проведения государственного кадастрового учёта',
	'558501030200': 'Протокол проверки документов',
	'558501030300': 'Акт определения кадастровой стоимости земельных участков',
	'558501030400': 'Протокол выявления технической ошибки',
	'558501030500': 'Акт определения кадастровой стоимости объектов недвижимости',
	'558501039900': 'Иные документы',
	'558502000000': 'ДОКУМЕНТЫ О РЕЗУЛЬТАТАХ РЕГИСТРАЦИИ ПРАВ',
	'558502010000': 'УВЕДОМЛЕНИЯ, СООБЩЕНИЯ',
	'558502010100': 'Уведомление о приостановлении государственной регистрации прав',
	'558502010200': 'Уведомление о прекращении государственной регистрации прав',
	'558502010300': 'Уведомление о зарегистрированных ограничениях (обременениях) прав',
	'558502010400': 'Уведомление о внесении изменений в ЕГРП',
	'558502010500': 'Уведомление об исправлении технической ошибки в записях единого государственного реестра прав на недвижимое имущество и сделок с ним',
	'558502010600': 'Сообщение об отказе в государственной регистрации прав',
	'558502010700': 'Сообщение об отказе в предоставлении сведений из ЕГРП',
	'558502010800': 'Уведомление об отсутствии в ЕГРП запрашиваемых сведений',
	'558502010900': 'Сообщение о приёме заявления о государственной регистрации права, ограничения (обременения) права на предприятие, сделки с ним',
	'558502011000': 'Сообщение о поступлении документов на государственную регистрацию договоров мены и (или) перехода права',
	'558502011100': 'Уведомление о возврате приложенных к заявлению документов без рассмотрения',
	'558502011200': 'Уведомление о государственной регистрации прекращения ограничения (обременения)',
	'558502011300': 'Уведомление об отсутствии сведений о лицах, получивших сведения об объектах недвижимого имущества',
	'558502011400': 'Уведомление о государственной регистрации права собственности субъекта Российской Федерации или муниципального образования на земельный участок или земельную долю вследствие отказа от соответствующего права правообладателем',
	'558502011500': 'Уведомление о поступлении решения суда, вступившего в законную силу, с указанием срока окончания осуществления государственной регистрации прав, в случае если отказ в государственной регистрации прав признан судом необоснованным',
	'558502011600': 'Уведомление о внесении изменений в единый государственный реестр прав на недвижимое имущество и сделок с ним в связи с изменением содержащихся в базовых государственных информационных ресурсах сведений о правообладателе (правообладателях)',
	'558502011700': 'Уведомление о возврате документов без рассмотрения при отказе в осуществлении государственного кадастрового учета',
	'558502020000': 'ПРОЧИЕ',
	'558502020100': 'Расписка в получении документов на государственную регистрацию прав',
	'558502029900': 'Иной документ',
	'558601000000': 'Расписка в получении извещений о проведении собрания о согласовании местоположения границ',
	'558602000000': 'Уведомление о вручении извещения о проведении собрания о согласовании местоположения границ',
	'558603000000': 'Копия страницы печатного издания, содержащей извещение о проведении собрания о согласовании местоположения границ земельного участка, включая первый лист, содержащего реквизиты такого печатного издания',
	'558699000000': 'Иные документы, свидетельствующие о соблюдении установленного порядка извещения заинтересованных лиц о проведении собрания о согласовании местоположения границ земельного участка'
};
//Территориальные зоны и зоны с особыми условиями использования территорий
var dZone = {
	'218010000000': 'Территориальные зоны',
	'218010010000': 'Жилая зона',
	'218010020000': 'Общественно-деловая зона',
	'218010030000': 'Производственная зона, зона инженерной и транспортной инфраструктур',
	'218010040000': 'Зона сельскохозяйственного использования',
	'218010050000': 'Зона рекреационного назначения',
	'218010060000': 'Зона особо охраняемых территорий',
	'218010070000': 'Зона специального назначения',
	'218010080000': 'Зона размещения военных объектов',
	'218010090000': 'Иная зона',
	'218020000000': 'Зоны с особыми условиями использования территории',
	'218020010000': 'Зоны охраны природных объектов',
	'218020010001': 'Территория особо охраняемого природного объекта',
	'218020010002': 'Охранная зона особо охраняемого природного объекта',
	'218020010003': 'Водоохранная зона',
	'218020010004': 'Прибрежная защитная полоса',
	'218020010005': 'Зона санитарной охраны источников водоснабжения и водопроводов питьевого назначения',
	'218020010006': 'Особо ценные земли',
	'218020020000': 'Зоны охраны искусственных объектов',
	'218020020001': 'Территория объекта культурного наследия',
	'218020020002': 'Зона охраны объекта культурного наследия',
	'218020020003': 'Охранная зона геодезического пункта',
	'218020020004': 'Охранная зона стационарного пункта наблюдений за состоянием окружающей природной среды',
	'218020020005': 'Охранная зона транспорта',
	'218020020006': 'Охранная зона инженерных коммуникаций',
	'218020020007': 'Охранная зона линий и сооружений связи и линий и сооружений радиофикации',
	'218020020008': 'Придорожная полоса',
	'218020030000': 'Зоны защиты населения',
	'218020030001': 'Запретная зона при военном складе',
	'218020030002': 'Запретный район при военном складе',
	'218020030003': 'Загрязненные земли',
	'218020030004': 'Охранная зона загрязненных земель',
	'218020030005': 'Санитарно-защитная зона предприятий, сооружений и иных объектов',
	'218020030006': 'Санитарный разрыв (санитарная полоса отчуждения)',
	'218020030007': 'Зона ограничения от передающего радиотехнического объекта',
	'218020030008': 'Район падения отделяющихся частей ракет',
	'218020040000': 'Прочие зоны с особыми условиями использования территории',
	'218020040001': 'Зона публичного сервитута',
	'218020040002': 'Зона резервирования земель',
	'218020040003': 'Горный отвод',
	'218020040004': 'Пригородная зона',
	'218020040005': 'Зеленая зона',
	'218020040006': 'Особая экономическая зона',
	'218020040007': 'Пограничная зона',
	'218020040008': 'Территория традиционного природопользования',
	'218020050000': 'Иные зоны с особыми условиями использования территории',
	'218020050001': 'Иная зона с особыми условиями использования территории'		
};
// Классификатор видов использования земель
var dUtilizations = {
	'141000000000': 'Для размещения объектов сельскохозяйственного назначения и сельскохозяйственных угодий',
	'141001000000': 'Для сельскохозяйственного производства',
	'141001010000': 'Для использования в качестве сельскохозяйственных угодий',
	'141001020000': 'Для размещения зданий, строений, сооружений, используемых для производства, хранения и первичной переработки сельскохозяйственной продукции',
	'141001030000': 'Для размещения внутрихозяйственных дорог и коммуникаций',
	'141001040000': 'Для размещения водных объектов',
	'141002000000': 'Для ведения крестьянского (фермерского) хозяйства',
	'141003000000': 'Для ведения личного подсобного хозяйства',
	'141004000000': 'Для ведения гражданами садоводства и огородничества',
	'141005000000': 'Для ведения гражданами животноводства',
	'141006000000': 'Для дачного строительства',
	'141007000000': 'Для размещения древесно-кустарниковой растительности, предназначенной для защиты земель от воздействия негативных (вредных) природных, антропогенных и техногенных явлений',
	'141008000000': 'Для научно-исследовательских целей',
	'141009000000': 'Для учебных целей',
	'141010000000': 'Для сенокошения и выпаса скота гражданами',
	'141011000000': 'Фонд перераспределения',
	'141012000000': 'Для размещения объектов охотничьего хозяйства',
	'141013000000': 'Для размещения объектов рыбного хозяйства',
	'141014000000': 'Для иных видов сельскохозяйственного использования',
	'142000000000': 'Для размещения объектов, характерных для населённых пунктов',
	'142001000000': 'Для объектов жилой застройки',
	'142001010000': 'Для индивидуальной жилой застройки',
	'142001020000': 'Для многоквартирной застройки',
	'142001020100': 'Для малоэтажной застройки',
	'142001020200': 'Для среднеэтажной застройки',
	'142001020300': 'Для многоэтажной застройки',
	'142001020400': 'Для иных видов жилой застройки',
	'142001030000': 'Для размещения объектов дошкольного, начального, общего и среднего (полного) общего образования',
	'142001040000': 'Для размещения иных объектов, допустимых в жилых зонах и не перечисленных в классификаторе',
	'142002000000': 'Для объектов общественно-делового значения',
	'142002010000': 'Для размещения объектов социального и коммунально-бытового назначения',
	'142002020000': 'Для размещения объектов здравоохранения',
	'142002030000': 'Для размещения объектов культуры',
	'142002040000': 'Для размещения объектов торговли',
	'142002040100': 'Для размещения объектов розничной торговли',
	'142002040200': 'Для размещения объектов оптовой торговли',
	'142002050000': 'Для размещения объектов общественного питания',
	'142002060000': 'Для размещения объектов предпринимательской деятельности',
	'142002070000': 'Для размещения объектов среднего профессионального и высшего профессионального образования',
	'142002080000': 'Для размещения административных зданий',
	'142002090000': 'Для размещения научно-исследовательских учреждений',
	'142002100000': 'Для размещения культовых зданий',
	'142002110000': 'Для стоянок автомобильного транспорта',
	'142002120000': 'Для размещения объектов делового назначения, в том числе офисных центров',
	'142002130000': 'Для размещения объектов финансового назначения',
	'142002140000': 'Для размещения гостиниц',
	'142002150000': 'Для размещения подземных или многоэтажных гаражей',
	'142002160000': 'Для размещения индивидуальных гаражей',
	'142002170000': 'Для размещения иных объектов общественно-делового значения, обеспечивающих жизнь граждан',
	'142003000000': 'Для общего пользования (уличная сеть)',
	'142004000000': 'Для размещения объектов специального назначения',
	'142004010000': 'Для размещения кладбищ',
	'142004020000': 'Для размещения крематориев',
	'142004030000': 'Для размещения скотомогильников',
	'142004040000': 'Под объектами размещения отходов потребления',
	'142004050000': 'Под иными объектами специального назначения',
	'142005000000': 'Для размещения коммунальных, складских объектов',
	'142006000000': 'Для размещения объектов жилищно-коммунального хозяйства',
	'142007000000': 'Для иных видов использования, характерных для населённых пунктов',
	'143000000000': 'Для размещения объектов промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, обеспечения космической деятельности, обороны, безопасности и иного специального назначения',
	'143001000000': 'Для размещения промышленных объектов',
	'143001010000': 'Для размещения производственных и административных зданий, строений, сооружений и обслуживающих их объектов',
	'143001010100': 'Для размещения производственных зданий',
	'143001010200': 'Для размещения коммуникаций',
	'143001010300': 'Для размещения подъездных путей',
	'143001010400': 'Для размещения складских помещений',
	'143001010500': 'Для размещения административных зданий',
	'143001010600': 'Для размещения культурно-бытовых зданий',
	'143001010700': 'Для размещения иных сооружений промышленности',
	'143001020000': 'Для добычи и разработки полезных ископаемых',
	'143001030000': 'Для размещения иных объектов промышленности',
	'143002000000': 'Для размещения объектов энергетики',
	'143002010000': 'Для размещения электростанций и обслуживающих сооружений и объектов',
	'143002010100': 'Для размещения гидроэлектростанций',
	'143002010200': 'Для размещения атомных станций',
	'143002010300': 'Для размещения ядерных установок',
	'143002010400': 'Для размещения пунктов хранения ядерных материалов и радиоактивных веществ энергетики',
	'143002010500': 'Для размещения хранилищ радиоактивных отходов',
	'143002010600': 'Для размещения тепловых станций',
	'143002010700': 'Для размещения иных типов электростанций',
	'143002010800': 'Для размещения иных обслуживающих сооружений и объектов',
	'143002020000': 'Для размещения объектов электросетевого хозяйства',
	'143002020100': 'Для размещения воздушных линий электропередачи',
	'143002020200': 'Для размещения наземных сооружений кабельных линий электропередачи',
	'143002020300': 'Для размещения подстанций',
	'143002020400': 'Для размещения распределительных пунктов',
	'143002020500': 'Для размещения других сооружений и объектов электросетевого хозяйства',
	'143002030000': 'Для размещения иных объектов энергетики',
	'143003000000': 'Для размещения объектов транспорта',
	'143003010000': 'Для размещения и эксплуатации объектов железнодорожного транспорта',
	'143003010100': 'Для размещения железнодорожных путей и их конструктивных элементов',
	'143003010200': 'Для размещения полос отвода железнодорожных путей',
	'143003010300': 'Для размещения, эксплуатации, расширения и реконструкции строений, зданий, сооружений, в том числе железнодорожных вокзалов, железнодорожных станций, а также устройств и других объектов, необходимых для эксплуатации, содержания, строительства, реконструкции, ремонта, развития наземных и подземных зданий, строений, сооружений, устройств и других объектов железнодорожного транспорта',
	'143003010301': 'Для размещения железнодорожных вокзалов',
	'143003010302': 'Для размещения железнодорожных станций',
	'143003010303': 'Для размещения устройств и других объектов, необходимых для эксплуатации, содержания, строительства, реконструкции, ремонта, развития наземных и подземных зданий, строений, сооружений, устройств и других объектов железнодорожного транспорта',
	'143003020000': 'Для размещения и эксплуатации объектов автомобильного транспорта и объектов дорожного хозяйства',
	'143003020100': 'Для размещения автомобильных дорог и их конструктивных элементов',
	'143003020200': 'Для размещения полос отвода',
	'143003020300': 'Для размещения объектов дорожного сервиса в полосах отвода автомобильных дорог',
	'143003020400': 'Для размещения дорожных сооружений',
	'143003020500': 'Для размещения автовокзалов и автостанций',
	'143003020600': 'Для размещения иных объектов автомобильного транспорта и дорожного хозяйства',
	'143003030000': 'Для размещения и эксплуатации объектов морского, внутреннего водного транспорта',
	'143003030100': 'Для размещения искусственно созданных внутренних водных путей',
	'143003030200': 'Для размещения морских и речных портов, причалов, пристаней',
	'143003030300': 'Для размещения иных объектов морского, внутреннего водного транспорта',
	'143003030400': 'Для выделения береговой полосы',
	'143003040000': 'Для размещения и эксплуатации объектов воздушного транспорта',
	'143003040100': 'Для размещения аэропортов и аэродромов',
	'143003040200': 'Для размещения аэровокзалов',
	'143003040300': 'Для размещения взлетно-посадочных полос',
	'143003040400': 'Для размещения иных наземных объектов воздушного транспорта',
	'143003050000': 'Для размещения и эксплуатации объектов трубопроводного транспорта',
	'143003050100': 'Для размещения нефтепроводов',
	'143003050200': 'Для размещения газопроводов',
	'143003050300': 'Для размещения иных трубопроводов',
	'143003050400': 'Для размещения иных объектов трубопроводного транспорта',
	'143003060000': 'Для размещения и эксплуатации иных объектов транспорта',
	'143004000000': 'Для размещения объектов связи, радиовещания, телевидения, информатики',
	'143004010000': 'Для размещения эксплуатационных предприятий связи и обслуживания линий связи',
	'143004020000': 'Для размещения кабельных, радиорелейных и воздушных линий связи и линий радиофикации на трассах кабельных и воздушных линий связи и радиофикации и их охранные зоны',
	'143004030000': 'Для размещения подземных кабельных и воздушных линий связи и радиофикации и их охранные зоны',
	'143004040000': 'Для размещения наземных и подземных необслуживаемых усилительных пунктов на кабельных линиях связи и их охранные зоны',
	'143004050000': 'Для размещения наземных сооружений и инфраструктур спутниковой связи',
	'143004060000': 'Для размещения иных объектов связи, радиовещания, телевидения, информатики',
	'143005000000': 'Для размещения объектов, предназначенных для обеспечения космической деятельности',
	'143005010000': 'Для размещения космодромов, стартовых комплексов и пусковых установок',
	'143005020000': 'Для размещения командно-измерительных комплексов, центров и пунктов управления полетами космических объектов, приема, хранения и переработки информации',
	'143005030000': 'Для размещения баз хранения космической техники',
	'143005040000': 'Для размещения полигонов приземления космических объектов и взлетно-посадочных полос',
	'143005050000': 'Для размещения объектов экспериментальной базы для отработки космической техники',
	'143005060000': 'Для размещения центров и оборудования для подготовки космонавтов',
	'143005070000': 'Для размещения других наземных сооружений и техники, используемых при осуществлении космической деятельности',
	'143006000000': 'Для размещения объектов, предназначенных для обеспечения обороны и безопасности',
	'143006010000': 'Для обеспечения задач обороны',
	'143006010100': 'Для размещения военных организаций, учреждений и других объектов',
	'143006010200': 'Для дислокации войск и сил флота',
	'143006010300': 'Для проведения учений и иных мероприятий',
	'143006010400': 'Для испытательных полигонов',
	'143006010500': 'Для мест уничтожения оружия и захоронения отходов',
	'143006010600': 'Для создания запасов материальных ценностей в государственном и мобилизационном резервах (хранилища, склады и другие)',
	'143006010700': 'Для размещения иных объектов обороны',
	'143006020000': 'Для размещения объектов (территорий), обеспечивающих защиту и охрану Государственной границы Российской Федерации',
	'143006020100': 'Для обустройства и содержания инженерно-технических сооружений и заграждений',
	'143006020200': 'Для обустройства и содержания пограничных знаков',
	'143006020300': 'Для обустройства и содержания пограничных просек',
	'143006020400': 'Для обустройства и содержания коммуникаций',
	'143006020500': 'Для обустройства и содержания пунктов пропуска через Государственную границу Российской Федерации',
	'143006020600': 'Для размещения иных объектов для защиты и охраны Государственной границы Российской Федерации',
	'143006030000': 'Для размещения иных объектов обороны и безопасности',
	'143007000000': 'Для размещения иных объектов промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, обеспечения космической деятельности, обороны, безопасности и иного специального назначения',
	'144000000000': 'Для размещения особо охраняемых историко-культурных и природных объектов (территорий)',
	'144001000000': 'Для размещения особо охраняемых природных объектов (территорий)',
	'144001010000': 'Для размещения государственных природных заповедников (в том числе биосферных)',
	'144001020000': 'Для размещения государственных природных заказников',
	'144001030000': 'Для размещения национальных парков',
	'144001040000': 'Для размещения природных парков',
	'144001050000': 'Для размещения дендрологических парков',
	'144001060000': 'Для размещения ботанических садов',
	'144001070000': 'Для размещения объектов санаторного и курортного назначения',
	'144001080000': 'Территории месторождений минеральных вод, лечебных грязей, рапы лиманов и озер',
	'144001090000': 'Для традиционного природопользования',
	'144001100000': 'Для размещения иных особо охраняемых природных территорий (объектов)',
	'144002000000': 'Для размещения объектов (территорий) природоохранного назначения',
	'144003000000': 'Для размещения объектов (территорий) рекреационного назначения',
	'144003010000': 'Для размещения домов отдыха, пансионатов, кемпингов',
	'144003020000': 'Для размещения объектов физической культуры и спорта',
	'144003030000': 'Для размещения туристических баз, стационарных и палаточных туристско-оздоровительных лагерей, домов рыболова и охотника, детских туристических станций',
	'144003040000': 'Для размещения туристических парков',
	'144003050000': 'Для размещения лесопарков',
	'144003060000': 'Для размещения учебно-туристических троп и трасс',
	'144003070000': 'Для размещения детских и спортивных лагерей',
	'144003080000': 'Для размещения скверов, парков, городских садов',
	'144003090000': 'Для размещения пляжей',
	'144003100000': 'Для размещения иных объектов (территорий) рекреационного назначения',
	'144004000000': 'Для размещения объектов историко-культурного назначения',
	'144004010000': 'Для размещения объектов культурного наследия народов Российской Федерации (памятников истории и культуры), в том числе объектов археологического наследия',
	'144004020000': 'Для размещения военных и гражданских захоронений',
	'144005000000': 'Для размещения иных особо охраняемых историко-культурных и природных объектов (территорий)',
	'145000000000': 'Для размещения объектов лесного фонда',
	'145001000000': 'Для размещения лесной растительности',
	'145002000000': 'Для восстановления лесной растительности',
	'145003000000': 'Для прочих объектов лесного хозяйства',
	'146000000000': 'Для размещения объектов водного фонда',
	'146001000000': 'Под водными объектами',
	'146002000000': 'Для размещения гидротехнических сооружений',
	'146003000000': 'Для размещения иных сооружений, расположенных на водных объектах',
	'147000000000': 'Земли запаса (неиспользуемые)'
};
// Назначение зданий
var dAssBuilding = {
	'204001000000': 'Нежилое здание',
	'204002000000': 'Жилой дом',
	'204003000000': 'Многоквартирный дом'
};

var ParcelProperties;
var ConstructionProperties;
var UncompletedProperties;
var BuildingProperties;
var ZoneProperties;
var BoundProperties;

function getValueFromDict(Key, Dic) {
    for (var k in Dic) {
        if (k === Key) {
            return Dic[k];
        }
    }
}

module.exports.getProperties = function (Feature, FeatureType) {
    switch (FeatureType) {
        case 'Parcel' :
        {
            ParcelProperties = {
                "Кадастровый номер": '', // require
                "Статус": '01', // dStates require
                "Дата создания": '',
                "Тип объекта": '', //dParcels require
                "Категория земель": '', // dCategories // require
                "Площадь": {// requre
                    "Значение": 0, // require
                    "ед.изм": '', //dUnit require
                    "Точность": '' // d20_2
                },
                "Разрешённое использование": {// require
                    "по документу": '',
                    "по справочнику": '' // dUtilization require
                }
            };
            ParcelProperties["Кадастровый номер"] = Feature.CadastralNumber;
            ParcelProperties["Статус"] = getValueFromDict(Feature.State, dStates);
            ParcelProperties["Тип объекта"] = getValueFromDict(Feature.Name, dParcels);
            ParcelProperties["Категория земель"] = getValueFromDict(Feature.Category, dCategories);
            ParcelProperties["Дата создания"] = Feature.DateCreated;
            ParcelProperties["Разрешённое использование"]["по справочнику"] = 
                    getValueFromDict(Feature.Utilization.Utilization, dUtilizations);
            ParcelProperties["Разрешённое использование"]["по документу"] = Feature.Utilization.ByDoc;
            break;
        }
        case 'Construction':{
            ConstructionProperties = {
                cadastreNumber: '', // 
                ObjectType: '', // require
                AssignationName: '',
                Address: {
                    Note: ''
                }
            };
            if (Feature.CadastralNumber) {
                ConstructionProperties.cadastreNumber = Feature.CadastralNumber;
            } else {
                ConstructionProperties.cadastreNumber = '';
            }
            
            ConstructionProperties.AssignationName = Feature.AssignationName;
            ConstructionProperties.ObjectType = getValueFromDict(Feature.ObjectType, dZone);
            ConstructionProperties["Address"]["Note"] = Feature.Address.Note;
            break;
        }
        case 'Building':{
            BuildingProperties = {
                cadastreNumber: '', // 
                ObjectType: '', // require
                AssignationName: '',
                Address: {
                    Note: ''
                }
            };
            if (Feature.CadastralNumber) {
                BuildingProperties.cadastreNumber = Feature.CadastralNumber;
            } else {
                BuildingProperties.cadastreNumber = '';
            }
            
            BuildingProperties.AssignationName = Feature.AssignationName;
            BuildingProperties.ObjectType = getValueFromDict(Feature.ObjectType, dZone);
            BuildingProperties["Address"]["Note"] = Feature.Address.Note;
            break;
        }
        case 'Uncompleted':{
            UncompletedProperties = {
                cadastreNumber: '', // 
                ObjectType: '', // require
                AssignationName: '',
                Address: {
                    Note: ''
                }
            };
            if (Feature.CadastralNumber) {
                UncompletedProperties.cadastreNumber = Feature.CadastralNumber;
            } else {
                UncompletedProperties.cadastreNumber = '';
            }
            
            UncompletedProperties.AssignationName = Feature.AssignationName;
            UncompletedProperties.ObjectType = getValueFromDict(Feature.ObjectType, dZone);
            UncompletedProperties["Address"]["Note"] = Feature.Address.Note;
            break;
        }
        default :{
                console.log('Тип объекта не распознан');
        }
    }
    return {
        parcelProperties: ParcelProperties,
        constructionProperties: ConstructionProperties,
        uncompletedProperties: UncompletedProperties,
        buildingProperties: BuildingProperties,
        zoneProperties: ZoneProperties,
        boundProperties: BoundProperties
    };
};
},{}],3:[function(require,module,exports){
var ES = require('./spatial/EntitySpatial.js');
var Props = require('./cadProps');

module.exports.GeoJSON = function (xmlData, reproject) {

    var geoJSONQuartal = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONBounds = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONZones = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONParcels = {
        'type': 'FeatureCollection',
        'features': []
    };
    var geoJSONRealty = {
        type: "FeatureCollection",
        features: []
    };
    // Отдельное хранилище для GeometryCollection
//    var geoJSONRealtyCollection = {
//        type: "FeatureCollection",
//        features: []
//    };
    var geoJSONOSMPoints = {
        type: "FeatureCollection",
        features: []
    };

    var _reproject = reproject || null;

    var AllData = $.xml2json(xmlData).CadastralBlocks.CadastralBlock;
    //console.log(AllData);

    // Может быть несколько СК
    var projMSK;
    if (_reproject !== null) {
        projMSK = AllData.CoordSystems;
    }

    // Обработка квартала. Не может быть многоконтурным           
    if (AllData.SpatialData !== null) {
        var spObj = ES.getEntitySpatial(AllData.SpatialData.EntitySpatial, projMSK, 'Quartal', false);
        if ((spObj === undefined) || (spObj.length === 0)) {
            console.log('Объект квартала с пустой геометрией! Объект будет пропущен.');
        }
        // Квартал
        var feature = {
            'type': 'Feature'
        };
        feature.geometry = spObj;
        // Остальные свойства....

        geoJSONQuartal.features.push(feature);
    } else {
        console.log('Нет описания пространственной составляющей квартала');
    }

    // Обработка границ. Не могут быть многоконтурными
    if (AllData.Bounds) {

        if (AllData.Bounds.Bound.splice) {
            for (var i = 0; i < AllData.Bounds.Bound.length; i++) {
                if (AllData.Bounds.Bound[i].Boundaries.Boundary.splice) {
                    for (var k = 0; k < AllData.Bounds.Bound[i].Boundaries.Boundary.length; k++) {
                        // Граница
                        var feature = {
                            'type': 'Feature'
                        };
                        if (AllData.Bounds.Bound[i].Boundaries.Boundary[k].EntitySpatial !== null) {
                            var spObj = ES.getEntitySpatial(AllData.Bounds.Bound[i].Boundaries.Boundary[k].EntitySpatial, projMSK, 'Bound', false);
                            if ((spObj === undefined) || (spObj.length === 0)) {
                                console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
                                continue;
                            }
                            feature.geometry = spObj;
                            // Остальные свойства....

                            geoJSONBounds.features.push(feature);
                        } else {
                            //console.log('Нет описания пространственной составляющей границы');
                        }
                    }
                } else {
                    // Граница
                    var feature = {
                        'type': 'Feature'
                    };
                    var spObj = ES.getEntitySpatial(AllData.Bounds.Bound[i].Boundaries.Boundary.EntitySpatial, projMSK, 'Bound', false);
                    if ((spObj === undefined) || (spObj.length === 0)) {
                        console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
                        continue;
                    }
                    feature.geometry = spObj;
                    // Остальные свойства....

                    geoJSONBounds.features.push(feature);
                }
            }
        } else {
            var spObj = ES.getEntitySpatial(AllData.Bounds.Bound.Boundaries.Boundary.EntitySpatial, projMSK, 'Bound', false);
            if ((spObj === undefined) || (spObj.length === 0)) {
                console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
            }
            feature.geometry = spObj;
            // Остальные свойства....

            geoJSONBounds.features.push(feature);
        }
    }
    // Обработка зон. Не могут быть многоконтурными
    if (AllData.Zones) {

        if (AllData.Zones.Zone.splice) {
            for (var i = 0; i < AllData.Zones.Zone.length; i++) {
                // Зона
                var feature = {
                    'type': 'Feature'
                };
                if (AllData.Zones.Zone[i].EntitySpatial !== null) {
                    var spObj = ES.getEntitySpatial(AllData.Zones.Zone[i].EntitySpatial, projMSK, 'Zone', false);
                    if ((spObj === undefined) || (spObj.length === 0)) {
                        console.log('Объект Зоны с пустой геометрией! Объект будет пропущен.');
                        continue;
                    }
                    feature.geometry = spObj;

                    geoJSONZones.features.push(feature);
                } else {
                    console.log('Нет описания пространственной составляющей зоны');
                }
            }
        } else {
            if (AllData.Zones.Zone.EntitySpatial !== null) {
                // Зона
                var feature = {
                    'type': 'Feature'
                };
                var spObj = ES.getEntitySpatial(AllData.Zones.Zone.EntitySpatial, projMSK, 'Zone', false);
                if ((spObj === undefined) || (spObj.length === 0)) {
                    console.log('Объект Зоны с пустой геометрией! Объект будет пропущен.');
                }
                feature.geometry = spObj;

                geoJSONZones.features.push(feature);
            } else {
                console.log('Нет описания пространственной составляющей зоны');
            }
        }
    }
    // Обработка всех земельных участков
    for (var e = 0; e < AllData.Parcels.Parcel.length; e++) {
        var spObj = null;
        // Земельный участок
        var feature = {
            'type': 'Feature'
        };
        if (AllData.Parcels.Parcel[e].EntitySpatial !== undefined) {
            spObj = ES.getEntitySpatial(AllData.Parcels.Parcel[e].EntitySpatial, projMSK, 'Parcel', false);
            if ((spObj === undefined) || (spObj.length === 0)) {
                continue;
            }

        }
        // Многоконтурный
        else if (AllData.Parcels.Parcel[e].Contours) {
            var Contours = AllData.Parcels.Parcel[e].Contours.Contour;
            var multiPolygon = [];
            for (var c = 0; c < Contours.length; c++) {
                var es = Contours[c].EntitySpatial;
                var p = ES.getEntitySpatial(es, projMSK, 'Parcel', true);
                if (p) {
                    multiPolygon.push(p);
                }
            }
            spObj = {
                type: "MultiPolygon",
                coordinates: multiPolygon
            };
        } else {
            //console.log('Нет описания пространственной составляющей');
        }

        // Если нет геометрии, то объект не нужен
        if (spObj) {
            feature.geometry = spObj;
            // Остальные свойства....
            var props = Props.getProperties(AllData.Parcels.Parcel[e], 'Parcel');
            if (props) {
                feature.properties = props.parcelProperties;
            }
            //console.log('Объект создан. КН:' + feature.properties.cadastreNumber);
            geoJSONParcels.features.push(feature);
        }

    }
    // Обработка строений. могут быть составные из разных геометрий
    if (AllData.ObjectsRealty.ObjectRealty) {
        if (AllData.ObjectsRealty.ObjectRealty.splice) {

            function processES(EntitySpatial, oType) {
                var spObj = ES.getEntitySpatial(EntitySpatial, projMSK, oType, false);
                if (spObj) {
                    if (spObj.type === 'GeometryCollection') {
                        // GeoJSON с коллекцией трудно открывать на десктопе
                        // ogr2ogr -f GeoJSON -explodecollections explode doc2139433_xml_RealtyGC.geojson
                        // поэтому лучше создать фич по количеству объектов в коллекции
                        for(var k=0; k < spObj.geometries.length-1; k++) {
                            feature.geometry = spObj.geometries[k];
                            geoJSONRealty.features.push(feature);
                        }
                        //geoJSONRealtyCollection.features.push(feature);
                        //console.log('Добавлен geoJSONRealtyGeometryCollection');
                        //console.log(spObj.geometries);
                    } else {
                        feature.geometry = spObj;
                        geoJSONRealty.features.push(feature);
                    }
                    
                } else {
                    console.log('ОКС с пустой геометрией! Объект будет пропущен.');
                }
            }

            for (var i = 0; i < AllData.ObjectsRealty.ObjectRealty.length; i++) {
                var spObj = null;
                // ОКС
                var feature = {
                    'type': 'Feature'
                };
                // строения
                if (AllData.ObjectsRealty.ObjectRealty[i].Building) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Building.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Building, 'Building');
                        if (props) {
                            feature.properties = props.buildingProperties;
                            //console.log(props.buildingProperties);
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Building.EntitySpatial, 'Building');
                    }
                }
                // объекты незавершённого строительства
                else if (AllData.ObjectsRealty.ObjectRealty[i].Uncompleted) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Uncompleted.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Uncompleted, 'Uncompleted');
                        if (props) {
                            feature.properties = props.uncompletedProperties;
                            //console.log(props.uncompletedProperties);
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Uncompleted.EntitySpatial, 'Uncompleted');
                    }
                }
                // сооружения
                else if (AllData.ObjectsRealty.ObjectRealty[i].Construction) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Construction.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Construction, 'Construction');
                        if (props) {
                            feature.properties = props.constructionProperties;
                            //console.log(props.constructionProperties);
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Construction.EntitySpatial, 'Construction');
                    }
                }
            }
        }
    }
    // Обработка пунктов ОМС

    return {
        geoJSONQuartal: geoJSONQuartal,
        geoJSONBounds: geoJSONBounds,
        geoJSONZones: geoJSONZones,
        geoJSONParcels: geoJSONParcels,
        geoJSONRealty: geoJSONRealty
        //geoJSONRealtyGeometryCollection: geoJSONRealtyCollection
    };
};

},{"./cadProps":2,"./spatial/EntitySpatial.js":4}],4:[function(require,module,exports){
/**
 * Модуль обработки геометрии типа полигон.
 * Один внешний контур и 0 или более внутренних контуров-"дырок"
 * 
 * GeoJSON geometry типа tEntitySpatialLandOut
 */

//"geometry": {
//    "type": "Polygon",
//    "coordinates": [
//      [ [100.0, 0.0], [101.0, 0.0], [101.0, 1.0],
//        [100.0, 1.0], [100.0, 0.0] ]
//      ]
//  }

var projections = require('./SpatialSystems');

module.exports.getEntitySpatial = function (EntitySpatialObj, proj, oType, partOfMultu) {

//	this.geometry = {
//        type: '',
//		coordinates: []
//	};

    var _EntitySpatialObj = EntitySpatialObj;
    var _proj = proj || null;
    var Area = 0.0;
    var spatialSysName = null;
    var LineString = false;

    // Вычисление площади замкнутого контура
    function polygonArea(Xs, Ys, numPoints) {
        var area = 0;
        var j = numPoints - 1;
        for (var i = 0; i < numPoints; i++)
        {
            area = area + ((Xs[j]) + (Xs[i])) * ((Ys[j]) - (Ys[i]));
            j = i;  //j is previous vertex to i
        }
        return Math.abs(area / 2);
    }

    function convertCoord(coord) {
        // global
        if ((_proj === null) || (spatialSysName === null)) {
            return coord;
        } else {
            return proj4(projections.SpatialSystems[spatialSysName], 'EPSG:3857', coord);
        }
    }

    function getSpatialSysName() {
        var id = _EntitySpatialObj.EntSys;
        for (var i = 0; _proj.CoordSystem.length; i++) {
            if (_proj.CoordSystem[i].CsId === id) {
                return _proj.CoordSystem[i].Name;
            }
        }
        return null;
    }

    // Создание одного замкнутого контура или линии или окружности
    function createContour(SpatialElement) {
        var xs = [];
        var ys = [];
        var contour = [];
        var coord;
        var re_projected = [];
        // проверка на окружность
        if ((SpatialElement.SpelementUnit.TypeUnit === "Окружность" || "Точка") &&
                (SpatialElement.SpelementUnit.R !== undefined)) {
            coord = [Number(SpatialElement.SpelementUnit.Ordinate.Y), Number(SpatialElement.SpelementUnit.Ordinate.X)];
            re_projected = convertCoord(coord);
            return {
                'R': Number(SpatialElement.SpelementUnit.R),
                'Y': Number(re_projected[0]),
                'X': Number(re_projected[1])
            };
        } else {
            if (SpatialElement.SpelementUnit.length === 1)
                return null;
            var firstPoint = SpatialElement.SpelementUnit[0];
            var lastPoint = SpatialElement.SpelementUnit[SpatialElement.SpelementUnit.length - 1];
            if (firstPoint.SuNmb === lastPoint.SuNmb) {
                LineString = false;
                //console.log(LineString, firstPoint.SuNmb, lastPoint.SuNmb);
                for (var j = 0; j < SpatialElement.SpelementUnit.length - 1; j++) {
                    var point = SpatialElement.SpelementUnit[j];
                    var xy = [];
                    coord = [Number(point.Ordinate.Y), Number(point.Ordinate.X)];
                    re_projected = convertCoord(coord);
                    xy.push(Number(re_projected[0]));
                    xy.push(Number(re_projected[1]));
                    contour.push(xy);
                }
                contour.push(contour[0]);
                Area = polygonArea(xs, ys, xs.length);
            } else {
                LineString = true;
                //console.log(LineString, firstPoint.SuNmb, lastPoint.SuNmb);
                for (var j = 0; j < SpatialElement.SpelementUnit.length; j++) {
                    var point = SpatialElement.SpelementUnit[j];
                    var xy = [];
                    coord = [Number(point.Ordinate.Y), Number(point.Ordinate.X)];
                    re_projected = convertCoord(coord);
                    xy.push(Number(re_projected[0]));
                    xy.push(Number(re_projected[1]));
                    contour.push(xy);
                }
                // бывае что LineString имеет одинаковые первую и последнюю точки
                // но SuNmb разные.
//                if ((contour[0][0][0] === contour[0][contour[0].length-1][0]) &&
//                        (contour[0][0][1] === contour[0][contour[0].length-1][1])){
//                    delete(contour[0][contour.length-1]);
//                    console.log(contour[0][0][0], contour[0][contour[0].length-1][0],LineString);
//                }
            }
            //console.log(Area);
            return contour;
        }
    }

    function processSpatialElement(SpatialElement) {
        var cntrs = [];
        if (_proj !== null) {
            spatialSysName = getSpatialSysName();
        }
        // Утинная типизация для проверки наличия дырок в полигоне
        // В Росреестре не следят за порядком контуров полигона
        if (SpatialElement.splice) {
            var MaxArea;
            var MaxAreaIdx = 0;
            for (var k = 0; k < SpatialElement.length; k++) {
                var contour = SpatialElement[k];
                var cnt = createContour(contour);
                if (cnt)
                    cntrs.push(cnt);
                if (Area > MaxArea) {
                    MaxArea = Area;
                    MaxAreaIdx = k;
                }
            }
            // Перемещаем основной (наружний) контур в начало массива
            if (MaxAreaIdx > 0) {
                var mainCnt = cntrs.splice(MaxAreaIdx, 1);
                cntrs.splice(0, 0, mainCnt);
                //console.log('Номер основного контура был ' + MaxAreaIdx);
            }
            if ((cntrs !== null) || (cntrs !== undefined)) {
                return cntrs;
            } else {
                return null;
            }
        } else {
            cntrs.push(createContour(SpatialElement));
            if ((cntrs !== null) || (cntrs !== undefined)) {
                return cntrs;
            } else {
                return null;
            }
        }
    }

    // у сооружений может быть смешаная геометрия (LineString, LineString, Circle, LineString)
    // в этом случае контуры cntrs будут хранить коллекцию
    function processRealtySpatialElement(SpatialElement) {
        var cntrs = [];
        if (_proj !== null) {
            spatialSysName = getSpatialSysName();
        }
        if (SpatialElement.splice) {
            var MaxArea;
            var MaxAreaIdx = 0;
            for (var k = 0; k < SpatialElement.length; k++) {
                var contour = SpatialElement[k];
                var cnt = createContour(contour);
                if (cnt)
                    cntrs.push(cnt);
                if (Area > MaxArea) {
                    MaxArea = Area;
                    MaxAreaIdx = k;
                }
            }
            // Перемещаем основной (наружний) контур в начало массива
            if ((!LineString) && (MaxAreaIdx > 0)) {
                var mainCnt = cntrs.splice(MaxAreaIdx, 1);
                cntrs.splice(0, 0, mainCnt);
                //console.log('Номер основного контура был ' + MaxAreaIdx);
            }
        } else {
            cntrs.push(createContour(SpatialElement));
        }
        if (cntrs.length > 1) {
            collection = [];

            for (var i = 0; i < cntrs.length - 1; i++) {
                // Окружность
                if (cntrs[i].R) {
                    var points = approximateCircle(cntrs[i].X, cntrs[i].Y, cntrs[i].R);
                    collection.push({
                        "type": "Polygon",
                        "coordinates": [points]
                    });
                }
                // Полигон
                else if (!LineString) {
                    collection.push({
                        "type": "Polygon",
                        "coordinates": [cntrs[i]]
                    });
                } else {
                    collection.push({
                        "type": "LineString",
                        "coordinates": cntrs[i]
                    });
                }
            }
            return  {
                "type": "GeometryCollection",
                "geometries": collection
            };

        } else {
            // Окружность
            if (cntrs[0].R) {
                var points = approximateCircle(cntrs[0].X, cntrs[0].Y, cntrs[0].R);
                return {
                    "type": "Polygon",
                    "coordinates": [points]
                };
            }
            // Полигон
            else if (!LineString) {
                return{
                    "type": "Polygon",
                    "coordinates": [cntrs[0]]
                };
            } else {
                return{
                    "type": "LineString",
                    "coordinates": cntrs[0]
                };
            }
        }
    }

    function approximateCircle(X, Y, R) {
        var rotatedAngle, x, y;
        var sides = 32;
        var points = [];
        x = X + R; // сдвиг на окружность
        //console.log('approximateCircle');
        for (var d = 0; d < sides - 1; d++) {
            var xy = [];
            rotatedAngle = (d * 2 * Math.PI / sides);//angle + (d * 2 * Math.PI / sides);
            x = X + (R * Math.cos(rotatedAngle));
            y = Y + (R * Math.sin(rotatedAngle));
            coord = [Number(y), Number(x)];
            xy.push(coord[0]);
            xy.push(coord[1]);
            points.push(xy);
        }
        points.push(points[0]);
        return points;
    }

    if ((_EntitySpatialObj !== undefined) && (_EntitySpatialObj !== null)) {

        var cntrs = [];

        switch (oType) {
            case 'Parcel' :
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                // Если это для многоконтурного объекта, то возвращем массив контуров
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            case 'Construction':
            {
                return processRealtySpatialElement(_EntitySpatialObj.SpatialElement);
                break;
            }
            case 'Building':
            {
                return processRealtySpatialElement(_EntitySpatialObj.SpatialElement);
                break;
            }
            case 'Uncompleted':
            {
                return processRealtySpatialElement(_EntitySpatialObj.SpatialElement);
                break;
            }
            case 'Zone':
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            case 'Quartal':
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            case 'Bound':
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            default :
            {
                console.log('Тип объекта не распознан');
                return null;
            }
        }
    }

}
;

},{"./SpatialSystems":5}],5:[function(require,module,exports){
/* 
 * The MIT License
 *
 * Copyright 2015 filippov.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

/*  Сиcтемы координат имеют смысл для визуализации получаемых GeoJSON,
    для сохранения в файл нет надобности в преобразовании.
    Информация о системах координат хранится в теге <CoordSystems>
    <CoordSystems>
        <ns3:CoordSystem Name="МСК 70, зона 3" CsId="ID3" />
        <ns3:CoordSystem Name="МСК 70, зона 4" CsId="ID4" />
    </CoordSystems>
    их может быть несколько.
    У объектов в теге <EntitySpatial> указано в какой СК он имеет координаты,
    например:
    <EntitySpatial EntSys="ID3">

    проблемы конвертации у тех xml у который указано <ns3:CoordSystem Name="СК кадастрового округа" CsId="ID1" />
*/ 


module.exports.SpatialSystems = {
    // Томская область
    'МСК 70, зона 4': '+proj=tmerc +lat_0=0 +lon_0=83.73333333333 +k=1 +x_0=4250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs',
    'МСК 70, зона 2': '+proj=tmerc +lat_0=0 +lon_0=77.73333333333 +k=1 +x_0=2250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs',
    'МСК 70, зона 3': '+proj=tmerc +lat_0=0 +lon_0=80.73333333333 +k=1 +x_0=3250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs'
};
},{}]},{},[1])
//# sourceMappingURL=data:application/json;charset:utf-8;base64,eyJ2ZXJzaW9uIjozLCJzb3VyY2VzIjpbIm5vZGVfbW9kdWxlcy9ncnVudC1icm93c2VyaWZ5L25vZGVfbW9kdWxlcy9icm93c2VyaWZ5L25vZGVfbW9kdWxlcy9icm93c2VyLXBhY2svX3ByZWx1ZGUuanMiLCJzcmMvYXBwLmpzIiwic3JjL2NhZFByb3BzLmpzIiwic3JjL2NhZFhNTDJHZW9KU09OLmpzIiwic3JjL3NwYXRpYWwvRW50aXR5U3BhdGlhbC5qcyIsInNyYy9zcGF0aWFsL1NwYXRpYWxTeXN0ZW1zLmpzIl0sIm5hbWVzIjpbXSwibWFwcGluZ3MiOiJBQUFBO0FDQUE7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7O0FDbkdBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7O0FDeDRCQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBOztBQzNSQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBOztBQzdWQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQSIsImZpbGUiOiJnZW5lcmF0ZWQuanMiLCJzb3VyY2VSb290IjoiIiwic291cmNlc0NvbnRlbnQiOlsiKGZ1bmN0aW9uIGUodCxuLHIpe2Z1bmN0aW9uIHMobyx1KXtpZighbltvXSl7aWYoIXRbb10pe3ZhciBhPXR5cGVvZiByZXF1aXJlPT1cImZ1bmN0aW9uXCImJnJlcXVpcmU7aWYoIXUmJmEpcmV0dXJuIGEobywhMCk7aWYoaSlyZXR1cm4gaShvLCEwKTt2YXIgZj1uZXcgRXJyb3IoXCJDYW5ub3QgZmluZCBtb2R1bGUgJ1wiK28rXCInXCIpO3Rocm93IGYuY29kZT1cIk1PRFVMRV9OT1RfRk9VTkRcIixmfXZhciBsPW5bb109e2V4cG9ydHM6e319O3Rbb11bMF0uY2FsbChsLmV4cG9ydHMsZnVuY3Rpb24oZSl7dmFyIG49dFtvXVsxXVtlXTtyZXR1cm4gcyhuP246ZSl9LGwsbC5leHBvcnRzLGUsdCxuLHIpfXJldHVybiBuW29dLmV4cG9ydHN9dmFyIGk9dHlwZW9mIHJlcXVpcmU9PVwiZnVuY3Rpb25cIiYmcmVxdWlyZTtmb3IodmFyIG89MDtvPHIubGVuZ3RoO28rKylzKHJbb10pO3JldHVybiBzfSkiLCIvKiBcbiAqIFRvIGNoYW5nZSB0aGlzIGxpY2Vuc2UgaGVhZGVyLCBjaG9vc2UgTGljZW5zZSBIZWFkZXJzIGluIFByb2plY3QgUHJvcGVydGllcy5cbiAqIFRvIGNoYW5nZSB0aGlzIHRlbXBsYXRlIGZpbGUsIGNob29zZSBUb29scyB8IFRlbXBsYXRlc1xuICogYW5kIG9wZW4gdGhlIHRlbXBsYXRlIGluIHRoZSBlZGl0b3IuXG4gKi9cblxuKGZ1bmN0aW9uICgpIHtcbiAgdmFyIENvbnZlcnRlciA9IHJlcXVpcmUoJy4vY2FkWE1MMkdlb0pTT04uanMnKTtcbiAgdmFyIGRhdGEgPSB7XG5cbiAgICBpbml0OiBmdW5jdGlvbiAobWFwLCByZXByb2plY3QpIHtcbiAgICAgIGRhdGEuX21hcCA9IG1hcDtcbiAgICAgIGRhdGEucmVwcm9qZWN0ID0gcmVwcm9qZWN0O1xuICAgICAgZGF0YS5fZ2VvQ29udGVudCA9IHtcblxuICAgICAgfTtcblxuICAgICAgZGF0YS5fZXhwb3J0Q29udCA9IGRvY3VtZW50LmdldEVsZW1lbnRCeUlkKCdleHBvcnRDb250Jyk7XG4gICAgICBkYXRhLl9maWxlUHJvZ3Jlc3MgPSBkb2N1bWVudC5nZXRFbGVtZW50QnlJZCgnZmlsZVByb2dyZXNzJyk7XG4gICAgICB2YXIgZXhwb3J0SWNvbiA9IG51bGw7XG4gICAgICBpZiAobmF2aWdhdG9yLm1zU2F2ZUJsb2IpIHsgLy8gSUUgMTArXG4gICAgICAgIGV4cG9ydEljb24gPSBMLkRvbVV0aWwuY3JlYXRlKCdidXR0b24nLCAnYnV0dG9uJywgZGF0YS5fZXhwb3J0Q29udCk7XG4gICAgICB9IGVsc2Uge1xuICAgICAgICBleHBvcnRJY29uID0gTC5Eb21VdGlsLmNyZWF0ZSgnYScsICdidXR0b24nLCBkYXRhLl9leHBvcnRDb250KTtcbiAgICAgICAgZXhwb3J0SWNvbi5zZXRBdHRyaWJ1dGUoJ3RhcmdldCcsICdfYmxhbmsnKTtcbiAgICAgICAgZXhwb3J0SWNvbi5zZXRBdHRyaWJ1dGUoJ2hyZWYnLCAnJyk7XG4gICAgICB9XG4gICAgICBleHBvcnRJY29uLmlubmVySFRNTCA9ICfQrdC60YHQv9C+0YDRgiDQsiBHZW9KU09OJztcbiAgICAgIHZhciBjb252ZXJ0Q29vcmQgPSBMLkRvbVV0aWwuZ2V0KCdjb252ZXJ0TVNLJyk7XG4gICAgICBMLkRvbVV0aWwucmVtb3ZlQ2xhc3MoY29udmVydENvb3JkLCAnaGlkZGVuJyk7XG4gICAgICBkYXRhLl9jb3VudFNwYW4gPSBMLkRvbVV0aWwuY3JlYXRlKCdzcGFuJywgJycsIGRhdGEuX2V4cG9ydENvbnQpO1xuICAgICAgZXhwb3J0SWNvbi5hZGRFdmVudExpc3RlbmVyKCdjbGljaycsIGZ1bmN0aW9uICgpIHtcbiAgICAgICAgdmFyIG9iaiA9IGRhdGEuZ2V0QmxvYihjb252ZXJ0Q29vcmQuY2hlY2tlZCk7XG4gICAgICAgIGlmIChuYXZpZ2F0b3IubXNTYXZlT3JPcGVuQmxvYikgeyAvLyBJRSAxMCtcbiAgICAgICAgICBuYXZpZ2F0b3IubXNTYXZlT3JPcGVuQmxvYihvYmouYmxvYiwgb2JqLmZpbGUpO1xuICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgIGV4cG9ydEljb24uc2V0QXR0cmlidXRlKCdkb3dubG9hZCcsIG9iai5maWxlKTtcbiAgICAgICAgICBleHBvcnRJY29uLnNldEF0dHJpYnV0ZSgnaHJlZicsIHdpbmRvdy5VUkwuY3JlYXRlT2JqZWN0VVJMKG9iai5ibG9iKSk7XG4gICAgICAgIH1cbiAgICAgICAgZGF0YS5fY291bnRTcGFuLmlubmVySFRNTCA9ICco0LPQtdC+0LzQtdGC0YDQuNC5OiA8Yj4nICsgb2JqLmNvdW50ICsgJzwvYj4pJztcbiAgICAgIH0sIGZhbHNlKTtcbiAgICAgIEwuRG9tVXRpbC5hZGRDbGFzcyhkYXRhLl9leHBvcnRDb250LCAnaGlkZGVuJyk7XG4gICAgICBkYXRhLl9rcHRJbmZvID0gZG9jdW1lbnQuZ2V0RWxlbWVudEJ5SWQoJ2twdEluZm8nKTtcbiAgICAgIGRhdGEuX2dyb3VwcyA9IHt9O1xuICAgIH0sXG5cbiAgICBzZWxlY3RGaWxlOiBmdW5jdGlvbiAoZWwpIHtcbiAgICAgIGRhdGEuX2twdEluZm8uaW5uZXJIVE1MID0gJyc7XG4gICAgICBMLkRvbVV0aWwuYWRkQ2xhc3MoZGF0YS5fZXhwb3J0Q29udCwgJ2hpZGRlbicpO1xuICAgICAgdmFyIHJlYWRlciA9IG5ldyBGaWxlUmVhZGVyKCksXG4gICAgICAgICAgICAgIGZpbGUgPSBlbC5maWxlc1swXTtcbiAgICAgIHJlYWRlci5vbmxvYWQgPSBmdW5jdGlvbiAoKSB7XG4gICAgICAgIGRhdGEuX2ZpbGVQcm9ncmVzcy5pbm5lckhUTUwgPSAn0LfQsNCz0YDRg9C20LXQvdC+OiA8Yj4nICsgZmlsZS5zaXplICsgJzwvYj4g0LHQsNC50YInO1xuLy8gICAgICAgIE9iamVjdC5rZXlzKGRhdGEuX2dyb3VwcykuZm9yRWFjaChmdW5jdGlvbiAodHlwZSkge1xuLy8gICAgICAgICAgdmFyIGdyb3VwID0gZGF0YS5fZ3JvdXBzW3R5cGVdO1xuLy8gICAgICAgICAgZ3JvdXAuY2xlYXJMYXllcnMoKTtcbi8vICAgICAgICAgIGRhdGEuX21hcC5yZW1vdmVMYXllcihncm91cCk7XG4vLyAgICAgICAgfSk7XG4vLyAgICAgICAgZGF0YS5fZ3JvdXBzID0ge307XG4vLyAgICAgICAgT2JqZWN0LmtleXMoZGF0YS5fZ3JvdXBzTXNrKS5mb3JFYWNoKGZ1bmN0aW9uICh0eXBlKSB7XG4vLyAgICAgICAgICB2YXIgZ3JvdXAgPSBkYXRhLl9ncm91cHNNc2tbdHlwZV07XG4vLyAgICAgICAgICBncm91cC5jbGVhckxheWVycygpO1xuLy8gICAgICAgIH0pO1xuLy8gICAgICAgIGRhdGEuX2dyb3Vwc01zayA9IHt9O1xuICAgICAgICBkYXRhLnBhcnNlRmlsZShyZWFkZXIpO1xuICAgICAgfTtcbiAgICAgIHJlYWRlci5vbnByb2dyZXNzID0gZnVuY3Rpb24gKGRhdGEpIHtcbiAgICAgICAgaWYgKGRhdGEubGVuZ3RoQ29tcHV0YWJsZSkge1xuICAgICAgICAgIEwuRG9tVXRpbC5yZW1vdmVDbGFzcyhkYXRhLl9yZXNDb250LCAnaGlkZGVuJyk7XG4gICAgICAgICAgdmFyIGNudCA9IGRhdGEubG9hZGVkIC8gZGF0YS50b3RhbDtcbiAgICAgICAgICBkYXRhLl9maWxlUHJvZ3Jlc3MuaW5uZXJIVE1MID0gJ9C30LDQs9GA0YPQttC10L3QvjogPGI+JyArIGRhdGEubG9hZGVkICsgJzwvYj4g0LHQsNC50YInICsgKGNudCA9PT0gMSA/ICcnIDogJygnICsgcGFyc2VJbnQoY250ICogMTAwLCAxMCkgKyAnJSknKTtcbiAgICAgICAgfVxuICAgICAgfTtcbiAgICAgIGlmIChlbC5maWxlcy5sZW5ndGgpIHtcbiAgICAgICAgcmVhZGVyLnJlYWRBc1RleHQoZmlsZSk7XG4gICAgICB9XG4gICAgfSxcblxuICAgIHBhcnNlRmlsZTogZnVuY3Rpb24gKHJlYWRlcikge1xuICAgICAgLy8gaHR0cHM6Ly9iaXRidWNrZXQub3JnL3N1cmVucmFvL3htbDJqc29uXG4gICAgICAvLyBodHRwOi8vd3d3LmNocm9tZS1hbGxvdy1maWxlLWFjY2Vzcy1mcm9tLWZpbGUuY29tL1xuICAgICAgdmFyIHBhcnNlZERhdGEgPSBDb252ZXJ0ZXIuR2VvSlNPTihyZWFkZXIucmVzdWx0KTtcbiAgICAgIGNvbnNvbGUubG9nKHBhcnNlZERhdGEuZ2VvSlNPTlBhcmNlbHMpO1xuLy8gICAgICAkLmdldCgnLi90ZXN0ZGF0YS9kb2MyMTYxOTc0LnhtbCcsIGZ1bmN0aW9uICh4bWwpIHtcbi8vICAgICAgICAvL3ZhciBqc29uID0gJC54bWwyanNvbih4bWwpLkNhZGFzdHJhbEJsb2Nrcztcbi8vICAgICAgICAvLyAkKFwiI2RhdGFcIikuaHRtbCgnPGNvZGU+JytKU09OLnN0cmluZ2lmeShqc29uKSsnPC9jb2RlPicpO1xuLy8gICAgICAgIGNvbnNvbGUubG9nKENvbnZlcnRlci5HZW9KU09OKTtcbi8vICAgICAgICBwYXJzZWREYXRhID0gQ29udmVydGVyLkdlb0pTT04oeG1sLCB0cnVlKTtcbi8vICAgICAgfSkuc3VjY2Vzcyhcbi8vICAgICAgICAgICAgICBmdW5jdGlvbiAoKSB7XG4vLyAgICAgICAgICAgICAgICAkKCcjbG9hZGluZycpLnRvZ2dsZUNsYXNzKCdoaWRkZW4nKTtcbi8vICAgICAgICAgICAgICAgIHZhciB6b25lcyA9IHBhcnNlZERhdGEuZ2VvSlNPTlpvbmVzO1xuLy8gICAgICAgICAgICAgICAgdmFyIHF1YXJ0YWwgPSBwYXJzZWREYXRhLmdlb0pTT05RdWFydGFsO1xuLy8gICAgICAgICAgICAgICAgdmFyIGJvdW5kcyA9IHBhcnNlZERhdGEuZ2VvSlNPTkJvdW5kcztcbi8vICAgICAgICAgICAgICB9KTtcbiAgICB9XG4gIH07XG4gIHdpbmRvdy5jb252ZXJ0ZWREYXRhID0gZGF0YTtcbn0pKCk7XG4iLCIvKiBcbiAqIFRoZSBNSVQgTGljZW5zZVxuICpcbiAqIENvcHlyaWdodCAyMDE1IGZpbGlwcG92LlxuICpcbiAqIFBlcm1pc3Npb24gaXMgaGVyZWJ5IGdyYW50ZWQsIGZyZWUgb2YgY2hhcmdlLCB0byBhbnkgcGVyc29uIG9idGFpbmluZyBhIGNvcHlcbiAqIG9mIHRoaXMgc29mdHdhcmUgYW5kIGFzc29jaWF0ZWQgZG9jdW1lbnRhdGlvbiBmaWxlcyAodGhlIFwiU29mdHdhcmVcIiksIHRvIGRlYWxcbiAqIGluIHRoZSBTb2Z0d2FyZSB3aXRob3V0IHJlc3RyaWN0aW9uLCBpbmNsdWRpbmcgd2l0aG91dCBsaW1pdGF0aW9uIHRoZSByaWdodHNcbiAqIHRvIHVzZSwgY29weSwgbW9kaWZ5LCBtZXJnZSwgcHVibGlzaCwgZGlzdHJpYnV0ZSwgc3VibGljZW5zZSwgYW5kL29yIHNlbGxcbiAqIGNvcGllcyBvZiB0aGUgU29mdHdhcmUsIGFuZCB0byBwZXJtaXQgcGVyc29ucyB0byB3aG9tIHRoZSBTb2Z0d2FyZSBpc1xuICogZnVybmlzaGVkIHRvIGRvIHNvLCBzdWJqZWN0IHRvIHRoZSBmb2xsb3dpbmcgY29uZGl0aW9uczpcbiAqXG4gKiBUaGUgYWJvdmUgY29weXJpZ2h0IG5vdGljZSBhbmQgdGhpcyBwZXJtaXNzaW9uIG5vdGljZSBzaGFsbCBiZSBpbmNsdWRlZCBpblxuICogYWxsIGNvcGllcyBvciBzdWJzdGFudGlhbCBwb3J0aW9ucyBvZiB0aGUgU29mdHdhcmUuXG4gKlxuICogVEhFIFNPRlRXQVJFIElTIFBST1ZJREVEIFwiQVMgSVNcIiwgV0lUSE9VVCBXQVJSQU5UWSBPRiBBTlkgS0lORCwgRVhQUkVTUyBPUlxuICogSU1QTElFRCwgSU5DTFVESU5HIEJVVCBOT1QgTElNSVRFRCBUTyBUSEUgV0FSUkFOVElFUyBPRiBNRVJDSEFOVEFCSUxJVFksXG4gKiBGSVRORVNTIEZPUiBBIFBBUlRJQ1VMQVIgUFVSUE9TRSBBTkQgTk9OSU5GUklOR0VNRU5ULiBJTiBOTyBFVkVOVCBTSEFMTCBUSEVcbiAqIEFVVEhPUlMgT1IgQ09QWVJJR0hUIEhPTERFUlMgQkUgTElBQkxFIEZPUiBBTlkgQ0xBSU0sIERBTUFHRVMgT1IgT1RIRVJcbiAqIExJQUJJTElUWSwgV0hFVEhFUiBJTiBBTiBBQ1RJT04gT0YgQ09OVFJBQ1QsIFRPUlQgT1IgT1RIRVJXSVNFLCBBUklTSU5HIEZST00sXG4gKiBPVVQgT0YgT1IgSU4gQ09OTkVDVElPTiBXSVRIIFRIRSBTT0ZUV0FSRSBPUiBUSEUgVVNFIE9SIE9USEVSIERFQUxJTkdTIElOXG4gKiBUSEUgU09GVFdBUkUuXG4gKi9cbid1c2Ugc3RyaWN0Jztcbi8vIERpY3RzXG5cbi8vINCh0YLQsNGC0YPRgSDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LhcbnZhciBkU3RhdGVzID0ge1xuICAgICcwMSc6ICfQoNCw0L3QtdC1INGD0YfRgtC10L3QvdGL0LknLFxuICAgICcwNSc6ICfQktGA0LXQvNC10L3QvdGL0LknLFxuICAgICcwNic6ICfQo9GH0YLQtdC90L3Ri9C5JyxcbiAgICAnMDcnOiAn0KHQvdGP0YIg0YEg0YPRh9C10YLQsCcsXG4gICAgJzA4JzogJ9CQ0L3QvdGD0LvQuNGA0L7QstCw0L3QvdGL0LknXG59O1xuLy8g0KLQuNC/ICDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LhcbnZhciBkUGFyY2VscyA9IHtcbiAgICAnMDEnOiAn0JfQtdC80LvQtdC/0L7Qu9GM0LfQvtCy0LDQvdC40LUnLFxuICAgICcwMic6ICfQldC00LjQvdC+0LUg0LfQtdC80LvQtdC/0L7Qu9GM0LfQvtCy0LDQvdC40LUnLFxuICAgICcwMyc6ICfQntCx0L7RgdC+0LHQu9C10L3QvdGL0Lkg0YPRh9Cw0YHRgtC+0LonLFxuICAgICcwNCc6ICfQo9GB0LvQvtCy0L3Ri9C5INGD0YfQsNGB0YLQvtC6JyxcbiAgICAnMDUnOiAn0JzQvdC+0LPQvtC60L7QvdGC0YPRgNC90YvQuSDRg9GH0LDRgdGC0L7QuicsXG4gICAgJzA2JzogJ9CX0L3QsNGH0LXQvdC40LUg0L7RgtGB0YPRgtGB0YLQstGD0LXRgidcbn07XG4vLyDQmtCw0YLQtdCz0L7RgNC40Y8g0LfQtdC80LXQu9GMXG52YXIgZENhdGVnb3JpZXMgPSB7XG4gICAgJzAwMzAwMTAwMDAwMCc6ICfQl9C10LzQu9C4INGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzAwMzAwMjAwMDAwMCc6ICfQl9C10LzQu9C4INC90LDRgdC10LvRkdC90L3Ri9GFINC/0YPQvdC60YLQvtCyJyxcbiAgICAnMDAzMDAzMDAwMDAwJzogJ9CX0LXQvNC70Lgg0L/RgNC+0LzRi9GI0LvQtdC90L3QvtGB0YLQuCwg0Y3QvdC10YDQs9C10YLQuNC60LgsINGC0YDQsNC90YHQv9C+0YDRgtCwLCDRgdCy0Y/Qt9C4LCDRgNCw0LTQuNC+0LLQtdGJ0LDQvdC40Y8sINGC0LXQu9C10LLQuNC00LXQvdC40Y8sINC40L3RhNC+0YDQvNCw0YLQuNC60LgsINC30LXQvNC70Lgg0LTQu9GPINC+0LHQtdGB0L/QtdGH0LXQvdC40Y8g0LrQvtGB0LzQuNGH0LXRgdC60L7QuSDQtNC10Y/RgtC10LvRjNC90L7RgdGC0LgsINC30LXQvNC70Lgg0L7QsdC+0YDQvtC90YssINCx0LXQt9C+0L/QsNGB0L3QvtGB0YLQuCDQuCDQt9C10LzQu9C4INC40L3QvtCz0L4g0YHQv9C10YbQuNCw0LvRjNC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcbiAgICAnMDAzMDA0MDAwMDAwJzogJ9CX0LXQvNC70Lgg0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80YvRhSDRgtC10YDRgNC40YLQvtGA0LjQuSDQuCDQvtCx0YrQtdC60YLQvtCyJyxcbiAgICAnMDAzMDA1MDAwMDAwJzogJ9CX0LXQvNC70Lgg0LvQtdGB0L3QvtCz0L4g0YTQvtC90LTQsCcsXG4gICAgJzAwMzAwNjAwMDAwMCc6ICfQl9C10LzQu9C4INCy0L7QtNC90L7Qs9C+INGE0L7QvdC00LAnLFxuICAgICcwMDMwMDcwMDAwMDAnOiAn0JfQtdC80LvQuCDQt9Cw0L/QsNGB0LAnLFxuICAgICcwMDMwMDgwMDAwMDAnOiAn0JrQsNGC0LXQs9C+0YDQuNGPINC90LUg0YPRgdGC0LDQvdC+0LLQu9C10L3QsCdcbn07XG4vLyDQntCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKSDQv9GA0LDQslxudmFyIGRFbmN1bWJyYW5jZXMgPSB7XG5cdCcwMjIwMDEwMDAwMDAnOiAn0KHQtdGA0LLQuNGC0YPRgicsXG5cdCcwMjIwMDEwMDEwMDAnOiAn0J/Rg9Cx0LvQuNGH0L3Ri9C5INGB0LXRgNCy0LjRgtGD0YInLFxuXHQnMDIyMDAxMDAyMDAwJzogJ9Cn0LDRgdGC0L3Ri9C5INGB0LXRgNCy0LjRgtGD0YInLFxuXHQnMDIyMDAyMDAwMDAwJzogJ9CQ0YDQtdGB0YInLFxuXHQnMDIyMDAzMDAwMDAwJzogJ9CX0LDQv9GA0LXRidC10L3QuNC1Jyxcblx0JzAyMjAwNDAwMDAwMCc6ICfQntCz0YDQsNC90LjRh9C10L3QuNGPINC/0YDQsNCyINC90LAg0LfQtdC80LXQu9GM0L3Ri9C5INGD0YfQsNGB0YLQvtC6LCDQv9GA0LXQtNGD0YHQvNC+0YLRgNC10L3QvdGL0LUg0YHRgtCw0YLRjNGP0LzQuCA1NiwgNTYuMSDQl9C10LzQtdC70YzQvdC+0LPQviDQutC+0LTQtdC60YHQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnMDIyMDA1MDAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0LjQt9GK0Y/RgtC40Lgg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAsINC20LjQu9C+0LPQviDQv9C+0LzQtdGJ0LXQvdC40Y8nLFxuXHQnMDIyMDA2MDAwMDAwJzogJ9CQ0YDQtdC90LTQsCAo0LIg0YLQvtC8INGH0LjRgdC70LUsINGB0YPQsdCw0YDQtdC90LTQsCknLFxuXHQnMDIyMDA3MDAwMDAwJzogJ9CY0L/QvtGC0LXQutCwJyxcblx0JzAyMjAwODAwMDAwMCc6ICfQmNC/0L7RgtC10LrQsCDQsiDRgdC40LvRgyDQt9Cw0LrQvtC90LAnLFxuXHQnMDIyMDA5MDAwMDAwJzogJ9CR0LXQt9Cy0L7Qt9C80LXQt9C00L3QvtC1ICjRgdGA0L7Rh9C90L7QtSkg0L/QvtC70YzQt9C+0LLQsNC90LjQtSDQt9C10LzQtdC70YzQvdGL0Lwv0LvQtdGB0L3Ri9C8INGD0YfQsNGB0YLQutC+0LwnLFxuXHQnMDIyMDEwMDAwMDAwJzogJ9CU0L7QstC10YDQuNGC0LXQu9GM0L3QvtC1INGD0L/RgNCw0LLQu9C10L3QuNC1Jyxcblx0JzAyMjAxMTAwMDAwMCc6ICfQoNC10L3RgtCwJyxcblx0JzAyMjAxMjAwMDAwMCc6ICfQl9Cw0L/RgNC10YIg0L3QsCDRgdC+0LLQtdGA0YjQtdC90LjQtSDQtNC10LnRgdGC0LLQuNC5INCyINGB0YTQtdGA0LUg0JPQmtCjINCyINC+0YLQvdC+0YjQtdC90LjQuCDQntCdJyxcblx0JzAyMjA5OTAwMDAwMCc6ICfQmNC90YvQtSDQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKSDQv9GA0LDQsidcbn07XG4vLyDQldC00LjQvdC40YbRiyDQuNC30LzQtdGA0LXQvdC40LlcbnZhciBkVW5pdHMgPSB7XG5cdCcwMDMnOiAn0JzQuNC70LvQuNC80LXRgtGAJyxcblx0JzAwNCc6ICfQodCw0L3RgtC40LzQtdGC0YAnLFxuXHQnMDA1JzogJ9CU0LXRhtC40LzQtdGC0YAnLFxuXHQnMDA2JzogJ9Cc0LXRgtGAJyxcblx0JzAwOCc6ICfQmtC40LvQvtC80LXRgtGAJyxcblx0JzAwOSc6ICfQnNC10LPQsNC80LXRgtGAJyxcblx0JzA0Nyc6ICfQnNC+0YDRgdC60LDRjyDQvNC40LvRjycsXG5cdCcwNTAnOiAn0JrQstCw0LTRgNCw0YLQvdGL0Lkg0LzQuNC70LvQuNC80LXRgtGAJyxcblx0JzA1MSc6ICfQmtCy0LDQtNGA0LDRgtC90YvQuSDRgdCw0L3RgtC40LzQtdGC0YAnLFxuXHQnMDUzJzogJ9Ca0LLQsNC00YDQsNGC0L3Ri9C5INC00LXRhtC40LzQtdGC0YAnLFxuXHQnMDU1JzogJ9Ca0LLQsNC00YDQsNGC0L3Ri9C5INC80LXRgtGAJyxcblx0JzA1OCc6ICfQotGL0YHRj9GH0LAg0LrQstCw0LTRgNCw0YLQvdGL0YUg0LzQtdGC0YDQvtCyJyxcblx0JzA1OSc6ICfQk9C10LrRgtCw0YAnLFxuXHQnMDYxJzogJ9Ca0LLQsNC00YDQsNGC0L3Ri9C5INC60LjQu9C+0LzQtdGC0YAnLFxuXHQnMTA5JzogJ9CQ0YAgKDEwMCDQvDIpJyxcblx0JzM1OSc6ICfQodGD0YLQutC4Jyxcblx0JzM2MCc6ICfQndC10LTQtdC70Y8nLFxuXHQnMzYxJzogJ9CU0LXQutCw0LTQsCcsXG5cdCczNjInOiAn0JzQtdGB0Y/RhicsXG5cdCczNjQnOiAn0JrQstCw0YDRgtCw0LsnLFxuXHQnMzY1JzogJ9Cf0L7Qu9GD0LPQvtC00LjQtScsXG5cdCczNTYnOiAn0KfQsNGBJyxcblx0JzM1NSc6ICfQnNC40L3Rg9GC0LAgJyxcblx0JzM2Nic6ICfQk9C+0LQnLFxuXHQnMzgzJzogJ9Cg0YPQsdC70YwnLFxuXHQnMzg0JzogJ9Ci0YvRgdGP0YfQsCDRgNGD0LHQu9C10LknLFxuXHQnMzg1JzogJ9Cc0LjQu9C70LjQvtC9INGA0YPQsdC70LXQuScsXG5cdCczODYnOiAn0JzQuNC70LvQuNCw0YDQtCDRgNGD0LHQu9C10LknLFxuXHQnMTAwMCc6ICfQndC10L7Qv9GA0LXQtNC10LvQtdC90L4nLFxuXHQnMTAwMSc6ICfQl9C90LDRh9C10L3QuNC1INC+0YLRgdGD0YLRgdGC0LLRg9C10YInLFxuXHQnMTAwMic6ICfQoNGD0LHQu9C10Lkg0LfQsCDQutCyLiDQvNC10YLRgCcsXG5cdCcxMDAzJzogJ9Cg0YPQsdC70LXQuSDQt9CwINCw0YAnLFxuXHQnMTAwNCc6ICfQoNGD0LHQu9C10LkgINC30LAg0LPQtdC60YLQsNGAJyxcblx0JzEwMDUnOiAn0JjQvdGL0LUnLFxuXHQnMTAwNic6ICfQoNGD0LHQu9C10Lkg0LfQsCDQutCyLiDQutC8Jyxcblx0JzEwMDcnOiAn0KDQsNCx0L7Rh9C40Lkg0LTQtdC90YwnXG59O1xuLy8g0JLRgdC1INC00L7QutGD0LzQtdC90YLRiyAo0KHQsdC+0YDQvdC40Log0LrQu9Cw0YHRgdC40YTQuNC60LDRgtC+0YDQvtCyLCDQutC+0LTRiyA4LjEsIDguMiwgNTU1LCA1NTguMSwgNTU4LjIsIDU1OC4zLCA1NTguNCwgNTU4LjUsIDU1OC42KVxudmFyIGRBbGxEb2N1bWVudHMgPSB7XG5cdCcwMDgwMDEwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLLCDRg9C00L7RgdGC0L7QstC10YDRj9GO0YnQuNC1INC70LjRh9C90L7RgdGC0Ywg0YTQuNC30LjRh9C10YHQutC+0LPQviDQu9C40YbQsCcsXG5cdCcwMDgwMDEwMDEwMDAnOiAn0J/QsNGB0L/QvtGA0YIg0LPRgNCw0LbQtNCw0L3QuNC90LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzAwODAwMTAwMjAwMCc6ICfQn9Cw0YHQv9C+0YDRgiDQs9GA0LDQttC00LDQvdC40L3QsCDQodCh0KHQoCcsXG5cdCcwMDgwMDEwMDMwMDAnOiAn0J/QsNGB0L/QvtGA0YIg0LPRgNCw0LbQtNCw0L3QuNC90LAg0LjQvdC+0YHRgtGA0LDQvdC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LAnLFxuXHQnMDA4MDAxMDA0MDAwJzogJ9Ce0LHRidC10LPRgNCw0LbQtNCw0L3RgdC60LjQuSDQt9Cw0LPRgNCw0L3QuNGH0L3Ri9C5INC/0LDRgdC/0L7RgNGCJyxcblx0JzAwODAwMTAwNTAwMCc6ICfQl9Cw0LPRgNCw0L3QuNGH0L3Ri9C5INC/0LDRgdC/0L7RgNGCINCc0LjQvdC40YHRgtC10YDRgdGC0LLQsCDQvNC+0YDRgdC60L7Qs9C+INGE0LvQvtGC0LAnLFxuXHQnMDA4MDAxMDA2MDAwJzogJ9CU0LjQv9C70L7QvNCw0YLQuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgicsXG5cdCcwMDgwMDEwMDcwMDAnOiAn0J/QsNGB0L/QvtGA0YIg0LzQvtGA0Y/QutCwICjRg9C00L7RgdGC0L7QstC10YDQtdC90LjQtSDQu9C40YfQvdC+0YHRgtC4INC80L7RgNGP0LrQsCknLFxuXHQnMDA4MDAxMDA4MDAwJzogJ9CS0L7QtdC90L3Ri9C5INCx0LjQu9C10YIg0LLQvtC10L3QvdC+0YHQu9GD0LbQsNGJ0LXQs9C+Jyxcblx0JzAwODAwMTAwOTAwMCc6ICfQktGA0LXQvNC10L3QvdC+0LUg0YPQtNC+0YHRgtC+0LLQtdGA0LXQvdC40LUsINCy0YvQtNCw0L3QvdC+0LUg0LLQt9Cw0LzQtdC9INCy0L7QtdC90L3QvtCz0L4g0LHQuNC70LXRgtCwJyxcblx0JzAwODAwMTAxMDAwMCc6ICfQo9C00L7RgdGC0L7QstC10YDQtdC90LjQtSDQu9C40YfQvdC+0YHRgtC4INC+0YTQuNGG0LXRgNCwINCc0LjQvdC40YHRgtC10YDRgdGC0LLQsCDQvtCx0L7RgNC+0L3RiyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgsINCc0LjQvdC40YHRgtC10YDRgdGC0LLQsCDQstC90YPRgtGA0LXQvdC90LjRhSDQtNC10Lsg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC4INC00YDRg9Cz0LjRhSDQstC+0LjQvdGB0LrQuNGFINGE0L7RgNC80LjRgNC+0LLQsNC90LjQuSDRgSDQv9GA0LjQu9C+0LbQtdC90LjQtdC8INGB0L/RgNCw0LLQutC4INC+INC/0YDQvtC/0LjRgdC60LUgKNGA0LXQs9C40YHRgtGA0LDRhtC40LgpINCkLTMzJyxcblx0JzAwODAwMTAxMTAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDRgNC+0LbQtNC10L3QuNC4Jyxcblx0JzAwODAwMTAxMjAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDRgNCw0YHRgdC80L7RgtGA0LXQvdC40Lgg0YXQvtC00LDRgtCw0LnRgdGC0LLQsCDQviDQv9GA0LjQt9C90LDQvdC40Lgg0LHQtdC20LXQvdGG0LXQvCDQvdCwINGC0LXRgNGA0LjRgtC+0YDQuNC4INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQv9C+INGB0YPRidC10YHRgtCy0YMnLFxuXHQnMDA4MDAxMDEzMDAwJzogJ9CS0LjQtCDQvdCwINC20LjRgtC10LvRjNGB0YLQstC+INC40L3QvtGB0YLRgNCw0L3QvdC+0LPQviDQs9GA0LDQttC00LDQvdC40L3QsCDQuNC70Lgg0LvQuNGG0LAg0LHQtdC3INCz0YDQsNC20LTQsNC90YHRgtCy0LAnLFxuXHQnMDA4MDAxMDE0MDAwJzogJ9Ch0L/RgNCw0LLQutCwINC+0LEg0L7RgdCy0L7QsdC+0LbQtNC10L3QuNC4INC40Lcg0LzQtdGB0YIg0LvQuNGI0LXQvdC40Y8g0YHQstC+0LHQvtC00YsnLFxuXHQnMDA4MDAxMDE1MDAwJzogJ9CS0YDQtdC80LXQvdC90L7QtSDRg9C00L7RgdGC0L7QstC10YDQtdC90LjQtSDQu9C40YfQvdC+0YHRgtC4INCz0YDQsNC20LTQsNC90LjQvdCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCcwMDgwMDEwMTYwMDAnOiAn0KPQtNC+0YHRgtC+0LLQtdGA0LXQvdC40LUg0LLRi9C90YPQttC00LXQvdC90L7Qs9C+INC/0LXRgNC10YHQtdC70LXQvdGG0LAnLFxuXHQnMDA4MDAxMDE3MDAwJzogJ9Cg0LDQt9GA0LXRiNC10L3QuNC1INC90LAg0LLRgNC10LzQtdC90L3QvtC1INC/0YDQvtC20LjQstCw0L3QuNC1INCyINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCcwMDgwMDEwMTgwMDAnOiAn0KPQtNC+0YHRgtC+0LLQtdGA0LXQvdC40LUg0LHQtdC20LXQvdGG0LAg0LIg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzAwODAwMTAxOTAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDRgNCw0YHRgdC80L7RgtGA0LXQvdC40Lgg0YXQvtC00LDRgtCw0LnRgdGC0LLQsCDQviDQv9GA0LjQt9C90LDQvdC40Lgg0LvQuNGG0LAg0LLRi9C90YPQttC00LXQvdC90YvQvCDQv9C10YDQtdGB0LXQu9C10L3RhtC10LwnLFxuXHQnMDA4MDAxMDIwMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0LLRgNC10LzQtdC90L3QvtCz0L4g0YPQsdC10LbQuNGJ0LAg0L3QsCDRgtC10YDRgNC40YLQvtGA0LjQuCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnMDA4MDAxMDk5MDAwJzogJ9CY0L3Ri9C1INC00L7QutGD0LzQtdC90YLRiywg0L/RgNC10LTRg9GB0LzQvtGC0YDQtdC90L3Ri9C1INC30LDQutC+0L3QvtC00LDRgtC10LvRjNGB0YLQstC+0Lwg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC40LvQuCDQv9GA0LjQt9C90LDQstCw0LXQvNGL0LUg0LIg0YHQvtC+0YLQstC10YLRgdGC0LLQuNC4INGBINC80LXQttC00YPQvdCw0YDQvtC00L3Ri9C8INC00L7Qs9C+0LLQvtGA0L7QvCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0LIg0LrQsNGH0LXRgdGC0LLQtSDQtNC+0LrRg9C80LXQvdGC0L7Qsiwg0YPQtNC+0YHRgtC+0LLQtdGA0Y/RjtGJ0LjRhSDQu9C40YfQvdC+0YHRgtGMJyxcblx0JzAwODAwMjAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0YssINC40LTQtdC90YLQuNGE0LjRhtC40YDRg9GO0YnQuNC1INGO0YDQuNC00LjRh9C10YHQutC+0LUg0LvQuNGG0L4nLFxuXHQnMDA4MDAyMDAxMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INGO0YDQuNC00LjRh9C10YHQutC+0LPQviDQu9C40YbQsCcsXG5cdCcwMDgwMDIwMDIwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0LLQvdC10YHQtdC90LjQuCDQt9Cw0L/QuNGB0LXQuSDQsiDQldCT0KDQrtCbJyxcblx0JzAwODAwMjAwNDAwMCc6ICfQo9GB0YLQsNCyJyxcblx0JzAwODAwMjAwNTAwMCc6ICfQo9GH0YDQtdC00LjRgtC10LvRjNC90YvQuSDQtNC+0LPQvtCy0L7RgCcsXG5cdCcwMDgwMDIwMDYwMDAnOiAn0J/QvtC70L7QttC10L3QuNC1ICjQvtCx0YnQtdC1INC/0L7Qu9C+0LbQtdC90LjQtSDQvtCxINC+0YDQs9Cw0L3QuNC30LDRhtC40LgpJyxcblx0JzAwODAwMjAwNzAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviAo0LjQu9C4INGD0LLQtdC00L7QvNC70LXQvdC40LUpINC+INC/0L7RgdGC0LDQvdC+0LLQutC1INC90LAg0YPRh9GR0YIg0LIg0L3QsNC70L7Qs9C+0LLQvtC8INC+0YDQs9Cw0L3QtSDRgSDRg9C60LDQt9Cw0L3QuNC10Lwg0JjQndCdJyxcblx0JzAwODAwMjAwODAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INCV0JPQoNCu0JsnLFxuXHQnMDA4MDAyMDk5MDAwJzogJ9CY0L3QvtC5INC00L7QutGD0LzQtdC90YInLFxuXHQnNTU1MDAxMDAwMDAwJzogJ9Ca0LLQuNGC0LDQvdGG0LjRjycsXG5cdCc1NTUwMDIwMDAwMDAnOiAn0J/Qu9Cw0YLRkdC20L3QvtC1INC/0L7RgNGD0YfQtdC90LjQtScsXG5cdCc1NTUwMDMwMDAwMDAnOiAn0KfQtdC6Jyxcblx0JzU1NTAwNDAwMDAwMCc6ICfQn9C+0LTRgtCy0LXRgNC20LTQtdC90LjQtSDRjdC70LXQutGC0YDQvtC90L3QvtCz0L4g0L/Qu9Cw0YLQtdC20LAnLFxuXHQnNTU1MDA1MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0L/RgNCw0LLQviDQt9Cw0Y/QstC40YLQtdC70Y8g0L3QsCDQsdC10LfQstC+0LfQvNC10LfQtNC90L7QtSDQv9C+0LvRg9GH0LXQvdC40LUg0YHQstC10LTQtdC90LjQuScsXG5cdCc1NTgxMDAwMDAwMDAnOiAn0JfQkNCv0JLQm9CV0J3QmNCvJyxcblx0JzU1ODEwMTAwMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40Y8g0Lgg0LfQsNC/0YDQvtGB0YssINGB0LLRj9C30LDQvdC90YvQtSDRgSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lwg0LrQsNC00LDRgdGC0YDQvtCy0YvQvCDRg9GH0ZHRgtC+0LwnLFxuXHQnNTU4MTAxMDEwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGB0LLQtdC00LXQvdC40LksINCy0L3QtdGB0ZHQvdC90YvRhSDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LrQsNC00LDRgdGC0YAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4LCDQsiDQstC40LTQtSDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INCy0YvQv9C40YHQutC4INC+0LEg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4LCDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0L/QsNGB0L/QvtGA0YLQsCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0Lgg0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INC/0LvQsNC90LAg0YLQtdGA0YDQuNGC0L7RgNC40LgsINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0YHQv9GA0LDQstC60Lgg0L4g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDRgdGC0L7QuNC80L7RgdGC0Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODEwMTAyMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/QvtGB0YLQsNC90L7QstC60LUg0L3QsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LrQsNC00LDRgdGC0YDQvtCy0YvQuSDRg9GH0ZHRgiDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MTAxMDMwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lwg0LrQsNC00LDRgdGC0YDQvtCy0L7QvCDRg9GH0ZHRgtC1INC40LfQvNC10L3QtdC90LjQuSDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MTAxMDQwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INCyINCV0LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAINC+0LHRitC10LrRgtC+0LIg0LrQsNC/0LjRgtCw0LvRjNC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwICjQldCT0KDQntCa0KEpINGB0LLQtdC00LXQvdC40Lkg0L7QsSDQvtCx0YrQtdC60YLQtSDQutCw0L/QuNGC0LDQu9GM0L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAgKNCe0JrQoSknLFxuXHQnNTU4MTAxMDUwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGB0LLQtdC00LXQvdC40Lkg0L7QsSDQntCa0KEnLFxuXHQnNTU4MTAxMDYwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDRgdC90Y/RgtC40Lgg0YEg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INGD0YfRkdGC0LAg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODEwMTA3MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LrQsNC00LDRgdGC0YAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INGB0LLQtdC00LXQvdC40Lkg0L4g0YDQsNC90LXQtSDRg9GH0YLRkdC90L3QvtC8INC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgxMDEwODAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INC+0YjQuNCx0LrQuCcsXG5cdCc1NTgxMDEwOTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCDQsiDRgdCy0LXQtNC10L3QuNGP0YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MTAxMDkwMTAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQvtCxINC40YHQv9GA0LDQstC70LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60Lgg0LIg0YHQstC10LTQtdC90LjRj9GFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INC+0LEg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODEwMTA5MDIwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4INCyINGB0LLQtdC00LXQvdC40Y/RhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQviDQv9GA0L7RhdC+0LbQtNC10L3QuNC4INGD0YfQsNGB0YLQutCwINCT0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQs9GA0LDQvdC40YbRiyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lg7INC+INCz0YDQsNC90LjRhtCw0YUg0LzQtdC20LTRgyDRgdGD0LHRitC10LrRgtCw0LzQuCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lg7INC+INCz0YDQsNC90LjRhtCw0YUg0LzRg9C90LjRhtC40L/QsNC70YzQvdGL0YUg0L7QsdGA0LDQt9C+0LLQsNC90LjQuTsg0L4g0LPRgNCw0L3QuNGG0LDRhSDQvdCw0YHQtdC70ZHQvdC90YvRhSDQv9GD0L3QutGC0L7Qsjsg0L4g0YLQtdGA0YDQuNGC0L7RgNC40LDQu9GM0L3Ri9GFINC30L7QvdCw0YUg0Lgg0LfQvtC90LDRhSDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40Lk7INC+INC60LDRgNGC0L7Qs9GA0LDRhNC40YfQtdGB0LrQvtC5INC4INCz0LXQvtC00LXQt9C40YfQtdGB0LrQvtC5INC+0YHQvdC+0LLQsNGFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODEwMTEwMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/RgNC10LTRgdGC0LDQstC70LXQvdC40Lgg0LTQvtC/0L7Qu9C90LjRgtC10LvRjNC90YvRhSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgNC+0LLRi9C5INGD0YfRkdGCJyxcblx0JzU1ODEwMTExMDAwMCc6ICfQktC90YPRgtGA0LjQstC10LTQvtC80YHRgtCy0LXQvdC90YvQuSDQt9Cw0L/RgNC+0YEg0LjQvdGE0L7RgNC80LDRhtC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MTAxMTIwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INC60L7Qv9C40Lgg0LTQvtC60YPQvNC10L3RgtCwLCDQvdCwINC+0YHQvdC+0LLQsNC90LjQuCDQutC+0YLQvtGA0L7Qs9C+INGB0LLQtdC00LXQvdC40Y8g0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LLQvdC10YHQtdC90Ysg0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGAINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgxMDExMzAwMDAnOiAn0JfQsNC/0YDQvtGBINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0YHQstC10LTQtdC90LjQuSwg0LLQvdC10YHRkdC90L3Ri9GFINCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgsINC/0L7RgdGA0LXQtNGB0YLQstC+0Lwg0L7QsdC10YHQv9C10YfQtdC90LjRjyDQtNC+0YHRgtGD0L/QsCDQuiDQuNC90YTQvtGA0LzQsNGG0LjQvtC90L3QvtC80YMg0YDQtdGB0YPRgNGB0YMsINGB0L7QtNC10YDQttCw0YnQtdC80YMg0YHQstC10LTQtdC90LjRjyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgxMDExNDAwMDAnOiAn0JfQsNC/0YDQvtGBINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0L/QtdGA0LXRh9C90Y8g0L7QsdGK0LXQutGC0L7QsiDQvdC10LTQstC40LbQuNC80L7RgdGC0LgsINC/0L7QtNC70LXQttCw0YnQuNGFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INC+0YbQtdC90LrQtScsXG5cdCc1NTgxMDExNTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0YDQtdC60YDQsNGJ0LXQvdC40Lgg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INGD0YfRkdGC0LAnLFxuXHQnNTU4MTAxMTYwMDAwJzogJ9Cc0LXQttCy0LXQtNC+0LzRgdGC0LLQtdC90L3Ri9C5INC30LDQv9GA0L7RgSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQsiDQvtGA0LPQsNC90LDRhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LLQu9Cw0YHRgtC4INC4INC+0YDQs9Cw0L3QsNGFINC80LXRgdGC0L3QvtCz0L4g0YHQsNC80L7Rg9C/0YDQsNCy0LvQtdC90LjRjycsXG5cdCc1NTgxMDExNzAwMDAnOiAn0JfQsNC/0YDQvtGBINC00L7QutGD0LzQtdC90YLQvtCyINC+INGA0LDQvdC10LUg0YPRh9GC0ZHQvdC90L7QvCDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LIg0L7RgNCz0LDQvdCw0YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCy0LvQsNGB0YLQuCwg0L7RgNCz0LDQvdCw0YUg0LzQtdGB0YLQvdC+0LPQviDRgdCw0LzQvtGD0L/RgNCw0LLQu9C10L3QuNGPINC40LvQuCDQvtGA0LPQsNC90LDRhSDQuCDQvtGA0LPQsNC90LjQt9Cw0YbQuNGP0YUg0L/QviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LzRgyDRgtC10YXQvdC40YfQtdGB0LrQvtC80YMg0YPRh9GR0YLRgyDQuCAo0LjQu9C4KSDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC40L3QstC10L3RgtCw0YDQuNC30LDRhtC40LgnLFxuXHQnNTU4MTAyMDAwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjRjyDQuCDQt9Cw0L/RgNC+0YHRiywg0YHQstGP0LfQsNC90L3Ri9C1INGBINGA0LXQs9C40YHRgtGA0LDRhtC40LXQuSDQv9GA0LDQsicsXG5cdCc1NTgxMDIwMTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCy0LAg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4sINGB0LTQtdC70LrQuCDRgSDQvdC40LwsINC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pLCDQv9C10YDQtdGF0L7QtNCwLCDQv9GA0LXQutGA0LDRidC10L3QuNGPINC/0YDQsNCy0LAg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4nLFxuXHQnNTU4MTAyMDIwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LXQutGA0LDRidC10L3QuNGPINC/0YDQsNCy0LAgKNC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pINC/0YDQsNCy0LApJyxcblx0JzU1ODEwMjAzMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQuNC30LzQtdC90LXQvdC40Lkg0LIg0JXQk9Cg0J8nLFxuXHQnNTU4MTAyMDQwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQvtCxINC40YHQv9GA0LDQstC70LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60LgnLFxuXHQnNTU4MTAyMDUwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9GA0LXQtNGB0YLQsNCy0LvQtdC90LjQuCDQtNC+0L/QvtC70L3QuNGC0LXQu9GM0L3Ri9GFINC00L7QutGD0LzQtdC90YLQvtCyINC00LvRjyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQsicsXG5cdCc1NTgxMDIwNjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0YDQuNC+0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8Jyxcblx0JzU1ODEwMjA3MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLQvtC30L7QsdC90L7QstC70LXQvdC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40LgnLFxuXHQnNTU4MTAyMDgwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9GA0LXQutGA0LDRidC10L3QuNC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4Jyxcblx0JzU1ODEwMjA5MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/QvtCy0YLQvtGA0L3QvtC5INCy0YvQtNCw0YfQtSDRgdCy0LjQtNC10YLQtdC70YzRgdGC0LLQsCDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQstCwJyxcblx0JzU1ODEwMjEwMDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5LCDRgdC+0LTQtdGA0LbQsNGJ0LjRhdGB0Y8g0LIg0JXQtNC40L3QvtC8INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDRgNC10LXRgdGC0YDQtSDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8Jyxcblx0JzU1ODEwMjExMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/QvtGB0YLQsNC90L7QstC60LUg0L3QsCDRg9GH0ZHRgiDQsdC10YHRhdC+0LfRj9C50L3Ri9GFINC90LXQtNCy0LjQttC40LzRi9GFINCy0LXRidC10LknLFxuXHQnNTU4MTAyMTIwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQstGL0LTQsNGH0LUg0LfQsNC60LvQsNC00L3QvtC5ICjQvdC+0LLQvtC5INC30LDQutC70LDQtNC90L7QuSwg0LTRg9Cx0LvQuNC60LDRgtCwINC30LDQutC70LDQtNC90L7QuSwg0LDQvdC90YPQu9C40YDQvtCy0LDQvdC90L7QuSDQt9Cw0LrQu9Cw0LTQvdC+0LkpJyxcblx0JzU1ODEwMjEzMDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0LLRi9C00LDRh9C1INC60L7Qv9C40Lkg0LTQvtCz0L7QstC+0YDQvtCyINC4INC40L3Ri9GFINC00L7QutGD0LzQtdC90YLQvtCyLCDQstGL0YDQsNC20LDRjtGJ0LjRhSDRgdC+0LTQtdGA0LbQsNC90LjQtSDQvtC00L3QvtGB0YLQvtGA0L7QvdC90LjRhSDRgdC00LXQu9C+0LosINGB0L7QstC10YDRiNC10L3QvdGL0YUg0LIg0L/RgNC+0YHRgtC+0Lkg0L/QuNGB0YzQvNC10L3QvdC+0Lkg0YTQvtGA0LzQtScsXG5cdCc1NTgxMDIxNDAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0YDQuNC+0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCwg0LLQvtC30LLRgNCw0YLQtSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQsdC10Lcg0L/RgNC+0LLQtdC00LXQvdC40Y8g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40LgsINC/0YDQtdC00YHRgtCw0LLQu9C10L3QuNC4INC00L7Qv9C+0LvQvdC40YLQtdC70YzQvdGL0YUg0LTQvtC60YPQvNC10L3RgtC+0LIsINC+INCy0L7Qt9C+0LHQvdC+0LLQu9C10L3QuNC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4LCDRgNCw0L3QtdC1INC/0YDQuNC+0YHRgtCw0L3QvtCy0LvQtdC90L3QvtC5INC/0L4g0LfQsNGP0LLQu9C10L3QuNGOINC/0YDQsNCy0L7QvtCx0LvQsNC00LDRgtC10LvRjywg0YHRgtC+0YDQvtC90YsgKNGB0YLQvtGA0L7QvSkg0YHQtNC10LvQutC4LCDQu9C40YbQsCwg0YfRjNGRINC/0YDQsNCy0L4g0L7Qs9GA0LDQvdC40YfQuNCy0LDQtdGC0YHRjyAo0L7QsdGA0LXQvNC10L3Rj9C10YLRgdGPKSwg0LvQuNGG0LAsINCyINC/0L7Qu9GM0LfRgyDQutC+0YLQvtGA0L7Qs9C+INC/0YDQsNCy0L4g0L7Qs9GA0LDQvdC40YfQuNCy0LDQtdGC0YHRjyAo0L7QsdGA0LXQvNC10L3Rj9C10YLRgdGPKSwg0LfQsNC60L7QvdC90L7Qs9C+INCy0LvQsNC00LXQu9GM0YbQsCDQt9Cw0LrQu9Cw0LTQvdC+0LkgKNC40YUg0L/RgNC10LTRgdGC0LDQstC40YLQtdC70Y8pJyxcblx0JzU1ODEwMjE1MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/QvtCy0YLQvtGA0L3QvtC5INCy0YvQtNCw0YfQtSDQvdC+0LLQvtCz0L4g0YHQstC40LTQtdGC0LXQu9GM0YHRgtCy0LAg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LLQsCwg0LLRi9C00LDRh9C1INC30LDQutC70LDQtNC90L7QuSwg0LLQvdC10YHQtdC90LjQuCDQuNC30LzQtdC90LXQvdC40Lkg0LIg0LfQsNC/0LjRgdGMINCV0LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwsINC/0L7Qs9Cw0YjQtdC90LjQuCDRgNC10LPQuNGB0YLRgNCw0YbQuNC+0L3QvdC+0Lkg0LfQsNC/0LjRgdC4INC+0LEg0LjQv9C+0YLQtdC60LUnLFxuXHQnNTU4MTAyMTYwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9GA0LjQvdGP0YLQuNC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwINCy0L3QvtCy0Ywg0LLQviDQstC70LDQtNC10L3QuNC1LCDQv9C+0LvRjNC30L7QstCw0L3QuNC1INC4INGA0LDRgdC/0L7RgNGP0LbQtdC90LjQtSAo0LIg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0YwpJyxcblx0JzU1ODEwMjE3MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQsiDQldC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8INC+0YLQvNC10YLQutC4INC+INC90LDQu9C40YfQuNC4INGB0YPQtNC10LHQvdC+0LPQviDRgdC/0L7RgNCwINCyINC+0YLQvdC+0YjQtdC90LjQuCDQt9Cw0YDQtdCz0LjRgdGC0YDQuNGA0L7QstCw0L3QvdC+0LPQviDQv9GA0LDQstCwJyxcblx0JzU1ODEwMjE4MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4INCyINC30LDQv9C40YHRj9GFINCV0LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwsINC+INC90LDQu9C40YfQuNC4INCy0L7Qt9GA0LDQttC10L3QuNGPINCyINC+0YLQvdC+0YjQtdC90LjQuCDQt9Cw0YDQtdCz0LjRgdGC0YDQuNGA0L7QstCw0L3QvdC+0LPQviDQv9GA0LDQstCwINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCwg0L4g0L/QvtCz0LDRiNC10L3QuNC4INC30LDQv9C40YHQuCDQsiDQldC00LjQvdC+0Lwg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC8INGA0LXQtdGB0YLRgNC1INC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40Lwg0L4g0L3QsNC70LjRh9C40Lgg0LLQvtC30YDQsNC20LXQvdC40Y8g0LIg0L7RgtC90L7RiNC10L3QuNC4INC30LDRgNC10LPQuNGB0YLRgNC40YDQvtCy0LDQvdC90L7Qs9C+INC/0YDQsNCy0LAg0L3QsCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4LCDQviDQvdC10LLQvtC30LzQvtC20L3QvtGB0YLQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9C10YDQtdGF0L7QtNCwLCDQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKSwg0L/RgNC10LrRgNCw0YnQtdC90LjRjyDQv9GA0LDQstCwINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQsdC10Lcg0LvQuNGH0L3QvtCz0L4g0YPRh9Cw0YHRgtC40Y8g0YHQvtCx0YHRgtCy0LXQvdC90LjQutCwICjQtdCz0L4g0LfQsNC60L7QvdC90L7Qs9C+INC/0YDQtdC00YHRgtCw0LLQuNGC0LXQu9GPKSwg0L7QsSDQvtGC0LfRi9Cy0LUg0YDQsNC90LXQtSDQv9GA0LXQtNGB0YLQsNCy0LvQtdC90L3QvtCz0L4g0LfQsNGP0LLQu9C10L3QuNGPINC+INC90LXQstC+0LfQvNC+0LbQvdC+0YHRgtC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0LXRgNC10YXQvtC00LAsINC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pLCDQv9GA0LXQutGA0LDRidC10L3QuNGPINC/0YDQsNCy0LAg0L3QsCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCx0LXQtyDQu9C40YfQvdC+0LPQviDRg9GH0LDRgdGC0LjRjyDRgdC+0LHRgdGC0LLQtdC90L3QuNC60LAgKNC10LPQviDQt9Cw0LrQvtC90L3QvtCz0L4g0L/RgNC10LTRgdGC0LDQstC40YLQtdC70Y8pJyxcblx0JzU1ODEwMjE5MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0YHQutGA0LXQv9C70LXQvdC40Lgg0LTQvtCx0LDQstC+0YfQvdC+0LPQviDQu9C40YHRgtCwICjQtNC+0LHQsNCy0L7Rh9C90YvRhSDQu9C40YHRgtC+0LIpINGBINC30LDQutC70LDQtNC90L7QuScsXG5cdCc1NTgxMDIyMDAwMDAnOiAn0JfQsNC/0YDQvtGBINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0YHQstC10LTQtdC90LjQuSwg0YHQvtC00LXRgNC20LDRidC40YXRgdGPINCyINCV0LTQuNC90L7QvCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lwg0YDQtdC10YHRgtGA0LUg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCwg0L/QvtGB0YDQtdC00YHRgtCy0L7QvCDQvtCx0LXRgdC/0LXRh9C10L3QuNGPINC00L7RgdGC0YPQv9CwINC6INC40L3RhNC+0YDQvNCw0YbQuNC+0L3QvdC+0LzRgyDRgNC10YHRg9GA0YHRgywg0YHQvtC00LXRgNC20LDRidC10LzRgyDRgdCy0LXQtNC10L3QuNGPINCV0LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwnLFxuXHQnNTU4MTAyMjEwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQt9Cw0LrQvtC90L3QvtCz0L4g0LLQu9Cw0LTQtdC70YzRhtCwINC30LDQutC70LDQtNC90L7QuScsXG5cdCc1NTgxMDIyMjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LjQt9C80LXQvdC10L3QuNC5INCyINC30LDQv9C40YHRjCDQldC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8LCDQv9C+0LPQsNGI0LXQvdC40Lgg0YDQtdCz0LjRgdGC0YDQsNGG0LjQvtC90L3QvtC5INC30LDQv9C40YHQuCDQvtCxINC40L/QvtGC0LXQutC1Jyxcblx0JzU1ODEwMzAwMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40Y8g0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC8INGD0YfRkdGC0LUg0LfQtNCw0L3QuNC5LCDRgdC+0L7RgNGD0LbQtdC90LjQuSwg0L/QvtC80LXRidC10L3QuNC5LCDQvtCx0YrQtdC60YLQvtCyINC90LXQt9Cw0LLQtdGA0YjRkdC90L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAgKNC+0LHRitC10LrRgtC+0LIg0YPRh9GR0YLQsCkg0Lgg0LfQsNC/0YDQvtGB0Ysg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5LCDQstC90LXRgdGR0L3QvdGL0YUg0LIg0JXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAnLFxuXHQnNTU4MTAzMDEwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9C+0YHRgtCw0L3QvtCy0LrQtSDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRg9GH0ZHRgiDQvtCx0YrQtdC60YLQsCDRg9GH0ZHRgtCwJyxcblx0JzU1ODEwMzAyMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQsiDQldCT0KDQntCa0KEg0YHQstC10LTQtdC90LjQuSDQviDRgNCw0L3QtdC1INGD0YfRgtGR0L3QvdC+0Lwg0L7QsdGK0LXQutGC0LUg0LrQsNC/0LjRgtCw0LvRjNC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwJyxcblx0JzU1ODEwMzAzMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC8INGD0YfRkdGC0LUg0LjQt9C80LXQvdC10L3QuNC5INC+0LHRitC10LrRgtCwINGD0YfRkdGC0LAnLFxuXHQnNTU4MTAzMDQwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDRgdC90Y/RgtC40Lgg0YEg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YPRh9GR0YLQsCDQvtCx0YrQtdC60YLQsCDRg9GH0ZHRgtCwJyxcblx0JzU1ODEwMzA1MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4Jyxcblx0JzU1ODEwMzA2MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L7QsSDQuNGB0LrQu9GO0YfQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5INC40Lcg0JXQk9Cg0J7QmtChLCDQvdC+0YHRj9GJ0LjRhSDQstGA0LXQvNC10L3QvdGL0Lkg0YXQsNGA0LDQutGC0LXRgCcsXG5cdCc1NTgxMDMwNzAwMDAnOiAn0JfQsNC/0YDQvtGBINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0LrQvtC/0LjQuCDQtNC+0LrRg9C80LXQvdGC0LAsINC90LAg0L7RgdC90L7QstCw0L3QuNC4INC60L7RgtC+0YDQvtCz0L4g0YHQstC10LTQtdC90LjRjyDQvtCxINC+0LHRitC10LrRgtC1INCy0L3QtdGB0LXQvdGLINCyINCV0LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAJyxcblx0JzU1ODEwMzA4MDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5LCDQstC90LXRgdC10L3QvdGL0YUg0LIg0JXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAnLFxuXHQnNTU4MTAzMDkwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9GA0LXQtNGB0YLQsNCy0LvQtdC90LjQuCDQtNC+0L/QvtC70L3QuNGC0LXQu9GM0L3Ri9GFINC00L7QutGD0LzQtdC90YLQvtCyINC90LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGD0YfRkdGCJyxcblx0JzU1ODEwNDAwMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLQvtC30LLRgNCw0YLQtSDQv9C70LDRgtC10LbQsCcsXG5cdCc1NTgxOTkwMDAwMDAnOiAn0JjQvdC+0LUg0LfQsNGP0LLQu9C10L3QuNC1Jyxcblx0JzU1ODIwMDAwMDAwMCc6ICfQlNCe0JrQo9Cc0JXQndCi0KssINCh0J7QlNCV0KDQltCQ0KnQmNCVINCe0J/QmNCh0JDQndCY0JUg0J7QkdCq0JXQmtCi0JAnLFxuXHQnNTU4MjAxMDAwMDAwJzogJ9Ce0L/QuNGB0LDQvdC40LUg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuXHQnNTU4MjAyMDAwMDAwJzogJ9CX0LXQvNC70LXRg9GB0YLRgNC+0LjRgtC10LvRjNC90L7QtSDQtNC10LvQvicsXG5cdCc1NTgyMDMwMDAwMDAnOiAn0JzQtdC20LXQstC+0Lkg0L/Qu9Cw0L0nLFxuXHQnNTU4MjA0MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIgKNC60L7Qv9C40Y8pLCDQvdCwINC+0YHQvdC+0LLQsNC90LjQuCDQutC+0YLQvtGA0L7Qs9C+INGB0LLQtdC00LXQvdC40Y8g0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LLQvdC10YHQtdC90Ysg0LIg0JPQmtCdJyxcblx0JzU1ODIwNTAwMDAwMCc6ICfQotC10YXQvdC40YfQtdGB0LrQuNC5INC/0LDRgdC/0L7RgNGCINC+0LHRitC10LrRgtCwINGD0YfRkdGC0LAnLFxuXHQnNTU4MjA1MDEwMDAwJzogJ9Ci0LXRhdC90LjRh9C10YHQutC40Lkg0L/QsNGB0L/QvtGA0YIg0LTQvtC80L7QstC70LDQtNC10L3QuNGPJyxcblx0JzU1ODIwNTAyMDAwMCc6ICfQotC10YXQvdC40YfQtdGB0LrQuNC5INC/0LDRgdC/0L7RgNGCINC30LTQsNC90LjRjyAo0YHRgtGA0L7QtdC90LjRjyknLFxuXHQnNTU4MjA1MDMwMDAwJzogJ9Ci0LXRhdC90LjRh9C10YHQutC40Lkg0L/QsNGB0L/QvtGA0YIg0LbQuNC70L7Qs9C+INC/0L7QvNC10YnQtdC90LjRjyAo0LrQstCw0YDRgtC40YDRiyknLFxuXHQnNTU4MjA1MDQwMDAwJzogJ9Ci0LXRhdC90LjRh9C10YHQutC40Lkg0L/QsNGB0L/QvtGA0YIg0L7QsdGK0LXQutGC0LAg0LjQvdC00LjQstC40LTRg9Cw0LvRjNC90L7Qs9C+INC20LjQu9C40YnQvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCcsXG5cdCc1NTgyMDUwNTAwMDAnOiAn0KLQtdGF0L3QuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgiDRgdC+0L7RgNGD0LbQtdC90LjRjycsXG5cdCc1NTgyMDUwNjAwMDAnOiAn0KLQtdGF0L3QuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgiDQvtCx0YrQtdC60YLQsCDQvdC10LfQsNCy0LXRgNGI0ZHQvdC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwJyxcblx0JzU1ODIwNjAwMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INGC0LXRhdC90LjRh9C10YHQutC+0LPQviDQv9Cw0YHQv9C+0YDRgtCwJyxcblx0JzU1ODIwNjAxMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INGC0LXRhdC90LjRh9C10YHQutC+0LPQviDQv9Cw0YHQv9C+0YDRgtCwINC90LAg0LfQtNCw0L3QuNC1ICjRgdGC0YDQvtC10L3QuNC1KScsXG5cdCc1NTgyMDYwMjAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDRgtC10YXQvdC40YfQtdGB0LrQvtCz0L4g0L/QsNGB0L/QvtGA0YLQsCDQkdCi0JgnLFxuXHQnNTU4MjA3MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIgKNC60L7Qv9C40Y8pLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INGA0LDQt9GA0LXRiNC10L3QuNC1INC30LXQvNC10LvRjNC90L7Qs9C+INGB0L/QvtGA0LAg0L4g0YHQvtCz0LvQsNGB0L7QstCw0L3QuNC4INC80LXRgdGC0L7Qv9C+0LvQvtC20LXQvdC40Y8g0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcblx0JzU1ODIwODAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCICjQutC+0L/QuNGPKSwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQv9GA0LjQvdCw0LTQu9C10LbQvdC+0YHRgtGMINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwINC6INC+0L/RgNC10LTQtdC70LXQvdC90L7QuSDQutCw0YLQtdCz0L7RgNC40Lgg0LfQtdC80LXQu9GMJyxcblx0JzU1ODIwOTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCICjQutC+0L/QuNGPKSwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDRg9GB0YLQsNC90L7QstC70LXQvdC90L7QtSDRgNCw0LfRgNC10YjQtdC90L3QvtC1INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNC1INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcblx0JzU1ODIxMDAwMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC/0LvQsNC9INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwICjQstGL0L/QuNGB0LrQsCDQuNC3INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC30LXQvNC10LvRjNC90L7Qs9C+INC60LDQtNCw0YHRgtGA0LApJyxcblx0JzU1ODIxMTAwMDAwMCc6ICfQn9C70LDQvdGLINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODIxMTAxMDAwMCc6ICfQotC10YXQvdC40YfQtdGB0LrQuNC5INC/0LvQsNC9INC30LTQsNC90LjRjywg0YHQvtC+0YDRg9C20LXQvdC40Y8sINC/0L7QvNC10YnQtdC90LjRjyDQu9C40LHQviDQvtCx0YrQtdC60YLQsCDQvdC10LfQsNCy0LXRgNGI0ZHQvdC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwJyxcblx0JzU1ODIxMTAyMDAwMCc6ICfQn9C70LDQvSDRg9GH0LDRgdGC0LrQsCDQu9C10YHQvdC+0LPQviDRhNC+0L3QtNCwJyxcblx0JzU1ODIxMTAzMDAwMCc6ICfQn9C70LDQvSDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MjExMDQwMDAwJzogJ9Ct0LrRgdC/0LvQuNC60LDRhtC40Y8g0Log0L/QvtGN0YLQsNC20L3QvtC80YMg0L/Qu9Cw0L3RgycsXG5cdCc1NTgyMTIwMDAwMDAnOiAn0JTQtdC60LvQsNGA0LDRhtC40Y8g0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MjEzMDAwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L/QsNGB0L/QvtGA0YIg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODIxMzAxMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC/0LDRgdC/0L7RgNGCINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcblx0JzU1ODIxMzAyMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC/0LDRgdC/0L7RgNGCINC/0L7QvNC10YnQtdC90LjRjyAo0LLRi9C/0LjRgdC60LAg0LjQtyDQk9Ca0J0pJyxcblx0JzU1ODIxMzAzMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC/0LDRgdC/0L7RgNGCINC30LTQsNC90LjRjywg0YHQvtC+0YDRg9C20LXQvdC40Y8sINC+0LHRitC10LrRgtCwINC90LXQt9Cw0LLQtdGA0YjRkdC90L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAnLFxuXHQnNTU4MjE0MDAwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstCw0Y8g0LLRi9C/0LjRgdC60LAg0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MjE0MDEwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstCw0Y8g0LLRi9C/0LjRgdC60LAg0L4g0LfQtdC80LXQu9GM0L3QvtC8INGD0YfQsNGB0YLQutC1Jyxcblx0JzU1ODIxNDAyMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLQsNGPINCy0YvQv9C40YHQutCwINC+INC30LTQsNC90LjQuCwg0YHQvtC+0YDRg9C20LXQvdC40LgsINC+0LHRitC10LrRgtC1INC90LXQt9Cw0LLQtdGA0YjRkdC90L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAnLFxuXHQnNTU4MjE2MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0LjQt9C80LXQvdC10L3QuNC1INC90LDQt9C90LDRh9C10L3QuNGPINC30LTQsNC90LjRjywg0L/QvtC80LXRidC10L3QuNGPINC40LvQuCDRgdC+0L7RgNGD0LbQtdC90LjRjywg0L3QsNC40LzQtdC90L7QstCw0L3QuNGPINGB0L7QvtGA0YPQttC10L3QuNGPJyxcblx0JzU1ODIxNzAwMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC/0LvQsNC9INGC0LXRgNGA0LjRgtC+0YDQuNC4Jyxcblx0JzU1ODIxODAwMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLQsNGPINGB0L/RgNCw0LLQutCwINC+INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0YHRgtC+0LjQvNC+0YHRgtC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgyMTkwMDAwMDAnOiAn0JDQutGCINC+0LHRgdC70LXQtNC+0LLQsNC90LjRjywg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQv9GA0LXQutGA0LDRidC10L3QuNC1INGB0YPRidC10YHRgtCy0L7QstCw0L3QuNGPINC+0LHRitC10LrRgtCwINGD0YfRkdGC0LAnLFxuXHQnNTU4MjIwMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0LIg0LLQuNC00LUg0LrQvtGC0L7RgNGL0YUg0L/RgNC10LTQvtGB0YLQsNCy0LvRj9GO0YLRgdGPINGB0LLQtdC00LXQvdC40Y8g0JXQtNC40L3QvtCz0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YDQtdC10YHRgtGA0LAnLFxuXHQnNTU4MjIwMDEwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0KDQtdC10YHRgtGA0LAsINGB0L7QtNC10YDQttCw0YnQsNGPINC+0YLQvdC+0YHRj9GJ0LjQtdGB0Y8g0Log0LjQvdGE0L7RgNC80LDRhtC40Lgg0L7Qs9GA0LDQvdC40YfQtdC90L3QvtCz0L4g0LTQvtGB0YLRg9C/0LAg0YHQstC10LTQtdC90LjRjyDQvtCxINC+0LHRitC10LrRgtC1INGD0YfQtdGC0LAnLFxuXHQnNTU4MjIwMDIwMDAwJzogJ9Ch0L/RgNCw0LLQutCwLCDRgdC+0LTQtdGA0LbQsNGJ0LDRjywg0LLQvdC10YHRkdC90L3Ri9C1INCyINCV0LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAINGB0LLQtdC00LXQvdC40Y8g0L4g0L/RgNC10LrRgNCw0YnQtdC90LjQuCDRgdGD0YnQtdGB0YLQstC+0LLQsNC90LjRjyDQvtCx0YrQtdC60YLQsCDRg9GH0ZHRgtCwJyxcblx0JzU1ODIyMDAzMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INCg0LXQtdGB0YLRgNCwLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQsNGPINGE0LDQutGCINC+0YLRgdGD0YLRgdGC0LLQuNGPINCyINCg0LXQtdGB0YLRgNC1INGB0LLQtdC00LXQvdC40Lkg0L7QsSDQvtCx0YrQtdC60YLQtSDRg9GH0LXRgtCwJyxcblx0JzU1ODIyMTAwMDAwMCc6ICfQn9Cg0J7Qp9CY0JUnLFxuXHQnNTU4MjIxMDEwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC90LXQvtCx0YXQvtC00LjQvNC+0YHRgtC4INGD0YHRgtGA0LDQvdC10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L7RiNC40LHQutC4Jyxcblx0JzU1ODIyMTAyMDAwMCc6ICfQnNC10LbQtNGD0L3QsNGA0L7QtNC90YvQuSDQtNC+0LPQvtCy0L7RgCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgsINCyINGB0L7QvtGC0LLQtdGC0YHRgtCy0LjQuCDRgSDQutC+0YLQvtGA0YvQvCDRg9GB0YLQsNC90L7QstC70LXQvdC+INC40LvQuCDQuNC30LzQtdC90LXQvdC+INC/0YDQvtGF0L7QttC00LXQvdC40LUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCz0YDQsNC90LjRhtGLINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCc1NTgyMjEwMzAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0YHQvtC00LXRgNC20LDRidC40Lkg0L3QtdC+0LHRhdC+0LTQuNC80YvQtSDQtNC70Y8g0LLQvdC10YHQtdC90LjRjyDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LrQsNC00LDRgdGC0YAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INGB0LLQtdC00LXQvdC40Y8g0L4g0LPRgNCw0L3QuNGG0LDRhSDQvNC10LbQtNGDINGB0YPQsdGK0LXQutGC0LDQvNC4INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCwg0LPRgNCw0L3QuNGG0LDRhSDQvNGD0L3QuNGG0LjQv9Cw0LvRjNC90L7Qs9C+INC+0LHRgNCw0LfQvtCy0LDQvdC40Y8sINCz0YDQsNC90LjRhtCw0YUg0L3QsNGB0LXQu9GR0L3QvdC+0LPQviDQv9GD0L3QutGC0LAnLFxuXHQnNTU4MjIxMDQwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINGB0L7QtNC10YDQttCw0YnQuNC5INC90LXQvtCx0YXQvtC00LjQvNGL0LUg0LTQu9GPINCy0L3QtdGB0LXQvdC40Y8g0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGAINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDRgdCy0LXQtNC10L3QuNGPINC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INC40LvQuCDQuNC30LzQtdC90LXQvdC40Lgg0YLQtdGA0YDQuNGC0L7RgNC40LDQu9GM0L3QvtC5INC30L7QvdGLINC40LvQuCDQt9C+0L3RiyDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LksINC70LjQsdC+INC+0LEg0L7RgtC80LXQvdC1INGD0YHRgtCw0L3QvtCy0LvQtdC90LjRjyDRgtCw0LrQvtC5INC30L7QvdGLJyxcblx0JzU1ODIyMTA1MDAwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQv9GA0LjRgdCy0L7QtdC90LjQuCwg0LjQt9C80LXQvdC10L3QuNC4INCw0LTRgNC10YHQsCcsXG5cdCc1NTgyMjEwNjAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLINC+0YDQs9Cw0L3QvtCyLCDQvtGB0YPRidC10YHRgtCy0LvRj9GO0YnQuNGFINCy0LXQtNC10L3QuNC1INC70LXRgdC90L7Qs9C+INC4INCy0L7QtNC90L7Qs9C+INC60LDQtNCw0YHRgtGA0LAsINGB0L7QtNC10YDQttCw0YnQuNC1INGB0LLQtdC00LXQvdC40Y8g0L4g0L/RgNC40YDQvtC00L3Ri9GFINC+0LHRitC10LrRgtCw0YUnLFxuXHQnNTU4MjIxMDcwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINGB0L7QtNC10YDQttCw0YnQuNC5INGB0LLQtdC00LXQvdC40Y8g0L7QsSDQsNC00YDQtdGB0LUg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODIyMTA4MDAwMCc6ICfQkNC60YIg0L7QsSDRg9GC0LLQtdGA0LbQtNC10L3QuNC4INGA0LXQt9GD0LvRjNGC0LDRgtC+0LIg0L7Qv9GA0LXQtNC10LvQtdC90LjRjyDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INGB0YLQvtC40LzQvtGB0YLQuCcsXG5cdCc1NTgyMjE5OTAwMDAnOiAn0JjQvdC+0Lkg0LTQvtC60YPQvNC10L3Rgiwg0YHQvtC00LXRgNC20LDRidC40Lkg0L7Qv9C40YHQsNC90LjQtSDQvtCx0YrQtdC60YLQsCcsXG5cdCc1NTgyMjIwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDQvNC10LbQtNGD0L3QsNGA0L7QtNC90L7QvCDQtNC+0LPQvtCy0L7RgNC1INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCwg0LIg0YHQvtC+0YLQstC10YLRgdGC0LLQuNC4INGBINC60L7RgtC+0YDRi9C8INGD0YHRgtCw0L3QvtCy0LvQtdC90L4g0LjQu9C4INC40LfQvNC10L3QtdC90L4g0L/RgNC+0YXQvtC20LTQtdC90LjQtSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LPRgNCw0L3QuNGG0Ysg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4LCDQsCDRgtCw0LrQttC1INGB0LLQtdC00LXQvdC40Y8g0L4g0YTQtdC00LXRgNCw0LvRjNC90L7QvCDQt9Cw0LrQvtC90LUsINC60L7RgtC+0YDRi9C8INGA0LDRgtC40YTQuNGG0LjRgNC+0LLQsNC9INC80LXQttC00YPQvdCw0YDQvtC00L3Ri9C5INC00L7Qs9C+0LLQvtGAINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCwg0Lgg0L7QsSDQvtGE0LjRhtC40LDQu9GM0L3QvtC8INC+0L/Rg9Cx0LvQuNC60L7QstCw0L3QuNC4INGC0LDQutC+0LPQviDRhNC10LTQtdGA0LDQu9GM0L3QvtCz0L4g0LfQsNC60L7QvdCwJyxcblx0JzU1ODIyMzAwMDAwMCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINC40LfQvNC10L3QtdC90LjQuCDQs9GA0LDQvdC40YYg0LzQtdC20LTRgyDRgdGD0LHRitC10LrRgtCw0LzQuCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnNTU4MjI0MDAwMDAwJzogJ9CX0LDQutC+0L0g0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0LjQu9C4INC40LfQvNC10L3QtdC90LjQuCDQs9GA0LDQvdC40YYg0LzRg9C90LjRhtC40L/QsNC70YzQvdGL0YUg0L7QsdGA0LDQt9C+0LLQsNC90LjQuSDQu9C40LHQviDQviDQv9GA0LXQvtCx0YDQsNC30L7QstCw0L3QuNC4INC80YPQvdC40YbQuNC/0LDQu9GM0L3Ri9GFINC+0LHRgNCw0LfQvtCy0LDQvdC40LknLFxuXHQnNTU4MjI1MDAwMDAwJzogJ9CQ0LrRgiDRg9C/0L7Qu9C90L7QvNC+0YfQtdC90L3QvtCz0L4g0L7RgNCz0LDQvdCwINC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INC40LvQuCDQuNC30LzQtdC90LXQvdC40Lgg0LPRgNCw0L3QuNGGINC90LDRgdC10LvRkdC90L3Ri9GFINC/0YPQvdC60YLQvtCyJyxcblx0JzU1ODIyNjAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0L3QtdC+0LHRhdC+0LTQuNC80YvQtSDQtNC70Y8g0LLQvdC10YHQtdC90LjRjyDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LrQsNC00LDRgdGC0YAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INGB0LLQtdC00LXQvdC40Y8g0L4g0LPRgNCw0L3QuNGG0LDRhSDQvNC10LbQtNGDINGB0YPQsdGK0LXQutGC0LDQvNC4INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCwg0LPRgNCw0L3QuNGG0LDRhSDQvNGD0L3QuNGG0LjQv9Cw0LvRjNC90L7Qs9C+INC+0LHRgNCw0LfQvtCy0LDQvdC40Y8sINCz0YDQsNC90LjRhtCw0YUg0L3QsNGB0LXQu9GR0L3QvdC+0LPQviDQv9GD0L3QutGC0LAsINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDRg9GC0LLQtdGA0LbQtNGR0L3QvdGL0YUg0L7RgNCz0LDQvdCw0LzQuCDQstC70LDRgdGC0Lgg0LTQvtC60YPQvNC10L3RgtCw0YUnLFxuXHQnNTU4MjI3MDAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INC40LvQuCDQuNC30LzQtdC90LXQvdC40Lgg0LPRgNCw0L3QuNGGINC30L7QvSDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LknLFxuXHQnNTU4MjI4MDAwMDAwJzogJ9Cf0YDQsNCy0L7QstC+0Lkg0LDQutGCLCDQutC+0YLQvtGA0YvQvCDRg9GC0LLQtdGA0LbQtNC10L3RiyDQuNC70Lgg0LjQt9C80LXQvdC10L3RiyDQv9GA0LDQstC40LvQsCDQt9C10LzQu9C10L/QvtC70YzQt9C+0LLQsNC90LjRjyDQuCDQt9Cw0YHRgtGA0L7QudC60LgnLFxuXHQnNTU4MjI5MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0LjQt9C80LXQvdC10L3QuNC1INC90LDQt9C90LDRh9C10L3QuNGPINC/0L7QvNC10YnQtdC90LjRjycsXG5cdCc1NTgyMzAwMDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0L/QtdGA0LXQstC+0LTQtSDQttC40LvQvtCz0L4g0L/QvtC80LXRidC10L3QuNGPINCyINC90LXQttC40LvQvtC1INC/0L7QvNC10YnQtdC90LjQtSwg0L3QtdC20LjQu9C+0LPQviDQv9C+0LzQtdGJ0LXQvdC40Y8g0LIg0LbQuNC70L7QtSDQv9C+0LzQtdGJ0LXQvdC40LUnLFxuXHQnNTU4MjMxMDAwMDAwJzogJ9CQ0LrRgiDQv9GA0LjQtdC80L7Rh9C90L7QuSDQutC+0LzQuNGB0YHQuNC4LCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC30LDQstC10YDRiNC10L3QuNC1INC/0LXRgNC10YPRgdGC0YDQvtC50YHRgtCy0LAg0LggKNC40LvQuCkg0L/QtdGA0LXQv9C70LDQvdC40YDQvtCy0LrQuCDQuCAo0LjQu9C4KSDQuNC90YvRhSDRgNCw0LHQvtGCJyxcblx0JzU1ODIzMjAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0YssINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQtSDRgdCy0LXQtNC10L3QuNGPINC+0LEg0LjQt9C80LXQvdC10L3QuNC4INC90LDQt9C90LDRh9C10L3QuNGPINC/0L7QvNC10YnQtdC90LjRjycsXG5cdCc1NTgyMzMwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDRgNC10YjQtdC90LjQuCDQviDQv9C10YDQtdCy0L7QtNC1INC20LjQu9C+0LPQviDQv9C+0LzQtdGJ0LXQvdC40Y8g0LIg0L3QtdC20LjQu9C+0LUg0L/QvtC80LXRidC10L3QuNC1LCDQvdC10LbQuNC70L7Qs9C+INC/0L7QvNC10YnQtdC90LjRjyDQsiDQttC40LvQvtC1INC/0L7QvNC10YnQtdC90LjQtScsXG5cdCc1NTgyMzQwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDQsNC60YLQtSDQv9GA0LjQtdC80L7Rh9C90L7QuSDQutC+0LzQuNGB0YHQuNC4LCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQtdC8INC30LDQstC10YDRiNC10L3QuNC1INC/0LXRgNC10YPRgdGC0YDQvtC50YHRgtCy0LAg0LggKNC40LvQuCkg0L/QtdGA0LXQv9C70LDQvdC40YDQvtCy0LrQuCDQuCAo0LjQu9C4KSDQuNC90YvRhSDRgNCw0LHQvtGCJyxcblx0JzU1ODIzNTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC40LfQvNC10L3QtdC90LjQtSDQvdCw0LfQvdCw0YfQtdC90LjRjyDQt9C00LDQvdC40Y8nLFxuXHQnNTU4MjM2MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0LjQt9C80LXQvdC10L3QuNC1INC90LDQt9C90LDRh9C10L3QuNGPINGB0L7QvtGA0YPQttC10L3QuNGPJyxcblx0JzU1ODIzNzAwMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGA0LDQt9GA0LXRiNC10L3QuNGPINC90LAg0YPRgdC70L7QstC90L4g0YDQsNC30YDQtdGI0LXQvdC90YvQuSDQstC40LQg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8nLFxuXHQnNTU4MjM4MDAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7Qv9GA0LXQtNC10LvQtdC90LjQuCAo0LjQt9C80LXQvdC10L3QuNC4KSDQstC40LTQsCDRgNCw0LfRgNC10YjQtdC90L3QvtCz0L4g0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8nLFxuXHQnNTU4MjM5MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIgKNC60L7Qv9C40Y8pLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjyDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGA0LDQt9GA0LXRiNC10L3QuNGPINC90LAg0YPRgdC70L7QstC90L4g0YDQsNC30YDQtdGI0LXQvdC90YvQuSDQstC40LQg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8sINC+0LEg0L7Qv9GA0LXQtNC10LvQtdC90LjQuCAo0LjQt9C80LXQvdC10L3QuNC4KSDQstC40LTQsCDRgNCw0LfRgNC10YjQtdC90L3QvtCz0L4g0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8nLFxuXHQnNTU4MjQwMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0YDQtdGI0LXQvdC40Lgg0L4g0L/RgNC40YHQstC+0LXQvdC40LgsINC40LfQvNC10L3QtdC90LjQuCDQsNC00YDQtdGB0LAnLFxuXHQnNTU4MjQxMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0YDQsNC30YDQtdGI0LXQvdC40Lgg0L3QsCDQstCy0L7QtCDQvtCx0YrQtdC60YLQsCDQutCw0L/QuNGC0LDQu9GM0L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAg0LIg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNGOINGB0LLQtdC00LXQvdC40Y8nLFxuXHQnNTU4MjQyMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0YDQtdC10YHRgtGA0LUg0L7QsdGK0LXQutGC0L7QsiDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8gKNC/0LDQvNGP0YLQvdC40LrQvtCyINC40YHRgtC+0YDQuNC4INC4INC60YPQu9GM0YLRg9GA0YspINC90LDRgNC+0LTQvtCyINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCc1NTgyNDMwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDQsNC60YLQtSDQn9GA0LDQstC40YLQtdC70YzRgdGC0LLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0L7QsSDQuNGB0LrQu9GO0YfQtdC90LjQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LjQtyDQtdC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQvtCx0YrQtdC60YLQvtCyINC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNGB0LvQtdC00LjRjyAo0L/QsNC80Y/RgtC90LjQutC+0LIg0LjRgdGC0L7RgNC40Lgg0Lgg0LrRg9C70YzRgtGD0YDRiykg0L3QsNGA0L7QtNC+0LIg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzU1ODI0NDAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDRgdC+0LTQtdGA0LbQsNGJ0LjQuSDRgdCy0LXQtNC10L3QuNGPINC+INC00LDRgtC1INC/0L7RgdGC0YPQv9C70LXQvdC40Y8g0LTQvtC60YPQvNC10L3RgtC+0LIsINC/0YDQtdC00YPRgdC80L7RgtGA0LXQvdC90YvRhSDRgdGC0LDRgtGM0LXQuSAxNyDQpNC10LTQtdGA0LDQu9GM0L3QvtCz0L4g0LfQsNC60L7QvdCwIFwi0J7QsSDQvtCx0YrQtdC60YLQsNGFINC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNGB0LvQtdC00LjRjyAo0L/QsNC80Y/RgtC90LjQutCw0YUg0LjRgdGC0L7RgNC40Lgg0Lgg0LrRg9C70YzRgtGD0YDRiykg0L3QsNGA0L7QtNC+0LIg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4XCIsINCyINC+0YLQvdC+0YjQtdC90LjQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MjQ1MDAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1ICjQutC+0L/QuNGPINGA0LXRiNC10L3QuNGPKSDRgdC+0L7RgtCy0LXRgtGB0YLQstGD0Y7RidC10LPQviDQvtGA0LPQsNC90LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCy0LvQsNGB0YLQuCDQvtCxINC+0YLQutCw0LfQtSDQstC60LvRjtGH0LjRgtGMINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LIg0LXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAg0L7QsdGK0LXQutGC0L7QsiDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8gKNC/0LDQvNGP0YLQvdC40LrQvtCyINC40YHRgtC+0YDQuNC4INC4INC60YPQu9GM0YLRg9GA0YspINC90LDRgNC+0LTQvtCyINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCc1NTgyNDYwMDAwMDAnOiAn0JDQutGCINCf0YDQsNCy0LjRgtC10LvRjNGB0YLQstCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQvtCxINC40YHQutC70Y7Rh9C10L3QuNC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQuNC3INC10LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC+0LHRitC10LrRgtC+0LIg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPJyxcblx0JzU1ODI0NzAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjyDQviDQvdCw0LjQvNC10L3QvtCy0LDQvdC40Lgg0LLQvtC00L3QvtCz0L4g0L7QsdGK0LXQutGC0LAg0Lgg0YPRgdGC0LDQvdC+0LLQu9C10L3QvdGL0YUg0L/QsNGA0LDQvNC10YLRgNCw0YUg0LLQvtC00L7QvtGF0YDQsNC90L3Ri9GFINC30L7QvSDQuCDQv9GA0LjQsdGA0LXQttC90YvRhSDQt9Cw0YnQuNGC0L3Ri9GFINC/0L7Qu9C+0YEsINC30L7QvSDQt9Cw0YLQvtC/0LvQtdC90LjRjywg0L/QvtC00YLQvtC/0LvQtdC90LjRjyDQuCDQtNGA0YPQs9C40YUg0LfQvtC9INGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGFINC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPJyxcblx0JzU1ODI0ODAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDQu9C10YHQvdC+0Lwg0YDQtdC10YHRgtGA0LUg0YHQstC10LTQtdC90LjRjyDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LvQtdGB0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuXHQnNTU4MjQ5MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LLQviDQstGB0YLRg9C/0LjQstGI0LXQvCDQsiDRgdC40LvRgyDQsNC60YLQtSDQvtCxINGD0YLQstC10YDQttC00LXQvdC40Lgg0YDQtdC30YPQu9GM0YLQsNGC0L7QsiDQvtC/0YDQtdC00LXQu9C10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0YHRgtC+0LjQvNC+0YHRgtC4Jyxcblx0JzU1ODI1MDAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjywg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINGA0LXRiNC10L3QuNC4INC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INC40LvQuCDQuNC30LzQtdC90LXQvdC40Lgg0LPRgNCw0L3QuNGGINC30L7QvSDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LknLFxuXHQnNTU4MjUxMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0L/RgNCw0LLQvtCy0L7QvCDQsNC60YLQtSwg0LrQvtGC0L7RgNGL0Lwg0YPRgtCy0LXRgNC20LTQtdC90Ysg0LjQu9C4INC40LfQvNC10L3QtdC90Ysg0L/RgNCw0LLQuNC70LAg0LfQtdC80LvQtdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0Lgg0LfQsNGB0YLRgNC+0LnQutC4LCDQstC60LvRjtGH0LDRjyDRgdCy0LXQtNC10L3QuNGPINC+INGC0LXRgNGA0LjRgtC+0YDQuNCw0LvRjNC90YvRhSDQt9C+0L3QsNGFJyxcblx0JzU1ODI1MjAwMDAwMCc6ICfQmtCw0YDRgtCwICjQv9C70LDQvSkg0L7QsdGK0LXQutGC0LAg0LfQtdC80LvQtdGD0YHRgtGA0L7QudGB0YLQstCwJyxcblx0JzU1ODI1MzAwMDAwMCc6ICfQlNC10LrQu9Cw0YDQsNGG0LjRjyDQt9Cw0LjQvdGC0LXRgNC10YHQvtCy0LDQvdC90L7Qs9C+INC70LjRhtCwINC+INCy0YvQsdGA0LDQvdC90L7QvCDQstC40LTQtSDRgNCw0LfRgNC10YjQtdC90L3QvtCz0L4g0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuXHQnNTU4MjU0MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0L7Qv9GA0LXQtNC10LvRj9GO0YnQuNC1ICjQvtC/0YDQtdC00LXQu9GP0LLRiNC40LUpINCyINGB0L7QvtGC0LLQtdGC0YHRgtCy0LjQuCDRgSDQt9Cw0LrQvtC90L7QtNCw0YLQtdC70YzRgdGC0LLQvtC8INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNC1INCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCAo0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LIpJyxcblx0JzU1ODI1NDAxMDAwMCc6ICfQl9C10LzQu9C10YPRgdGC0YDQvtC40YLQtdC70YzQvdCw0Y8g0LTQvtC60YPQvNC10L3RgtCw0YbQuNGPJyxcblx0JzU1ODI1NDAyMDAwMCc6ICfQm9C10YHQvtGD0YHRgtGA0L7QuNGC0LXQu9GM0L3QsNGPINC00L7QutGD0LzQtdC90YLQsNGG0LjRjycsXG5cdCc1NTgyNTQwMzAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLINCz0YDQsNC00L7RgdGC0YDQvtC40YLQtdC70YzQvdC+0LPQviDQt9C+0L3QuNGA0L7QstCw0L3QuNGPICjQn9GA0LDQstC40LvQsCDQt9C10LzQu9C10L/QvtC70YzQt9C+0LLQsNC90LjRjyDQuCDQt9Cw0YHRgtGA0L7QudC60LgpJyxcblx0JzU1ODI1NDA0MDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0LDRhtC40Y8g0L/QviDQv9C70LDQvdC40YDQvtCy0LrQtSDRgtC10YDRgNC40YLQvtGA0LjQuCAo0L/RgNC+0LXQutGC0Ysg0LzQtdC20LXQstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC5KSwg0LIg0YIu0YcuINC00L7QutGD0LzQtdC90YIg0L/QviDQv9C70LDQvdC40YDQvtCy0LrQtSDRgtC10YDRgNC40YLQvtGA0LjQuCDQsiDQv9C70LDQvdC40YDRg9C10LzRi9GFINCz0YDQsNC90LjRhtCw0YUg0LjRgdC60YPRgdGB0YLQstC10L3QvdC+0LPQviDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG5cdCc1NTgyNTQwNTAwMDAnOiAn0JrQvtC/0LjRjyDQv9GA0L7QtdC60YLQsCDQvNC10LbQtdCy0LDQvdC40Y8g0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuXHQnNTU4MjU0MDYwMDAwJzogJ9CQ0LrRgiDQvtGC0LLQvtC00LAg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LIg0LIg0L3QsNGC0YPRgNC1Jyxcblx0JzU1ODI1NDA3MDAwMCc6ICfQn9GA0L7QtdC60YIg0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcblx0JzU1ODI1NDA4MDAwMCc6ICfQn9GA0L7QtdC60YIgKNC60L7Qv9C40Lgg0L7RgtC00LXQu9GM0L3Ri9GFINGB0L7RgdGC0LDQstC90YvRhSDRh9Cw0YHRgtC10LkpINC+0YDQs9Cw0L3QuNC30LDRhtC40Lgg0Lgg0LfQsNGB0YLRgNC+0LnQutC4INGC0LXRgNGA0LjRgtC+0YDQuNC5INGB0LDQtNC+0LLQvtC00YfQtdGB0LrQuNGFLCDQvtCz0L7RgNC+0LTQvdC40YfQtdGB0LrQuNGFINC40LvQuCDQtNCw0YfQvdGL0YUg0L3QtdC60L7QvNC80LXRgNGH0LXRgdC60LjRhSDQvtCx0YrQtdC00LjQvdC10L3QuNC5INCz0YDQsNC20LTQsNC9Jyxcblx0JzU1ODI1NDA5MDAwMCc6ICfQn9GA0L7QtdC60YIgKNC60L7Qv9C40Lgg0L7RgtC00LXQu9GM0L3Ri9GFINGB0L7RgdGC0LDQstC90YvRhSDRh9Cw0YHRgtC10LkpINC/0LXRgNC10YDQsNGB0L/RgNC10LTQtdC70LXQvdC40Y8g0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90YvRhSDRg9Cz0L7QtNC40Lkg0Lgg0LjQvdGL0YUg0LfQtdC80LXQu9GMINGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCc1NTgyNTQxMDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0L/RgNC10LTQstCw0YDQuNGC0LXQu9GM0L3QvtC8INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQuCDQvNC10YHRgiDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyJyxcblx0JzU1ODI1NDExMDAwMCc6ICfQmtC+0L/QuNGPINGA0LXRiNC10L3QuNGPINC+0LHRidC10LPQviDRgdC+0LHRgNCw0L3QuNGPINGD0YfQsNGB0YLQvdC40LrQvtCyINC00L7Qu9C10LLQvtC5INGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4INC90LAg0LfQtdC80LXQu9GM0L3Ri9C5INGD0YfQsNGB0YLQvtC6INC40Lcg0LfQtdC80LXQu9GMINGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjyDQvtCxINGD0YLQstC10YDQttC00LXQvdC40Lgg0L/RgNC+0LXQutGC0LAg0LzQtdC20LXQstCw0L3QuNGPINC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcblx0JzU1ODI1NDEyMDAwMCc6ICfQmtC+0L/QuNGPINC00L7QutGD0LzQtdC90YLQsCwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LXQs9C+INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQtSDQv9GA0L7QtdC60YLQsCDQvNC10LbQtdCy0LDQvdC40Y8g0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuXHQnNTU4MjU0MTMwMDAwJzogJ9CS0L7Qt9GA0LDQttC10L3QuNGPINC30LDQuNC90YLQtdGA0LXRgdC+0LLQsNC90L3Ri9GFINC70LjRhiDQv9C+INC/0L7QstC+0LTRgyDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNGPINCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG5cdCc1NTgyNTQxNDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0YHQstC40LTQtdGC0LXQu9GM0YHRgtCy0YPRjtGJ0LjQuSDQviDRgdC90Y/RgtC40Lgg0LLQvtC30YDQsNC20LXQvdC40Lkg0LfQsNC40L3RgtC10YDQtdGB0L7QstCw0L3QvdGL0YUg0LvQuNGGINC/0L4g0L/QvtCy0L7QtNGDINC80LXRgdGC0L7Qv9C+0LvQvtC20LXQvdC40Y8g0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcblx0JzU1ODI1NDE1MDAwMCc6ICfQodGF0LXQvNCwINGA0LDRgdC/0L7Qu9C+0LbQtdC90LjRjyDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsiDQvdCwINC60LDQtNCw0YHRgtGA0L7QstGL0YUg0L/Qu9Cw0L3QsNGFINC40LvQuCDQutCw0LTQsNGB0YLRgNC+0LLRi9GFINC60LDRgNGC0LDRhSDRgdC+0L7RgtCy0LXRgtGB0YLQstGD0Y7RidC40YUg0YLQtdGA0YDQuNGC0L7RgNC40LknLFxuXHQnNTU4MjU0OTkwMDAwJzogJ9Cf0YDQvtGH0LjQtSDQtNC+0LrRg9C80LXQvdGC0YssINC+0L/RgNC10LTQtdC70Y/RjtGJ0LjQtSAo0L7Qv9GA0LXQtNC10LvRj9Cy0YjQuNC1KSDQsiDRgdC+0L7RgtCy0LXRgtGB0YLQstC40Lgg0YEg0LfQsNC60L7QvdC+0LTQsNGC0LXQu9GM0YHRgtCy0L7QvCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjQtSDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAgKNC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyKScsXG5cdCc1NTgyNTUwMDAwMDAnOiAn0JrQsNGA0YLQvtCz0YDQsNGE0LjRh9C10YHQutC40LUg0LzQsNGC0LXRgNC40LDQu9GLJyxcblx0JzU1ODI1NjAwMDAwMCc6ICfQnNCw0YLQtdGA0LjQsNC70Ysg0LrQsNGA0YLQvtCz0YDQsNGE0L4t0LPQtdC+0LTQtdC30LjRh9C10YHQutC+0LPQviDRhNC+0L3QtNCwJyxcblx0JzU1ODI1NzAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0YssINGD0YHRgtCw0L3QsNCy0LvQuNCy0LDRjtGJ0LjQtSDQv9GA0LXQtNC10LvRjNC90YvQtSDQvNC40L3QuNC80LDQu9GM0L3Ri9C1INC4INC80LDQutGB0LjQvNCw0LvRjNC90YvQtSDRgNCw0LfQvNC10YDRiywg0YHQvtC+0YLQstC10YLRgdGC0LLRg9GO0YnQuNC1INCy0LjQtNGDINGA0LDQt9GA0LXRiNC10L3QvdC+0LPQviDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG5cdCc1NTgyNTcwMTAwMDAnOiAn0KTQtdC00LXRgNCw0LvRjNC90YvQuSDQt9Cw0LrQvtC9Jyxcblx0JzU1ODI1NzAyMDAwMCc6ICfQl9Cw0LrQvtC9INGB0YPQsdGK0LXQutGC0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzU1ODI1NzAzMDAwMCc6ICfQndC+0YDQvNCw0YLQuNCy0L3Ri9C5INC/0YDQsNCy0L7QstC+0Lkg0LDQutGCINC+0YDQs9Cw0L3QsCDQvNC10YHRgtC90L7Qs9C+INGB0LDQvNC+0YPQv9GA0LDQstC70LXQvdC40Y8nLFxuXHQnNTU4MjU4MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINGB0L7QtNC10YDQttCw0YnQuNC5INC40L3RhNC+0YDQvNCw0YbQuNGOINC+INGA0LDQvdC10LUg0L/RgNC40YHQstC+0LXQvdC90YvRhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0YUg0YPRh9C10YLQvdGL0YUg0L3QvtC80LXRgNCw0YUg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODI1OTAwMDAwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INC+0LHRgNCw0LfQvtCy0LDQvdC40Y8g0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuXHQnNTU4MjYwMDAwMDAwJzogJ9Cn0LXRgNGC0LXQtiAo0LDQsdGA0LjRgSkg0L/QvtC80LXRidC10L3QuNGPJyxcblx0JzU1ODI2MTAwMDAwMCc6ICfQn9GA0L7QtdC60YLQvdCw0Y8g0LTQvtC60YPQvNC10L3RgtCw0YbQuNGPINC30LTQsNC90LjRjycsXG5cdCc1NTgyNjIwMDAwMDAnOiAn0J/RgNC+0LXQutGC0L3QsNGPINC00L7QutGD0LzQtdC90YLQsNGG0LjRjyDRgdC+0L7RgNGD0LbQtdC90LjRjycsXG5cdCc1NTgyNjMwMDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0LrQvtC80LjRgdGB0LjQuCDQv9C+INGA0LDRgdGB0LzQvtGC0YDQtdC90LjRjiDRgdC/0L7RgNC+0LIg0L4g0YDQtdC30YPQu9GM0YLQsNGC0LDRhSDQvtC/0YDQtdC00LXQu9C10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0YHRgtC+0LjQvNC+0YHRgtC4Jyxcblx0JzU1ODI2NDAwMDAwMCc6ICfQoNC10YjQtdC90LjQtSDRgdGD0LTQsCcsXG5cdCc1NTgyOTkwMDAwMDAnOiAn0JjQvdC+0Lkg0LTQvtC60YPQvNC10L3Rgiwg0YHQvtC00LXRgNC20LDRidC40Lkg0L7Qv9C40YHQsNC90LjQtSDQvtCx0YrQtdC60YLQsCcsXG5cdCc1NTgzMDAwMDAwMDAnOiAn0JTQntCa0KPQnNCV0J3QotCrLCDQodCe0JTQldCg0JbQkNCp0JjQlSDQntCf0JjQodCQ0J3QmNCVINCX0JDQr9CS0JjQotCV0JvQryDQmNCb0Jgg0JXQk9CeINCf0KDQldCU0KHQotCQ0JLQmNCi0JXQm9CvJyxcblx0JzU1ODMwMTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0YssINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40LUg0L/QvtC70L3QvtC80L7Rh9C40Y8g0L/RgNC10LTRgdGC0LDQstC40YLQtdC70Y8nLFxuXHQnNTU4MzAxMDEwMDAwJzogJ9CU0L7QstC10YDQtdC90L3QvtGB0YLRjCcsXG5cdCc1NTgzMDEwMjAwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0YDQvtC20LTQtdC90LjQuCcsXG5cdCc1NTgzMDEwMzAwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L7QsSDRg9GB0YvQvdC+0LLQu9C10L3QuNC4Jyxcblx0JzU1ODMwMTA0MDAwMCc6ICfQoNC10YjQtdC90LjQtSDRgdGD0LTQsCcsXG5cdCc1NTgzMDEwNTAwMDAnOiAn0J7Qv9GA0LXQtNC10LvQtdC90LjQtSDRgdGD0LTQsCcsXG5cdCc1NTgzMDEwNjAwMDAnOiAn0J/RgNC+0YLQvtC60L7QuyDQvtCxINC40LfQsdGA0LDQvdC40LggKNC10LTQuNC90L7Qu9C40YfQvdC+0LPQviDQuNGB0L/QvtC70L3QuNGC0LXQu9GM0L3QvtCz0L4g0L7RgNCz0LDQvdCwINGO0YDQuNC00LjRh9C10YHQutC+0LPQviDQu9C40YbQsCknLFxuXHQnNTU4MzAxMDcwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0L/RgNC+0YLQvtC60L7Qu9CwINC+0LEg0LjQt9Cx0YDQsNC90LjQuCAo0LXQtNC40L3QvtC70LjRh9C90L7Qs9C+INC40YHQv9C+0LvQvdC40YLQtdC70YzQvdC+0LPQviDQvtGA0LPQsNC90LAg0Y7RgNC40LTQuNGH0LXRgdC60L7Qs9C+INC70LjRhtCwKScsXG5cdCc1NTgzMDEwODAwMDAnOiAn0J/RgNC40LrQsNC3INC+INC90LDQt9C90LDRh9C10L3QuNC4ICjRgNGD0LrQvtCy0L7QtNC40YLQtdC70Y8g0LjQu9C4INC40L3QvtCz0L4g0YPQv9C+0LvQvdC+0LzQvtGH0LXQvdC90L7Qs9C+INC70LjRhtCwKScsXG5cdCc1NTgzMDEwOTAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7RgNCz0LDQvdC+0LIg0L7Qv9C10LrQuCDQuCDQv9C+0L/QtdGH0LjRgtC10LvRjNGB0YLQstCwJyxcblx0JzU1ODMwMTEwMDAwMCc6ICfQlNC+0LPQvtCy0L7RgCDQutC+0LzQvNC10YDRh9C10YHQutC+0LPQviDQv9GA0LXQtNGB0YLQsNCy0LjRgtC10LvRjNGB0YLQstCwJyxcblx0JzU1ODMwMTExMDAwMCc6ICfQlNC+0LPQvtCy0L7RgCDQtNC+0LLQtdGA0LjRgtC10LvRjNC90L7Qs9C+INGD0L/RgNCw0LLQu9C10L3QuNGPJyxcblx0JzU1ODMwMTEyMDAwMCc6ICfQn9C+0YHRgtCw0L3QvtCy0LvQtdC90LjQtSDRgdGD0LTQtdCx0L3QvtCz0L4g0L/RgNC40YHRgtCw0LLQsC3QuNGB0L/QvtC70L3QuNGC0LXQu9GPJyxcblx0JzU1ODMwMTEzMDAwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INC+0LHRidC10LPQviDRgdC+0LHRgNCw0L3QuNGPJyxcblx0JzU1ODMwMTE0MDAwMCc6ICfQkNC60YIg0L7RgNCz0LDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQstC70LDRgdGC0Lgg0LjQu9C4INC+0YDQs9Cw0L3QsCDQvNC10YHRgtC90L7Qs9C+INGB0LDQvNC+0YPQv9GA0LDQstC70LXQvdC40Y8sINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0L/QvtC70L3QvtC80L7Rh9C40Y8g0L/RgNC10LTRgdGC0LDQstC40YLQtdC70Y8g0LfQsNGP0LLQuNGC0LXQu9GPJyxcblx0JzU1ODMwMTk5MDAwMCc6ICfQmNC90L7QuSDQtNC+0LrRg9C80LXQvdGCJyxcblx0JzU1ODQwMDAwMDAwMCc6ICfQlNCe0JrQo9Cc0JXQndCi0Ksg0J4g0J/QoNCQ0JLQkNClLCDQodCU0JXQm9Ca0JDQpSwg0J7Qk9Cg0JDQndCY0KfQldCd0JjQr9ClICjQntCR0KDQldCc0JXQndCV0J3QmNCv0KUpJyxcblx0JzU1ODQwMTAwMDAwMCc6ICfQn9GA0LDQstC+0YPRgdGC0LDQvdCw0LLQu9C40LLQsNGO0YnQuNC1INC4INC/0YDQsNCy0L7Rg9C00L7RgdGC0L7QstC10YDRj9GO0YnQuNC1INC00L7QutGD0LzQtdC90YLRiycsXG5cdCc1NTg0MDEwMTAwMDAnOiAn0JTQvtCz0L7QstC+0YDRiyAvINGB0L7Qs9C70LDRiNC10L3QuNGPJyxcblx0JzU1ODQwMTAxMDEwMCc6ICfQodC00LXQu9C60Lgg0L7QsSDQvtGC0YfRg9C20LTQtdC90LjQuCcsXG5cdCc1NTg0MDEwMTAxMDEnOiAn0JTQvtCz0L7QstC+0YAg0LrRg9C/0LvQuC3Qv9GA0L7QtNCw0LbQuCcsXG5cdCc1NTg0MDEwMTAxMDInOiAn0JTQvtCz0L7QstC+0YAg0LzQtdC90YsnLFxuXHQnNTU4NDAxMDEwMTAzJzogJ9CU0L7Qs9C+0LLQvtGAINC00LDRgNC10L3QuNGPJyxcblx0JzU1ODQwMTAxMDEwNCc6ICfQlNC+0LPQvtCy0L7RgCDRgNC10L3RgtGLJyxcblx0JzU1ODQwMTAxMDEwNSc6ICfQlNC+0LPQvtCy0L7RgCDQv9C+0LbQuNC30L3QtdC90L3QvtCz0L4g0YHQvtC00LXRgNC20LDQvdC40Y8g0YEg0LjQttC00LjQstC10L3QuNC10LwnLFxuXHQnNTU4NDAxMDEwMTA2JzogJ9CU0L7Qs9C+0LLQvtGAINC/0YDQuNCy0LDRgtC40LfQsNGG0LjQuCAo0LTQvtCz0L7QstC+0YAg0L/QtdGA0LXQtNCw0YfQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LIg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0YwpJyxcblx0JzU1ODQwMTAxMDIwMCc6ICfQlNGA0YPQs9C40LUg0YHQtNC10LvQutC4Jyxcblx0JzU1ODQwMTAxMDIwMSc6ICfQlNC+0LPQvtCy0L7RgCDRg9GH0LDRgdGC0LjRjyDQsiDQtNC+0LvQtdCy0L7QvCDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQtScsXG5cdCc1NTg0MDEwMTAyMDInOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDQvtC/0YDQtdC00LXQu9C10L3QuNC4ICjQv9C10YDQtdGA0LDRgdC/0YDQtdC00LXQu9C10L3QuNC4KSDQtNC+0LvQtdC5INCyINC/0YDQsNCy0LUg0L7QsdGJ0LXQuSDQtNC+0LvQtdCy0L7QuSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCcsXG5cdCc1NTg0MDEwMTAyMDMnOiAn0JHRgNCw0YfQvdGL0Lkg0LTQvtCz0L7QstC+0YAnLFxuXHQnNTU4NDAxMDEwMjA0JzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0L7RgtGB0YLRg9C/0L3QvtC8Jyxcblx0JzU1ODQwMTAxMDIwNSc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQviDRgNCw0LfQtNC10LvQtSDQuNC80YPRidC10YHRgtCy0LAnLFxuXHQnNTU4NDAxMDEwMjA2JzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+INCy0YvQtNC10LvQtSDQtNC+0LvQuCcsXG5cdCc1NTg0MDEwMTAyMDcnOiAn0JjQvdCy0LXRgdGC0LjRhtC40L7QvdC90YvQuSDQtNC+0LPQvtCy0L7RgCAo0LTQvtCz0L7QstC+0YAg0L7QsSDQuNC90LLQtdGB0YLQuNGA0L7QstCw0L3QuNC4KScsXG5cdCc1NTg0MDEwMTAyMDgnOiAn0JzQuNGA0L7QstC+0LUg0YHQvtCz0LvQsNGI0LXQvdC40LUnLFxuXHQnNTU4NDAxMDEwMjA5JzogJ9CU0L7Qs9C+0LLQvtGAINCw0YDQtdC90LTRiyAo0YHRg9Cx0LDRgNC10L3QtNGLKScsXG5cdCc1NTg0MDEwMTAyMTAnOiAn0JTQvtCz0L7QstC+0YAg0L7QsSDQuNC/0L7RgtC10LrQtScsXG5cdCc1NTg0MDEwMTAyMTEnOiAn0JTQvtCz0L7QstC+0YAg0LHQtdC30LLQvtC30LzQtdC30LTQvdC+0LPQviDRgdGA0L7Rh9C90L7Qs9C+INC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0LfQtdC80LXQu9GM0L3Ri9C8INGD0YfQsNGB0YLQutC+0LwnLFxuXHQnNTU4NDAxMDEwMjEyJzogJ9Ca0YDQtdC00LjRgtC90YvQuSDQtNC+0LPQvtCy0L7RgCcsXG5cdCc1NTg0MDEwMTAyMTMnOiAn0JTQvtCz0L7QstC+0YAg0LfQsNC50LzQsCcsXG5cdCc1NTg0MDEwMTAyMTQnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0YHQtdGA0LLQuNGC0YPRgtCwJyxcblx0JzU1ODQwMTAxMDIxNSc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINC40LfQvNC10L3QtdC90LjQuCDRgdC+0LTQtdGA0LbQsNC90LjRjyDQt9Cw0LrQu9Cw0LTQvdC+0LknLFxuXHQnNTU4NDAxMDEwMjE2JzogJ9CU0L7Qv9C+0LvQvdC40YLQtdC70YzQvdC+0LUg0YHQvtCz0LvQsNGI0LXQvdC40LUgKNGB0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0LjQt9C80LXQvdC10L3QuNC4INGD0YHQu9C+0LLQuNC5INC00L7Qs9C+0LLQvtGA0LApINC6INC00L7Qs9C+0LLQvtGA0YMnLFxuXHQnNTU4NDAxMDEwMjE3JzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+INGA0LDRgdGC0L7RgNC20LXQvdC40Lgg0LTQvtCz0L7QstC+0YDQsCcsXG5cdCc1NTg0MDEwMTAyMTgnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDRg9GB0YLRg9C/0LrQtSDQv9GA0LDQsiDRgtGA0LXQsdC+0LLQsNC90LjRjyDQv9C+INC00L7Qs9C+0LLQvtGA0YMgKNC00L7Qs9C+0LLQvtGAINC+INC/0LXRgNC10LTQsNGH0LUg0L/RgNCw0LIg0Lgg0L7QsdGP0LfQsNC90L3QvtGB0YLQtdC5KScsXG5cdCc1NTg0MDEwMTAyMTknOiAn0JTQvtCz0L7QstC+0YAg0L/RgNC+0YHRgtC+0LPQviDRgtC+0LLQsNGA0LjRidC10YHRgtCy0LAgKNC00L7Qs9C+0LLQvtGAINC+INGB0L7QstC80LXRgdGC0L3QvtC5INC00LXRj9GC0LXQu9GM0L3QvtGB0YLQuCknLFxuXHQnNTU4NDAxMDEwMjIwJzogJ9CT0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutC+0L3RgtGA0LDQutGCJyxcblx0JzU1ODQwMTAxMDI5OSc6ICfQmNC90LDRjyDRgdC00LXQu9C60LAnLFxuXHQnNTU4NDAxMDIwMDAwJzogJ9CQ0LrRgtGLINC+0YDQs9Cw0L3QvtCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQstC70LDRgdGC0Lgg0LjQu9C4INC+0YDQs9Cw0L3QvtCyINC80LXRgdGC0L3QvtCz0L4g0YHQsNC80L7Rg9C/0YDQsNCy0LvQtdC90LjRjycsXG5cdCc1NTg0MDEwMjAxMDAnOiAn0KTQtdC00LXRgNCw0LvRjNC90YvQuSDQt9Cw0LrQvtC9Jyxcblx0JzU1ODQwMTAyMDIwMCc6ICfQo9C60LDQtyDQn9GA0LXQt9C40LTQtdC90YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnNTU4NDAxMDIwMzAwJzogJ9Cf0L7RgdGC0LDQvdC+0LLQu9C10L3QuNC1INCf0YDQsNCy0LjRgtC10LvRjNGB0YLQstCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCc1NTg0MDEwMjA0MDAnOiAn0JfQsNC60L7QvSAo0LfQsNC60L7QvdGLINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCwg0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgpJyxcblx0JzU1ODQwMTAyMDUwMCc6ICfQlNC+0LrRg9C80LXQvdGCINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuXHQnNTU4NDAxMDIwNjAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7QsdGA0LDQt9C+0LLQsNC90LjQuCDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG5cdCc1NTg0MDEwMjA3MDAnOiAn0JDQutGCINC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INGB0LXRgNCy0LjRgtGD0YLQsCcsXG5cdCc1NTg0MDEwMjA4MDAnOiAn0JDQutGCINC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pJyxcblx0JzU1ODQwMTAyOTkwMCc6ICfQmNC90YvQtSDQsNC60YLRiyDQvtGA0LPQsNC90L7QsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LLQu9Cw0YHRgtC4INC40LvQuCDQvtGA0LPQsNC90L7QsiDQvNC10YHRgtC90L7Qs9C+INGB0LDQvNC+0YPQv9GA0LDQstC70LXQvdC40Y8nLFxuXHQnNTU4NDAxMDMwMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INC/0YDQsNCy0LUg0L3QsCDQvdCw0YHQu9C10LTRgdGC0LLQvicsXG5cdCc1NTg0MDEwMzAxMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0L/RgNCw0LLQtSDQvdCwINC90LDRgdC70LXQtNGB0YLQstC+INC/0L4g0LfQsNC60L7QvdGDJyxcblx0JzU1ODQwMTAzMDIwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQv9GA0LDQstC1INC90LAg0L3QsNGB0LvQtdC00YHRgtCy0L4g0L/QviDQt9Cw0LLQtdGJ0LDQvdC40Y4nLFxuXHQnNTU4NDAxMDQwMDAwJzogJ9CS0YHRgtGD0L/QuNCy0YjQuNC1INCyINGB0LjQu9GDINGB0YPQtNC10LHQvdGL0LUg0LDQutGC0YsnLFxuXHQnNTU4NDAxMDQwMTAwJzogJ9Ch0YPQtNC10LHQvdGL0Lkg0LDQutGCLCDRg9GB0YLQsNC90LDQstC70LjQstCw0Y7RidC40Lkg0LfQsNC/0YDQtdGCINC90LAg0YHQvtCy0LXRgNGI0LXQvdC40LUg0LTQtdC50YHRgtCy0LjQuSDQsiDRgdGE0LXRgNC1INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDRg9GH0LXRgtCwINCyINC+0YLQvdC+0YjQtdC90LjQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4NDAxMDQwMjAwJzogJ9Ch0YPQtNC10LHQvdGL0Lkg0LDQutGCINC+INCy0L7RgdGB0YLQsNC90L7QstC70LXQvdC40Lgg0LDQvdC90YPQu9C40YDQvtCy0LDQvdC90YvRhSDQuCDQuNGB0LrQu9GO0YfQtdC90L3Ri9GFINC40Lcg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0YHQstC10LTQtdC90LjQuSDQvtCxINC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTg0MDEwNDAzMDAnOiAn0KHRg9C00LXQsdC90YvQuSDQsNC60YIg0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0L7QsdGA0LXQvNC10L3QtdC90LjRjyAo0L7Qs9GA0LDQvdC40YfQtdC90LjQuCkg0LIg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4ICAo0YfQsNGB0YLQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgpJyxcblx0JzU1ODQwMTA0OTkwMCc6ICfQmNC90YvQtSDQv9GA0LXQtNGD0YHQvNC+0YLRgNC10L3QvdGL0LUg0LfQsNC60L7QvdC+0LTQsNGC0LXQu9GM0YHRgtCy0L7QvCDRgdGD0LTQtdCx0L3Ri9C1INCw0LrRgtGLJyxcblx0JzU1ODQwMTA1MDAwMCc6ICfQkNC60YLRiyAo0YHQstC40LTQtdGC0LXQu9GM0YHRgtCy0LApINC+INC/0YDQsNCy0LDRhSDQvdCwINC+0LHRitC10LrRgtGLINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTg0MDEwNTAxMDAnOiAn0KDQtdCz0LjRgdGC0YDQsNGG0LjQvtC90L3QvtC1INGD0LTQvtGB0YLQvtCy0LXRgNC10L3QuNC1Jyxcblx0JzU1ODQwMTA1MDIwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQv9GA0LDQstC1INC90LAg0LfQtdC80LvRjicsXG5cdCc1NTg0MDEwNTAzMDAnOiAn0JPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INCw0LrRgiDQviDQv9GA0LDQstC1INC90LAg0LfQtdC80LvRjicsXG5cdCc1NTg0MDEwNTA0MDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0L/RgNCw0LLQtSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCcsXG5cdCc1NTg0MDEwNTk5MDAnOiAn0JjQvdGL0LUg0LDQutGC0YssINGB0LLQuNC00LXRgtC10LvRjNGB0YLQstCwINC+INC/0YDQsNCy0LDRhSDQvdCwINC+0LHRitC10LrRgtGLINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTg0MDEwNjAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLINC90LAg0LLQvdC+0LLRjCDQstC+0LfQstC10LTQtdC90L3Ri9C5ICjRgNC10LrQvtC90YHRgtGA0YPQuNGA0L7QstCw0L3QvdGL0LkpINC+0LHRitC10LrRgicsXG5cdCc1NTg0MDEwNjAxMDAnOiAn0KDQsNC30YDQtdGI0LXQvdC40LUg0L3QsCDQstCy0L7QtCDQvtCx0YrQtdC60YLQsCDQsiDRjdC60YHQv9C70YPQsNGC0LDRhtC40Y4nLFxuXHQnNTU4NDAxMDYwMjAwJzogJ9Cg0LDQt9GA0LXRiNC10L3QuNC1INC90LAg0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0L4nLFxuXHQnNTU4NDAxMDYwMzAwJzogJ9CQ0LrRgiDQstCy0L7QtNCwINCyINGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjRjicsXG5cdCc1NTg0MDEwNjA0MDAnOiAn0JrQvtC/0LjRjyDRgNC10YjQtdC90LjRjyDQviDRgdC+0LfQtNCw0L3QuNC4INC40YHQutGD0YHRgdGC0LLQtdC90L3QvtCz0L4g0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuXHQnNTU4NDAxMDcwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiyDQv9GA0Lgg0YPQv9GA0L7RidC10L3QvdC+0Lwg0L/QvtGA0Y/QtNC60LUg0L7RhNC+0YDQvNC70LXQvdC40Y8g0L/RgNCw0LIg0LPRgNCw0LbQtNCw0L0g0L3QsCDQvtGC0LTQtdC70YzQvdGL0LUg0L7QsdGK0LXQutGC0Ysg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuXHQnNTU4NDAxMDcwMTAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0L/QvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtC5INC60L3QuNCz0Lgg0L4g0L3QsNC70LjRh9C40Lgg0YMg0LPRgNCw0LbQtNCw0L3QuNC90LAg0L/RgNCw0LLQsCDQvdCwINC30LXQvNC10LvRjNC90YvQuSDRg9GH0LDRgdGC0L7QuicsXG5cdCc1NTg0MDEwNzAyMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQv9Cw0YHQv9C+0YDRgiDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4NDAxMDcwMzAwJzogJ9CU0LXQutC70LDRgNCw0YbQuNGPINC+0LEg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuXHQnNTU4NDAxMDgwMDAwJzogJ9Cf0YDQvtGH0LjQtSDQv9GA0LDQstC+0YPRgdGC0LDQvdCw0LLQu9C40LLQsNGO0YnQuNC1INC00L7QutGD0LzQtdC90YLRiycsXG5cdCc1NTg0MDEwODAxMDAnOiAn0J/QtdGA0LXQtNCw0YLQvtGH0L3Ri9C5INCw0LrRgicsXG5cdCc1NTg0MDEwODAyMDAnOiAn0KDQsNC30LTQtdC70LjRgtC10LvRjNC90YvQuSDQsdCw0LvQsNC90YEnLFxuXHQnNTU4NDAxMDgwMzAwJzogJ9Cf0LvQsNC9INC/0YDQuNCy0LDRgtC40LfQsNGG0LjQuCcsXG5cdCc1NTg0MDEwODA0MDAnOiAn0J/RgNCw0LLQuNC70LAg0LTQvtCy0LXRgNC40YLQtdC70YzQvdC+0LPQviDRg9C/0YDQsNCy0LvQtdC90LjRjycsXG5cdCc1NTg0MDEwODA1MDAnOiAn0JDQutGCINC+0L/QuNGB0Lgg0Lgg0LDRgNC10YHRgtCwINC40LzRg9GJ0LXRgdGC0LLQsCcsXG5cdCc1NTg0MDEwODA2MDAnOiAn0J/RgNC+0YLQvtC60L7QuyDQviDQstGL0LTQtdC70LUg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAg0LIg0YHRh9C10YIg0LfQtdC80LXQu9GM0L3QvtC5INC00L7Qu9C4Jyxcblx0JzU1ODQwMTA4MDcwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INC+0LHRidC10LPQviDRgdC+0LHRgNCw0L3QuNGPINGB0L7QsdGB0YLQstC10L3QvdC40LrQvtCyINC/0L7QvNC10YnQtdC90LjQuSDQsiDQvNC90L7Qs9C+0LrQstCw0YDRgtC40YDQvdC+0Lwg0LTQvtC80LUnLFxuXHQnNTU4NDAxMDgwODAwJzogJ9Ce0YLQutCw0Lcg0L7QtNCw0YDRj9C10LzQvtCz0L4g0L/RgNC40L3Rj9GC0Ywg0LTQsNGAICjQvtGC0LrQsNC3INC+0YIg0LTQsNGA0LApJyxcblx0JzU1ODQwMTA4MDkwMCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQviDQvdC+0LLQsNGG0LjQuCcsXG5cdCc1NTg0MDEwODEwMDAnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L4g0YDQsNC30LTQtdC70LUg0L3QsNGB0LvQtdC00YHRgtCy0LXQvdC90L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG5cdCc1NTg0MDEwODExMDAnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDRg9C/0LvQsNGC0LUg0LDQu9C40LzQtdC90YLQvtCyJyxcblx0JzU1ODQwMTA4MTIwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC90LDQu9C40YfQuNC1LCDQstC+0LfQvdC40LrQvdC+0LLQtdC90LjQtSwg0L/QtdGA0LXRhdC+0LQg0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjykg0LLQtdGJ0L3QvtCz0L4g0L/RgNCw0LLQsCDQvdCwINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LIg0L/QvtC70YzQt9GDINC30LDRj9Cy0LjRgtC10LvRjycsXG5cdCc1NTg0MDEwODk5MDAnOiAn0JjQvdC+0Lkg0LTQvtC60YPQvNC10L3RgicsXG5cdCc1NTg0MDIwMDAwMDAnOiAn0KHQntCf0KPQotCh0KLQktCj0K7QqdCY0JUg0Jgg0JTQntCf0J7Qm9Cd0JjQotCV0JvQrNCd0KvQlSDQlNCe0JrQo9Cc0JXQndCi0KsnLFxuXHQnNTU4NDAyMDEwMDAwJzogJ9Ch0L7Qs9C70LDRgdC40LUg0YHRg9C/0YDRg9Cz0LAg0L3QsCDRgdC+0LLQtdGA0YjQtdC90LjQtSDRgdC00LXQu9C60LgnLFxuXHQnNTU4NDAyMDIwMDAwJzogJ9Ch0L7Qs9C70LDRgdC40LUg0L7RgNCz0LDQvdC+0LIg0L7Qv9C10LrQuCDQuCDQv9C+0L/QtdGH0LjRgtC10LvRjNGB0YLQstCwJyxcblx0JzU1ODQwMjAzMDAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQt9Cw0LrQu9GO0YfQtdC90LjQuCDQsdGA0LDQutCwJyxcblx0JzU1ODQwMjA0MDAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDRgNCw0YHRgtC+0YDQttC10L3QuNC4INCx0YDQsNC60LAnLFxuXHQnNTU4NDAyMDUwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7QtNC+0LHRgNC10L3QuNC4ICjQviDRgdC+0LLQtdGA0YjQtdC90LjQuCkg0YHQtNC10LvQutC4Jyxcblx0JzU1ODQwMjA2MDAwMCc6ICfQodC/0YDQsNCy0LrQsCDQviDRgdGC0L7QuNC80L7RgdGC0LggKNGB0L/RgNCw0LLQutCwINC+INGB0L7QvtGC0L3QvtGI0LXQvdC40Lgg0YHRgtC+0LjQvNC+0YHRgtC4INC+0YLRh9GD0LbQtNCw0LXQvNC+0LPQviDQvtCx0YrQtdC60YLQsCDQuCDQsdCw0LvQsNC90YHQvtCy0L7QuSDRgdGC0L7QuNC80L7RgdGC0Lgg0LjQvNGD0YnQtdGB0YLQstCwINC40LvQuCDQsNC60YLQuNCy0L7QsiDRhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC+0LHRidC10YHRgtCy0LApJyxcblx0JzU1ODQwMjA3MDAwMCc6ICfQodC/0YDQsNCy0LrQsCDQviDQt9Cw0LjQvdGC0LXRgNC10YHQvtCy0LDQvdC90YvRhSDQu9C40YbQsNGFINCyINGB0LTQtdC70LrQtScsXG5cdCc1NTg0MDIwODAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQtNC+0LzQvtCy0L7QuSDQutC90LjQs9C4ICjRgdCy0LXQtNC10L3QuNGPINC+INC70LjRhtCw0YUsINGB0L7RhdGA0LDQvdGP0Y7RidC40YUg0L/RgNCw0LLQviDQv9GA0L7QttC40LLQsNC90LjRjyDQsiDQttC40LvQvtC8INC/0L7QvNC10YnQtdC90LjQuCDQv9C+0YHQu9C1INC/0LXRgNC10YXQvtC00LAg0L/RgNCw0LLQsCDQvdCwINC90LXQs9C+KScsXG5cdCc1NTg0MDIwOTAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQu9C40YbQtdCy0L7Qs9C+INGB0YfQtdGC0LAgKNGB0LLQtdC00LXQvdC40Y8g0L4g0LvQuNGG0LDRhSwg0YHQvtGF0YDQsNC90Y/RjtGJ0LjRhSDQv9GA0LDQstC+INC/0YDQvtC20LjQstCw0L3QuNGPINCyINC20LjQu9C+0Lwg0L/QvtC80LXRidC10L3QuNC4INC/0L7RgdC70LUg0L/QtdGA0LXRhdC+0LTQsCDQv9GA0LDQstCwINC90LAg0L3QtdCz0L4pJyxcblx0JzU1ODQwMjEwMDAwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INC+INGA0LXQt9GD0LvRjNGC0LDRgtCw0YUg0YLQvtGA0LPQvtCyJyxcblx0JzU1ODQwMjExMDAwMCc6ICfQm9C40YbQtdC90LfQuNGPICjQu9C40YbQtdC90LfQuNGPINC90LAg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40LUg0L7Qv9GA0LXQtNC10LvQtdC90L3Ri9GFINCy0LjQtNC+0LIg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4KScsXG5cdCc1NTg0MDIxMjAwMDAnOiAn0J/RgNC+0LXQutGC0L3QsNGPINC00LXQutC70LDRgNCw0YbQuNGPJyxcblx0JzU1ODQwMjEzMDAwMCc6ICfQntGC0LrQsNC3INC+0YIg0L/RgNC10LjQvNGD0YnQtdGB0YLQstC10L3QvdC+0LPQviDQv9GA0LDQstCwINC/0L7QutGD0L/QutC4ICjQtNC70Y8g0YPRh9Cw0YHRgtC90LjQutC+0LIg0LTQvtC70LXQstC+0Lkg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0LgsINC00LvRjyDRgdGD0LHRitC10LrRgtCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQv9GA0Lgg0L/RgNC+0LTQsNC20LUg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAg0LjQtyDRgdC+0YHRgtCw0LLQsCDQt9C10LzQtdC70Ywg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPKScsXG5cdCc1NTg0MDIxNDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0YHQvtC30LTQsNC90LjQuCDRjtGA0LjQtNC40YfQtdGB0LrQvtCz0L4g0LvQuNGG0LAnLFxuXHQnNTU4NDAyMTUwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INGA0LXQvtGA0LPQsNC90LjQt9Cw0YbQuNC4INGO0YDQuNC00LjRh9C10YHQutC+0LPQviDQu9C40YbQsCcsXG5cdCc1NTg0MDIxNjAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0LvQuNC60LLQuNC00LDRhtC40Lgg0Y7RgNC40LTQuNGH0LXRgdC60L7Qs9C+INC70LjRhtCwJyxcblx0JzU1ODQwMjE3MDAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINGD0YLQstC10YDQttC00LXQvdC40Lgg0L7RhtC10L3QutC4INC40LzRg9GJ0LXRgdGC0LLQsCAo0YDQtdGI0LXQvdC40LUg0L7QsSDRg9GC0LLQtdGA0LbQtNC10L3QuNC4INC+0YbQtdC90LrQuCDQvdC10LTQtdC90LXQttC90YvRhSDQstC60LvQsNC00L7QsiDQsiDRg9GB0YLQsNCy0L3Ri9C5INC60LDQv9C40YLQsNC7INC+0LHRidC10YHRgtCy0LApJyxcblx0JzU1ODQwMjE4MDAwMCc6ICfQmNGB0L/QvtC70L3QuNGC0LXQu9GM0L3Ri9C5INC70LjRgdGCJyxcblx0JzU1ODQwMjE5MDAwMCc6ICfQlNC+0LPQvtCy0L7RgCDQv9C+0YDRg9GH0LXQvdC40Y8nLFxuXHQnNTU4NDAyMjAwMDAwJzogJ9CR0YPRhdCz0LDQu9GC0LXRgNGB0LrQuNC5INCx0LDQu9Cw0L3RgScsXG5cdCc1NTg0MDIyMTAwMDAnOiAn0JfQsNC60LvQsNC00L3QsNGPJyxcblx0JzU1ODQwMjIyMDAwMCc6ICfQlNC+0LHQsNCy0L7Rh9C90YvQuSDQu9C40YHRgiDQuiDQt9Cw0LrQu9Cw0LTQvdC+0LknLFxuXHQnNTU4NDAyMjMwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0YDQtdC10YHRgtGA0LAg0LzRg9C90LjRhtC40L/QsNC70YzQvdC+0Lkg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0LgnLFxuXHQnNTU4NDAyMjQwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0YDQtdC10YHRgtGA0LAg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Lgg0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnNTU4NDAyMjUwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0YDQtdC10YHRgtGA0LAg0YTQtdC00LXRgNCw0LvRjNC90L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG5cdCc1NTg0MDIyNjAwMDAnOiAn0JbQuNC70LjRidC90YvQuSDRgdC10YDRgtC40YTQuNC60LDRgicsXG5cdCc1NTg0MDIyNzAwMDAnOiAn0JDRg9C00LjRgtC+0YDRgdC60L7QtSDQt9Cw0LrQu9GO0YfQtdC90LjQtScsXG5cdCc1NTg0MDIyODAwMDAnOiAn0J7RgtGH0LXRgiDQviDQv9GA0L7QstC10LTQtdC90LjQuCDQvdC10LfQsNCy0LjRgdC40LzQvtC5INC+0YbQtdC90LrQuCAo0LDQutGCINC+0YbQtdC90LrQuCknLFxuXHQnNTU4NDAyMzkwMDAwJzogJ9CQ0LrRgiDQuNC90LLQtdC90YLQsNGA0LjQt9Cw0YbQuNC4Jyxcblx0JzU1ODQwMjQwMDAwMCc6ICfQntGF0YDQsNC90L3QvtC1INC+0LHRj9C30LDRgtC10LvRjNGB0YLQstC+INGB0L7QsdGB0YLQstC10L3QvdC40LrQsCDQvtCx0YrQtdC60YLQsCDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8nLFxuXHQnNTU4NDAyOTkwMDAwJzogJ9CY0L3QvtC5INC00L7QutGD0LzQtdC90YInLFxuXHQnNTU4NDAzMDAwMDAwJzogJ9CU0J7QmtCj0JzQldCd0KLQqywg0KHQntCU0JXQoNCW0JDQqdCY0JUg0KHQktCV0JTQldCd0JjQryDQldCT0KDQnycsXG5cdCc1NTg0MDMwMTAwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LLQsCcsXG5cdCc1NTg0MDMwMjAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0L4g0L/RgNCw0LLQsNGFINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcblx0JzU1ODQwMzAzMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQviDQv9C10YDQtdGF0L7QtNC1INC/0YDQsNCyINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcblx0JzU1ODQwMzA0MDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQviDQv9GA0LDQstCw0YUg0L7RgtC00LXQu9GM0L3QvtCz0L4g0LvQuNGG0LAg0L3QsCDQuNC80LXRjtGJ0LjQtdGB0Y8g0YMg0L3QtdCz0L4g0L7QsdGK0LXQutGC0Ysg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuXHQnNTU4NDAzMDUwMDAwJzogJ9CS0YvQv9C40YHQutCwINC+INC/0YDQuNC30L3QsNC90LjQuCDQv9GA0LDQstC+0L7QsdC70LDQtNCw0YLQtdC70Y8g0L3QtdC00LXQtdGB0L/QvtGB0L7QsdC90YvQvCDQuNC70Lgg0L7Qs9GA0LDQvdC40YfQtdC90L3QviDQtNC10LXRgdC/0L7RgdC+0LHQvdGL0LwnLFxuXHQnNTU4NDAzMDYwMDAwJzogJ9Ch0L/RgNCw0LLQutCwINC+INGB0L7QtNC10YDQttCw0L3QuNC4INC/0YDQsNCy0L7Rg9GB0YLQsNC90LDQstC70LjQstCw0Y7RidC40YUg0LTQvtC60YPQvNC10L3RgtC+0LIg0L3QsCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuXHQnNTU4NDAzMDcwMDAwJzogJ9Ch0L/RgNCw0LLQutCwINC+INC70LjRhtCw0YUsINC/0L7Qu9GD0YfQuNCy0YjQuNGFINGB0LLQtdC00LXQvdC40Y8g0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG5cdCc1NTg0MDMwODAwMDAnOiAn0JrQvtC/0LjQuCDQtNC+0LPQvtCy0L7RgNC+0LIg0Lgg0LjQvdGL0YUg0LTQvtC60YPQvNC10L3RgtC+0LIsINCy0YvRgNCw0LbQsNGO0YnQuNGFINGB0L7QtNC10YDQttCw0L3QuNC1INC+0LTQvdC+0YHRgtC+0YDQvtC90L3QuNGFINGB0LTQtdC70L7Quiwg0YHQvtCy0LXRgNGI0LXQvdC90YvRhSDQsiDQv9GA0L7RgdGC0L7QuSDQv9C40YHRjNC80LXQvdC90L7QuSDRhNC+0YDQvNC1Jyxcblx0JzU1ODQwMzA5MDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INCV0JPQoNCfINC+INC/0YDQuNC90Y/RgtC40Lgg0L3QsCDRg9GH0ZHRgiDQsdC10YHRhdC+0LfRj9C50L3QvtCz0L4g0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuXHQnNTU4NDAzMTAwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0JXQk9Cg0J8g0L4g0L/RgNC40L3Rj9GC0LjQuCDQvdCwINGD0YfRkdGCINCx0LXRgdGF0L7Qt9GP0LnQvdC+0LPQviDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCwg0L7RgiDQv9GA0LDQstCwINGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4INC90LAg0LrQvtGC0L7RgNGL0Lkg0YHQvtCx0YHRgtCy0LXQvdC90LjQuiDQvtGC0LrQsNC30LDQu9GB0Y8nLFxuXHQnNTU4NDAzMTEwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0JXQk9Cg0J8g0L4g0LHQtdGB0YXQvtC30Y/QudC90L7QvCDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCwg0L/RgNC40L3Rj9GC0L7QvCDQvdCwINGD0YfRkdGCJyxcblx0JzU1ODQwMzEyMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INC10LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwsINGD0LTQvtGB0YLQvtCy0LXRgNGP0Y7RidCw0Y8g0L/RgNC+0LLQtdC00LXQvdC40LUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0LLQvtC30L3QuNC60L3QvtCy0LXQvdC40Y8g0LggKNC40LvQuCkg0L/QtdGA0LXRhdC+0LTQsCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQvicsXG5cdCc1NTg0MDM5OTAwMDAnOiAn0JjQvdC+0Lkg0LTQvtC60YPQvNC10L3RgicsXG5cdCc1NTg0MDQwMDAwMDAnOiAn0KHQvtCz0LvQsNGI0LXQvdC40Y8g0Lgg0YHQvtCz0LvQsNGB0LjRjyDQvtCxINC+0LHRgNCw0LfQvtCy0LDQvdC40Lgg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuXHQnNTU4NDA0MDEwMDAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+INGA0LDQt9C00LXQu9C1LCDQvtCxINC+0LHRitC10LTQuNC90LXQvdC40LgsINC+INC/0LXRgNC10YDQsNGB0L/RgNC10LTQtdC70LXQvdC40Lgg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LIg0LjQu9C4INC+INCy0YvQtNC10LvQtSDQuNC3INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcblx0JzU1ODQwNDAyMDAwMCc6ICfQodC+0LPQu9Cw0YHQuNC1INC90LAg0L7QsdGA0LDQt9C+0LLQsNC90LjQtSDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG5cdCc1NTg0MDQwMzAwMDAnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDQvtCx0YDQsNC30L7QstCw0L3QuNC4INC+0LHRidC10Lkg0LTQvtC70LXQstC+0Lkg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Lgg0L3QsCDQt9C10LzQtdC70YzQvdGL0Lkg0YPRh9Cw0YHRgtC+0LosINC+0LHRgNCw0LfRg9C10LzRi9C5INC/0YDQuCDQstGL0LTQtdC70LUg0LXQs9C+INCyINGB0YfQtdGCINC30LXQvNC10LvRjNC90L7QuSDQtNC+0LvQuCDQuNC70Lgg0LfQtdC80LXQu9GM0L3Ri9GFINC00L7Qu9C10LknLFxuXHQnNTU4NDA0MDQwMDAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0L7QsdGA0LDQt9C+0LLQsNC90LjQuCDQvtCx0YnQtdC5INGB0L7QstC80LXRgdGC0L3QvtC5INGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4INC90LAg0LfQtdC80LXQu9GM0L3Ri9C5INGD0YfQsNGB0YLQvtC6LCDQvtCx0YDQsNC30YPQtdC80YvQuSDQv9GA0Lgg0LLRi9C00LXQu9C1INC10LPQviDQsiDRgdGH0LXRgiDQt9C10LzQtdC70YzQvdC+0Lkg0LTQvtC70Lgg0LjQu9C4INC30LXQvNC10LvRjNC90YvRhSDQtNC+0LvQtdC5Jyxcblx0JzU1ODQwNTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0YssINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40LUg0LLQvtC30L3QuNC60L3QvtCy0LXQvdC40LUg0L/RgNCw0LLQsCDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAg0LIg0YHQuNC70YMg0YTQtdC00LXRgNCw0LvRjNC90L7Qs9C+INC30LDQutC+0L3QsCDQstC90LUg0LfQsNCy0LjRgdC40LzQvtGB0YLQuCDQvtGCINC80L7QvNC10L3RgtCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INGN0YLQvtCz0L4g0L/RgNCw0LLQsCDQsiDQldCT0KDQnycsXG5cdCc1NTg0MDUwMTAwMDAnOiAn0JrQvtC/0LjRjyDRgNC10YjQtdC90LjRjyDQviDQsdC10LfQstC+0LfQvNC10LfQtNC90L7QuSDQv9C10YDQtdC00LDRh9C1INCy0L7QtdC90L3QvtCz0L4g0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAg0LjQtyDRhNC10LTQtdGA0LDQu9GM0L3QvtC5INGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4INCyINGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtGMINGB0YPQsdGK0LXQutGC0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4IC0g0LPQvtGA0L7QtNCwINGE0LXQtNC10YDQsNC70YzQvdC+0LPQviDQt9C90LDRh9C10L3QuNGPINCc0L7RgdC60LLRiyDQuNC70Lgg0KHQsNC90LrRgi3Qn9C10YLQtdGA0LHRg9GA0LPQsCDQu9C40LHQviDQvNGD0L3QuNGG0LjQv9Cw0LvRjNC90YPRjiDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLRjCcsXG5cdCc1NTg0MDUwMjAwMDAnOiAn0J/QvtC00LvQuNC90L3QuNC6INC40LvQuCDQutC+0L/QuNGPINC/0LjRgdGM0LzQsCDQvtGA0LPQsNC90LAg0LjRgdC/0L7Qu9C90LjRgtC10LvRjNC90L7QuSDQstC70LDRgdGC0Lgg0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LggLSDQs9C+0YDQvtC00LAg0YTQtdC00LXRgNCw0LvRjNC90L7Qs9C+INC30L3QsNGH0LXQvdC40Y8g0JzQvtGB0LrQstGLINC40LvQuCDQodCw0L3QutGCLdCf0LXRgtC10YDQsdGD0YDQs9CwINC70LjQsdC+INC+0YDQs9Cw0L3QsCDQvNC10YHRgtC90L7Qs9C+INGB0LDQvNC+0YPQv9GA0LDQstC70LXQvdC40Y8g0LzRg9C90LjRhtC40L/QsNC70YzQvdC+0LPQviDQvtCx0YDQsNC30L7QstCw0L3QuNGPINC+INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQuCDQs9GA0LDQvdC40YYg0L7QsdGA0LDQt9GD0LXQvNC+0LPQviDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDRgSDQv9GA0LjQu9C+0LbQtdC90LjQtdC8INGB0L7Qs9C70LDRgdC+0LLQsNC90L3QvtCz0L4g0L/RgNC+0LXQutGC0LAg0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwINCyINGB0LvRg9GH0LDQtSwg0LXRgdC70Lgg0LDQutGCINGB0L7Qs9C70LDRgdC+0LLQsNC90LjRjyDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAg0L3QtSDQt9Cw0LLQtdGA0LXQvSDQv9C+0LTQv9C40YHRjNGOINGD0L/QvtC70L3QvtC80L7Rh9C10L3QvdC+0LPQviDQtNC+0LvQttC90L7RgdGC0L3QvtCz0L4g0LvQuNGG0LAg0YHQvtC+0YLQstC10YLRgdGC0LLRg9GO0YnQtdCz0L4g0L7RgNCz0LDQvdCwJyxcblx0JzU1ODQwNTAzMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC40LfRitGP0YLQuNC4INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyINC4ICjQuNC70LgpINGA0LDRgdC/0L7Qu9C+0LbQtdC90L3Ri9GFINC90LAg0L3QuNGFINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAg0LIg0YbQtdC70Y/RhSDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtC70LjQvNC/0LjQudGB0LrQuNGFINC+0LHRitC10LrRgtC+0LInLFxuXHQnNTU4NDA1MDQwMDAwJzogJ9Ca0L7Qv9C40Y8g0LDQutGC0LAg0L/RgNC40LXQvNCwLdC/0LXRgNC10LTQsNGH0Lgg0L7QsdGK0LXQutGC0L7QsiDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCwg0LIg0L7RgtC90L7RiNC10L3QuNC4INC60L7RgtC+0YDRi9GFINC/0YDQuNC90Y/RgtC+INGA0LXRiNC10L3QuNC1INC+0LEg0LjQt9GK0Y/RgtC40Lgg0LIg0YbQtdC70Y/RhSDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtC70LjQvNC/0LjQudGB0LrQuNGFINC+0LHRitC10LrRgtC+0LInLFxuXHQnNTU4NDA1OTkwMDAwJzogJ9CY0L3Ri9C1INC00L7QutGD0LzQtdC90YLRiywg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQtSDQstC+0LfQvdC40LrQvdC+0LLQtdC90LjQtSDQv9GA0LDQstCwINGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4INCyINC+0YLQvdC+0YjQtdC90LjQuCDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDQsiDRgdC40LvRgyDRhNC10LTQtdGA0LDQu9GM0L3QvtCz0L4g0LfQsNC60L7QvdCwINCy0L3QtSDQt9Cw0LLQuNGB0LjQvNC+0YHRgtC4INC+0YIg0LzQvtC80LXQvdGC0LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0Y3RgtC+0LPQviDQv9GA0LDQstCwINCyINCV0JPQoNCfJyxcblx0JzU1ODUwMDAwMDAwMCc6ICfQoNC10YjQtdC90LjRjywg0YPQstC10LTQvtC80LvQtdC90LjRjywg0YDQsNGB0L/QuNGB0LrQuCcsXG5cdCc1NTg1MDEwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLINC+INGA0LXQt9GD0LvRjNGC0LDRgtCw0YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INGD0YfRkdGC0LAnLFxuXHQnNTU4NTAxMDEwMDAwJzogJ9Cg0JXQqNCV0J3QmNCvJyxcblx0JzU1ODUwMTAxMDEwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INC30LDQv9GA0LDRiNC40LLQsNC10LzRi9GFINGB0LLQtdC00LXQvdC40LknLFxuXHQnNTU4NTAxMDEwMjAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC40YHQv9GA0LDQstC70LXQvdC40Lgg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQvtGI0LjQsdC60LgnLFxuXHQnNTU4NTAxMDEwMzAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC40YHQv9GA0LDQstC70LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60LgnLFxuXHQnNTU4NTAxMDEwNDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC4INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L7RiNC40LHQvtC6Jyxcblx0JzU1ODUwMTAxMDUwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQvtGB0YPRidC10YHRgtCy0LvQtdC90LjQuCDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INC/0YDQvtGG0LXQtNGD0YDRiycsXG5cdCc1NTg1MDEwMTA2MDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QuNC4INC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L/RgNC+0YbQtdC00YPRgNGLJyxcblx0JzU1ODUwMTAxMDcwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDRgdC90Y/RgtC40Lgg0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QuNGPJyxcblx0JzU1ODUwMTAxMDgwMCc6ICfQoNC10YjQtdC90LjQtSDQviDRgdC90Y/RgtC40Lgg0YEg0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INGD0YfRkdGC0LAg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LIg0YHQviDRgdGC0LDRgtGD0YHQvtC8IMKr0LLRgNC10LzQtdC90L3Ri9C1wrsg0L/QviDQt9Cw0Y/QstC70LXQvdC40Y4g0LfQsNC40L3RgtC10YDQtdGB0L7QstCw0L3QvdC+0LPQviDQu9C40YbQsCcsXG5cdCc1NTg1MDEwMTA5MDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0LLRi9C00LDRh9C1INC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDQv9Cw0YHQv9C+0YDRgtCwJyxcblx0JzU1ODUwMTAxMTAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNC4INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L/RgNC+0YbQtdC00YPRgNGLJyxcblx0JzU1ODUwMTAxMTEwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINCw0L3QvdGD0LvQuNGA0L7QstCw0L3QuNC4INC60LDQtNCw0YHRgtGA0L7QstGL0YUg0YHQstC10LTQtdC90LjQuScsXG5cdCc1NTg1MDEwMTEyMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtGC0LrQu9C+0L3QtdC90LjQuCDQt9Cw0Y/QstC70LXQvdC40Y8g0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4Jyxcblx0JzU1ODUwMTAxMTMwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INC30LDQv9C40YHQuCDQviDQvdCw0LvQuNGH0LjQuCDQstC+0LfRgNCw0LbQtdC90LjRjycsXG5cdCc1NTg1MDEwMTE0MDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0L/QvtCz0LDRiNC10L3QuNC4INC30LDQv9C40YHQuCDQviDQvdCw0LvQuNGH0LjQuCDQstC+0LfRgNCw0LbQtdC90LjRjycsXG5cdCc1NTg1MDEwMTE1MDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQt9Cw0L/QuNGB0Lgg0L4g0LfQsNGP0LLQu9C10L3QuNC4INC+INC90LXQstC+0LfQvNC+0LbQvdC+0YHRgtC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4Jyxcblx0JzU1ODUwMTAxMTYwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQv9C+0LPQsNGI0LXQvdC40Lgg0LfQsNC/0LjRgdC4INC+INC30LDRj9Cy0LvQtdC90LjQuCDQviDQvdC10LLQvtC30LzQvtC20L3QvtGB0YLQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCcsXG5cdCc1NTg1MDEwMjAwMDAnOiAn0KPQktCV0JTQntCc0JvQldCd0JjQrycsXG5cdCc1NTg1MDEwMjAxMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINC+0YLRgdGD0YLRgdGC0LLQuNC4INCyINCT0JrQnSDQt9Cw0L/RgNCw0YjQuNCy0LDQtdC80YvRhSDRgdCy0LXQtNC10L3QuNC5Jyxcblx0JzU1ODUwMTAyMDIwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgdGD0YnQtdGB0YLQstC70ZHQvdC90L7QvCDQutCw0LTQsNGB0YLRgNC+0LLQvtC8INGD0YfRkdGC0LUnLFxuXHQnNTU4NTAxMDIwMzAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0L/RgNC40LXQvNC1INC00L7QutGD0LzQtdC90YLQvtCyINC00LvRjyDQstC90LXRgdC10L3QuNGPINCyINCV0LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAINC+0LHRitC10LrRgtC+0LIg0LrQsNC/0LjRgtCw0LvRjNC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwICjQtNCw0LvQtdC1IC0g0JXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YApINGB0LLQtdC00LXQvdC40Lkg0L7QsSDQntCa0KEnLFxuXHQnNTU4NTAxMDIwNDAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0L/RgNC40LXQvNC1INC00L7QutGD0LzQtdC90YLQvtCyINC00LvRjyDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNGPINC40Lcg0JXQtNC40L3QvtCz0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YDQtdC10YHRgtGA0LAg0YHQstC10LTQtdC90LjQuSDQvtCxINCe0JrQoScsXG5cdCc1NTg1MDEwMjA1MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINGD0YHRgtGA0LDQvdC10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4INCyINGB0LLQtdC00LXQvdC40Y/RhSDQk9Ca0J0nLFxuXHQnNTU4NTAxMDIwNjAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0LLRi9C00LDRh9C1INGB0LLQtdC00LXQvdC40Lkg0L7QsSDQntCa0KEnLFxuXHQnNTU4NTAxMDIwNzAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QuNC4INC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L/RgNC+0YbQtdC00YPRgNGLJyxcblx0JzU1ODUwMTAyMDgwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNC4INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L/RgNC+0YbQtdC00YPRgNGLJyxcblx0JzU1ODUwMTAyMDkwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LLQsCcsXG5cdCc1NTg1MDEwMjEwMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQv9GA0LjQvtGB0YLQsNC90L7QstC70LXQvdC40Lgg0L/RgNC40L3Rj9GC0LjRjyDQvdCwINGD0YfRkdGCINC40LzRg9GJ0LXRgdGC0LLQsCDQsiDQutCw0YfQtdGB0YLQstC1INCx0LXRgdGF0L7Qt9GP0LnQvdC+0LPQvicsXG5cdCc1NTg1MDEwMjExMDAnOiAn0KHQvtC+0LHRidC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC/0YDQuNC90Y/RgtC40Lgg0L3QsCDRg9GH0ZHRgiDQuNC80YPRidC10YHRgtCy0LAg0LIg0LrQsNGH0LXRgdGC0LLQtSDQsdC10YHRhdC+0LfRj9C50L3QvtCz0L4nLFxuXHQnNTU4NTAxMDIxMjAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0YHQvdGP0YLQuNC4INGBINGD0YfRkdGC0LAg0LjQvNGD0YnQtdGB0YLQstCwINCyINC60LDRh9C10YHRgtCy0LUg0LHQtdGB0YXQvtC30Y/QudC90L7Qs9C+Jyxcblx0JzU1ODUwMTAyMTMwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INCy0L7Qt9Cy0YDQsNGC0LUg0LfQsNGP0LLQu9C10L3QuNGPINC+INC90LDQu9C40YfQuNC4INCy0L7Qt9GA0LDQttC10L3QuNGPINCyINC+0YLQvdC+0YjQtdC90LjQuCDQt9Cw0YDQtdCz0LjRgdGC0YDQuNGA0L7QstCw0L3QvdC+0LPQviDQv9GA0LDQstCwINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQsdC10Lcg0YDQsNGB0YHQvNC+0YLRgNC10L3QuNGPJyxcblx0JzU1ODUwMTAzMDAwMCc6ICfQn9Cg0J7Qp9CY0JUnLFxuXHQnNTU4NTAxMDMwMTAwJzogJ9Cg0LDRgdC/0LjRgdC60LAg0LIg0L/QvtC70YPRh9C10L3QuNC4INGB0L7QvtGC0LLQtdGC0YHRgtCy0YPRjtGJ0LjRhSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQtNC70Y8g0L/RgNC+0LLQtdC00LXQvdC40Y8g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INGD0YfRkdGC0LAnLFxuXHQnNTU4NTAxMDMwMjAwJzogJ9Cf0YDQvtGC0L7QutC+0Lsg0L/RgNC+0LLQtdGA0LrQuCDQtNC+0LrRg9C80LXQvdGC0L7QsicsXG5cdCc1NTg1MDEwMzAzMDAnOiAn0JDQutGCINC+0L/RgNC10LTQtdC70LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDRgdGC0L7QuNC80L7RgdGC0Lgg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuXHQnNTU4NTAxMDMwNDAwJzogJ9Cf0YDQvtGC0L7QutC+0Lsg0LLRi9GP0LLQu9C10L3QuNGPINGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4Jyxcblx0JzU1ODUwMTAzMDUwMCc6ICfQkNC60YIg0L7Qv9GA0LXQtNC10LvQtdC90LjRjyDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INGB0YLQvtC40LzQvtGB0YLQuCDQvtCx0YrQtdC60YLQvtCyINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTg1MDEwMzk5MDAnOiAn0JjQvdGL0LUg0LTQvtC60YPQvNC10L3RgtGLJyxcblx0JzU1ODUwMjAwMDAwMCc6ICfQlNCe0JrQo9Cc0JXQndCi0Ksg0J4g0KDQldCX0KPQm9Cs0KLQkNCi0JDQpSDQoNCV0JPQmNCh0KLQoNCQ0KbQmNCYINCf0KDQkNCSJyxcblx0JzU1ODUwMjAxMDAwMCc6ICfQo9CS0JXQlNCe0JzQm9CV0J3QmNCvLCDQodCe0J7QkdCp0JXQndCY0K8nLFxuXHQnNTU4NTAyMDEwMTAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QuNC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCyJyxcblx0JzU1ODUwMjAxMDIwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INC/0YDQtdC60YDQsNGJ0LXQvdC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LInLFxuXHQnNTU4NTAyMDEwMzAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LfQsNGA0LXQs9C40YHRgtGA0LjRgNC+0LLQsNC90L3Ri9GFINC+0LPRgNCw0L3QuNGH0LXQvdC40Y/RhSAo0L7QsdGA0LXQvNC10L3QtdC90LjRj9GFKSDQv9GA0LDQsicsXG5cdCc1NTg1MDIwMTA0MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INC40LfQvNC10L3QtdC90LjQuSDQsiDQldCT0KDQnycsXG5cdCc1NTg1MDIwMTA1MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINC40YHQv9GA0LDQstC70LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60Lgg0LIg0LfQsNC/0LjRgdGP0YUg0LXQtNC40L3QvtCz0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YDQtdC10YHRgtGA0LAg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCcsXG5cdCc1NTg1MDIwMTA2MDAnOiAn0KHQvtC+0LHRidC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCyJyxcblx0JzU1ODUwMjAxMDcwMCc6ICfQodC+0L7QsdGJ0LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5INC40Lcg0JXQk9Cg0J8nLFxuXHQnNTU4NTAyMDEwODAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQvtGC0YHRg9GC0YHRgtCy0LjQuCDQsiDQldCT0KDQnyDQt9Cw0L/RgNCw0YjQuNCy0LDQtdC80YvRhSDRgdCy0LXQtNC10L3QuNC5Jyxcblx0JzU1ODUwMjAxMDkwMCc6ICfQodC+0L7QsdGJ0LXQvdC40LUg0L4g0L/RgNC40ZHQvNC1INC30LDRj9Cy0LvQtdC90LjRjyDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQstCwLCDQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKSDQv9GA0LDQstCwINC90LAg0L/RgNC10LTQv9GA0LjRj9GC0LjQtSwg0YHQtNC10LvQutC4INGBINC90LjQvCcsXG5cdCc1NTg1MDIwMTEwMDAnOiAn0KHQvtC+0LHRidC10L3QuNC1INC+INC/0L7RgdGC0YPQv9C70LXQvdC40Lgg0LTQvtC60YPQvNC10L3RgtC+0LIg0L3QsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGD0Y4g0YDQtdCz0LjRgdGC0YDQsNGG0LjRjiDQtNC+0LPQvtCy0L7RgNC+0LIg0LzQtdC90Ysg0LggKNC40LvQuCkg0L/QtdGA0LXRhdC+0LTQsCDQv9GA0LDQstCwJyxcblx0JzU1ODUwMjAxMTEwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INCy0L7Qt9Cy0YDQsNGC0LUg0L/RgNC40LvQvtC20LXQvdC90YvRhSDQuiDQt9Cw0Y/QstC70LXQvdC40Y4g0LTQvtC60YPQvNC10L3RgtC+0LIg0LHQtdC3INGA0LDRgdGB0LzQvtGC0YDQtdC90LjRjycsXG5cdCc1NTg1MDIwMTEyMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LXQutGA0LDRidC10L3QuNGPINC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pJyxcblx0JzU1ODUwMjAxMTMwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgtGB0YPRgtGB0YLQstC40Lgg0YHQstC10LTQtdC90LjQuSDQviDQu9C40YbQsNGFLCDQv9C+0LvRg9GH0LjQstGI0LjRhSDRgdCy0LXQtNC10L3QuNGPINC+0LEg0L7QsdGK0LXQutGC0LDRhSDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG5cdCc1NTg1MDIwMTE0MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQstCwINGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4INGB0YPQsdGK0LXQutGC0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC40LvQuCDQvNGD0L3QuNGG0LjQv9Cw0LvRjNC90L7Qs9C+INC+0LHRgNCw0LfQvtCy0LDQvdC40Y8g0L3QsCDQt9C10LzQtdC70YzQvdGL0Lkg0YPRh9Cw0YHRgtC+0Log0LjQu9C4INC30LXQvNC10LvRjNC90YPRjiDQtNC+0LvRjiDQstGB0LvQtdC00YHRgtCy0LjQtSDQvtGC0LrQsNC30LAg0L7RgiDRgdC+0L7RgtCy0LXRgtGB0YLQstGD0Y7RidC10LPQviDQv9GA0LDQstCwINC/0YDQsNCy0L7QvtCx0LvQsNC00LDRgtC10LvQtdC8Jyxcblx0JzU1ODUwMjAxMTUwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INC/0L7RgdGC0YPQv9C70LXQvdC40Lgg0YDQtdGI0LXQvdC40Y8g0YHRg9C00LAsINCy0YHRgtGD0L/QuNCy0YjQtdCz0L4g0LIg0LfQsNC60L7QvdC90YPRjiDRgdC40LvRgywg0YEg0YPQutCw0LfQsNC90LjQtdC8INGB0YDQvtC60LAg0L7QutC+0L3Rh9Cw0L3QuNGPINC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNGPINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCyLCDQsiDRgdC70YPRh9Cw0LUg0LXRgdC70Lgg0L7RgtC60LDQtyDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQsiDQv9GA0LjQt9C90LDQvSDRgdGD0LTQvtC8INC90LXQvtCx0L7RgdC90L7QstCw0L3QvdGL0LwnLFxuXHQnNTU4NTAyMDExNjAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQuNC30LzQtdC90LXQvdC40Lkg0LIg0LXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCDQsiDRgdCy0Y/Qt9C4INGBINC40LfQvNC10L3QtdC90LjQtdC8INGB0L7QtNC10YDQttCw0YnQuNGF0YHRjyDQsiDQsdCw0LfQvtCy0YvRhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0YUg0LjQvdGE0L7RgNC80LDRhtC40L7QvdC90YvRhSDRgNC10YHRg9GA0YHQsNGFINGB0LLQtdC00LXQvdC40Lkg0L4g0L/RgNCw0LLQvtC+0LHQu9Cw0LTQsNGC0LXQu9C1ICjQv9GA0LDQstC+0L7QsdC70LDQtNCw0YLQtdC70Y/RhSknLFxuXHQnNTU4NTAyMDExNzAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LLQvtC30LLRgNCw0YLQtSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQsdC10Lcg0YDQsNGB0YHQvNC+0YLRgNC10L3QuNGPINC/0YDQuCDQvtGC0LrQsNC30LUg0LIg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INGD0YfQtdGC0LAnLFxuXHQnNTU4NTAyMDIwMDAwJzogJ9Cf0KDQntCn0JjQlScsXG5cdCc1NTg1MDIwMjAxMDAnOiAn0KDQsNGB0L/QuNGB0LrQsCDQsiDQv9C+0LvRg9GH0LXQvdC40Lgg0LTQvtC60YPQvNC10L3RgtC+0LIg0L3QsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGD0Y4g0YDQtdCz0LjRgdGC0YDQsNGG0LjRjiDQv9GA0LDQsicsXG5cdCc1NTg1MDIwMjk5MDAnOiAn0JjQvdC+0Lkg0LTQvtC60YPQvNC10L3RgicsXG5cdCc1NTg2MDEwMDAwMDAnOiAn0KDQsNGB0L/QuNGB0LrQsCDQsiDQv9C+0LvRg9GH0LXQvdC40Lgg0LjQt9Cy0LXRidC10L3QuNC5INC+INC/0YDQvtCy0LXQtNC10L3QuNC4INGB0L7QsdGA0LDQvdC40Y8g0L4g0YHQvtCz0LvQsNGB0L7QstCw0L3QuNC4INC80LXRgdGC0L7Qv9C+0LvQvtC20LXQvdC40Y8g0LPRgNCw0L3QuNGGJyxcblx0JzU1ODYwMjAwMDAwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INCy0YDRg9GH0LXQvdC40Lgg0LjQt9Cy0LXRidC10L3QuNGPINC+INC/0YDQvtCy0LXQtNC10L3QuNC4INGB0L7QsdGA0LDQvdC40Y8g0L4g0YHQvtCz0LvQsNGB0L7QstCw0L3QuNC4INC80LXRgdGC0L7Qv9C+0LvQvtC20LXQvdC40Y8g0LPRgNCw0L3QuNGGJyxcblx0JzU1ODYwMzAwMDAwMCc6ICfQmtC+0L/QuNGPINGB0YLRgNCw0L3QuNGG0Ysg0L/QtdGH0LDRgtC90L7Qs9C+INC40LfQtNCw0L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LXQuSDQuNC30LLQtdGJ0LXQvdC40LUg0L4g0L/RgNC+0LLQtdC00LXQvdC40Lgg0YHQvtCx0YDQsNC90LjRjyDQviDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40Lgg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjRjyDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAsINCy0LrQu9GO0YfQsNGPINC/0LXRgNCy0YvQuSDQu9C40YHRgiwg0YHQvtC00LXRgNC20LDRidC10LPQviDRgNC10LrQstC40LfQuNGC0Ysg0YLQsNC60L7Qs9C+INC/0LXRh9Cw0YLQvdC+0LPQviDQuNC30LTQsNC90LjRjycsXG5cdCc1NTg2OTkwMDAwMDAnOiAn0JjQvdGL0LUg0LTQvtC60YPQvNC10L3RgtGLLCDRgdCy0LjQtNC10YLQtdC70YzRgdGC0LLRg9GO0YnQuNC1INC+INGB0L7QsdC70Y7QtNC10L3QuNC4INGD0YHRgtCw0L3QvtCy0LvQtdC90L3QvtCz0L4g0L/QvtGA0Y/QtNC60LAg0LjQt9Cy0LXRidC10L3QuNGPINC30LDQuNC90YLQtdGA0LXRgdC+0LLQsNC90L3Ri9GFINC70LjRhiDQviDQv9GA0L7QstC10LTQtdC90LjQuCDRgdC+0LHRgNCw0L3QuNGPINC+INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQuCDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNGPINCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCdcbn07XG4vL9Ci0LXRgNGA0LjRgtC+0YDQuNCw0LvRjNC90YvQtSDQt9C+0L3RiyDQuCDQt9C+0L3RiyDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LlcbnZhciBkWm9uZSA9IHtcblx0JzIxODAxMDAwMDAwMCc6ICfQotC10YDRgNC40YLQvtGA0LjQsNC70YzQvdGL0LUg0LfQvtC90YsnLFxuXHQnMjE4MDEwMDEwMDAwJzogJ9CW0LjQu9Cw0Y8g0LfQvtC90LAnLFxuXHQnMjE4MDEwMDIwMDAwJzogJ9Ce0LHRidC10YHRgtCy0LXQvdC90L4t0LTQtdC70L7QstCw0Y8g0LfQvtC90LAnLFxuXHQnMjE4MDEwMDMwMDAwJzogJ9Cf0YDQvtC40LfQstC+0LTRgdGC0LLQtdC90L3QsNGPINC30L7QvdCwLCDQt9C+0L3QsCDQuNC90LbQtdC90LXRgNC90L7QuSDQuCDRgtGA0LDQvdGB0L/QvtGA0YLQvdC+0Lkg0LjQvdGE0YDQsNGB0YLRgNGD0LrRgtGD0YAnLFxuXHQnMjE4MDEwMDQwMDAwJzogJ9CX0L7QvdCwINGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0LPQviDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjycsXG5cdCcyMTgwMTAwNTAwMDAnOiAn0JfQvtC90LAg0YDQtdC60YDQtdCw0YbQuNC+0L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCcyMTgwMTAwNjAwMDAnOiAn0JfQvtC90LAg0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80YvRhSDRgtC10YDRgNC40YLQvtGA0LjQuScsXG5cdCcyMTgwMTAwNzAwMDAnOiAn0JfQvtC90LAg0YHQv9C10YbQuNCw0LvRjNC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzIxODAxMDA4MDAwMCc6ICfQl9C+0L3QsCDRgNCw0LfQvNC10YnQtdC90LjRjyDQstC+0LXQvdC90YvRhSDQvtCx0YrQtdC60YLQvtCyJyxcblx0JzIxODAxMDA5MDAwMCc6ICfQmNC90LDRjyDQt9C+0L3QsCcsXG5cdCcyMTgwMjAwMDAwMDAnOiAn0JfQvtC90Ysg0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC4Jyxcblx0JzIxODAyMDAxMDAwMCc6ICfQl9C+0L3RiyDQvtGF0YDQsNC90Ysg0L/RgNC40YDQvtC00L3Ri9GFINC+0LHRitC10LrRgtC+0LInLFxuXHQnMjE4MDIwMDEwMDAxJzogJ9Ci0LXRgNGA0LjRgtC+0YDQuNGPINC+0YHQvtCx0L4g0L7RhdGA0LDQvdGP0LXQvNC+0LPQviDQv9GA0LjRgNC+0LTQvdC+0LPQviDQvtCx0YrQtdC60YLQsCcsXG5cdCcyMTgwMjAwMTAwMDInOiAn0J7RhdGA0LDQvdC90LDRjyDQt9C+0L3QsCDQvtGB0L7QsdC+INC+0YXRgNCw0L3Rj9C10LzQvtCz0L4g0L/RgNC40YDQvtC00L3QvtCz0L4g0L7QsdGK0LXQutGC0LAnLFxuXHQnMjE4MDIwMDEwMDAzJzogJ9CS0L7QtNC+0L7RhdGA0LDQvdC90LDRjyDQt9C+0L3QsCcsXG5cdCcyMTgwMjAwMTAwMDQnOiAn0J/RgNC40LHRgNC10LbQvdCw0Y8g0LfQsNGJ0LjRgtC90LDRjyDQv9C+0LvQvtGB0LAnLFxuXHQnMjE4MDIwMDEwMDA1JzogJ9CX0L7QvdCwINGB0LDQvdC40YLQsNGA0L3QvtC5INC+0YXRgNCw0L3RiyDQuNGB0YLQvtGH0L3QuNC60L7QsiDQstC+0LTQvtGB0L3QsNCx0LbQtdC90LjRjyDQuCDQstC+0LTQvtC/0YDQvtCy0L7QtNC+0LIg0L/QuNGC0YzQtdCy0L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzIxODAyMDAxMDAwNic6ICfQntGB0L7QsdC+INGG0LXQvdC90YvQtSDQt9C10LzQu9C4Jyxcblx0JzIxODAyMDAyMDAwMCc6ICfQl9C+0L3RiyDQvtGF0YDQsNC90Ysg0LjRgdC60YPRgdGB0YLQstC10L3QvdGL0YUg0L7QsdGK0LXQutGC0L7QsicsXG5cdCcyMTgwMjAwMjAwMDEnOiAn0KLQtdGA0YDQuNGC0L7RgNC40Y8g0L7QsdGK0LXQutGC0LAg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPJyxcblx0JzIxODAyMDAyMDAwMic6ICfQl9C+0L3QsCDQvtGF0YDQsNC90Ysg0L7QsdGK0LXQutGC0LAg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPJyxcblx0JzIxODAyMDAyMDAwMyc6ICfQntGF0YDQsNC90L3QsNGPINC30L7QvdCwINCz0LXQvtC00LXQt9C40YfQtdGB0LrQvtCz0L4g0L/Rg9C90LrRgtCwJyxcblx0JzIxODAyMDAyMDAwNCc6ICfQntGF0YDQsNC90L3QsNGPINC30L7QvdCwINGB0YLQsNGG0LjQvtC90LDRgNC90L7Qs9C+INC/0YPQvdC60YLQsCDQvdCw0LHQu9GO0LTQtdC90LjQuSDQt9CwINGB0L7RgdGC0L7Rj9C90LjQtdC8INC+0LrRgNGD0LbQsNGO0YnQtdC5INC/0YDQuNGA0L7QtNC90L7QuSDRgdGA0LXQtNGLJyxcblx0JzIxODAyMDAyMDAwNSc6ICfQntGF0YDQsNC90L3QsNGPINC30L7QvdCwINGC0YDQsNC90YHQv9C+0YDRgtCwJyxcblx0JzIxODAyMDAyMDAwNic6ICfQntGF0YDQsNC90L3QsNGPINC30L7QvdCwINC40L3QttC10L3QtdGA0L3Ri9GFINC60L7QvNC80YPQvdC40LrQsNGG0LjQuScsXG5cdCcyMTgwMjAwMjAwMDcnOiAn0J7RhdGA0LDQvdC90LDRjyDQt9C+0L3QsCDQu9C40L3QuNC5INC4INGB0L7QvtGA0YPQttC10L3QuNC5INGB0LLRj9C30Lgg0Lgg0LvQuNC90LjQuSDQuCDRgdC+0L7RgNGD0LbQtdC90LjQuSDRgNCw0LTQuNC+0YTQuNC60LDRhtC40LgnLFxuXHQnMjE4MDIwMDIwMDA4JzogJ9Cf0YDQuNC00L7RgNC+0LbQvdCw0Y8g0L/QvtC70L7RgdCwJyxcblx0JzIxODAyMDAzMDAwMCc6ICfQl9C+0L3RiyDQt9Cw0YnQuNGC0Ysg0L3QsNGB0LXQu9C10L3QuNGPJyxcblx0JzIxODAyMDAzMDAwMSc6ICfQl9Cw0L/RgNC10YLQvdCw0Y8g0LfQvtC90LAg0L/RgNC4INCy0L7QtdC90L3QvtC8INGB0LrQu9Cw0LTQtScsXG5cdCcyMTgwMjAwMzAwMDInOiAn0JfQsNC/0YDQtdGC0L3Ri9C5INGA0LDQudC+0L0g0L/RgNC4INCy0L7QtdC90L3QvtC8INGB0LrQu9Cw0LTQtScsXG5cdCcyMTgwMjAwMzAwMDMnOiAn0JfQsNCz0YDRj9C30L3QtdC90L3Ri9C1INC30LXQvNC70LgnLFxuXHQnMjE4MDIwMDMwMDA0JzogJ9Ce0YXRgNCw0L3QvdCw0Y8g0LfQvtC90LAg0LfQsNCz0YDRj9C30L3QtdC90L3Ri9GFINC30LXQvNC10LvRjCcsXG5cdCcyMTgwMjAwMzAwMDUnOiAn0KHQsNC90LjRgtCw0YDQvdC+LdC30LDRidC40YLQvdCw0Y8g0LfQvtC90LAg0L/RgNC10LTQv9GA0LjRj9GC0LjQuSwg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsicsXG5cdCcyMTgwMjAwMzAwMDYnOiAn0KHQsNC90LjRgtCw0YDQvdGL0Lkg0YDQsNC30YDRi9CyICjRgdCw0L3QuNGC0LDRgNC90LDRjyDQv9C+0LvQvtGB0LAg0L7RgtGH0YPQttC00LXQvdC40Y8pJyxcblx0JzIxODAyMDAzMDAwNyc6ICfQl9C+0L3QsCDQvtCz0YDQsNC90LjRh9C10L3QuNGPINC+0YIg0L/QtdGA0LXQtNCw0Y7RidC10LPQviDRgNCw0LTQuNC+0YLQtdGF0L3QuNGH0LXRgdC60L7Qs9C+INC+0LHRitC10LrRgtCwJyxcblx0JzIxODAyMDAzMDAwOCc6ICfQoNCw0LnQvtC9INC/0LDQtNC10L3QuNGPINC+0YLQtNC10LvRj9GO0YnQuNGF0YHRjyDRh9Cw0YHRgtC10Lkg0YDQsNC60LXRgicsXG5cdCcyMTgwMjAwNDAwMDAnOiAn0J/RgNC+0YfQuNC1INC30L7QvdGLINGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuCcsXG5cdCcyMTgwMjAwNDAwMDEnOiAn0JfQvtC90LAg0L/Rg9Cx0LvQuNGH0L3QvtCz0L4g0YHQtdGA0LLQuNGC0YPRgtCwJyxcblx0JzIxODAyMDA0MDAwMic6ICfQl9C+0L3QsCDRgNC10LfQtdGA0LLQuNGA0L7QstCw0L3QuNGPINC30LXQvNC10LvRjCcsXG5cdCcyMTgwMjAwNDAwMDMnOiAn0JPQvtGA0L3Ri9C5INC+0YLQstC+0LQnLFxuXHQnMjE4MDIwMDQwMDA0JzogJ9Cf0YDQuNCz0L7RgNC+0LTQvdCw0Y8g0LfQvtC90LAnLFxuXHQnMjE4MDIwMDQwMDA1JzogJ9CX0LXQu9C10L3QsNGPINC30L7QvdCwJyxcblx0JzIxODAyMDA0MDAwNic6ICfQntGB0L7QsdCw0Y8g0Y3QutC+0L3QvtC80LjRh9C10YHQutCw0Y8g0LfQvtC90LAnLFxuXHQnMjE4MDIwMDQwMDA3JzogJ9Cf0L7Qs9GA0LDQvdC40YfQvdCw0Y8g0LfQvtC90LAnLFxuXHQnMjE4MDIwMDQwMDA4JzogJ9Ci0LXRgNGA0LjRgtC+0YDQuNGPINGC0YDQsNC00LjRhtC40L7QvdC90L7Qs9C+INC/0YDQuNGA0L7QtNC+0L/QvtC70YzQt9C+0LLQsNC90LjRjycsXG5cdCcyMTgwMjAwNTAwMDAnOiAn0JjQvdGL0LUg0LfQvtC90Ysg0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC4Jyxcblx0JzIxODAyMDA1MDAwMSc6ICfQmNC90LDRjyDQt9C+0L3QsCDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LgnXHRcdFxufTtcbi8vINCa0LvQsNGB0YHQuNGE0LjQutCw0YLQvtGAINCy0LjQtNC+0LIg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0LfQtdC80LXQu9GMXG52YXIgZFV0aWxpemF0aW9ucyA9IHtcblx0JzE0MTAwMDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8g0Lgg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90YvRhSDRg9Cz0L7QtNC40LknLFxuXHQnMTQxMDAxMDAwMDAwJzogJ9CU0LvRjyDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0L/RgNC+0LjQt9Cy0L7QtNGB0YLQstCwJyxcblx0JzE0MTAwMTAxMDAwMCc6ICfQlNC70Y8g0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0LIg0LrQsNGH0LXRgdGC0LLQtSDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3Ri9GFINGD0LPQvtC00LjQuScsXG5cdCcxNDEwMDEwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC30LTQsNC90LjQuSwg0YHRgtGA0L7QtdC90LjQuSwg0YHQvtC+0YDRg9C20LXQvdC40LksINC40YHQv9C+0LvRjNC30YPQtdC80YvRhSDQtNC70Y8g0L/RgNC+0LjQt9Cy0L7QtNGB0YLQstCwLCDRhdGA0LDQvdC10L3QuNGPINC4INC/0LXRgNCy0LjRh9C90L7QuSDQv9C10YDQtdGA0LDQsdC+0YLQutC4INGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0Lkg0L/RgNC+0LTRg9C60YbQuNC4Jyxcblx0JzE0MTAwMTAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LLQvdGD0YLRgNC40YXQvtC30Y/QudGB0YLQstC10L3QvdGL0YUg0LTQvtGA0L7QsyDQuCDQutC+0LzQvNGD0L3QuNC60LDRhtC40LknLFxuXHQnMTQxMDAxMDQwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQstC+0LTQvdGL0YUg0L7QsdGK0LXQutGC0L7QsicsXG5cdCcxNDEwMDIwMDAwMDAnOiAn0JTQu9GPINCy0LXQtNC10L3QuNGPINC60YDQtdGB0YLRjNGP0L3RgdC60L7Qs9C+ICjRhNC10YDQvNC10YDRgdC60L7Qs9C+KSDRhdC+0LfRj9C50YHRgtCy0LAnLFxuXHQnMTQxMDAzMDAwMDAwJzogJ9CU0LvRjyDQstC10LTQtdC90LjRjyDQu9C40YfQvdC+0LPQviDQv9C+0LTRgdC+0LHQvdC+0LPQviDRhdC+0LfRj9C50YHRgtCy0LAnLFxuXHQnMTQxMDA0MDAwMDAwJzogJ9CU0LvRjyDQstC10LTQtdC90LjRjyDQs9GA0LDQttC00LDQvdCw0LzQuCDRgdCw0LTQvtCy0L7QtNGB0YLQstCwINC4INC+0LPQvtGA0L7QtNC90LjRh9C10YHRgtCy0LAnLFxuXHQnMTQxMDA1MDAwMDAwJzogJ9CU0LvRjyDQstC10LTQtdC90LjRjyDQs9GA0LDQttC00LDQvdCw0LzQuCDQttC40LLQvtGC0L3QvtCy0L7QtNGB0YLQstCwJyxcblx0JzE0MTAwNjAwMDAwMCc6ICfQlNC70Y8g0LTQsNGH0L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAnLFxuXHQnMTQxMDA3MDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQtNGA0LXQstC10YHQvdC+LdC60YPRgdGC0LDRgNC90LjQutC+0LLQvtC5INGA0LDRgdGC0LjRgtC10LvRjNC90L7RgdGC0LgsINC/0YDQtdC00L3QsNC30L3QsNGH0LXQvdC90L7QuSDQtNC70Y8g0LfQsNGJ0LjRgtGLINC30LXQvNC10LvRjCDQvtGCINCy0L7Qt9C00LXQudGB0YLQstC40Y8g0L3QtdCz0LDRgtC40LLQvdGL0YUgKNCy0YDQtdC00L3Ri9GFKSDQv9GA0LjRgNC+0LTQvdGL0YUsINCw0L3RgtGA0L7Qv9C+0LPQtdC90L3Ri9GFINC4INGC0LXRhdC90L7Qs9C10L3QvdGL0YUg0Y/QstC70LXQvdC40LknLFxuXHQnMTQxMDA4MDAwMDAwJzogJ9CU0LvRjyDQvdCw0YPRh9C90L4t0LjRgdGB0LvQtdC00L7QstCw0YLQtdC70YzRgdC60LjRhSDRhtC10LvQtdC5Jyxcblx0JzE0MTAwOTAwMDAwMCc6ICfQlNC70Y8g0YPRh9C10LHQvdGL0YUg0YbQtdC70LXQuScsXG5cdCcxNDEwMTAwMDAwMDAnOiAn0JTQu9GPINGB0LXQvdC+0LrQvtGI0LXQvdC40Y8g0Lgg0LLRi9C/0LDRgdCwINGB0LrQvtGC0LAg0LPRgNCw0LbQtNCw0L3QsNC80LgnLFxuXHQnMTQxMDExMDAwMDAwJzogJ9Ck0L7QvdC0INC/0LXRgNC10YDQsNGB0L/RgNC10LTQtdC70LXQvdC40Y8nLFxuXHQnMTQxMDEyMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC+0YXQvtGC0L3QuNGH0YzQtdCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcblx0JzE0MTAxMzAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgNGL0LHQvdC+0LPQviDRhdC+0LfRj9C50YHRgtCy0LAnLFxuXHQnMTQxMDE0MDAwMDAwJzogJ9CU0LvRjyDQuNC90YvRhSDQstC40LTQvtCyINGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0LPQviDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjycsXG5cdCcxNDIwMDAwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIsINGF0LDRgNCw0LrRgtC10YDQvdGL0YUg0LTQu9GPINC90LDRgdC10LvRkdC90L3Ri9GFINC/0YPQvdC60YLQvtCyJyxcblx0JzE0MjAwMTAwMDAwMCc6ICfQlNC70Y8g0L7QsdGK0LXQutGC0L7QsiDQttC40LvQvtC5INC30LDRgdGC0YDQvtC50LrQuCcsXG5cdCcxNDIwMDEwMTAwMDAnOiAn0JTQu9GPINC40L3QtNC40LLQuNC00YPQsNC70YzQvdC+0Lkg0LbQuNC70L7QuSDQt9Cw0YHRgtGA0L7QudC60LgnLFxuXHQnMTQyMDAxMDIwMDAwJzogJ9CU0LvRjyDQvNC90L7Qs9C+0LrQstCw0YDRgtC40YDQvdC+0Lkg0LfQsNGB0YLRgNC+0LnQutC4Jyxcblx0JzE0MjAwMTAyMDEwMCc6ICfQlNC70Y8g0LzQsNC70L7RjdGC0LDQttC90L7QuSDQt9Cw0YHRgtGA0L7QudC60LgnLFxuXHQnMTQyMDAxMDIwMjAwJzogJ9CU0LvRjyDRgdGA0LXQtNC90LXRjdGC0LDQttC90L7QuSDQt9Cw0YHRgtGA0L7QudC60LgnLFxuXHQnMTQyMDAxMDIwMzAwJzogJ9CU0LvRjyDQvNC90L7Qs9C+0Y3RgtCw0LbQvdC+0Lkg0LfQsNGB0YLRgNC+0LnQutC4Jyxcblx0JzE0MjAwMTAyMDQwMCc6ICfQlNC70Y8g0LjQvdGL0YUg0LLQuNC00L7QsiDQttC40LvQvtC5INC30LDRgdGC0YDQvtC50LrQuCcsXG5cdCcxNDIwMDEwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LTQvtGI0LrQvtC70YzQvdC+0LPQviwg0L3QsNGH0LDQu9GM0L3QvtCz0L4sINC+0LHRidC10LPQviDQuCDRgdGA0LXQtNC90LXQs9C+ICjQv9C+0LvQvdC+0LPQvikg0L7QsdGJ0LXQs9C+INC+0LHRgNCw0LfQvtCy0LDQvdC40Y8nLFxuXHQnMTQyMDAxMDQwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyLCDQtNC+0L/Rg9GB0YLQuNC80YvRhSDQsiDQttC40LvRi9GFINC30L7QvdCw0YUg0Lgg0L3QtSDQv9C10YDQtdGH0LjRgdC70LXQvdC90YvRhSDQsiDQutC70LDRgdGB0LjRhNC40LrQsNGC0L7RgNC1Jyxcblx0JzE0MjAwMjAwMDAwMCc6ICfQlNC70Y8g0L7QsdGK0LXQutGC0L7QsiDQvtCx0YnQtdGB0YLQstC10L3QvdC+LdC00LXQu9C+0LLQvtCz0L4g0LfQvdCw0YfQtdC90LjRjycsXG5cdCcxNDIwMDIwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YHQvtGG0LjQsNC70YzQvdC+0LPQviDQuCDQutC+0LzQvNGD0L3QsNC70YzQvdC+LdCx0YvRgtC+0LLQvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMTQyMDAyMDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC30LTRgNCw0LLQvtC+0YXRgNCw0L3QtdC90LjRjycsXG5cdCcxNDIwMDIwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LrRg9C70YzRgtGD0YDRiycsXG5cdCcxNDIwMDIwNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YLQvtGA0LPQvtCy0LvQuCcsXG5cdCcxNDIwMDIwNDAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YDQvtC30L3QuNGH0L3QvtC5INGC0L7RgNCz0L7QstC70LgnLFxuXHQnMTQyMDAyMDQwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC+0L/RgtC+0LLQvtC5INGC0L7RgNCz0L7QstC70LgnLFxuXHQnMTQyMDAyMDUwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC+0LHRidC10YHRgtCy0LXQvdC90L7Qs9C+INC/0LjRgtCw0L3QuNGPJyxcblx0JzE0MjAwMjA2MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQv9GA0LXQtNC/0YDQuNC90LjQvNCw0YLQtdC70YzRgdC60L7QuSDQtNC10Y/RgtC10LvRjNC90L7RgdGC0LgnLFxuXHQnMTQyMDAyMDcwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGB0YDQtdC00L3QtdCz0L4g0L/RgNC+0YTQtdGB0YHQuNC+0L3QsNC70YzQvdC+0LPQviDQuCDQstGL0YHRiNC10LPQviDQv9GA0L7RhNC10YHRgdC40L7QvdCw0LvRjNC90L7Qs9C+INC+0LHRgNCw0LfQvtCy0LDQvdC40Y8nLFxuXHQnMTQyMDAyMDgwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsNC00LzQuNC90LjRgdGC0YDQsNGC0LjQstC90YvRhSDQt9C00LDQvdC40LknLFxuXHQnMTQyMDAyMDkwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvdCw0YPRh9C90L4t0LjRgdGB0LvQtdC00L7QstCw0YLQtdC70YzRgdC60LjRhSDRg9GH0YDQtdC20LTQtdC90LjQuScsXG5cdCcxNDIwMDIxMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60YPQu9GM0YLQvtCy0YvRhSDQt9C00LDQvdC40LknLFxuXHQnMTQyMDAyMTEwMDAwJzogJ9CU0LvRjyDRgdGC0L7Rj9C90L7QuiDQsNCy0YLQvtC80L7QsdC40LvRjNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcblx0JzE0MjAwMjEyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQtNC10LvQvtCy0L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPLCDQsiDRgtC+0Lwg0YfQuNGB0LvQtSDQvtGE0LjRgdC90YvRhSDRhtC10L3RgtGA0L7QsicsXG5cdCcxNDIwMDIxMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YTQuNC90LDQvdGB0L7QstC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCcxNDIwMDIxNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCz0L7RgdGC0LjQvdC40YYnLFxuXHQnMTQyMDAyMTUwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9C+0LTQt9C10LzQvdGL0YUg0LjQu9C4INC80L3QvtCz0L7RjdGC0LDQttC90YvRhSDQs9Cw0YDQsNC20LXQuScsXG5cdCcxNDIwMDIxNjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3QtNC40LLQuNC00YPQsNC70YzQvdGL0YUg0LPQsNGA0LDQttC10LknLFxuXHQnMTQyMDAyMTcwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC+0LHRidC10YHRgtCy0LXQvdC90L4t0LTQtdC70L7QstC+0LPQviDQt9C90LDRh9C10L3QuNGPLCDQvtCx0LXRgdC/0LXRh9C40LLQsNGO0YnQuNGFINC20LjQt9C90Ywg0LPRgNCw0LbQtNCw0L0nLFxuXHQnMTQyMDAzMDAwMDAwJzogJ9CU0LvRjyDQvtCx0YnQtdCz0L4g0L/QvtC70YzQt9C+0LLQsNC90LjRjyAo0YPQu9C40YfQvdCw0Y8g0YHQtdGC0YwpJyxcblx0JzE0MjAwNDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgdC/0LXRhtC40LDQu9GM0L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMTQyMDA0MDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutC70LDQtNCx0LjRiScsXG5cdCcxNDIwMDQwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60YDQtdC80LDRgtC+0YDQuNC10LInLFxuXHQnMTQyMDA0MDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRgdC60L7RgtC+0LzQvtCz0LjQu9GM0L3QuNC60L7QsicsXG5cdCcxNDIwMDQwNDAwMDAnOiAn0J/QvtC0INC+0LHRitC10LrRgtCw0LzQuCDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtGC0YXQvtC00L7QsiDQv9C+0YLRgNC10LHQu9C10L3QuNGPJyxcblx0JzE0MjAwNDA1MDAwMCc6ICfQn9C+0LQg0LjQvdGL0LzQuCDQvtCx0YrQtdC60YLQsNC80Lgg0YHQv9C10YbQuNCw0LvRjNC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzE0MjAwNTAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LrQvtC80LzRg9C90LDQu9GM0L3Ri9GFLCDRgdC60LvQsNC00YHQutC40YUg0L7QsdGK0LXQutGC0L7QsicsXG5cdCcxNDIwMDYwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LbQuNC70LjRidC90L4t0LrQvtC80LzRg9C90LDQu9GM0L3QvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcblx0JzE0MjAwNzAwMDAwMCc6ICfQlNC70Y8g0LjQvdGL0YUg0LLQuNC00L7QsiDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjywg0YXQsNGA0LDQutGC0LXRgNC90YvRhSDQtNC70Y8g0L3QsNGB0LXQu9GR0L3QvdGL0YUg0L/Rg9C90LrRgtC+0LInLFxuXHQnMTQzMDAwMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC/0YDQvtC80YvRiNC70LXQvdC90L7RgdGC0LgsINGN0L3QtdGA0LPQtdGC0LjQutC4LCDRgtGA0LDQvdGB0L/QvtGA0YLQsCwg0YHQstGP0LfQuCwg0YDQsNC00LjQvtCy0LXRidCw0L3QuNGPLCDRgtC10LvQtdCy0LjQtNC10L3QuNGPLCDQuNC90YTQvtGA0LzQsNGC0LjQutC4LCDQvtCx0LXRgdC/0LXRh9C10L3QuNGPINC60L7RgdC80LjRh9C10YHQutC+0Lkg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4LCDQvtCx0L7RgNC+0L3Riywg0LHQtdC30L7Qv9Cw0YHQvdC+0YHRgtC4INC4INC40L3QvtCz0L4g0YHQv9C10YbQuNCw0LvRjNC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzE0MzAwMTAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/RgNC+0LzRi9GI0LvQtdC90L3Ri9GFINC+0LHRitC10LrRgtC+0LInLFxuXHQnMTQzMDAxMDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9GA0L7QuNC30LLQvtC00YHRgtCy0LXQvdC90YvRhSDQuCDQsNC00LzQuNC90LjRgdGC0YDQsNGC0LjQstC90YvRhSDQt9C00LDQvdC40LksINGB0YLRgNC+0LXQvdC40LksINGB0L7QvtGA0YPQttC10L3QuNC5INC4INC+0LHRgdC70YPQttC40LLQsNGO0YnQuNGFINC40YUg0L7QsdGK0LXQutGC0L7QsicsXG5cdCcxNDMwMDEwMTAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0YDQvtC40LfQstC+0LTRgdGC0LLQtdC90L3Ri9GFINC30LTQsNC90LjQuScsXG5cdCcxNDMwMDEwMTAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60L7QvNC80YPQvdC40LrQsNGG0LjQuScsXG5cdCcxNDMwMDEwMTAzMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0L7QtNGK0LXQt9C00L3Ri9GFINC/0YPRgtC10LknLFxuXHQnMTQzMDAxMDEwNDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRgdC60LvQsNC00YHQutC40YUg0L/QvtC80LXRidC10L3QuNC5Jyxcblx0JzE0MzAwMTAxMDUwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LDQtNC80LjQvdC40YHRgtGA0LDRgtC40LLQvdGL0YUg0LfQtNCw0L3QuNC5Jyxcblx0JzE0MzAwMTAxMDYwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LrRg9C70YzRgtGD0YDQvdC+LdCx0YvRgtC+0LLRi9GFINC30LTQsNC90LjQuScsXG5cdCcxNDMwMDEwMTA3MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINGB0L7QvtGA0YPQttC10L3QuNC5INC/0YDQvtC80YvRiNC70LXQvdC90L7RgdGC0LgnLFxuXHQnMTQzMDAxMDIwMDAwJzogJ9CU0LvRjyDQtNC+0LHRi9GH0Lgg0Lgg0YDQsNC30YDQsNCx0L7RgtC60Lgg0L/QvtC70LXQt9C90YvRhSDQuNGB0LrQvtC/0LDQtdC80YvRhScsXG5cdCcxNDMwMDEwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0L/RgNC+0LzRi9GI0LvQtdC90L3QvtGB0YLQuCcsXG5cdCcxNDMwMDIwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0Y3QvdC10YDQs9C10YLQuNC60LgnLFxuXHQnMTQzMDAyMDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRjdC70LXQutGC0YDQvtGB0YLQsNC90YbQuNC5INC4INC+0LHRgdC70YPQttC40LLQsNGO0YnQuNGFINGB0L7QvtGA0YPQttC10L3QuNC5INC4INC+0LHRitC10LrRgtC+0LInLFxuXHQnMTQzMDAyMDEwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQs9C40LTRgNC+0Y3Qu9C10LrRgtGA0L7RgdGC0LDQvdGG0LjQuScsXG5cdCcxNDMwMDIwMTAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCw0YLQvtC80L3Ri9GFINGB0YLQsNC90YbQuNC5Jyxcblx0JzE0MzAwMjAxMDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0Y/QtNC10YDQvdGL0YUg0YPRgdGC0LDQvdC+0LLQvtC6Jyxcblx0JzE0MzAwMjAxMDQwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/Rg9C90LrRgtC+0LIg0YXRgNCw0L3QtdC90LjRjyDRj9C00LXRgNC90YvRhSDQvNCw0YLQtdGA0LjQsNC70L7QsiDQuCDRgNCw0LTQuNC+0LDQutGC0LjQstC90YvRhSDQstC10YnQtdGB0YLQsiDRjdC90LXRgNCz0LXRgtC40LrQuCcsXG5cdCcxNDMwMDIwMTA1MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGF0YDQsNC90LjQu9C40Ykg0YDQsNC00LjQvtCw0LrRgtC40LLQvdGL0YUg0L7RgtGF0L7QtNC+0LInLFxuXHQnMTQzMDAyMDEwNjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRgtC10L/Qu9C+0LLRi9GFINGB0YLQsNC90YbQuNC5Jyxcblx0JzE0MzAwMjAxMDcwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0YLQuNC/0L7QsiDRjdC70LXQutGC0YDQvtGB0YLQsNC90YbQuNC5Jyxcblx0JzE0MzAwMjAxMDgwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGB0LvRg9C20LjQstCw0Y7RidC40YUg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0L7QsdGK0LXQutGC0L7QsicsXG5cdCcxNDMwMDIwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0Y3Qu9C10LrRgtGA0L7RgdC10YLQtdCy0L7Qs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG5cdCcxNDMwMDIwMjAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCy0L7Qt9C00YPRiNC90YvRhSDQu9C40L3QuNC5INGN0LvQtdC60YLRgNC+0L/QtdGA0LXQtNCw0YfQuCcsXG5cdCcxNDMwMDIwMjAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC90LDQt9C10LzQvdGL0YUg0YHQvtC+0YDRg9C20LXQvdC40Lkg0LrQsNCx0LXQu9GM0L3Ri9GFINC70LjQvdC40Lkg0Y3Qu9C10LrRgtGA0L7Qv9C10YDQtdC00LDRh9C4Jyxcblx0JzE0MzAwMjAyMDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/QvtC00YHRgtCw0L3RhtC40LknLFxuXHQnMTQzMDAyMDIwNDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRgNCw0YHQv9GA0LXQtNC10LvQuNGC0LXQu9GM0L3Ri9GFINC/0YPQvdC60YLQvtCyJyxcblx0JzE0MzAwMjAyMDUwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LTRgNGD0LPQuNGFINGB0L7QvtGA0YPQttC10L3QuNC5INC4INC+0LHRitC10LrRgtC+0LIg0Y3Qu9C10LrRgtGA0L7RgdC10YLQtdCy0L7Qs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG5cdCcxNDMwMDIwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0Y3QvdC10YDQs9C10YLQuNC60LgnLFxuXHQnMTQzMDAzMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGC0YDQsNC90YHQv9C+0YDRgtCwJyxcblx0JzE0MzAwMzAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0Lgg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4INC+0LHRitC10LrRgtC+0LIg0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuXHQnMTQzMDAzMDEwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQttC10LvQtdC30L3QvtC00L7RgNC+0LbQvdGL0YUg0L/Rg9GC0LXQuSDQuCDQuNGFINC60L7QvdGB0YLRgNGD0LrRgtC40LLQvdGL0YUg0Y3Qu9C10LzQtdC90YLQvtCyJyxcblx0JzE0MzAwMzAxMDIwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/QvtC70L7RgSDQvtGC0LLQvtC00LAg0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3Ri9GFINC/0YPRgtC10LknLFxuXHQnMTQzMDAzMDEwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjywg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4LCDRgNCw0YHRiNC40YDQtdC90LjRjyDQuCDRgNC10LrQvtC90YHRgtGA0YPQutGG0LjQuCDRgdGC0YDQvtC10L3QuNC5LCDQt9C00LDQvdC40LksINGB0L7QvtGA0YPQttC10L3QuNC5LCDQsiDRgtC+0Lwg0YfQuNGB0LvQtSDQttC10LvQtdC30L3QvtC00L7RgNC+0LbQvdGL0YUg0LLQvtC60LfQsNC70L7Qsiwg0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3Ri9GFINGB0YLQsNC90YbQuNC5LCDQsCDRgtCw0LrQttC1INGD0YHRgtGA0L7QudGB0YLQsiDQuCDQtNGA0YPQs9C40YUg0L7QsdGK0LXQutGC0L7Qsiwg0L3QtdC+0LHRhdC+0LTQuNC80YvRhSDQtNC70Y8g0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4LCDRgdC+0LTQtdGA0LbQsNC90LjRjywg0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAsINGA0LXQutC+0L3RgdGC0YDRg9C60YbQuNC4LCDRgNC10LzQvtC90YLQsCwg0YDQsNC30LLQuNGC0LjRjyDQvdCw0LfQtdC80L3Ri9GFINC4INC/0L7QtNC30LXQvNC90YvRhSDQt9C00LDQvdC40LksINGB0YLRgNC+0LXQvdC40LksINGB0L7QvtGA0YPQttC10L3QuNC5LCDRg9GB0YLRgNC+0LnRgdGC0LIg0Lgg0LTRgNGD0LPQuNGFINC+0LHRitC10LrRgtC+0LIg0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuXHQnMTQzMDAzMDEwMzAxJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQttC10LvQtdC30L3QvtC00L7RgNC+0LbQvdGL0YUg0LLQvtC60LfQsNC70L7QsicsXG5cdCcxNDMwMDMwMTAzMDInOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90YvRhSDRgdGC0LDQvdGG0LjQuScsXG5cdCcxNDMwMDMwMTAzMDMnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGD0YHRgtGA0L7QudGB0YLQsiDQuCDQtNGA0YPQs9C40YUg0L7QsdGK0LXQutGC0L7Qsiwg0L3QtdC+0LHRhdC+0LTQuNC80YvRhSDQtNC70Y8g0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4LCDRgdC+0LTQtdGA0LbQsNC90LjRjywg0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAsINGA0LXQutC+0L3RgdGC0YDRg9C60YbQuNC4LCDRgNC10LzQvtC90YLQsCwg0YDQsNC30LLQuNGC0LjRjyDQvdCw0LfQtdC80L3Ri9GFINC4INC/0L7QtNC30LXQvNC90YvRhSDQt9C00LDQvdC40LksINGB0YLRgNC+0LXQvdC40LksINGB0L7QvtGA0YPQttC10L3QuNC5LCDRg9GB0YLRgNC+0LnRgdGC0LIg0Lgg0LTRgNGD0LPQuNGFINC+0LHRitC10LrRgtC+0LIg0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuXHQnMTQzMDAzMDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuCDRjdC60YHQv9C70YPQsNGC0LDRhtC40Lgg0L7QsdGK0LXQutGC0L7QsiDQsNCy0YLQvtC80L7QsdC40LvRjNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwINC4INC+0LHRitC10LrRgtC+0LIg0LTQvtGA0L7QttC90L7Qs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG5cdCcxNDMwMDMwMjAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCw0LLRgtC+0LzQvtCx0LjQu9GM0L3Ri9GFINC00L7RgNC+0LMg0Lgg0LjRhSDQutC+0L3RgdGC0YDRg9C60YLQuNCy0L3Ri9GFINGN0LvQtdC80LXQvdGC0L7QsicsXG5cdCcxNDMwMDMwMjAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0L7Qu9C+0YEg0L7RgtCy0L7QtNCwJyxcblx0JzE0MzAwMzAyMDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQtNC+0YDQvtC20L3QvtCz0L4g0YHQtdGA0LLQuNGB0LAg0LIg0L/QvtC70L7RgdCw0YUg0L7RgtCy0L7QtNCwINCw0LLRgtC+0LzQvtCx0LjQu9GM0L3Ri9GFINC00L7RgNC+0LMnLFxuXHQnMTQzMDAzMDIwNDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQtNC+0YDQvtC20L3Ri9GFINGB0L7QvtGA0YPQttC10L3QuNC5Jyxcblx0JzE0MzAwMzAyMDUwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LDQstGC0L7QstC+0LrQt9Cw0LvQvtCyINC4INCw0LLRgtC+0YHRgtCw0L3RhtC40LknLFxuXHQnMTQzMDAzMDIwNjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINCw0LLRgtC+0LzQvtCx0LjQu9GM0L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAg0Lgg0LTQvtGA0L7QttC90L7Qs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG5cdCcxNDMwMDMwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC4INGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCDQvtCx0YrQtdC60YLQvtCyINC80L7RgNGB0LrQvtCz0L4sINCy0L3Rg9GC0YDQtdC90L3QtdCz0L4g0LLQvtC00L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuXHQnMTQzMDAzMDMwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNGB0LrRg9GB0YHRgtCy0LXQvdC90L4g0YHQvtC30LTQsNC90L3Ri9GFINCy0L3Rg9GC0YDQtdC90L3QuNGFINCy0L7QtNC90YvRhSDQv9GD0YLQtdC5Jyxcblx0JzE0MzAwMzAzMDIwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LzQvtGA0YHQutC40YUg0Lgg0YDQtdGH0L3Ri9GFINC/0L7RgNGC0L7Qsiwg0L/RgNC40YfQsNC70L7Qsiwg0L/RgNC40YHRgtCw0L3QtdC5Jyxcblx0JzE0MzAwMzAzMDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQvNC+0YDRgdC60L7Qs9C+LCDQstC90YPRgtGA0LXQvdC90LXQs9C+INCy0L7QtNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcblx0JzE0MzAwMzAzMDQwMCc6ICfQlNC70Y8g0LLRi9C00LXQu9C10L3QuNGPINCx0LXRgNC10LPQvtCy0L7QuSDQv9C+0LvQvtGB0YsnLFxuXHQnMTQzMDAzMDQwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuCDRjdC60YHQv9C70YPQsNGC0LDRhtC40Lgg0L7QsdGK0LXQutGC0L7QsiDQstC+0LfQtNGD0YjQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG5cdCcxNDMwMDMwNDAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCw0Y3RgNC+0L/QvtGA0YLQvtCyINC4INCw0Y3RgNC+0LTRgNC+0LzQvtCyJyxcblx0JzE0MzAwMzA0MDIwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LDRjdGA0L7QstC+0LrQt9Cw0LvQvtCyJyxcblx0JzE0MzAwMzA0MDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LLQt9C70LXRgtC90L4t0L/QvtGB0LDQtNC+0YfQvdGL0YUg0L/QvtC70L7RgScsXG5cdCcxNDMwMDMwNDA0MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC90LDQt9C10LzQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQstC+0LfQtNGD0YjQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG5cdCcxNDMwMDMwNTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC4INGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCDQvtCx0YrQtdC60YLQvtCyINGC0YDRg9Cx0L7Qv9GA0L7QstC+0LTQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG5cdCcxNDMwMDMwNTAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC90LXRhNGC0LXQv9GA0L7QstC+0LTQvtCyJyxcblx0JzE0MzAwMzA1MDIwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LPQsNC30L7Qv9GA0L7QstC+0LTQvtCyJyxcblx0JzE0MzAwMzA1MDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0YLRgNGD0LHQvtC/0YDQvtCy0L7QtNC+0LInLFxuXHQnMTQzMDAzMDUwNDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINGC0YDRg9Cx0L7Qv9GA0L7QstC+0LTQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG5cdCcxNDMwMDMwNjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC4INGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINGC0YDQsNC90YHQv9C+0YDRgtCwJyxcblx0JzE0MzAwNDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgdCy0Y/Qt9C4LCDRgNCw0LTQuNC+0LLQtdGJ0LDQvdC40Y8sINGC0LXQu9C10LLQuNC00LXQvdC40Y8sINC40L3RhNC+0YDQvNCw0YLQuNC60LgnLFxuXHQnMTQzMDA0MDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRjdC60YHQv9C70YPQsNGC0LDRhtC40L7QvdC90YvRhSDQv9GA0LXQtNC/0YDQuNGP0YLQuNC5INGB0LLRj9C30Lgg0Lgg0L7QsdGB0LvRg9C20LjQstCw0L3QuNGPINC70LjQvdC40Lkg0YHQstGP0LfQuCcsXG5cdCcxNDMwMDQwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60LDQsdC10LvRjNC90YvRhSwg0YDQsNC00LjQvtGA0LXQu9C10LnQvdGL0YUg0Lgg0LLQvtC30LTRg9GI0L3Ri9GFINC70LjQvdC40Lkg0YHQstGP0LfQuCDQuCDQu9C40L3QuNC5INGA0LDQtNC40L7RhNC40LrQsNGG0LjQuCDQvdCwINGC0YDQsNGB0YHQsNGFINC60LDQsdC10LvRjNC90YvRhSDQuCDQstC+0LfQtNGD0YjQvdGL0YUg0LvQuNC90LjQuSDRgdCy0Y/Qt9C4INC4INGA0LDQtNC40L7RhNC40LrQsNGG0LjQuCDQuCDQuNGFINC+0YXRgNCw0L3QvdGL0LUg0LfQvtC90YsnLFxuXHQnMTQzMDA0MDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9C+0LTQt9C10LzQvdGL0YUg0LrQsNCx0LXQu9GM0L3Ri9GFINC4INCy0L7Qt9C00YPRiNC90YvRhSDQu9C40L3QuNC5INGB0LLRj9C30Lgg0Lgg0YDQsNC00LjQvtGE0LjQutCw0YbQuNC4INC4INC40YUg0L7RhdGA0LDQvdC90YvQtSDQt9C+0L3RiycsXG5cdCcxNDMwMDQwNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC90LDQt9C10LzQvdGL0YUg0Lgg0L/QvtC00LfQtdC80L3Ri9GFINC90LXQvtCx0YHQu9GD0LbQuNCy0LDQtdC80YvRhSDRg9GB0LjQu9C40YLQtdC70YzQvdGL0YUg0L/Rg9C90LrRgtC+0LIg0L3QsCDQutCw0LHQtdC70YzQvdGL0YUg0LvQuNC90LjRj9GFINGB0LLRj9C30Lgg0Lgg0LjRhSDQvtGF0YDQsNC90L3Ri9C1INC30L7QvdGLJyxcblx0JzE0MzAwNDA1MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L3QsNC30LXQvNC90YvRhSDRgdC+0L7RgNGD0LbQtdC90LjQuSDQuCDQuNC90YTRgNCw0YHRgtGA0YPQutGC0YPRgCDRgdC/0YPRgtC90LjQutC+0LLQvtC5INGB0LLRj9C30LgnLFxuXHQnMTQzMDA0MDYwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINGB0LLRj9C30LgsINGA0LDQtNC40L7QstC10YnQsNC90LjRjywg0YLQtdC70LXQstC40LTQtdC90LjRjywg0LjQvdGE0L7RgNC80LDRgtC40LrQuCcsXG5cdCcxNDMwMDUwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIsINC/0YDQtdC00L3QsNC30L3QsNGH0LXQvdC90YvRhSDQtNC70Y8g0L7QsdC10YHQv9C10YfQtdC90LjRjyDQutC+0YHQvNC40YfQtdGB0LrQvtC5INC00LXRj9GC0LXQu9GM0L3QvtGB0YLQuCcsXG5cdCcxNDMwMDUwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60L7RgdC80L7QtNGA0L7QvNC+0LIsINGB0YLQsNGA0YLQvtCy0YvRhSDQutC+0LzQv9C70LXQutGB0L7QsiDQuCDQv9GD0YHQutC+0LLRi9GFINGD0YHRgtCw0L3QvtCy0L7QuicsXG5cdCcxNDMwMDUwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60L7QvNCw0L3QtNC90L4t0LjQt9C80LXRgNC40YLQtdC70YzQvdGL0YUg0LrQvtC80L/Qu9C10LrRgdC+0LIsINGG0LXQvdGC0YDQvtCyINC4INC/0YPQvdC60YLQvtCyINGD0L/RgNCw0LLQu9C10L3QuNGPINC/0L7Qu9C10YLQsNC80Lgg0LrQvtGB0LzQuNGH0LXRgdC60LjRhSDQvtCx0YrQtdC60YLQvtCyLCDQv9GA0LjQtdC80LAsINGF0YDQsNC90LXQvdC40Y8g0Lgg0L/QtdGA0LXRgNCw0LHQvtGC0LrQuCDQuNC90YTQvtGA0LzQsNGG0LjQuCcsXG5cdCcxNDMwMDUwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCx0LDQtyDRhdGA0LDQvdC10L3QuNGPINC60L7RgdC80LjRh9C10YHQutC+0Lkg0YLQtdGF0L3QuNC60LgnLFxuXHQnMTQzMDA1MDQwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9C+0LvQuNCz0L7QvdC+0LIg0L/RgNC40LfQtdC80LvQtdC90LjRjyDQutC+0YHQvNC40YfQtdGB0LrQuNGFINC+0LHRitC10LrRgtC+0LIg0Lgg0LLQt9C70LXRgtC90L4t0L/QvtGB0LDQtNC+0YfQvdGL0YUg0L/QvtC70L7RgScsXG5cdCcxNDMwMDUwNTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0Y3QutGB0L/QtdGA0LjQvNC10L3RgtCw0LvRjNC90L7QuSDQsdCw0LfRiyDQtNC70Y8g0L7RgtGA0LDQsdC+0YLQutC4INC60L7RgdC80LjRh9C10YHQutC+0Lkg0YLQtdGF0L3QuNC60LgnLFxuXHQnMTQzMDA1MDYwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRhtC10L3RgtGA0L7QsiDQuCDQvtCx0L7RgNGD0LTQvtCy0LDQvdC40Y8g0LTQu9GPINC/0L7QtNCz0L7RgtC+0LLQutC4INC60L7RgdC80L7QvdCw0LLRgtC+0LInLFxuXHQnMTQzMDA1MDcwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQtNGA0YPQs9C40YUg0L3QsNC30LXQvNC90YvRhSDRgdC+0L7RgNGD0LbQtdC90LjQuSDQuCDRgtC10YXQvdC40LrQuCwg0LjRgdC/0L7Qu9GM0LfRg9C10LzRi9GFINC/0YDQuCDQvtGB0YPRidC10YHRgtCy0LvQtdC90LjQuCDQutC+0YHQvNC40YfQtdGB0LrQvtC5INC00LXRj9GC0LXQu9GM0L3QvtGB0YLQuCcsXG5cdCcxNDMwMDYwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIsINC/0YDQtdC00L3QsNC30L3QsNGH0LXQvdC90YvRhSDQtNC70Y8g0L7QsdC10YHQv9C10YfQtdC90LjRjyDQvtCx0L7RgNC+0L3RiyDQuCDQsdC10LfQvtC/0LDRgdC90L7RgdGC0LgnLFxuXHQnMTQzMDA2MDEwMDAwJzogJ9CU0LvRjyDQvtCx0LXRgdC/0LXRh9C10L3QuNGPINC30LDQtNCw0Ycg0L7QsdC+0YDQvtC90YsnLFxuXHQnMTQzMDA2MDEwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQstC+0LXQvdC90YvRhSDQvtGA0LPQsNC90LjQt9Cw0YbQuNC5LCDRg9GH0YDQtdC20LTQtdC90LjQuSDQuCDQtNGA0YPQs9C40YUg0L7QsdGK0LXQutGC0L7QsicsXG5cdCcxNDMwMDYwMTAyMDAnOiAn0JTQu9GPINC00LjRgdC70L7QutCw0YbQuNC4INCy0L7QudGB0Log0Lgg0YHQuNC7INGE0LvQvtGC0LAnLFxuXHQnMTQzMDA2MDEwMzAwJzogJ9CU0LvRjyDQv9GA0L7QstC10LTQtdC90LjRjyDRg9GH0LXQvdC40Lkg0Lgg0LjQvdGL0YUg0LzQtdGA0L7Qv9GA0LjRj9GC0LjQuScsXG5cdCcxNDMwMDYwMTA0MDAnOiAn0JTQu9GPINC40YHQv9GL0YLQsNGC0LXQu9GM0L3Ri9GFINC/0L7Qu9C40LPQvtC90L7QsicsXG5cdCcxNDMwMDYwMTA1MDAnOiAn0JTQu9GPINC80LXRgdGCINGD0L3QuNGH0YLQvtC20LXQvdC40Y8g0L7RgNGD0LbQuNGPINC4INC30LDRhdC+0YDQvtC90LXQvdC40Y8g0L7RgtGF0L7QtNC+0LInLFxuXHQnMTQzMDA2MDEwNjAwJzogJ9CU0LvRjyDRgdC+0LfQtNCw0L3QuNGPINC30LDQv9Cw0YHQvtCyINC80LDRgtC10YDQuNCw0LvRjNC90YvRhSDRhtC10L3QvdC+0YHRgtC10Lkg0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC8INC4INC80L7QsdC40LvQuNC30LDRhtC40L7QvdC90L7QvCDRgNC10LfQtdGA0LLQsNGFICjRhdGA0LDQvdC40LvQuNGJ0LAsINGB0LrQu9Cw0LTRiyDQuCDQtNGA0YPQs9C40LUpJyxcblx0JzE0MzAwNjAxMDcwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQvtCx0L7RgNC+0L3RiycsXG5cdCcxNDMwMDYwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIgKNGC0LXRgNGA0LjRgtC+0YDQuNC5KSwg0L7QsdC10YHQv9C10YfQuNCy0LDRjtGJ0LjRhSDQt9Cw0YnQuNGC0YMg0Lgg0L7RhdGA0LDQvdGDINCT0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQs9GA0LDQvdC40YbRiyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnMTQzMDA2MDIwMTAwJzogJ9CU0LvRjyDQvtCx0YPRgdGC0YDQvtC50YHRgtCy0LAg0Lgg0YHQvtC00LXRgNC20LDQvdC40Y8g0LjQvdC20LXQvdC10YDQvdC+LdGC0LXRhdC90LjRh9C10YHQutC40YUg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0LfQsNCz0YDQsNC20LTQtdC90LjQuScsXG5cdCcxNDMwMDYwMjAyMDAnOiAn0JTQu9GPINC+0LHRg9GB0YLRgNC+0LnRgdGC0LLQsCDQuCDRgdC+0LTQtdGA0LbQsNC90LjRjyDQv9C+0LPRgNCw0L3QuNGH0L3Ri9GFINC30L3QsNC60L7QsicsXG5cdCcxNDMwMDYwMjAzMDAnOiAn0JTQu9GPINC+0LHRg9GB0YLRgNC+0LnRgdGC0LLQsCDQuCDRgdC+0LTQtdGA0LbQsNC90LjRjyDQv9C+0LPRgNCw0L3QuNGH0L3Ri9GFINC/0YDQvtGB0LXQuicsXG5cdCcxNDMwMDYwMjA0MDAnOiAn0JTQu9GPINC+0LHRg9GB0YLRgNC+0LnRgdGC0LLQsCDQuCDRgdC+0LTQtdGA0LbQsNC90LjRjyDQutC+0LzQvNGD0L3QuNC60LDRhtC40LknLFxuXHQnMTQzMDA2MDIwNTAwJzogJ9CU0LvRjyDQvtCx0YPRgdGC0YDQvtC50YHRgtCy0LAg0Lgg0YHQvtC00LXRgNC20LDQvdC40Y8g0L/Rg9C90LrRgtC+0LIg0L/RgNC+0L/Rg9GB0LrQsCDRh9C10YDQtdC3INCT0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YPRjiDQs9GA0LDQvdC40YbRgyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnMTQzMDA2MDIwNjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC00LvRjyDQt9Cw0YnQuNGC0Ysg0Lgg0L7RhdGA0LDQvdGLINCT0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQs9GA0LDQvdC40YbRiyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnMTQzMDA2MDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC+0LHQvtGA0L7QvdGLINC4INCx0LXQt9C+0L/QsNGB0L3QvtGB0YLQuCcsXG5cdCcxNDMwMDcwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0L/RgNC+0LzRi9GI0LvQtdC90L3QvtGB0YLQuCwg0Y3QvdC10YDQs9C10YLQuNC60LgsINGC0YDQsNC90YHQv9C+0YDRgtCwLCDRgdCy0Y/Qt9C4LCDRgNCw0LTQuNC+0LLQtdGJ0LDQvdC40Y8sINGC0LXQu9C10LLQuNC00LXQvdC40Y8sINC40L3RhNC+0YDQvNCw0YLQuNC60LgsINC+0LHQtdGB0L/QtdGH0LXQvdC40Y8g0LrQvtGB0LzQuNGH0LXRgdC60L7QuSDQtNC10Y/RgtC10LvRjNC90L7RgdGC0LgsINC+0LHQvtGA0L7QvdGLLCDQsdC10LfQvtC/0LDRgdC90L7RgdGC0Lgg0Lgg0LjQvdC+0LPQviDRgdC/0LXRhtC40LDQu9GM0L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMTQ0MDAwMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtGB0L7QsdC+INC+0YXRgNCw0L3Rj9C10LzRi9GFINC40YHRgtC+0YDQuNC60L4t0LrRg9C70YzRgtGD0YDQvdGL0YUg0Lgg0L/RgNC40YDQvtC00L3Ri9GFINC+0LHRitC10LrRgtC+0LIgKNGC0LXRgNGA0LjRgtC+0YDQuNC5KScsXG5cdCcxNDQwMDEwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0YHQvtCx0L4g0L7RhdGA0LDQvdGP0LXQvNGL0YUg0L/RgNC40YDQvtC00L3Ri9GFINC+0LHRitC10LrRgtC+0LIgKNGC0LXRgNGA0LjRgtC+0YDQuNC5KScsXG5cdCcxNDQwMDEwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvRhSDQv9GA0LjRgNC+0LTQvdGL0YUg0LfQsNC/0L7QstC10LTQvdC40LrQvtCyICjQsiDRgtC+0Lwg0YfQuNGB0LvQtSDQsdC40L7RgdGE0LXRgNC90YvRhSknLFxuXHQnMTQ0MDAxMDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0YUg0L/RgNC40YDQvtC00L3Ri9GFINC30LDQutCw0LfQvdC40LrQvtCyJyxcblx0JzE0NDAwMTAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L3QsNGG0LjQvtC90LDQu9GM0L3Ri9GFINC/0LDRgNC60L7QsicsXG5cdCcxNDQwMDEwNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0YDQuNGA0L7QtNC90YvRhSDQv9Cw0YDQutC+0LInLFxuXHQnMTQ0MDAxMDUwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQtNC10L3QtNGA0L7Qu9C+0LPQuNGH0LXRgdC60LjRhSDQv9Cw0YDQutC+0LInLFxuXHQnMTQ0MDAxMDYwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsdC+0YLQsNC90LjRh9C10YHQutC40YUg0YHQsNC00L7QsicsXG5cdCcxNDQwMDEwNzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YHQsNC90LDRgtC+0YDQvdC+0LPQviDQuCDQutGD0YDQvtGA0YLQvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCcxNDQwMDEwODAwMDAnOiAn0KLQtdGA0YDQuNGC0L7RgNC40Lgg0LzQtdGB0YLQvtGA0L7QttC00LXQvdC40Lkg0LzQuNC90LXRgNCw0LvRjNC90YvRhSDQstC+0LQsINC70LXRh9C10LHQvdGL0YUg0LPRgNGP0LfQtdC5LCDRgNCw0L/RiyDQu9C40LzQsNC90L7QsiDQuCDQvtC30LXRgCcsXG5cdCcxNDQwMDEwOTAwMDAnOiAn0JTQu9GPINGC0YDQsNC00LjRhtC40L7QvdC90L7Qs9C+INC/0YDQuNGA0L7QtNC+0L/QvtC70YzQt9C+0LLQsNC90LjRjycsXG5cdCcxNDQwMDExMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0YHQvtCx0L4g0L7RhdGA0LDQvdGP0LXQvNGL0YUg0L/RgNC40YDQvtC00L3Ri9GFINGC0LXRgNGA0LjRgtC+0YDQuNC5ICjQvtCx0YrQtdC60YLQvtCyKScsXG5cdCcxNDQwMDIwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIgKNGC0LXRgNGA0LjRgtC+0YDQuNC5KSDQv9GA0LjRgNC+0LTQvtC+0YXRgNCw0L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCcxNDQwMDMwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIgKNGC0LXRgNGA0LjRgtC+0YDQuNC5KSDRgNC10LrRgNC10LDRhtC40L7QvdC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzE0NDAwMzAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LTQvtC80L7QsiDQvtGC0LTRi9GF0LAsINC/0LDQvdGB0LjQvtC90LDRgtC+0LIsINC60LXQvNC/0LjQvdCz0L7QsicsXG5cdCcxNDQwMDMwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YTQuNC30LjRh9C10YHQutC+0Lkg0LrRg9C70YzRgtGD0YDRiyDQuCDRgdC/0L7RgNGC0LAnLFxuXHQnMTQ0MDAzMDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRgtGD0YDQuNGB0YLQuNGH0LXRgdC60LjRhSDQsdCw0LcsINGB0YLQsNGG0LjQvtC90LDRgNC90YvRhSDQuCDQv9Cw0LvQsNGC0L7Rh9C90YvRhSDRgtGD0YDQuNGB0YLRgdC60L4t0L7Qt9C00L7RgNC+0LLQuNGC0LXQu9GM0L3Ri9GFINC70LDQs9C10YDQtdC5LCDQtNC+0LzQvtCyINGA0YvQsdC+0LvQvtCy0LAg0Lgg0L7RhdC+0YLQvdC40LrQsCwg0LTQtdGC0YHQutC40YUg0YLRg9GA0LjRgdGC0LjRh9C10YHQutC40YUg0YHRgtCw0L3RhtC40LknLFxuXHQnMTQ0MDAzMDQwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRgtGD0YDQuNGB0YLQuNGH0LXRgdC60LjRhSDQv9Cw0YDQutC+0LInLFxuXHQnMTQ0MDAzMDUwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQu9C10YHQvtC/0LDRgNC60L7QsicsXG5cdCcxNDQwMDMwNjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGD0YfQtdCx0L3Qvi3RgtGD0YDQuNGB0YLQuNGH0LXRgdC60LjRhSDRgtGA0L7QvyDQuCDRgtGA0LDRgdGBJyxcblx0JzE0NDAwMzA3MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LTQtdGC0YHQutC40YUg0Lgg0YHQv9C+0YDRgtC40LLQvdGL0YUg0LvQsNCz0LXRgNC10LknLFxuXHQnMTQ0MDAzMDgwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRgdC60LLQtdGA0L7Qsiwg0L/QsNGA0LrQvtCyLCDQs9C+0YDQvtC00YHQutC40YUg0YHQsNC00L7QsicsXG5cdCcxNDQwMDMwOTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0LvRj9C20LXQuScsXG5cdCcxNDQwMDMxMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIgKNGC0LXRgNGA0LjRgtC+0YDQuNC5KSDRgNC10LrRgNC10LDRhtC40L7QvdC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzE0NDAwNDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQuNGB0YLQvtGA0LjQutC+LdC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMTQ0MDA0MDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNGB0LvQtdC00LjRjyDQvdCw0YDQvtC00L7QsiDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LggKNC/0LDQvNGP0YLQvdC40LrQvtCyINC40YHRgtC+0YDQuNC4INC4INC60YPQu9GM0YLRg9GA0YspLCDQsiDRgtC+0Lwg0YfQuNGB0LvQtSDQvtCx0YrQtdC60YLQvtCyINCw0YDRhdC10L7Qu9C+0LPQuNGH0LXRgdC60L7Qs9C+INC90LDRgdC70LXQtNC40Y8nLFxuXHQnMTQ0MDA0MDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQstC+0LXQvdC90YvRhSDQuCDQs9GA0LDQttC00LDQvdGB0LrQuNGFINC30LDRhdC+0YDQvtC90LXQvdC40LknLFxuXHQnMTQ0MDA1MDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtGB0L7QsdC+INC+0YXRgNCw0L3Rj9C10LzRi9GFINC40YHRgtC+0YDQuNC60L4t0LrRg9C70YzRgtGD0YDQvdGL0YUg0Lgg0L/RgNC40YDQvtC00L3Ri9GFINC+0LHRitC10LrRgtC+0LIgKNGC0LXRgNGA0LjRgtC+0YDQuNC5KScsXG5cdCcxNDUwMDAwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LvQtdGB0L3QvtCz0L4g0YTQvtC90LTQsCcsXG5cdCcxNDUwMDEwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC70LXRgdC90L7QuSDRgNCw0YHRgtC40YLQtdC70YzQvdC+0YHRgtC4Jyxcblx0JzE0NTAwMjAwMDAwMCc6ICfQlNC70Y8g0LLQvtGB0YHRgtCw0L3QvtCy0LvQtdC90LjRjyDQu9C10YHQvdC+0Lkg0YDQsNGB0YLQuNGC0LXQu9GM0L3QvtGB0YLQuCcsXG5cdCcxNDUwMDMwMDAwMDAnOiAn0JTQu9GPINC/0YDQvtGH0LjRhSDQvtCx0YrQtdC60YLQvtCyINC70LXRgdC90L7Qs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG5cdCcxNDYwMDAwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LLQvtC00L3QvtCz0L4g0YTQvtC90LTQsCcsXG5cdCcxNDYwMDEwMDAwMDAnOiAn0J/QvtC0INCy0L7QtNC90YvQvNC4INC+0LHRitC10LrRgtCw0LzQuCcsXG5cdCcxNDYwMDIwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCz0LjQtNGA0L7RgtC10YXQvdC40YfQtdGB0LrQuNGFINGB0L7QvtGA0YPQttC10L3QuNC5Jyxcblx0JzE0NjAwMzAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0YHQvtC+0YDRg9C20LXQvdC40LksINGA0LDRgdC/0L7Qu9C+0LbQtdC90L3Ri9GFINC90LAg0LLQvtC00L3Ri9GFINC+0LHRitC10LrRgtCw0YUnLFxuXHQnMTQ3MDAwMDAwMDAwJzogJ9CX0LXQvNC70Lgg0LfQsNC/0LDRgdCwICjQvdC10LjRgdC/0L7Qu9GM0LfRg9C10LzRi9C1KSdcbn07XG4vLyDQndCw0LfQvdCw0YfQtdC90LjQtSDQt9C00LDQvdC40LlcbnZhciBkQXNzQnVpbGRpbmcgPSB7XG5cdCcyMDQwMDEwMDAwMDAnOiAn0J3QtdC20LjQu9C+0LUg0LfQtNCw0L3QuNC1Jyxcblx0JzIwNDAwMjAwMDAwMCc6ICfQltC40LvQvtC5INC00L7QvCcsXG5cdCcyMDQwMDMwMDAwMDAnOiAn0JzQvdC+0LPQvtC60LLQsNGA0YLQuNGA0L3Ri9C5INC00L7QvCdcbn07XG5cbnZhciBQYXJjZWxQcm9wZXJ0aWVzO1xudmFyIENvbnN0cnVjdGlvblByb3BlcnRpZXM7XG52YXIgVW5jb21wbGV0ZWRQcm9wZXJ0aWVzO1xudmFyIEJ1aWxkaW5nUHJvcGVydGllcztcbnZhciBab25lUHJvcGVydGllcztcbnZhciBCb3VuZFByb3BlcnRpZXM7XG5cbmZ1bmN0aW9uIGdldFZhbHVlRnJvbURpY3QoS2V5LCBEaWMpIHtcbiAgICBmb3IgKHZhciBrIGluIERpYykge1xuICAgICAgICBpZiAoayA9PT0gS2V5KSB7XG4gICAgICAgICAgICByZXR1cm4gRGljW2tdO1xuICAgICAgICB9XG4gICAgfVxufVxuXG5tb2R1bGUuZXhwb3J0cy5nZXRQcm9wZXJ0aWVzID0gZnVuY3Rpb24gKEZlYXR1cmUsIEZlYXR1cmVUeXBlKSB7XG4gICAgc3dpdGNoIChGZWF0dXJlVHlwZSkge1xuICAgICAgICBjYXNlICdQYXJjZWwnIDpcbiAgICAgICAge1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllcyA9IHtcbiAgICAgICAgICAgICAgICBcItCa0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L3QvtC80LXRgFwiOiAnJywgLy8gcmVxdWlyZVxuICAgICAgICAgICAgICAgIFwi0KHRgtCw0YLRg9GBXCI6ICcwMScsIC8vIGRTdGF0ZXMgcmVxdWlyZVxuICAgICAgICAgICAgICAgIFwi0JTQsNGC0LAg0YHQvtC30LTQsNC90LjRj1wiOiAnJyxcbiAgICAgICAgICAgICAgICBcItCi0LjQvyDQvtCx0YrQtdC60YLQsFwiOiAnJywgLy9kUGFyY2VscyByZXF1aXJlXG4gICAgICAgICAgICAgICAgXCLQmtCw0YLQtdCz0L7RgNC40Y8g0LfQtdC80LXQu9GMXCI6ICcnLCAvLyBkQ2F0ZWdvcmllcyAvLyByZXF1aXJlXG4gICAgICAgICAgICAgICAgXCLQn9C70L7RidCw0LTRjFwiOiB7Ly8gcmVxdXJlXG4gICAgICAgICAgICAgICAgICAgIFwi0JfQvdCw0YfQtdC90LjQtVwiOiAwLCAvLyByZXF1aXJlXG4gICAgICAgICAgICAgICAgICAgIFwi0LXQtC7QuNC30LxcIjogJycsIC8vZFVuaXQgcmVxdWlyZVxuICAgICAgICAgICAgICAgICAgICBcItCi0L7Rh9C90L7RgdGC0YxcIjogJycgLy8gZDIwXzJcbiAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIFwi0KDQsNC30YDQtdGI0ZHQvdC90L7QtSDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjQtVwiOiB7Ly8gcmVxdWlyZVxuICAgICAgICAgICAgICAgICAgICBcItC/0L4g0LTQvtC60YPQvNC10L3RgtGDXCI6ICcnLFxuICAgICAgICAgICAgICAgICAgICBcItC/0L4g0YHQv9GA0LDQstC+0YfQvdC40LrRg1wiOiAnJyAvLyBkVXRpbGl6YXRpb24gcmVxdWlyZVxuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH07XG4gICAgICAgICAgICBQYXJjZWxQcm9wZXJ0aWVzW1wi0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQvdC+0LzQtdGAXCJdID0gRmVhdHVyZS5DYWRhc3RyYWxOdW1iZXI7XG4gICAgICAgICAgICBQYXJjZWxQcm9wZXJ0aWVzW1wi0KHRgtCw0YLRg9GBXCJdID0gZ2V0VmFsdWVGcm9tRGljdChGZWF0dXJlLlN0YXRlLCBkU3RhdGVzKTtcbiAgICAgICAgICAgIFBhcmNlbFByb3BlcnRpZXNbXCLQotC40L8g0L7QsdGK0LXQutGC0LBcIl0gPSBnZXRWYWx1ZUZyb21EaWN0KEZlYXR1cmUuTmFtZSwgZFBhcmNlbHMpO1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllc1tcItCa0LDRgtC10LPQvtGA0LjRjyDQt9C10LzQtdC70YxcIl0gPSBnZXRWYWx1ZUZyb21EaWN0KEZlYXR1cmUuQ2F0ZWdvcnksIGRDYXRlZ29yaWVzKTtcbiAgICAgICAgICAgIFBhcmNlbFByb3BlcnRpZXNbXCLQlNCw0YLQsCDRgdC+0LfQtNCw0L3QuNGPXCJdID0gRmVhdHVyZS5EYXRlQ3JlYXRlZDtcbiAgICAgICAgICAgIFBhcmNlbFByb3BlcnRpZXNbXCLQoNCw0LfRgNC10YjRkdC90L3QvtC1INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNC1XCJdW1wi0L/QviDRgdC/0YDQsNCy0L7Rh9C90LjQutGDXCJdID0gXG4gICAgICAgICAgICAgICAgICAgIGdldFZhbHVlRnJvbURpY3QoRmVhdHVyZS5VdGlsaXphdGlvbi5VdGlsaXphdGlvbiwgZFV0aWxpemF0aW9ucyk7XG4gICAgICAgICAgICBQYXJjZWxQcm9wZXJ0aWVzW1wi0KDQsNC30YDQtdGI0ZHQvdC90L7QtSDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjQtVwiXVtcItC/0L4g0LTQvtC60YPQvNC10L3RgtGDXCJdID0gRmVhdHVyZS5VdGlsaXphdGlvbi5CeURvYztcbiAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICB9XG4gICAgICAgIGNhc2UgJ0NvbnN0cnVjdGlvbic6e1xuICAgICAgICAgICAgQ29uc3RydWN0aW9uUHJvcGVydGllcyA9IHtcbiAgICAgICAgICAgICAgICBjYWRhc3RyZU51bWJlcjogJycsIC8vIFxuICAgICAgICAgICAgICAgIE9iamVjdFR5cGU6ICcnLCAvLyByZXF1aXJlXG4gICAgICAgICAgICAgICAgQXNzaWduYXRpb25OYW1lOiAnJyxcbiAgICAgICAgICAgICAgICBBZGRyZXNzOiB7XG4gICAgICAgICAgICAgICAgICAgIE5vdGU6ICcnXG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfTtcbiAgICAgICAgICAgIGlmIChGZWF0dXJlLkNhZGFzdHJhbE51bWJlcikge1xuICAgICAgICAgICAgICAgIENvbnN0cnVjdGlvblByb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIgPSBGZWF0dXJlLkNhZGFzdHJhbE51bWJlcjtcbiAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgQ29uc3RydWN0aW9uUHJvcGVydGllcy5jYWRhc3RyZU51bWJlciA9ICcnO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgXG4gICAgICAgICAgICBDb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzLkFzc2lnbmF0aW9uTmFtZSA9IEZlYXR1cmUuQXNzaWduYXRpb25OYW1lO1xuICAgICAgICAgICAgQ29uc3RydWN0aW9uUHJvcGVydGllcy5PYmplY3RUeXBlID0gZ2V0VmFsdWVGcm9tRGljdChGZWF0dXJlLk9iamVjdFR5cGUsIGRab25lKTtcbiAgICAgICAgICAgIENvbnN0cnVjdGlvblByb3BlcnRpZXNbXCJBZGRyZXNzXCJdW1wiTm90ZVwiXSA9IEZlYXR1cmUuQWRkcmVzcy5Ob3RlO1xuICAgICAgICAgICAgYnJlYWs7XG4gICAgICAgIH1cbiAgICAgICAgY2FzZSAnQnVpbGRpbmcnOntcbiAgICAgICAgICAgIEJ1aWxkaW5nUHJvcGVydGllcyA9IHtcbiAgICAgICAgICAgICAgICBjYWRhc3RyZU51bWJlcjogJycsIC8vIFxuICAgICAgICAgICAgICAgIE9iamVjdFR5cGU6ICcnLCAvLyByZXF1aXJlXG4gICAgICAgICAgICAgICAgQXNzaWduYXRpb25OYW1lOiAnJyxcbiAgICAgICAgICAgICAgICBBZGRyZXNzOiB7XG4gICAgICAgICAgICAgICAgICAgIE5vdGU6ICcnXG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfTtcbiAgICAgICAgICAgIGlmIChGZWF0dXJlLkNhZGFzdHJhbE51bWJlcikge1xuICAgICAgICAgICAgICAgIEJ1aWxkaW5nUHJvcGVydGllcy5jYWRhc3RyZU51bWJlciA9IEZlYXR1cmUuQ2FkYXN0cmFsTnVtYmVyO1xuICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICBCdWlsZGluZ1Byb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIgPSAnJztcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIFxuICAgICAgICAgICAgQnVpbGRpbmdQcm9wZXJ0aWVzLkFzc2lnbmF0aW9uTmFtZSA9IEZlYXR1cmUuQXNzaWduYXRpb25OYW1lO1xuICAgICAgICAgICAgQnVpbGRpbmdQcm9wZXJ0aWVzLk9iamVjdFR5cGUgPSBnZXRWYWx1ZUZyb21EaWN0KEZlYXR1cmUuT2JqZWN0VHlwZSwgZFpvbmUpO1xuICAgICAgICAgICAgQnVpbGRpbmdQcm9wZXJ0aWVzW1wiQWRkcmVzc1wiXVtcIk5vdGVcIl0gPSBGZWF0dXJlLkFkZHJlc3MuTm90ZTtcbiAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICB9XG4gICAgICAgIGNhc2UgJ1VuY29tcGxldGVkJzp7XG4gICAgICAgICAgICBVbmNvbXBsZXRlZFByb3BlcnRpZXMgPSB7XG4gICAgICAgICAgICAgICAgY2FkYXN0cmVOdW1iZXI6ICcnLCAvLyBcbiAgICAgICAgICAgICAgICBPYmplY3RUeXBlOiAnJywgLy8gcmVxdWlyZVxuICAgICAgICAgICAgICAgIEFzc2lnbmF0aW9uTmFtZTogJycsXG4gICAgICAgICAgICAgICAgQWRkcmVzczoge1xuICAgICAgICAgICAgICAgICAgICBOb3RlOiAnJ1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH07XG4gICAgICAgICAgICBpZiAoRmVhdHVyZS5DYWRhc3RyYWxOdW1iZXIpIHtcbiAgICAgICAgICAgICAgICBVbmNvbXBsZXRlZFByb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIgPSBGZWF0dXJlLkNhZGFzdHJhbE51bWJlcjtcbiAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgVW5jb21wbGV0ZWRQcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyID0gJyc7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBcbiAgICAgICAgICAgIFVuY29tcGxldGVkUHJvcGVydGllcy5Bc3NpZ25hdGlvbk5hbWUgPSBGZWF0dXJlLkFzc2lnbmF0aW9uTmFtZTtcbiAgICAgICAgICAgIFVuY29tcGxldGVkUHJvcGVydGllcy5PYmplY3RUeXBlID0gZ2V0VmFsdWVGcm9tRGljdChGZWF0dXJlLk9iamVjdFR5cGUsIGRab25lKTtcbiAgICAgICAgICAgIFVuY29tcGxldGVkUHJvcGVydGllc1tcIkFkZHJlc3NcIl1bXCJOb3RlXCJdID0gRmVhdHVyZS5BZGRyZXNzLk5vdGU7XG4gICAgICAgICAgICBicmVhaztcbiAgICAgICAgfVxuICAgICAgICBkZWZhdWx0IDp7XG4gICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ci0LjQvyDQvtCx0YrQtdC60YLQsCDQvdC1INGA0LDRgdC/0L7Qt9C90LDQvScpO1xuICAgICAgICB9XG4gICAgfVxuICAgIHJldHVybiB7XG4gICAgICAgIHBhcmNlbFByb3BlcnRpZXM6IFBhcmNlbFByb3BlcnRpZXMsXG4gICAgICAgIGNvbnN0cnVjdGlvblByb3BlcnRpZXM6IENvbnN0cnVjdGlvblByb3BlcnRpZXMsXG4gICAgICAgIHVuY29tcGxldGVkUHJvcGVydGllczogVW5jb21wbGV0ZWRQcm9wZXJ0aWVzLFxuICAgICAgICBidWlsZGluZ1Byb3BlcnRpZXM6IEJ1aWxkaW5nUHJvcGVydGllcyxcbiAgICAgICAgem9uZVByb3BlcnRpZXM6IFpvbmVQcm9wZXJ0aWVzLFxuICAgICAgICBib3VuZFByb3BlcnRpZXM6IEJvdW5kUHJvcGVydGllc1xuICAgIH07XG59OyIsInZhciBFUyA9IHJlcXVpcmUoJy4vc3BhdGlhbC9FbnRpdHlTcGF0aWFsLmpzJyk7XG52YXIgUHJvcHMgPSByZXF1aXJlKCcuL2NhZFByb3BzJyk7XG5cbm1vZHVsZS5leHBvcnRzLkdlb0pTT04gPSBmdW5jdGlvbiAoeG1sRGF0YSwgcmVwcm9qZWN0KSB7XG5cbiAgICB2YXIgZ2VvSlNPTlF1YXJ0YWwgPSB7XG4gICAgICAgIHR5cGU6IFwiRmVhdHVyZUNvbGxlY3Rpb25cIixcbiAgICAgICAgZmVhdHVyZXM6IFtdXG4gICAgfTtcbiAgICB2YXIgZ2VvSlNPTkJvdW5kcyA9IHtcbiAgICAgICAgdHlwZTogXCJGZWF0dXJlQ29sbGVjdGlvblwiLFxuICAgICAgICBmZWF0dXJlczogW11cbiAgICB9O1xuICAgIHZhciBnZW9KU09OWm9uZXMgPSB7XG4gICAgICAgIHR5cGU6IFwiRmVhdHVyZUNvbGxlY3Rpb25cIixcbiAgICAgICAgZmVhdHVyZXM6IFtdXG4gICAgfTtcbiAgICB2YXIgZ2VvSlNPTlBhcmNlbHMgPSB7XG4gICAgICAgICd0eXBlJzogJ0ZlYXR1cmVDb2xsZWN0aW9uJyxcbiAgICAgICAgJ2ZlYXR1cmVzJzogW11cbiAgICB9O1xuICAgIHZhciBnZW9KU09OUmVhbHR5ID0ge1xuICAgICAgICB0eXBlOiBcIkZlYXR1cmVDb2xsZWN0aW9uXCIsXG4gICAgICAgIGZlYXR1cmVzOiBbXVxuICAgIH07XG4gICAgLy8g0J7RgtC00LXQu9GM0L3QvtC1INGF0YDQsNC90LjQu9C40YnQtSDQtNC70Y8gR2VvbWV0cnlDb2xsZWN0aW9uXG4vLyAgICB2YXIgZ2VvSlNPTlJlYWx0eUNvbGxlY3Rpb24gPSB7XG4vLyAgICAgICAgdHlwZTogXCJGZWF0dXJlQ29sbGVjdGlvblwiLFxuLy8gICAgICAgIGZlYXR1cmVzOiBbXVxuLy8gICAgfTtcbiAgICB2YXIgZ2VvSlNPTk9TTVBvaW50cyA9IHtcbiAgICAgICAgdHlwZTogXCJGZWF0dXJlQ29sbGVjdGlvblwiLFxuICAgICAgICBmZWF0dXJlczogW11cbiAgICB9O1xuXG4gICAgdmFyIF9yZXByb2plY3QgPSByZXByb2plY3QgfHwgbnVsbDtcblxuICAgIHZhciBBbGxEYXRhID0gJC54bWwyanNvbih4bWxEYXRhKS5DYWRhc3RyYWxCbG9ja3MuQ2FkYXN0cmFsQmxvY2s7XG4gICAgLy9jb25zb2xlLmxvZyhBbGxEYXRhKTtcblxuICAgIC8vINCc0L7QttC10YIg0LHRi9GC0Ywg0L3QtdGB0LrQvtC70YzQutC+INCh0JpcbiAgICB2YXIgcHJvak1TSztcbiAgICBpZiAoX3JlcHJvamVjdCAhPT0gbnVsbCkge1xuICAgICAgICBwcm9qTVNLID0gQWxsRGF0YS5Db29yZFN5c3RlbXM7XG4gICAgfVxuXG4gICAgLy8g0J7QsdGA0LDQsdC+0YLQutCwINC60LLQsNGA0YLQsNC70LAuINCd0LUg0LzQvtC20LXRgiDQsdGL0YLRjCDQvNC90L7Qs9C+0LrQvtC90YLRg9GA0L3Ri9C8ICAgICAgICAgICBcbiAgICBpZiAoQWxsRGF0YS5TcGF0aWFsRGF0YSAhPT0gbnVsbCkge1xuICAgICAgICB2YXIgc3BPYmogPSBFUy5nZXRFbnRpdHlTcGF0aWFsKEFsbERhdGEuU3BhdGlhbERhdGEuRW50aXR5U3BhdGlhbCwgcHJvak1TSywgJ1F1YXJ0YWwnLCBmYWxzZSk7XG4gICAgICAgIGlmICgoc3BPYmogPT09IHVuZGVmaW5lZCkgfHwgKHNwT2JqLmxlbmd0aCA9PT0gMCkpIHtcbiAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQntCx0YrQtdC60YIg0LrQstCw0YDRgtCw0LvQsCDRgSDQv9GD0YHRgtC+0Lkg0LPQtdC+0LzQtdGC0YDQuNC10LkhINCe0LHRitC10LrRgiDQsdGD0LTQtdGCINC/0YDQvtC/0YPRidC10L0uJyk7XG4gICAgICAgIH1cbiAgICAgICAgLy8g0JrQstCw0YDRgtCw0LtcbiAgICAgICAgdmFyIGZlYXR1cmUgPSB7XG4gICAgICAgICAgICAndHlwZSc6ICdGZWF0dXJlJ1xuICAgICAgICB9O1xuICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgIC8vINCe0YHRgtCw0LvRjNC90YvQtSDRgdCy0L7QudGB0YLQstCwLi4uLlxuXG4gICAgICAgIGdlb0pTT05RdWFydGFsLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgfSBlbHNlIHtcbiAgICAgICAgY29uc29sZS5sb2coJ9Cd0LXRgiDQvtC/0LjRgdCw0L3QuNGPINC/0YDQvtGB0YLRgNCw0L3RgdGC0LLQtdC90L3QvtC5INGB0L7RgdGC0LDQstC70Y/RjtGJ0LXQuSDQutCy0LDRgNGC0LDQu9CwJyk7XG4gICAgfVxuXG4gICAgLy8g0J7QsdGA0LDQsdC+0YLQutCwINCz0YDQsNC90LjRhi4g0J3QtSDQvNC+0LPRg9GCINCx0YvRgtGMINC80L3QvtCz0L7QutC+0L3RgtGD0YDQvdGL0LzQuFxuICAgIGlmIChBbGxEYXRhLkJvdW5kcykge1xuXG4gICAgICAgIGlmIChBbGxEYXRhLkJvdW5kcy5Cb3VuZC5zcGxpY2UpIHtcbiAgICAgICAgICAgIGZvciAodmFyIGkgPSAwOyBpIDwgQWxsRGF0YS5Cb3VuZHMuQm91bmQubGVuZ3RoOyBpKyspIHtcbiAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5Cb3VuZHMuQm91bmRbaV0uQm91bmRhcmllcy5Cb3VuZGFyeS5zcGxpY2UpIHtcbiAgICAgICAgICAgICAgICAgICAgZm9yICh2YXIgayA9IDA7IGsgPCBBbGxEYXRhLkJvdW5kcy5Cb3VuZFtpXS5Cb3VuZGFyaWVzLkJvdW5kYXJ5Lmxlbmd0aDsgaysrKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAvLyDQk9GA0LDQvdC40YbQsFxuICAgICAgICAgICAgICAgICAgICAgICAgdmFyIGZlYXR1cmUgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgJ3R5cGUnOiAnRmVhdHVyZSdcbiAgICAgICAgICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5Cb3VuZHMuQm91bmRbaV0uQm91bmRhcmllcy5Cb3VuZGFyeVtrXS5FbnRpdHlTcGF0aWFsICE9PSBudWxsKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgdmFyIHNwT2JqID0gRVMuZ2V0RW50aXR5U3BhdGlhbChBbGxEYXRhLkJvdW5kcy5Cb3VuZFtpXS5Cb3VuZGFyaWVzLkJvdW5kYXJ5W2tdLkVudGl0eVNwYXRpYWwsIHByb2pNU0ssICdCb3VuZCcsIGZhbHNlKTtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBpZiAoKHNwT2JqID09PSB1bmRlZmluZWQpIHx8IChzcE9iai5sZW5ndGggPT09IDApKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQntCx0YrQtdC60YIg0JPRgNCw0L3QuNGG0Ysg0YEg0L/Rg9GB0YLQvtC5INCz0LXQvtC80LXRgtGA0LjQtdC5ISDQntCx0YrQtdC60YIg0LHRg9C00LXRgiDQv9GA0L7Qv9GD0YnQtdC9LicpO1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICBjb250aW51ZTtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5nZW9tZXRyeSA9IHNwT2JqO1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIC8vINCe0YHRgtCw0LvRjNC90YvQtSDRgdCy0L7QudGB0YLQstCwLi4uLlxuXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgZ2VvSlNPTkJvdW5kcy5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgICAgICAgICAgICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQndC10YIg0L7Qv9C40YHQsNC90LjRjyDQv9GA0L7RgdGC0YDQsNC90YHRgtCy0LXQvdC90L7QuSDRgdC+0YHRgtCw0LLQu9GP0Y7RidC10Lkg0LPRgNCw0L3QuNGG0YsnKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgIC8vINCT0YDQsNC90LjRhtCwXG4gICAgICAgICAgICAgICAgICAgIHZhciBmZWF0dXJlID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgJ3R5cGUnOiAnRmVhdHVyZSdcbiAgICAgICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICAgICAgdmFyIHNwT2JqID0gRVMuZ2V0RW50aXR5U3BhdGlhbChBbGxEYXRhLkJvdW5kcy5Cb3VuZFtpXS5Cb3VuZGFyaWVzLkJvdW5kYXJ5LkVudGl0eVNwYXRpYWwsIHByb2pNU0ssICdCb3VuZCcsIGZhbHNlKTtcbiAgICAgICAgICAgICAgICAgICAgaWYgKChzcE9iaiA9PT0gdW5kZWZpbmVkKSB8fCAoc3BPYmoubGVuZ3RoID09PSAwKSkge1xuICAgICAgICAgICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDQk9GA0LDQvdC40YbRiyDRgSDQv9GD0YHRgtC+0Lkg0LPQtdC+0LzQtdGC0YDQuNC10LkhINCe0LHRitC10LrRgiDQsdGD0LTQtdGCINC/0YDQvtC/0YPRidC10L0uJyk7XG4gICAgICAgICAgICAgICAgICAgICAgICBjb250aW51ZTtcbiAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAgICAgICAgIC8vINCe0YHRgtCw0LvRjNC90YvQtSDRgdCy0L7QudGB0YLQstCwLi4uLlxuXG4gICAgICAgICAgICAgICAgICAgIGdlb0pTT05Cb3VuZHMuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICB2YXIgc3BPYmogPSBFUy5nZXRFbnRpdHlTcGF0aWFsKEFsbERhdGEuQm91bmRzLkJvdW5kLkJvdW5kYXJpZXMuQm91bmRhcnkuRW50aXR5U3BhdGlhbCwgcHJvak1TSywgJ0JvdW5kJywgZmFsc2UpO1xuICAgICAgICAgICAgaWYgKChzcE9iaiA9PT0gdW5kZWZpbmVkKSB8fCAoc3BPYmoubGVuZ3RoID09PSAwKSkge1xuICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQntCx0YrQtdC60YIg0JPRgNCw0L3QuNGG0Ysg0YEg0L/Rg9GB0YLQvtC5INCz0LXQvtC80LXRgtGA0LjQtdC5ISDQntCx0YrQtdC60YIg0LHRg9C00LXRgiDQv9GA0L7Qv9GD0YnQtdC9LicpO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgZmVhdHVyZS5nZW9tZXRyeSA9IHNwT2JqO1xuICAgICAgICAgICAgLy8g0J7RgdGC0LDQu9GM0L3Ri9C1INGB0LLQvtC50YHRgtCy0LAuLi4uXG5cbiAgICAgICAgICAgIGdlb0pTT05Cb3VuZHMuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgfVxuICAgIH1cbiAgICAvLyDQntCx0YDQsNCx0L7RgtC60LAg0LfQvtC9LiDQndC1INC80L7Qs9GD0YIg0LHRi9GC0Ywg0LzQvdC+0LPQvtC60L7QvdGC0YPRgNC90YvQvNC4XG4gICAgaWYgKEFsbERhdGEuWm9uZXMpIHtcblxuICAgICAgICBpZiAoQWxsRGF0YS5ab25lcy5ab25lLnNwbGljZSkge1xuICAgICAgICAgICAgZm9yICh2YXIgaSA9IDA7IGkgPCBBbGxEYXRhLlpvbmVzLlpvbmUubGVuZ3RoOyBpKyspIHtcbiAgICAgICAgICAgICAgICAvLyDQl9C+0L3QsFxuICAgICAgICAgICAgICAgIHZhciBmZWF0dXJlID0ge1xuICAgICAgICAgICAgICAgICAgICAndHlwZSc6ICdGZWF0dXJlJ1xuICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICAgICAgaWYgKEFsbERhdGEuWm9uZXMuWm9uZVtpXS5FbnRpdHlTcGF0aWFsICE9PSBudWxsKSB7XG4gICAgICAgICAgICAgICAgICAgIHZhciBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoQWxsRGF0YS5ab25lcy5ab25lW2ldLkVudGl0eVNwYXRpYWwsIHByb2pNU0ssICdab25lJywgZmFsc2UpO1xuICAgICAgICAgICAgICAgICAgICBpZiAoKHNwT2JqID09PSB1bmRlZmluZWQpIHx8IChzcE9iai5sZW5ndGggPT09IDApKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0J7QsdGK0LXQutGCINCX0L7QvdGLINGBINC/0YPRgdGC0L7QuSDQs9C10L7QvNC10YLRgNC40LXQuSEg0J7QsdGK0LXQutGCINCx0YPQtNC10YIg0L/RgNC+0L/Rg9GJ0LXQvS4nKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGNvbnRpbnVlO1xuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcblxuICAgICAgICAgICAgICAgICAgICBnZW9KU09OWm9uZXMuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0J3QtdGCINC+0L/QuNGB0LDQvdC40Y8g0L/RgNC+0YHRgtGA0LDQvdGB0YLQstC10L3QvdC+0Lkg0YHQvtGB0YLQsNCy0LvRj9GO0YnQtdC5INC30L7QvdGLJyk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfVxuICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgaWYgKEFsbERhdGEuWm9uZXMuWm9uZS5FbnRpdHlTcGF0aWFsICE9PSBudWxsKSB7XG4gICAgICAgICAgICAgICAgLy8g0JfQvtC90LBcbiAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICAgICAgICAgJ3R5cGUnOiAnRmVhdHVyZSdcbiAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgIHZhciBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoQWxsRGF0YS5ab25lcy5ab25lLkVudGl0eVNwYXRpYWwsIHByb2pNU0ssICdab25lJywgZmFsc2UpO1xuICAgICAgICAgICAgICAgIGlmICgoc3BPYmogPT09IHVuZGVmaW5lZCkgfHwgKHNwT2JqLmxlbmd0aCA9PT0gMCkpIHtcbiAgICAgICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDQl9C+0L3RiyDRgSDQv9GD0YHRgtC+0Lkg0LPQtdC+0LzQtdGC0YDQuNC10LkhINCe0LHRitC10LrRgiDQsdGD0LTQtdGCINC/0YDQvtC/0YPRidC10L0uJyk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcblxuICAgICAgICAgICAgICAgIGdlb0pTT05ab25lcy5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0J3QtdGCINC+0L/QuNGB0LDQvdC40Y8g0L/RgNC+0YHRgtGA0LDQvdGB0YLQstC10L3QvdC+0Lkg0YHQvtGB0YLQsNCy0LvRj9GO0YnQtdC5INC30L7QvdGLJyk7XG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG4gICAgLy8g0J7QsdGA0LDQsdC+0YLQutCwINCy0YHQtdGFINC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyXG4gICAgZm9yICh2YXIgZSA9IDA7IGUgPCBBbGxEYXRhLlBhcmNlbHMuUGFyY2VsLmxlbmd0aDsgZSsrKSB7XG4gICAgICAgIHZhciBzcE9iaiA9IG51bGw7XG4gICAgICAgIC8vINCX0LXQvNC10LvRjNC90YvQuSDRg9GH0LDRgdGC0L7QulxuICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICd0eXBlJzogJ0ZlYXR1cmUnXG4gICAgICAgIH07XG4gICAgICAgIGlmIChBbGxEYXRhLlBhcmNlbHMuUGFyY2VsW2VdLkVudGl0eVNwYXRpYWwgIT09IHVuZGVmaW5lZCkge1xuICAgICAgICAgICAgc3BPYmogPSBFUy5nZXRFbnRpdHlTcGF0aWFsKEFsbERhdGEuUGFyY2Vscy5QYXJjZWxbZV0uRW50aXR5U3BhdGlhbCwgcHJvak1TSywgJ1BhcmNlbCcsIGZhbHNlKTtcbiAgICAgICAgICAgIGlmICgoc3BPYmogPT09IHVuZGVmaW5lZCkgfHwgKHNwT2JqLmxlbmd0aCA9PT0gMCkpIHtcbiAgICAgICAgICAgICAgICBjb250aW51ZTtcbiAgICAgICAgICAgIH1cblxuICAgICAgICB9XG4gICAgICAgIC8vINCc0L3QvtCz0L7QutC+0L3RgtGD0YDQvdGL0LlcbiAgICAgICAgZWxzZSBpZiAoQWxsRGF0YS5QYXJjZWxzLlBhcmNlbFtlXS5Db250b3Vycykge1xuICAgICAgICAgICAgdmFyIENvbnRvdXJzID0gQWxsRGF0YS5QYXJjZWxzLlBhcmNlbFtlXS5Db250b3Vycy5Db250b3VyO1xuICAgICAgICAgICAgdmFyIG11bHRpUG9seWdvbiA9IFtdO1xuICAgICAgICAgICAgZm9yICh2YXIgYyA9IDA7IGMgPCBDb250b3Vycy5sZW5ndGg7IGMrKykge1xuICAgICAgICAgICAgICAgIHZhciBlcyA9IENvbnRvdXJzW2NdLkVudGl0eVNwYXRpYWw7XG4gICAgICAgICAgICAgICAgdmFyIHAgPSBFUy5nZXRFbnRpdHlTcGF0aWFsKGVzLCBwcm9qTVNLLCAnUGFyY2VsJywgdHJ1ZSk7XG4gICAgICAgICAgICAgICAgaWYgKHApIHtcbiAgICAgICAgICAgICAgICAgICAgbXVsdGlQb2x5Z29uLnB1c2gocCk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfVxuICAgICAgICAgICAgc3BPYmogPSB7XG4gICAgICAgICAgICAgICAgdHlwZTogXCJNdWx0aVBvbHlnb25cIixcbiAgICAgICAgICAgICAgICBjb29yZGluYXRlczogbXVsdGlQb2x5Z29uXG4gICAgICAgICAgICB9O1xuICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgLy9jb25zb2xlLmxvZygn0J3QtdGCINC+0L/QuNGB0LDQvdC40Y8g0L/RgNC+0YHRgtGA0LDQvdGB0YLQstC10L3QvdC+0Lkg0YHQvtGB0YLQsNCy0LvRj9GO0YnQtdC5Jyk7XG4gICAgICAgIH1cblxuICAgICAgICAvLyDQldGB0LvQuCDQvdC10YIg0LPQtdC+0LzQtdGC0YDQuNC4LCDRgtC+INC+0LHRitC10LrRgiDQvdC1INC90YPQttC10L1cbiAgICAgICAgaWYgKHNwT2JqKSB7XG4gICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAvLyDQntGB0YLQsNC70YzQvdGL0LUg0YHQstC+0LnRgdGC0LLQsC4uLi5cbiAgICAgICAgICAgIHZhciBwcm9wcyA9IFByb3BzLmdldFByb3BlcnRpZXMoQWxsRGF0YS5QYXJjZWxzLlBhcmNlbFtlXSwgJ1BhcmNlbCcpO1xuICAgICAgICAgICAgaWYgKHByb3BzKSB7XG4gICAgICAgICAgICAgICAgZmVhdHVyZS5wcm9wZXJ0aWVzID0gcHJvcHMucGFyY2VsUHJvcGVydGllcztcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIC8vY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDRgdC+0LfQtNCw0L0uINCa0J06JyArIGZlYXR1cmUucHJvcGVydGllcy5jYWRhc3RyZU51bWJlcik7XG4gICAgICAgICAgICBnZW9KU09OUGFyY2Vscy5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgICAgICB9XG5cbiAgICB9XG4gICAgLy8g0J7QsdGA0LDQsdC+0YLQutCwINGB0YLRgNC+0LXQvdC40LkuINC80L7Qs9GD0YIg0LHRi9GC0Ywg0YHQvtGB0YLQsNCy0L3Ri9C1INC40Lcg0YDQsNC30L3Ri9GFINCz0LXQvtC80LXRgtGA0LjQuVxuICAgIGlmIChBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5KSB7XG4gICAgICAgIGlmIChBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5LnNwbGljZSkge1xuXG4gICAgICAgICAgICBmdW5jdGlvbiBwcm9jZXNzRVMoRW50aXR5U3BhdGlhbCwgb1R5cGUpIHtcbiAgICAgICAgICAgICAgICB2YXIgc3BPYmogPSBFUy5nZXRFbnRpdHlTcGF0aWFsKEVudGl0eVNwYXRpYWwsIHByb2pNU0ssIG9UeXBlLCBmYWxzZSk7XG4gICAgICAgICAgICAgICAgaWYgKHNwT2JqKSB7XG4gICAgICAgICAgICAgICAgICAgIGlmIChzcE9iai50eXBlID09PSAnR2VvbWV0cnlDb2xsZWN0aW9uJykge1xuICAgICAgICAgICAgICAgICAgICAgICAgLy8gR2VvSlNPTiDRgSDQutC+0LvQu9C10LrRhtC40LXQuSDRgtGA0YPQtNC90L4g0L7RgtC60YDRi9Cy0LDRgtGMINC90LAg0LTQtdGB0LrRgtC+0L/QtVxuICAgICAgICAgICAgICAgICAgICAgICAgLy8gb2dyMm9nciAtZiBHZW9KU09OIC1leHBsb2RlY29sbGVjdGlvbnMgZXhwbG9kZSBkb2MyMTM5NDMzX3htbF9SZWFsdHlHQy5nZW9qc29uXG4gICAgICAgICAgICAgICAgICAgICAgICAvLyDQv9C+0Y3RgtC+0LzRgyDQu9GD0YfRiNC1INGB0L7Qt9C00LDRgtGMINGE0LjRhyDQv9C+INC60L7Qu9C40YfQtdGB0YLQstGDINC+0LHRitC10LrRgtC+0LIg0LIg0LrQvtC70LvQtdC60YbQuNC4XG4gICAgICAgICAgICAgICAgICAgICAgICBmb3IodmFyIGs9MDsgayA8IHNwT2JqLmdlb21ldHJpZXMubGVuZ3RoLTE7IGsrKykge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iai5nZW9tZXRyaWVzW2tdO1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGdlb0pTT05SZWFsdHkuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgIC8vZ2VvSlNPTlJlYWx0eUNvbGxlY3Rpb24uZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2coJ9CU0L7QsdCw0LLQu9C10L0gZ2VvSlNPTlJlYWx0eUdlb21ldHJ5Q29sbGVjdGlvbicpO1xuICAgICAgICAgICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZyhzcE9iai5nZW9tZXRyaWVzKTtcbiAgICAgICAgICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgICAgICAgICAgICAgICAgIGdlb0pTT05SZWFsdHkuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICBcbiAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0J7QmtChINGBINC/0YPRgdGC0L7QuSDQs9C10L7QvNC10YLRgNC40LXQuSEg0J7QsdGK0LXQutGCINCx0YPQtNC10YIg0L/RgNC+0L/Rg9GJ0LXQvS4nKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICAgIGZvciAodmFyIGkgPSAwOyBpIDwgQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eS5sZW5ndGg7IGkrKykge1xuICAgICAgICAgICAgICAgIHZhciBzcE9iaiA9IG51bGw7XG4gICAgICAgICAgICAgICAgLy8g0J7QmtChXG4gICAgICAgICAgICAgICAgdmFyIGZlYXR1cmUgPSB7XG4gICAgICAgICAgICAgICAgICAgICd0eXBlJzogJ0ZlYXR1cmUnXG4gICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICAvLyDRgdGC0YDQvtC10L3QuNGPXG4gICAgICAgICAgICAgICAgaWYgKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uQnVpbGRpbmcpIHtcbiAgICAgICAgICAgICAgICAgICAgaWYgKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uQnVpbGRpbmcuRW50aXR5U3BhdGlhbCkge1xuICAgICAgICAgICAgICAgICAgICAgICAgdmFyIHByb3BzID0gUHJvcHMuZ2V0UHJvcGVydGllcyhBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLkJ1aWxkaW5nLCAnQnVpbGRpbmcnKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGlmIChwcm9wcykge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGZlYXR1cmUucHJvcGVydGllcyA9IHByb3BzLmJ1aWxkaW5nUHJvcGVydGllcztcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKHByb3BzLmJ1aWxkaW5nUHJvcGVydGllcyk7XG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICBwcm9jZXNzRVMoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5CdWlsZGluZy5FbnRpdHlTcGF0aWFsLCAnQnVpbGRpbmcnKTtcbiAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAvLyDQvtCx0YrQtdC60YLRiyDQvdC10LfQsNCy0LXRgNGI0ZHQvdC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwXG4gICAgICAgICAgICAgICAgZWxzZSBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5VbmNvbXBsZXRlZCkge1xuICAgICAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5VbmNvbXBsZXRlZC5FbnRpdHlTcGF0aWFsKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICB2YXIgcHJvcHMgPSBQcm9wcy5nZXRQcm9wZXJ0aWVzKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uVW5jb21wbGV0ZWQsICdVbmNvbXBsZXRlZCcpO1xuICAgICAgICAgICAgICAgICAgICAgICAgaWYgKHByb3BzKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5wcm9wZXJ0aWVzID0gcHJvcHMudW5jb21wbGV0ZWRQcm9wZXJ0aWVzO1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2cocHJvcHMudW5jb21wbGV0ZWRQcm9wZXJ0aWVzKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgIHByb2Nlc3NFUyhBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLlVuY29tcGxldGVkLkVudGl0eVNwYXRpYWwsICdVbmNvbXBsZXRlZCcpO1xuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIC8vINGB0L7QvtGA0YPQttC10L3QuNGPXG4gICAgICAgICAgICAgICAgZWxzZSBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5Db25zdHJ1Y3Rpb24pIHtcbiAgICAgICAgICAgICAgICAgICAgaWYgKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uQ29uc3RydWN0aW9uLkVudGl0eVNwYXRpYWwpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIHZhciBwcm9wcyA9IFByb3BzLmdldFByb3BlcnRpZXMoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5Db25zdHJ1Y3Rpb24sICdDb25zdHJ1Y3Rpb24nKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGlmIChwcm9wcykge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGZlYXR1cmUucHJvcGVydGllcyA9IHByb3BzLmNvbnN0cnVjdGlvblByb3BlcnRpZXM7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZyhwcm9wcy5jb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgIHByb2Nlc3NFUyhBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLkNvbnN0cnVjdGlvbi5FbnRpdHlTcGF0aWFsLCAnQ29uc3RydWN0aW9uJyk7XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG4gICAgLy8g0J7QsdGA0LDQsdC+0YLQutCwINC/0YPQvdC60YLQvtCyINCe0JzQoVxuXG4gICAgcmV0dXJuIHtcbiAgICAgICAgZ2VvSlNPTlF1YXJ0YWw6IGdlb0pTT05RdWFydGFsLFxuICAgICAgICBnZW9KU09OQm91bmRzOiBnZW9KU09OQm91bmRzLFxuICAgICAgICBnZW9KU09OWm9uZXM6IGdlb0pTT05ab25lcyxcbiAgICAgICAgZ2VvSlNPTlBhcmNlbHM6IGdlb0pTT05QYXJjZWxzLFxuICAgICAgICBnZW9KU09OUmVhbHR5OiBnZW9KU09OUmVhbHR5XG4gICAgICAgIC8vZ2VvSlNPTlJlYWx0eUdlb21ldHJ5Q29sbGVjdGlvbjogZ2VvSlNPTlJlYWx0eUNvbGxlY3Rpb25cbiAgICB9O1xufTtcbiIsIi8qKlxuICog0JzQvtC00YPQu9GMINC+0LHRgNCw0LHQvtGC0LrQuCDQs9C10L7QvNC10YLRgNC40Lgg0YLQuNC/0LAg0L/QvtC70LjQs9C+0L0uXG4gKiDQntC00LjQvSDQstC90LXRiNC90LjQuSDQutC+0L3RgtGD0YAg0LggMCDQuNC70Lgg0LHQvtC70LXQtSDQstC90YPRgtGA0LXQvdC90LjRhSDQutC+0L3RgtGD0YDQvtCyLVwi0LTRi9GA0L7QulwiXG4gKiBcbiAqIEdlb0pTT04gZ2VvbWV0cnkg0YLQuNC/0LAgdEVudGl0eVNwYXRpYWxMYW5kT3V0XG4gKi9cblxuLy9cImdlb21ldHJ5XCI6IHtcbi8vICAgIFwidHlwZVwiOiBcIlBvbHlnb25cIixcbi8vICAgIFwiY29vcmRpbmF0ZXNcIjogW1xuLy8gICAgICBbIFsxMDAuMCwgMC4wXSwgWzEwMS4wLCAwLjBdLCBbMTAxLjAsIDEuMF0sXG4vLyAgICAgICAgWzEwMC4wLCAxLjBdLCBbMTAwLjAsIDAuMF0gXVxuLy8gICAgICBdXG4vLyAgfVxuXG52YXIgcHJvamVjdGlvbnMgPSByZXF1aXJlKCcuL1NwYXRpYWxTeXN0ZW1zJyk7XG5cbm1vZHVsZS5leHBvcnRzLmdldEVudGl0eVNwYXRpYWwgPSBmdW5jdGlvbiAoRW50aXR5U3BhdGlhbE9iaiwgcHJvaiwgb1R5cGUsIHBhcnRPZk11bHR1KSB7XG5cbi8vXHR0aGlzLmdlb21ldHJ5ID0ge1xuLy8gICAgICAgIHR5cGU6ICcnLFxuLy9cdFx0Y29vcmRpbmF0ZXM6IFtdXG4vL1x0fTtcblxuICAgIHZhciBfRW50aXR5U3BhdGlhbE9iaiA9IEVudGl0eVNwYXRpYWxPYmo7XG4gICAgdmFyIF9wcm9qID0gcHJvaiB8fCBudWxsO1xuICAgIHZhciBBcmVhID0gMC4wO1xuICAgIHZhciBzcGF0aWFsU3lzTmFtZSA9IG51bGw7XG4gICAgdmFyIExpbmVTdHJpbmcgPSBmYWxzZTtcblxuICAgIC8vINCS0YvRh9C40YHQu9C10L3QuNC1INC/0LvQvtGJ0LDQtNC4INC30LDQvNC60L3Rg9GC0L7Qs9C+INC60L7QvdGC0YPRgNCwXG4gICAgZnVuY3Rpb24gcG9seWdvbkFyZWEoWHMsIFlzLCBudW1Qb2ludHMpIHtcbiAgICAgICAgdmFyIGFyZWEgPSAwO1xuICAgICAgICB2YXIgaiA9IG51bVBvaW50cyAtIDE7XG4gICAgICAgIGZvciAodmFyIGkgPSAwOyBpIDwgbnVtUG9pbnRzOyBpKyspXG4gICAgICAgIHtcbiAgICAgICAgICAgIGFyZWEgPSBhcmVhICsgKChYc1tqXSkgKyAoWHNbaV0pKSAqICgoWXNbal0pIC0gKFlzW2ldKSk7XG4gICAgICAgICAgICBqID0gaTsgIC8vaiBpcyBwcmV2aW91cyB2ZXJ0ZXggdG8gaVxuICAgICAgICB9XG4gICAgICAgIHJldHVybiBNYXRoLmFicyhhcmVhIC8gMik7XG4gICAgfVxuXG4gICAgZnVuY3Rpb24gY29udmVydENvb3JkKGNvb3JkKSB7XG4gICAgICAgIC8vIGdsb2JhbFxuICAgICAgICBpZiAoKF9wcm9qID09PSBudWxsKSB8fCAoc3BhdGlhbFN5c05hbWUgPT09IG51bGwpKSB7XG4gICAgICAgICAgICByZXR1cm4gY29vcmQ7XG4gICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICByZXR1cm4gcHJvajQocHJvamVjdGlvbnMuU3BhdGlhbFN5c3RlbXNbc3BhdGlhbFN5c05hbWVdLCAnRVBTRzozODU3JywgY29vcmQpO1xuICAgICAgICB9XG4gICAgfVxuXG4gICAgZnVuY3Rpb24gZ2V0U3BhdGlhbFN5c05hbWUoKSB7XG4gICAgICAgIHZhciBpZCA9IF9FbnRpdHlTcGF0aWFsT2JqLkVudFN5cztcbiAgICAgICAgZm9yICh2YXIgaSA9IDA7IF9wcm9qLkNvb3JkU3lzdGVtLmxlbmd0aDsgaSsrKSB7XG4gICAgICAgICAgICBpZiAoX3Byb2ouQ29vcmRTeXN0ZW1baV0uQ3NJZCA9PT0gaWQpIHtcbiAgICAgICAgICAgICAgICByZXR1cm4gX3Byb2ouQ29vcmRTeXN0ZW1baV0uTmFtZTtcbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgICAgICByZXR1cm4gbnVsbDtcbiAgICB9XG5cbiAgICAvLyDQodC+0LfQtNCw0L3QuNC1INC+0LTQvdC+0LPQviDQt9Cw0LzQutC90YPRgtC+0LPQviDQutC+0L3RgtGD0YDQsCDQuNC70Lgg0LvQuNC90LjQuCDQuNC70Lgg0L7QutGA0YPQttC90L7RgdGC0LhcbiAgICBmdW5jdGlvbiBjcmVhdGVDb250b3VyKFNwYXRpYWxFbGVtZW50KSB7XG4gICAgICAgIHZhciB4cyA9IFtdO1xuICAgICAgICB2YXIgeXMgPSBbXTtcbiAgICAgICAgdmFyIGNvbnRvdXIgPSBbXTtcbiAgICAgICAgdmFyIGNvb3JkO1xuICAgICAgICB2YXIgcmVfcHJvamVjdGVkID0gW107XG4gICAgICAgIC8vINC/0YDQvtCy0LXRgNC60LAg0L3QsCDQvtC60YDRg9C20L3QvtGB0YLRjFxuICAgICAgICBpZiAoKFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXQuVHlwZVVuaXQgPT09IFwi0J7QutGA0YPQttC90L7RgdGC0YxcIiB8fCBcItCi0L7Rh9C60LBcIikgJiZcbiAgICAgICAgICAgICAgICAoU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5SICE9PSB1bmRlZmluZWQpKSB7XG4gICAgICAgICAgICBjb29yZCA9IFtOdW1iZXIoU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5PcmRpbmF0ZS5ZKSwgTnVtYmVyKFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXQuT3JkaW5hdGUuWCldO1xuICAgICAgICAgICAgcmVfcHJvamVjdGVkID0gY29udmVydENvb3JkKGNvb3JkKTtcbiAgICAgICAgICAgIHJldHVybiB7XG4gICAgICAgICAgICAgICAgJ1InOiBOdW1iZXIoU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5SKSxcbiAgICAgICAgICAgICAgICAnWSc6IE51bWJlcihyZV9wcm9qZWN0ZWRbMF0pLFxuICAgICAgICAgICAgICAgICdYJzogTnVtYmVyKHJlX3Byb2plY3RlZFsxXSlcbiAgICAgICAgICAgIH07XG4gICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICBpZiAoU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5sZW5ndGggPT09IDEpXG4gICAgICAgICAgICAgICAgcmV0dXJuIG51bGw7XG4gICAgICAgICAgICB2YXIgZmlyc3RQb2ludCA9IFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXRbMF07XG4gICAgICAgICAgICB2YXIgbGFzdFBvaW50ID0gU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdFtTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0Lmxlbmd0aCAtIDFdO1xuICAgICAgICAgICAgaWYgKGZpcnN0UG9pbnQuU3VObWIgPT09IGxhc3RQb2ludC5TdU5tYikge1xuICAgICAgICAgICAgICAgIExpbmVTdHJpbmcgPSBmYWxzZTtcbiAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKExpbmVTdHJpbmcsIGZpcnN0UG9pbnQuU3VObWIsIGxhc3RQb2ludC5TdU5tYik7XG4gICAgICAgICAgICAgICAgZm9yICh2YXIgaiA9IDA7IGogPCBTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0Lmxlbmd0aCAtIDE7IGorKykge1xuICAgICAgICAgICAgICAgICAgICB2YXIgcG9pbnQgPSBTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0W2pdO1xuICAgICAgICAgICAgICAgICAgICB2YXIgeHkgPSBbXTtcbiAgICAgICAgICAgICAgICAgICAgY29vcmQgPSBbTnVtYmVyKHBvaW50Lk9yZGluYXRlLlkpLCBOdW1iZXIocG9pbnQuT3JkaW5hdGUuWCldO1xuICAgICAgICAgICAgICAgICAgICByZV9wcm9qZWN0ZWQgPSBjb252ZXJ0Q29vcmQoY29vcmQpO1xuICAgICAgICAgICAgICAgICAgICB4eS5wdXNoKE51bWJlcihyZV9wcm9qZWN0ZWRbMF0pKTtcbiAgICAgICAgICAgICAgICAgICAgeHkucHVzaChOdW1iZXIocmVfcHJvamVjdGVkWzFdKSk7XG4gICAgICAgICAgICAgICAgICAgIGNvbnRvdXIucHVzaCh4eSk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIGNvbnRvdXIucHVzaChjb250b3VyWzBdKTtcbiAgICAgICAgICAgICAgICBBcmVhID0gcG9seWdvbkFyZWEoeHMsIHlzLCB4cy5sZW5ndGgpO1xuICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICBMaW5lU3RyaW5nID0gdHJ1ZTtcbiAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKExpbmVTdHJpbmcsIGZpcnN0UG9pbnQuU3VObWIsIGxhc3RQb2ludC5TdU5tYik7XG4gICAgICAgICAgICAgICAgZm9yICh2YXIgaiA9IDA7IGogPCBTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0Lmxlbmd0aDsgaisrKSB7XG4gICAgICAgICAgICAgICAgICAgIHZhciBwb2ludCA9IFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXRbal07XG4gICAgICAgICAgICAgICAgICAgIHZhciB4eSA9IFtdO1xuICAgICAgICAgICAgICAgICAgICBjb29yZCA9IFtOdW1iZXIocG9pbnQuT3JkaW5hdGUuWSksIE51bWJlcihwb2ludC5PcmRpbmF0ZS5YKV07XG4gICAgICAgICAgICAgICAgICAgIHJlX3Byb2plY3RlZCA9IGNvbnZlcnRDb29yZChjb29yZCk7XG4gICAgICAgICAgICAgICAgICAgIHh5LnB1c2goTnVtYmVyKHJlX3Byb2plY3RlZFswXSkpO1xuICAgICAgICAgICAgICAgICAgICB4eS5wdXNoKE51bWJlcihyZV9wcm9qZWN0ZWRbMV0pKTtcbiAgICAgICAgICAgICAgICAgICAgY29udG91ci5wdXNoKHh5KTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgLy8g0LHRi9Cy0LDQtSDRh9GC0L4gTGluZVN0cmluZyDQuNC80LXQtdGCINC+0LTQuNC90LDQutC+0LLRi9C1INC/0LXRgNCy0YPRjiDQuCDQv9C+0YHQu9C10LTQvdGO0Y4g0YLQvtGH0LrQuFxuICAgICAgICAgICAgICAgIC8vINC90L4gU3VObWIg0YDQsNC30L3Ri9C1LlxuLy8gICAgICAgICAgICAgICAgaWYgKChjb250b3VyWzBdWzBdWzBdID09PSBjb250b3VyWzBdW2NvbnRvdXJbMF0ubGVuZ3RoLTFdWzBdKSAmJlxuLy8gICAgICAgICAgICAgICAgICAgICAgICAoY29udG91clswXVswXVsxXSA9PT0gY29udG91clswXVtjb250b3VyWzBdLmxlbmd0aC0xXVsxXSkpe1xuLy8gICAgICAgICAgICAgICAgICAgIGRlbGV0ZShjb250b3VyWzBdW2NvbnRvdXIubGVuZ3RoLTFdKTtcbi8vICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZyhjb250b3VyWzBdWzBdWzBdLCBjb250b3VyWzBdW2NvbnRvdXJbMF0ubGVuZ3RoLTFdWzBdLExpbmVTdHJpbmcpO1xuLy8gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfVxuICAgICAgICAgICAgLy9jb25zb2xlLmxvZyhBcmVhKTtcbiAgICAgICAgICAgIHJldHVybiBjb250b3VyO1xuICAgICAgICB9XG4gICAgfVxuXG4gICAgZnVuY3Rpb24gcHJvY2Vzc1NwYXRpYWxFbGVtZW50KFNwYXRpYWxFbGVtZW50KSB7XG4gICAgICAgIHZhciBjbnRycyA9IFtdO1xuICAgICAgICBpZiAoX3Byb2ogIT09IG51bGwpIHtcbiAgICAgICAgICAgIHNwYXRpYWxTeXNOYW1lID0gZ2V0U3BhdGlhbFN5c05hbWUoKTtcbiAgICAgICAgfVxuICAgICAgICAvLyDQo9GC0LjQvdC90LDRjyDRgtC40L/QuNC30LDRhtC40Y8g0LTQu9GPINC/0YDQvtCy0LXRgNC60Lgg0L3QsNC70LjRh9C40Y8g0LTRi9GA0L7QuiDQsiDQv9C+0LvQuNCz0L7QvdC1XG4gICAgICAgIC8vINCSINCg0L7RgdGA0LXQtdGB0YLRgNC1INC90LUg0YHQu9C10LTRj9GCINC30LAg0L/QvtGA0Y/QtNC60L7QvCDQutC+0L3RgtGD0YDQvtCyINC/0L7Qu9C40LPQvtC90LBcbiAgICAgICAgaWYgKFNwYXRpYWxFbGVtZW50LnNwbGljZSkge1xuICAgICAgICAgICAgdmFyIE1heEFyZWE7XG4gICAgICAgICAgICB2YXIgTWF4QXJlYUlkeCA9IDA7XG4gICAgICAgICAgICBmb3IgKHZhciBrID0gMDsgayA8IFNwYXRpYWxFbGVtZW50Lmxlbmd0aDsgaysrKSB7XG4gICAgICAgICAgICAgICAgdmFyIGNvbnRvdXIgPSBTcGF0aWFsRWxlbWVudFtrXTtcbiAgICAgICAgICAgICAgICB2YXIgY250ID0gY3JlYXRlQ29udG91cihjb250b3VyKTtcbiAgICAgICAgICAgICAgICBpZiAoY250KVxuICAgICAgICAgICAgICAgICAgICBjbnRycy5wdXNoKGNudCk7XG4gICAgICAgICAgICAgICAgaWYgKEFyZWEgPiBNYXhBcmVhKSB7XG4gICAgICAgICAgICAgICAgICAgIE1heEFyZWEgPSBBcmVhO1xuICAgICAgICAgICAgICAgICAgICBNYXhBcmVhSWR4ID0gaztcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICAvLyDQn9C10YDQtdC80LXRidCw0LXQvCDQvtGB0L3QvtCy0L3QvtC5ICjQvdCw0YDRg9C20L3QuNC5KSDQutC+0L3RgtGD0YAg0LIg0L3QsNGH0LDQu9C+INC80LDRgdGB0LjQstCwXG4gICAgICAgICAgICBpZiAoTWF4QXJlYUlkeCA+IDApIHtcbiAgICAgICAgICAgICAgICB2YXIgbWFpbkNudCA9IGNudHJzLnNwbGljZShNYXhBcmVhSWR4LCAxKTtcbiAgICAgICAgICAgICAgICBjbnRycy5zcGxpY2UoMCwgMCwgbWFpbkNudCk7XG4gICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZygn0J3QvtC80LXRgCDQvtGB0L3QvtCy0L3QvtCz0L4g0LrQvtC90YLRg9GA0LAg0LHRi9C7ICcgKyBNYXhBcmVhSWR4KTtcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIGlmICgoY250cnMgIT09IG51bGwpIHx8IChjbnRycyAhPT0gdW5kZWZpbmVkKSkge1xuICAgICAgICAgICAgICAgIHJldHVybiBjbnRycztcbiAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgcmV0dXJuIG51bGw7XG4gICAgICAgICAgICB9XG4gICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICBjbnRycy5wdXNoKGNyZWF0ZUNvbnRvdXIoU3BhdGlhbEVsZW1lbnQpKTtcbiAgICAgICAgICAgIGlmICgoY250cnMgIT09IG51bGwpIHx8IChjbnRycyAhPT0gdW5kZWZpbmVkKSkge1xuICAgICAgICAgICAgICAgIHJldHVybiBjbnRycztcbiAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgcmV0dXJuIG51bGw7XG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cbiAgICAvLyDRgyDRgdC+0L7RgNGD0LbQtdC90LjQuSDQvNC+0LbQtdGCINCx0YvRgtGMINGB0LzQtdGI0LDQvdCw0Y8g0LPQtdC+0LzQtdGC0YDQuNGPIChMaW5lU3RyaW5nLCBMaW5lU3RyaW5nLCBDaXJjbGUsIExpbmVTdHJpbmcpXG4gICAgLy8g0LIg0Y3RgtC+0Lwg0YHQu9GD0YfQsNC1INC60L7QvdGC0YPRgNGLIGNudHJzINCx0YPQtNGD0YIg0YXRgNCw0L3QuNGC0Ywg0LrQvtC70LvQtdC60YbQuNGOXG4gICAgZnVuY3Rpb24gcHJvY2Vzc1JlYWx0eVNwYXRpYWxFbGVtZW50KFNwYXRpYWxFbGVtZW50KSB7XG4gICAgICAgIHZhciBjbnRycyA9IFtdO1xuICAgICAgICBpZiAoX3Byb2ogIT09IG51bGwpIHtcbiAgICAgICAgICAgIHNwYXRpYWxTeXNOYW1lID0gZ2V0U3BhdGlhbFN5c05hbWUoKTtcbiAgICAgICAgfVxuICAgICAgICBpZiAoU3BhdGlhbEVsZW1lbnQuc3BsaWNlKSB7XG4gICAgICAgICAgICB2YXIgTWF4QXJlYTtcbiAgICAgICAgICAgIHZhciBNYXhBcmVhSWR4ID0gMDtcbiAgICAgICAgICAgIGZvciAodmFyIGsgPSAwOyBrIDwgU3BhdGlhbEVsZW1lbnQubGVuZ3RoOyBrKyspIHtcbiAgICAgICAgICAgICAgICB2YXIgY29udG91ciA9IFNwYXRpYWxFbGVtZW50W2tdO1xuICAgICAgICAgICAgICAgIHZhciBjbnQgPSBjcmVhdGVDb250b3VyKGNvbnRvdXIpO1xuICAgICAgICAgICAgICAgIGlmIChjbnQpXG4gICAgICAgICAgICAgICAgICAgIGNudHJzLnB1c2goY250KTtcbiAgICAgICAgICAgICAgICBpZiAoQXJlYSA+IE1heEFyZWEpIHtcbiAgICAgICAgICAgICAgICAgICAgTWF4QXJlYSA9IEFyZWE7XG4gICAgICAgICAgICAgICAgICAgIE1heEFyZWFJZHggPSBrO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIC8vINCf0LXRgNC10LzQtdGJ0LDQtdC8INC+0YHQvdC+0LLQvdC+0LkgKNC90LDRgNGD0LbQvdC40LkpINC60L7QvdGC0YPRgCDQsiDQvdCw0YfQsNC70L4g0LzQsNGB0YHQuNCy0LBcbiAgICAgICAgICAgIGlmICgoIUxpbmVTdHJpbmcpICYmIChNYXhBcmVhSWR4ID4gMCkpIHtcbiAgICAgICAgICAgICAgICB2YXIgbWFpbkNudCA9IGNudHJzLnNwbGljZShNYXhBcmVhSWR4LCAxKTtcbiAgICAgICAgICAgICAgICBjbnRycy5zcGxpY2UoMCwgMCwgbWFpbkNudCk7XG4gICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZygn0J3QvtC80LXRgCDQvtGB0L3QvtCy0L3QvtCz0L4g0LrQvtC90YLRg9GA0LAg0LHRi9C7ICcgKyBNYXhBcmVhSWR4KTtcbiAgICAgICAgICAgIH1cbiAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgIGNudHJzLnB1c2goY3JlYXRlQ29udG91cihTcGF0aWFsRWxlbWVudCkpO1xuICAgICAgICB9XG4gICAgICAgIGlmIChjbnRycy5sZW5ndGggPiAxKSB7XG4gICAgICAgICAgICBjb2xsZWN0aW9uID0gW107XG5cbiAgICAgICAgICAgIGZvciAodmFyIGkgPSAwOyBpIDwgY250cnMubGVuZ3RoIC0gMTsgaSsrKSB7XG4gICAgICAgICAgICAgICAgLy8g0J7QutGA0YPQttC90L7RgdGC0YxcbiAgICAgICAgICAgICAgICBpZiAoY250cnNbaV0uUikge1xuICAgICAgICAgICAgICAgICAgICB2YXIgcG9pbnRzID0gYXBwcm94aW1hdGVDaXJjbGUoY250cnNbaV0uWCwgY250cnNbaV0uWSwgY250cnNbaV0uUik7XG4gICAgICAgICAgICAgICAgICAgIGNvbGxlY3Rpb24ucHVzaCh7XG4gICAgICAgICAgICAgICAgICAgICAgICBcInR5cGVcIjogXCJQb2x5Z29uXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBcImNvb3JkaW5hdGVzXCI6IFtwb2ludHNdXG4gICAgICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAvLyDQn9C+0LvQuNCz0L7QvVxuICAgICAgICAgICAgICAgIGVsc2UgaWYgKCFMaW5lU3RyaW5nKSB7XG4gICAgICAgICAgICAgICAgICAgIGNvbGxlY3Rpb24ucHVzaCh7XG4gICAgICAgICAgICAgICAgICAgICAgICBcInR5cGVcIjogXCJQb2x5Z29uXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBcImNvb3JkaW5hdGVzXCI6IFtjbnRyc1tpXV1cbiAgICAgICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICAgICAgY29sbGVjdGlvbi5wdXNoKHtcbiAgICAgICAgICAgICAgICAgICAgICAgIFwidHlwZVwiOiBcIkxpbmVTdHJpbmdcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIFwiY29vcmRpbmF0ZXNcIjogY250cnNbaV1cbiAgICAgICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfVxuICAgICAgICAgICAgcmV0dXJuICB7XG4gICAgICAgICAgICAgICAgXCJ0eXBlXCI6IFwiR2VvbWV0cnlDb2xsZWN0aW9uXCIsXG4gICAgICAgICAgICAgICAgXCJnZW9tZXRyaWVzXCI6IGNvbGxlY3Rpb25cbiAgICAgICAgICAgIH07XG5cbiAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgIC8vINCe0LrRgNGD0LbQvdC+0YHRgtGMXG4gICAgICAgICAgICBpZiAoY250cnNbMF0uUikge1xuICAgICAgICAgICAgICAgIHZhciBwb2ludHMgPSBhcHByb3hpbWF0ZUNpcmNsZShjbnRyc1swXS5YLCBjbnRyc1swXS5ZLCBjbnRyc1swXS5SKTtcbiAgICAgICAgICAgICAgICByZXR1cm4ge1xuICAgICAgICAgICAgICAgICAgICBcInR5cGVcIjogXCJQb2x5Z29uXCIsXG4gICAgICAgICAgICAgICAgICAgIFwiY29vcmRpbmF0ZXNcIjogW3BvaW50c11cbiAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgLy8g0J/QvtC70LjQs9C+0L1cbiAgICAgICAgICAgIGVsc2UgaWYgKCFMaW5lU3RyaW5nKSB7XG4gICAgICAgICAgICAgICAgcmV0dXJue1xuICAgICAgICAgICAgICAgICAgICBcInR5cGVcIjogXCJQb2x5Z29uXCIsXG4gICAgICAgICAgICAgICAgICAgIFwiY29vcmRpbmF0ZXNcIjogW2NudHJzWzBdXVxuICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgIHJldHVybntcbiAgICAgICAgICAgICAgICAgICAgXCJ0eXBlXCI6IFwiTGluZVN0cmluZ1wiLFxuICAgICAgICAgICAgICAgICAgICBcImNvb3JkaW5hdGVzXCI6IGNudHJzWzBdXG4gICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cblxuICAgIGZ1bmN0aW9uIGFwcHJveGltYXRlQ2lyY2xlKFgsIFksIFIpIHtcbiAgICAgICAgdmFyIHJvdGF0ZWRBbmdsZSwgeCwgeTtcbiAgICAgICAgdmFyIHNpZGVzID0gMzI7XG4gICAgICAgIHZhciBwb2ludHMgPSBbXTtcbiAgICAgICAgeCA9IFggKyBSOyAvLyDRgdC00LLQuNCzINC90LAg0L7QutGA0YPQttC90L7RgdGC0YxcbiAgICAgICAgLy9jb25zb2xlLmxvZygnYXBwcm94aW1hdGVDaXJjbGUnKTtcbiAgICAgICAgZm9yICh2YXIgZCA9IDA7IGQgPCBzaWRlcyAtIDE7IGQrKykge1xuICAgICAgICAgICAgdmFyIHh5ID0gW107XG4gICAgICAgICAgICByb3RhdGVkQW5nbGUgPSAoZCAqIDIgKiBNYXRoLlBJIC8gc2lkZXMpOy8vYW5nbGUgKyAoZCAqIDIgKiBNYXRoLlBJIC8gc2lkZXMpO1xuICAgICAgICAgICAgeCA9IFggKyAoUiAqIE1hdGguY29zKHJvdGF0ZWRBbmdsZSkpO1xuICAgICAgICAgICAgeSA9IFkgKyAoUiAqIE1hdGguc2luKHJvdGF0ZWRBbmdsZSkpO1xuICAgICAgICAgICAgY29vcmQgPSBbTnVtYmVyKHkpLCBOdW1iZXIoeCldO1xuICAgICAgICAgICAgeHkucHVzaChjb29yZFswXSk7XG4gICAgICAgICAgICB4eS5wdXNoKGNvb3JkWzFdKTtcbiAgICAgICAgICAgIHBvaW50cy5wdXNoKHh5KTtcbiAgICAgICAgfVxuICAgICAgICBwb2ludHMucHVzaChwb2ludHNbMF0pO1xuICAgICAgICByZXR1cm4gcG9pbnRzO1xuICAgIH1cblxuICAgIGlmICgoX0VudGl0eVNwYXRpYWxPYmogIT09IHVuZGVmaW5lZCkgJiYgKF9FbnRpdHlTcGF0aWFsT2JqICE9PSBudWxsKSkge1xuXG4gICAgICAgIHZhciBjbnRycyA9IFtdO1xuXG4gICAgICAgIHN3aXRjaCAob1R5cGUpIHtcbiAgICAgICAgICAgIGNhc2UgJ1BhcmNlbCcgOlxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAgIGNudHJzID0gcHJvY2Vzc1NwYXRpYWxFbGVtZW50KF9FbnRpdHlTcGF0aWFsT2JqLlNwYXRpYWxFbGVtZW50KTtcbiAgICAgICAgICAgICAgICAvLyDQldGB0LvQuCDRjdGC0L4g0LTQu9GPINC80L3QvtCz0L7QutC+0L3RgtGD0YDQvdC+0LPQviDQvtCx0YrQtdC60YLQsCwg0YLQviDQstC+0LfQstGA0LDRidC10Lwg0LzQsNGB0YHQuNCyINC60L7QvdGC0YPRgNC+0LJcbiAgICAgICAgICAgICAgICBpZiAocGFydE9mTXVsdHUpIHtcbiAgICAgICAgICAgICAgICAgICAgcmV0dXJuIGNudHJzO1xuICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgIHJldHVybiB7XG4gICAgICAgICAgICAgICAgICAgICAgICB0eXBlOiBcIlBvbHlnb25cIixcbiAgICAgICAgICAgICAgICAgICAgICAgIGNvb3JkaW5hdGVzOiBjbnRyc1xuICAgICAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICBicmVhaztcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIGNhc2UgJ0NvbnN0cnVjdGlvbic6XG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICAgcmV0dXJuIHByb2Nlc3NSZWFsdHlTcGF0aWFsRWxlbWVudChfRW50aXR5U3BhdGlhbE9iai5TcGF0aWFsRWxlbWVudCk7XG4gICAgICAgICAgICAgICAgYnJlYWs7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBjYXNlICdCdWlsZGluZyc6XG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICAgcmV0dXJuIHByb2Nlc3NSZWFsdHlTcGF0aWFsRWxlbWVudChfRW50aXR5U3BhdGlhbE9iai5TcGF0aWFsRWxlbWVudCk7XG4gICAgICAgICAgICAgICAgYnJlYWs7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBjYXNlICdVbmNvbXBsZXRlZCc6XG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICAgcmV0dXJuIHByb2Nlc3NSZWFsdHlTcGF0aWFsRWxlbWVudChfRW50aXR5U3BhdGlhbE9iai5TcGF0aWFsRWxlbWVudCk7XG4gICAgICAgICAgICAgICAgYnJlYWs7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBjYXNlICdab25lJzpcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgICBjbnRycyA9IHByb2Nlc3NTcGF0aWFsRWxlbWVudChfRW50aXR5U3BhdGlhbE9iai5TcGF0aWFsRWxlbWVudCk7XG4gICAgICAgICAgICAgICAgaWYgKHBhcnRPZk11bHR1KSB7XG4gICAgICAgICAgICAgICAgICAgIHJldHVybiBjbnRycztcbiAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICByZXR1cm4ge1xuICAgICAgICAgICAgICAgICAgICAgICAgdHlwZTogXCJQb2x5Z29uXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBjb29yZGluYXRlczogY250cnNcbiAgICAgICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgYnJlYWs7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBjYXNlICdRdWFydGFsJzpcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgICBjbnRycyA9IHByb2Nlc3NTcGF0aWFsRWxlbWVudChfRW50aXR5U3BhdGlhbE9iai5TcGF0aWFsRWxlbWVudCk7XG4gICAgICAgICAgICAgICAgaWYgKHBhcnRPZk11bHR1KSB7XG4gICAgICAgICAgICAgICAgICAgIHJldHVybiBjbnRycztcbiAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICByZXR1cm4ge1xuICAgICAgICAgICAgICAgICAgICAgICAgdHlwZTogXCJQb2x5Z29uXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBjb29yZGluYXRlczogY250cnNcbiAgICAgICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgYnJlYWs7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBjYXNlICdCb3VuZCc6XG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICAgY250cnMgPSBwcm9jZXNzU3BhdGlhbEVsZW1lbnQoX0VudGl0eVNwYXRpYWxPYmouU3BhdGlhbEVsZW1lbnQpO1xuICAgICAgICAgICAgICAgIGlmIChwYXJ0T2ZNdWx0dSkge1xuICAgICAgICAgICAgICAgICAgICByZXR1cm4gY250cnM7XG4gICAgICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICAgICAgcmV0dXJuIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIHR5cGU6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgY29vcmRpbmF0ZXM6IGNudHJzXG4gICAgICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgZGVmYXVsdCA6XG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ci0LjQvyDQvtCx0YrQtdC60YLQsCDQvdC1INGA0LDRgdC/0L7Qt9C90LDQvScpO1xuICAgICAgICAgICAgICAgIHJldHVybiBudWxsO1xuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuXG59XG47XG4iLCIvKiBcbiAqIFRoZSBNSVQgTGljZW5zZVxuICpcbiAqIENvcHlyaWdodCAyMDE1IGZpbGlwcG92LlxuICpcbiAqIFBlcm1pc3Npb24gaXMgaGVyZWJ5IGdyYW50ZWQsIGZyZWUgb2YgY2hhcmdlLCB0byBhbnkgcGVyc29uIG9idGFpbmluZyBhIGNvcHlcbiAqIG9mIHRoaXMgc29mdHdhcmUgYW5kIGFzc29jaWF0ZWQgZG9jdW1lbnRhdGlvbiBmaWxlcyAodGhlIFwiU29mdHdhcmVcIiksIHRvIGRlYWxcbiAqIGluIHRoZSBTb2Z0d2FyZSB3aXRob3V0IHJlc3RyaWN0aW9uLCBpbmNsdWRpbmcgd2l0aG91dCBsaW1pdGF0aW9uIHRoZSByaWdodHNcbiAqIHRvIHVzZSwgY29weSwgbW9kaWZ5LCBtZXJnZSwgcHVibGlzaCwgZGlzdHJpYnV0ZSwgc3VibGljZW5zZSwgYW5kL29yIHNlbGxcbiAqIGNvcGllcyBvZiB0aGUgU29mdHdhcmUsIGFuZCB0byBwZXJtaXQgcGVyc29ucyB0byB3aG9tIHRoZSBTb2Z0d2FyZSBpc1xuICogZnVybmlzaGVkIHRvIGRvIHNvLCBzdWJqZWN0IHRvIHRoZSBmb2xsb3dpbmcgY29uZGl0aW9uczpcbiAqXG4gKiBUaGUgYWJvdmUgY29weXJpZ2h0IG5vdGljZSBhbmQgdGhpcyBwZXJtaXNzaW9uIG5vdGljZSBzaGFsbCBiZSBpbmNsdWRlZCBpblxuICogYWxsIGNvcGllcyBvciBzdWJzdGFudGlhbCBwb3J0aW9ucyBvZiB0aGUgU29mdHdhcmUuXG4gKlxuICogVEhFIFNPRlRXQVJFIElTIFBST1ZJREVEIFwiQVMgSVNcIiwgV0lUSE9VVCBXQVJSQU5UWSBPRiBBTlkgS0lORCwgRVhQUkVTUyBPUlxuICogSU1QTElFRCwgSU5DTFVESU5HIEJVVCBOT1QgTElNSVRFRCBUTyBUSEUgV0FSUkFOVElFUyBPRiBNRVJDSEFOVEFCSUxJVFksXG4gKiBGSVRORVNTIEZPUiBBIFBBUlRJQ1VMQVIgUFVSUE9TRSBBTkQgTk9OSU5GUklOR0VNRU5ULiBJTiBOTyBFVkVOVCBTSEFMTCBUSEVcbiAqIEFVVEhPUlMgT1IgQ09QWVJJR0hUIEhPTERFUlMgQkUgTElBQkxFIEZPUiBBTlkgQ0xBSU0sIERBTUFHRVMgT1IgT1RIRVJcbiAqIExJQUJJTElUWSwgV0hFVEhFUiBJTiBBTiBBQ1RJT04gT0YgQ09OVFJBQ1QsIFRPUlQgT1IgT1RIRVJXSVNFLCBBUklTSU5HIEZST00sXG4gKiBPVVQgT0YgT1IgSU4gQ09OTkVDVElPTiBXSVRIIFRIRSBTT0ZUV0FSRSBPUiBUSEUgVVNFIE9SIE9USEVSIERFQUxJTkdTIElOXG4gKiBUSEUgU09GVFdBUkUuXG4gKi9cblxuLyogINCh0Lhj0YLQtdC80Ysg0LrQvtC+0YDQtNC40L3QsNGCINC40LzQtdGO0YIg0YHQvNGL0YHQuyDQtNC70Y8g0LLQuNC30YPQsNC70LjQt9Cw0YbQuNC4INC/0L7Qu9GD0YfQsNC10LzRi9GFIEdlb0pTT04sXG4gICAg0LTQu9GPINGB0L7RhdGA0LDQvdC10L3QuNGPINCyINGE0LDQudC7INC90LXRgiDQvdCw0LTQvtCx0L3QvtGB0YLQuCDQsiDQv9GA0LXQvtCx0YDQsNC30L7QstCw0L3QuNC4LlxuICAgINCY0L3RhNC+0YDQvNCw0YbQuNGPINC+INGB0LjRgdGC0LXQvNCw0YUg0LrQvtC+0YDQtNC40L3QsNGCINGF0YDQsNC90LjRgtGB0Y8g0LIg0YLQtdCz0LUgPENvb3JkU3lzdGVtcz5cbiAgICA8Q29vcmRTeXN0ZW1zPlxuICAgICAgICA8bnMzOkNvb3JkU3lzdGVtIE5hbWU9XCLQnNCh0JogNzAsINC30L7QvdCwIDNcIiBDc0lkPVwiSUQzXCIgLz5cbiAgICAgICAgPG5zMzpDb29yZFN5c3RlbSBOYW1lPVwi0JzQodCaIDcwLCDQt9C+0L3QsCA0XCIgQ3NJZD1cIklENFwiIC8+XG4gICAgPC9Db29yZFN5c3RlbXM+XG4gICAg0LjRhSDQvNC+0LbQtdGCINCx0YvRgtGMINC90LXRgdC60L7Qu9GM0LrQvi5cbiAgICDQoyDQvtCx0YrQtdC60YLQvtCyINCyINGC0LXQs9C1IDxFbnRpdHlTcGF0aWFsPiDRg9C60LDQt9Cw0L3QviDQsiDQutCw0LrQvtC5INCh0Jog0L7QvSDQuNC80LXQtdGCINC60L7QvtGA0LTQuNC90LDRgtGLLFxuICAgINC90LDQv9GA0LjQvNC10YA6XG4gICAgPEVudGl0eVNwYXRpYWwgRW50U3lzPVwiSUQzXCI+XG5cbiAgICDQv9GA0L7QsdC70LXQvNGLINC60L7QvdCy0LXRgNGC0LDRhtC40Lgg0YMg0YLQtdGFIHhtbCDRgyDQutC+0YLQvtGA0YvQuSDRg9C60LDQt9Cw0L3QviA8bnMzOkNvb3JkU3lzdGVtIE5hbWU9XCLQodCaINC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDQvtC60YDRg9Cz0LBcIiBDc0lkPVwiSUQxXCIgLz5cbiovIFxuXG5cbm1vZHVsZS5leHBvcnRzLlNwYXRpYWxTeXN0ZW1zID0ge1xuICAgIC8vINCi0L7QvNGB0LrQsNGPINC+0LHQu9Cw0YHRgtGMXG4gICAgJ9Cc0KHQmiA3MCwg0LfQvtC90LAgNCc6ICcrcHJvaj10bWVyYyArbGF0XzA9MCArbG9uXzA9ODMuNzMzMzMzMzMzMzMgK2s9MSAreF8wPTQyNTAwMDAgK3lfMD0tNTkxMjkwMC41NjYgK2VsbHBzPWtyYXNzICt0b3dnczg0PTIzLjU3LC0xNDAuOTUsLTc5LjgsMCwwLjM1LDAuNzksLTAuMjIgK3VuaXRzPW0gK25vX2RlZnMnLFxuICAgICfQnNCh0JogNzAsINC30L7QvdCwIDInOiAnK3Byb2o9dG1lcmMgK2xhdF8wPTAgK2xvbl8wPTc3LjczMzMzMzMzMzMzICtrPTEgK3hfMD0yMjUwMDAwICt5XzA9LTU5MTI5MDAuNTY2ICtlbGxwcz1rcmFzcyArdG93Z3M4ND0yMy41NywtMTQwLjk1LC03OS44LDAsMC4zNSwwLjc5LC0wLjIyICt1bml0cz1tICtub19kZWZzJyxcbiAgICAn0JzQodCaIDcwLCDQt9C+0L3QsCAzJzogJytwcm9qPXRtZXJjICtsYXRfMD0wICtsb25fMD04MC43MzMzMzMzMzMzMyAraz0xICt4XzA9MzI1MDAwMCAreV8wPS01OTEyOTAwLjU2NiArZWxscHM9a3Jhc3MgK3Rvd2dzODQ9MjMuNTcsLTE0MC45NSwtNzkuOCwwLDAuMzUsMC43OSwtMC4yMiArdW5pdHM9bSArbm9fZGVmcydcbn07Il19
