(function e(t,n,r){function s(o,u){if(!n[o]){if(!t[o]){var a=typeof require=="function"&&require;if(!u&&a)return a(o,!0);if(i)return i(o,!0);var f=new Error("Cannot find module '"+o+"'");throw f.code="MODULE_NOT_FOUND",f}var l=n[o]={exports:{}};t[o][0].call(l.exports,function(e){var n=t[o][1][e];return s(n?n:e)},l,l.exports,e,t,n,r)}return n[o].exports}var i=typeof require=="function"&&require;for(var o=0;o<r.length;o++)s(r[o]);return s})({1:[function(require,module,exports){
/* 
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */

(function () {
    var Converter = require('./cadXML2GeoJSON.js');

    var parcelStyle = {
        fillColor: "#b8e50e",
        color: "#000",
        weight: 1,
        opacity: 1,
        fillOpacity: 0.8
    };
    var oksStyle = {
        fillColor: "#ff7800",
        color: "#000",
        weight: 1,
        opacity: 1,
        fillOpacity: 0.5
    };
    var quartallStyle = {
        fillColor: "#e4dea4",
        color: "#000",
        weight: 1,
        opacity: 1,
        fillOpacity: 0.3
    };
    var zoneStyle = {
        fillColor: "#f91414",
        color: "#000",
        weight: 1,
        opacity: 1,
        fillOpacity: 0.8
    };
    var boundlStyle = {
        fillColor: "#4b5c70",
        color: "#000",
        weight: 1,
        opacity: 1,
        fillOpacity: 0.8
    };

    function layerFActory(geoJSON, layerStyle) {
        geoJSON.crs = {
            "type": "name",
            "properties": {
                "name": "urn:ogc:def:crs:EPSG::3857"
            }
        };
        return L.Proj.geoJson(
                geoJSON, {
                    style: layerStyle,
                    onEachFeature: function (feature, layer)
                    {
                        //layer.bindPopup(feature.properties);
                    }
                }
        );
    }

    var data = {

        init: function (map, reproject) {
            data._map = map;
            data.reproject = reproject;
            data._groups = {

            };

            data._exportCont = document.getElementById('exportCont');
            data._fileProgress = document.getElementById('fileProgress');
            var exportIcon = null;
            if (navigator.msSaveBlob) { // IE 10+
                exportIcon = L.DomUtil.create('button', 'button', data._exportCont);
            } else {
                exportIcon = L.DomUtil.create('a', 'button', data._exportCont);
                exportIcon.setAttribute('target', '_blank');
                exportIcon.setAttribute('href', '');
            }
            exportIcon.innerHTML = 'Экспорт в GeoJSON';
//      var convertCoord = L.DomUtil.get('convertMSK');
//      L.DomUtil.removeClass(convertCoord, 'hidden');
            data._countSpan = L.DomUtil.create('span', '', data._exportCont);
            exportIcon.addEventListener('click', function () {
                var obj = data.getBlob();
                if (navigator.msSaveOrOpenBlob) { // IE 10+
                    navigator.msSaveOrOpenBlob(obj.blob, obj.file);
                } else {
                    exportIcon.setAttribute('download', obj.file);
                    exportIcon.setAttribute('href', window.URL.createObjectURL(obj.blob));
                }
                data._countSpan.innerHTML = '(геометрий: <b>' + obj.count + '</b>)';
            }, false);
            L.DomUtil.addClass(data._exportCont, 'hidden');
            data._kptInfo = document.getElementById('kptInfo');

        },

        getBlob: function () {
            var fc = null,
                    items = data._groups;
            for (var g in items) {
                var geojson = items[g];
                if (fc) {
                    Array.prototype.push.apply(fc.features, geojson.features);
                } else {
                    fc = geojson;
                }
            }
            return {
                file: 'data_' + Date.now() + '.geojson',
                blob: new Blob([JSON.stringify(fc, null, '\t')], {type: 'text/json;charset=utf-8;'}),
                count: fc ? fc.features.length : 0
            };
        },

        selectFile: function (el) {
            data._kptInfo.innerHTML = '';
            data._fileProgress.innerHTML = '';
            L.DomUtil.addClass(data._exportCont, 'hidden');
            var reader = new FileReader(),
                    file = el.files[0];
            
            reader.onerror = function (e) {
                console.log(e.message);
            }
            reader.onload = function () {
                data._fileProgress.innerHTML = 'загружено: <b>' + file.size + '</b> байт';

                if (data._map.layers) {
                    for (var i = 0; i < data._map.layers.length; i++) {
                        data._map.removeLayer(data._map.layers[i]);
                    }
                }
                var oldLayerControl = document.getElementsByClassName('leaflet-control-layers');
                if (oldLayerControl.length>0) {
                    L.DomUtil.remove(oldLayerControl[0]);
                }
                data._groups = {};
                data.parseFile(reader);
            };
            reader.onprogress = function (info) {
                if (data.lengthComputable) {
                    var cnt = info.loaded / info.total;
                    data._fileProgress.innerHTML = 'загружено: <b>' + info.loaded + '</b> байт' + (cnt === 1 ? '' : '(' + parseInt(cnt * 100, 10) + '%)');
                }
            };
            if (el.files.length) {
                reader.readAsText(file);
            }
        },

        parseFile: function (reader) {
            // https://bitbucket.org/surenrao/xml2json
            // http://www.chrome-allow-file-access-from-file.com/
            var parsedData = Converter.GeoJSON(reader.result);
            var parcels = parsedData.geoJSONParcels;
            var oks = parsedData.geoJSONRealty;
            var zones = parsedData.geoJSONZones;
            var quartal = parsedData.geoJSONQuartal;
            var bounds = parsedData.geoJSONBounds;
            console.log(zones);
            console.log(bounds);
            data._groups = {
                parcels: parcels,
                oks: oks,
                zones: zones,
                quartal: quartal,
                bounds: bounds
            };

            var oksLayer = layerFActory(oks, oksStyle);
            var parcelLayer = layerFActory(parcels, parcelStyle);
            var zoneLayer = layerFActory(zones, zoneStyle);
            var boundLayer = layerFActory(bounds, boundlStyle);
            var quartalLayer = layerFActory(quartal, quartallStyle);

            var layerControl = L.control.layers({}, {
                'Квартал': quartalLayer,
                'Границы': boundLayer,
                'Зоны': zoneLayer,
                'Участки': parcelLayer,
                'ОКС': oksLayer
            }).addTo(data._map);

            data._map.fitBounds(parcelLayer.getBounds());
            L.DomUtil.removeClass(data._exportCont, 'hidden');
        }
    };
    window.convertedData = data;
})();

},{"./cadXML2GeoJSON.js":3}],2:[function(require,module,exports){
/* 
 * The MIT License
 *
 * Copyright 2015 filippov.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */
'use strict';
// Dicts

// Статус объекта недвижимости
var dStates = {
    '01': 'Ранее учтенный',
    '05': 'Временный',
    '06': 'Учтенный',
    '07': 'Снят с учета',
    '08': 'Аннулированный'
};
// Тип  объекта недвижимости
var dParcels = {
    '01': 'Землепользование',
    '02': 'Единое землепользование',
    '03': 'Обособленный участок',
    '04': 'Условный участок',
    '05': 'Многоконтурный участок',
    '06': 'Значение отсутствует'
};
// Категория земель
var dCategories = {
    '003001000000': 'Земли сельскохозяйственного назначения',
    '003002000000': 'Земли населённых пунктов',
    '003003000000': 'Земли промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, земли для обеспечения космической деятельности, земли обороны, безопасности и земли иного специального назначения',
    '003004000000': 'Земли особо охраняемых территорий и объектов',
    '003005000000': 'Земли лесного фонда',
    '003006000000': 'Земли водного фонда',
    '003007000000': 'Земли запаса',
    '003008000000': 'Категория не установлена'
};
// Ограничения (обременения) прав
var dEncumbrances = {
    '022001000000': 'Сервитут',
    '022001001000': 'Публичный сервитут',
    '022001002000': 'Частный сервитут',
    '022002000000': 'Арест',
    '022003000000': 'Запрещение',
    '022004000000': 'Ограничения прав на земельный участок, предусмотренные статьями 56, 56.1 Земельного кодекса Российской Федерации',
    '022005000000': 'Решение об изъятии земельного участка, жилого помещения',
    '022006000000': 'Аренда (в том числе, субаренда)',
    '022007000000': 'Ипотека',
    '022008000000': 'Ипотека в силу закона',
    '022009000000': 'Безвозмездное (срочное) пользование земельным/лесным участком',
    '022010000000': 'Доверительное управление',
    '022011000000': 'Рента',
    '022012000000': 'Запрет на совершение действий в сфере ГКУ в отношении ОН',
    '022099000000': 'Иные ограничения (обременения) прав'
};
// Единицы измерений
var dUnits = {
    '003': 'Миллиметр',
    '004': 'Сантиметр',
    '005': 'Дециметр',
    '006': 'Метр',
    '008': 'Километр',
    '009': 'Мегаметр',
    '047': 'Морская миля',
    '050': 'Квадратный миллиметр',
    '051': 'Квадратный сантиметр',
    '053': 'Квадратный дециметр',
    '055': 'Квадратный метр',
    '058': 'Тысяча квадратных метров',
    '059': 'Гектар',
    '061': 'Квадратный километр',
    '109': 'Ар (100 м2)',
    '359': 'Сутки',
    '360': 'Неделя',
    '361': 'Декада',
    '362': 'Месяц',
    '364': 'Квартал',
    '365': 'Полугодие',
    '356': 'Час',
    '355': 'Минута ',
    '366': 'Год',
    '383': 'Рубль',
    '384': 'Тысяча рублей',
    '385': 'Миллион рублей',
    '386': 'Миллиард рублей',
    '1000': 'Неопределено',
    '1001': 'Значение отсутствует',
    '1002': 'Рублей за кв. метр',
    '1003': 'Рублей за ар',
    '1004': 'Рублей  за гектар',
    '1005': 'Иные',
    '1006': 'Рублей за кв. км',
    '1007': 'Рабочий день'
};
// Все документы (Сборник классификаторов, коды 8.1, 8.2, 555, 558.1, 558.2, 558.3, 558.4, 558.5, 558.6)
var dAllDocuments = {
    '008001000000': 'Документы, удостоверяющие личность физического лица',
    '008001001000': 'Паспорт гражданина Российской Федерации',
    '008001002000': 'Паспорт гражданина СССР',
    '008001003000': 'Паспорт гражданина иностранного государства',
    '008001004000': 'Общегражданский заграничный паспорт',
    '008001005000': 'Заграничный паспорт Министерства морского флота',
    '008001006000': 'Дипломатический паспорт',
    '008001007000': 'Паспорт моряка (удостоверение личности моряка)',
    '008001008000': 'Военный билет военнослужащего',
    '008001009000': 'Временное удостоверение, выданное взамен военного билета',
    '008001010000': 'Удостоверение личности офицера Министерства обороны Российской Федерации, Министерства внутренних дел Российской Федерации и других воинских формирований с приложением справки о прописке (регистрации) Ф-33',
    '008001011000': 'Свидетельство о рождении',
    '008001012000': 'Свидетельство о рассмотрении ходатайства о признании беженцем на территории Российской Федерации по существу',
    '008001013000': 'Вид на жительство иностранного гражданина или лица без гражданства',
    '008001014000': 'Справка об освобождении из мест лишения свободы',
    '008001015000': 'Временное удостоверение личности гражданина Российской Федерации',
    '008001016000': 'Удостоверение вынужденного переселенца',
    '008001017000': 'Разрешение на временное проживание в Российской Федерации',
    '008001018000': 'Удостоверение беженца в Российской Федерации',
    '008001019000': 'Свидетельство о рассмотрении ходатайства о признании лица вынужденным переселенцем',
    '008001020000': 'Свидетельство о предоставлении временного убежища на территории Российской Федерации',
    '008001099000': 'Иные документы, предусмотренные законодательством Российской Федерации или признаваемые в соответствии с международным договором Российской Федерации в качестве документов, удостоверяющих личность',
    '008002000000': 'Документы, идентифицирующие юридическое лицо',
    '008002001000': 'Свидетельство о государственной регистрации юридического лица',
    '008002002000': 'Свидетельство о внесении записей в ЕГРЮЛ',
    '008002004000': 'Устав',
    '008002005000': 'Учредительный договор',
    '008002006000': 'Положение (общее положение об организации)',
    '008002007000': 'Свидетельство (или уведомление) о постановке на учёт в налоговом органе с указанием ИНН',
    '008002008000': 'Выписка из ЕГРЮЛ',
    '008002099000': 'Иной документ',
    '555001000000': 'Квитанция',
    '555002000000': 'Платёжное поручение',
    '555003000000': 'Чек',
    '555004000000': 'Подтверждение электронного платежа',
    '555005000000': 'Документ, подтверждающий право заявителя на безвозмездное получение сведений',
    '558100000000': 'ЗАЯВЛЕНИЯ',
    '558101000000': 'Заявления и запросы, связанные с государственным кадастровым учётом',
    '558101010000': 'Запрос о предоставлении сведений, внесённых в государственный кадастр недвижимости, в виде кадастровой выписки об объекте недвижимости, кадастрового паспорта объекта недвижимости и кадастрового плана территории, кадастровой справки о кадастровой стоимости объекта недвижимости',
    '558101020000': 'Заявление о постановке на государственный кадастровый учёт объекта недвижимости',
    '558101030000': 'Заявление о государственном кадастровом учёте изменений объекта недвижимости',
    '558101040000': 'Заявление о внесении в Единый государственный реестр объектов капитального строительства (ЕГРОКС) сведений об объекте капитального строительства (ОКС)',
    '558101050000': 'Запрос о предоставлении сведений об ОКС',
    '558101060000': 'Заявление о снятии с государственного кадастрового учёта объекта недвижимости',
    '558101070000': 'Заявление о внесении в государственный кадастр недвижимости сведений о ранее учтённом объекте недвижимости',
    '558101080000': 'Заявление об исправлении кадастровой ошибки',
    '558101090000': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости',
    '558101090100': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости об объекте недвижимости',
    '558101090200': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости о прохождении участка Государственной границы Российской Федерации; о границах между субъектами Российской Федерации; о границах муниципальных образований; о границах населённых пунктов; о территориальных зонах и зонах с особыми условиями использования территорий; о картографической и геодезической основах государственного кадастра недвижимости',
    '558101100000': 'Заявление о представлении дополнительных документов на государственный кадастровый учёт',
    '558101110000': 'Внутриведомственный запрос информации государственного кадастра недвижимости',
    '558101120000': 'Запрос о предоставлении копии документа, на основании которого сведения об объекте недвижимости внесены в государственный кадастр недвижимости',
    '558101130000': 'Запрос о предоставлении сведений, внесённых в государственный кадастр недвижимости, посредством обеспечения доступа к информационному ресурсу, содержащему сведения государственного кадастра недвижимости',
    '558101140000': 'Запрос о предоставлении перечня объектов недвижимости, подлежащих государственной кадастровой оценке',
    '558101150000': 'Заявление о прекращении осуществления кадастрового учёта',
    '558101160000': 'Межведомственный запрос документов в органах государственной власти и органах местного самоуправления',
    '558101170000': 'Запрос документов о ранее учтённом объекте недвижимости в органах государственной власти, органах местного самоуправления или органах и организациях по государственному техническому учёту и (или) технической инвентаризации',
    '558102000000': 'Заявления и запросы, связанные с регистрацией прав',
    '558102010000': 'Заявление о государственной регистрации права на недвижимое имущество, сделки с ним, ограничения (обременения), перехода, прекращения права на недвижимое имущество',
    '558102020000': 'Заявление о государственной регистрации прекращения права (ограничения (обременения) права)',
    '558102030000': 'Заявление о внесении изменений в ЕГРП',
    '558102040000': 'Заявление об исправлении технической ошибки',
    '558102050000': 'Заявление о представлении дополнительных документов для государственной регистрации прав',
    '558102060000': 'Заявление о приостановлении государственной регистрации прав на недвижимое имущество и сделок с ним',
    '558102070000': 'Заявление о возобновлении государственной регистрации',
    '558102080000': 'Заявление о прекращении государственной регистрации',
    '558102090000': 'Заявление о повторной выдаче свидетельства о государственной регистрации права',
    '558102100000': 'Запрос о предоставлении сведений, содержащихся в Едином государственном реестре прав на недвижимое имущество и сделок с ним',
    '558102110000': 'Заявление о постановке на учёт бесхозяйных недвижимых вещей',
    '558102120000': 'Заявление о выдаче закладной (новой закладной, дубликата закладной, аннулированной закладной)',
    '558102130000': 'Запрос о выдаче копий договоров и иных документов, выражающих содержание односторонних сделок, совершенных в простой письменной форме',
    '558102140000': 'Заявление о приостановлении государственной регистрации, возврате документов без проведения государственной регистрации, представлении дополнительных документов, о возобновлении государственной регистрации, ранее приостановленной по заявлению правообладателя, стороны (сторон) сделки, лица, чьё право ограничивается (обременяется), лица, в пользу которого право ограничивается (обременяется), законного владельца закладной (их представителя)',
    '558102150000': 'Заявление о повторной выдаче нового свидетельства о государственной регистрации права, выдаче закладной, внесении изменений в запись Единого государственного реестра прав на недвижимое имущество и сделок с ним, погашении регистрационной записи об ипотеке',
    '558102160000': 'Заявление о принятии объекта недвижимого имущества вновь во владение, пользование и распоряжение (в собственность)',
    '558102170000': 'Заявление о внесении в Единый государственный реестр прав на недвижимое имущество и сделок с ним отметки о наличии судебного спора в отношении зарегистрированного права',
    '558102180000': 'Заявление об исправлении технической ошибки в записях Единого государственного реестра прав на недвижимое имущество и сделок с ним, о наличии возражения в отношении зарегистрированного права на объект недвижимости, о погашении записи в Едином государственном реестре прав на недвижимое имущество и сделок с ним о наличии возражения в отношении зарегистрированного права на объект недвижимости, о невозможности государственной регистрации перехода, ограничения (обременения), прекращения права на объект недвижимости без личного участия собственника (его законного представителя), об отзыве ранее представленного заявления о невозможности государственной регистрации перехода, ограничения (обременения), прекращения права на объект недвижимости без личного участия собственника (его законного представителя)',
    '558102190000': 'Заявление о скреплении добавочного листа (добавочных листов) с закладной',
    '558102200000': 'Запрос о предоставлении сведений, содержащихся в Едином государственном реестре прав на недвижимое имущество и сделок с ним, посредством обеспечения доступа к информационному ресурсу, содержащему сведения Единого государственного реестра прав на недвижимое имущество и сделок с ним',
    '558102210000': 'Заявление о государственной регистрации законного владельца закладной',
    '558102220000': 'Заявление о внесении изменений в запись Единого государственного реестра прав на недвижимое имущество и сделок с ним, погашении регистрационной записи об ипотеке',
    '558103000000': 'Заявления о государственном учёте зданий, сооружений, помещений, объектов незавершённого строительства (объектов учёта) и запросы о предоставлении сведений, внесённых в Единый государственный реестр',
    '558103010000': 'Заявление о постановке на государственный учёт объекта учёта',
    '558103020000': 'Заявление о внесении в ЕГРОКС сведений о ранее учтённом объекте капитального строительства',
    '558103030000': 'Заявление о государственном учёте изменений объекта учёта',
    '558103040000': 'Заявление о снятии с государственного учёта объекта учёта',
    '558103050000': 'Заявление об исправлении технической ошибки',
    '558103060000': 'Заявление об исключении сведений из ЕГРОКС, носящих временный характер',
    '558103070000': 'Запрос о предоставлении копии документа, на основании которого сведения об объекте внесены в Единый государственный реестр',
    '558103080000': 'Запрос о предоставлении сведений, внесенных в Единый государственный реестр',
    '558103090000': 'Заявление о представлении дополнительных документов на государственный учёт',
    '558104000000': 'Заявление о возврате платежа',
    '558199000000': 'Иное заявление',
    '558200000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ ОПИСАНИЕ ОБЪЕКТА',
    '558201000000': 'Описание земельных участков',
    '558202000000': 'Землеустроительное дело',
    '558203000000': 'Межевой план',
    '558204000000': 'Документ (копия), на основании которого сведения об объекте недвижимости внесены в ГКН',
    '558205000000': 'Технический паспорт объекта учёта',
    '558205010000': 'Технический паспорт домовладения',
    '558205020000': 'Технический паспорт здания (строения)',
    '558205030000': 'Технический паспорт жилого помещения (квартиры)',
    '558205040000': 'Технический паспорт объекта индивидуального жилищного строительства',
    '558205050000': 'Технический паспорт сооружения',
    '558205060000': 'Технический паспорт объекта незавершённого строительства',
    '558206000000': 'Выписка из технического паспорта',
    '558206010000': 'Выписка из технического паспорта на здание (строение)',
    '558206020000': 'Выписка из технического паспорта БТИ',
    '558207000000': 'Документ (копия), подтверждающий разрешение земельного спора о согласовании местоположения границ земельного участка',
    '558208000000': 'Документ (копия), подтверждающий принадлежность земельного участка к определенной категории земель',
    '558209000000': 'Документ (копия), подтверждающий установленное разрешенное использование земельного участка',
    '558210000000': 'Кадастровый план земельного участка (выписка из государственного земельного кадастра)',
    '558211000000': 'Планы иных объектов недвижимости',
    '558211010000': 'Технический план здания, сооружения, помещения либо объекта незавершённого строительства',
    '558211020000': 'План участка лесного фонда',
    '558211030000': 'План объекта недвижимости',
    '558211040000': 'Экспликация к поэтажному плану',
    '558212000000': 'Декларация об объекте недвижимости',
    '558213000000': 'Кадастровый паспорт объекта недвижимости',
    '558213010000': 'Кадастровый паспорт земельного участка',
    '558213020000': 'Кадастровый паспорт помещения (выписка из ГКН)',
    '558213030000': 'Кадастровый паспорт здания, сооружения, объекта незавершённого строительства',
    '558214000000': 'Кадастровая выписка об объекте недвижимости',
    '558214010000': 'Кадастровая выписка о земельном участке',
    '558214020000': 'Кадастровая выписка о здании, сооружении, объекте незавершённого строительства',
    '558216000000': 'Документ, подтверждающий изменение назначения здания, помещения или сооружения, наименования сооружения',
    '558217000000': 'Кадастровый план территории',
    '558218000000': 'Кадастровая справка о кадастровой стоимости объекта недвижимости',
    '558219000000': 'Акт обследования, подтверждающий прекращение существования объекта учёта',
    '558220000000': 'Документы, в виде которых предоставляются сведения Единого государственного реестра',
    '558220010000': 'Выписка из Реестра, содержащая относящиеся к информации ограниченного доступа сведения об объекте учета',
    '558220020000': 'Справка, содержащая, внесённые в Единый государственный реестр сведения о прекращении существования объекта учёта',
    '558220030000': 'Выписка из Реестра, подтверждающая факт отсутствия в Реестре сведений об объекте учета',
    '558221000000': 'ПРОЧИЕ',
    '558221010000': 'Решение о необходимости устранения кадастровой ошибки',
    '558221020000': 'Международный договор Российской Федерации, в соответствии с которым установлено или изменено прохождение государственной границы Российской Федерации',
    '558221030000': 'Документ, содержащий необходимые для внесения в государственный кадастр недвижимости сведения о границах между субъектами Российской Федерации, границах муниципального образования, границах населённого пункта',
    '558221040000': 'Документ, содержащий необходимые для внесения в государственный кадастр недвижимости сведения об установлении или изменении территориальной зоны или зоны с особыми условиями использования территорий, либо об отмене установления такой зоны',
    '558221050000': 'Решение о присвоении, изменении адреса',
    '558221060000': 'Документы органов, осуществляющих ведение лесного и водного кадастра, содержащие сведения о природных объектах',
    '558221070000': 'Документ, содержащий сведения об адресе объекта недвижимости',
    '558221080000': 'Акт об утверждении результатов определения кадастровой стоимости',
    '558221990000': 'Иной документ, содержащий описание объекта',
    '558222000000': 'Документ, воспроизводящий сведения, содержащиеся в международном договоре Российской Федерации, в соответствии с которым установлено или изменено прохождение государственной границы Российской Федерации, а также сведения о федеральном законе, которым ратифицирован международный договор Российской Федерации, и об официальном опубликовании такого федерального закона',
    '558223000000': 'Соглашение об изменении границ между субъектами Российской Федерации',
    '558224000000': 'Закон субъекта Российской Федерации об установлении или изменении границ муниципальных образований либо о преобразовании муниципальных образований',
    '558225000000': 'Акт уполномоченного органа об установлении или изменении границ населённых пунктов',
    '558226000000': 'Документ, воспроизводящий необходимые для внесения в государственный кадастр недвижимости сведения о границах между субъектами Российской Федерации, границах муниципального образования, границах населённого пункта, содержащиеся в утверждённых органами власти документах',
    '558227000000': 'Решение об установлении или изменении границ зон с особыми условиями использования территорий',
    '558228000000': 'Правовой акт, которым утверждены или изменены правила землепользования и застройки',
    '558229000000': 'Документ, подтверждающий изменение назначения помещения',
    '558230000000': 'Решение о переводе жилого помещения в нежилое помещение, нежилого помещения в жилое помещение',
    '558231000000': 'Акт приемочной комиссии, подтверждающий завершение переустройства и (или) перепланировки и (или) иных работ',
    '558232000000': 'Документы, воспроизводящие сведения об изменении назначения помещения',
    '558233000000': 'Документ, воспроизводящий сведения, содержащиеся в решении о переводе жилого помещения в нежилое помещение, нежилого помещения в жилое помещение',
    '558234000000': 'Документ, воспроизводящий сведения, содержащиеся в акте приемочной комиссии, подтверждающем завершение переустройства и (или) перепланировки и (или) иных работ',
    '558235000000': 'Документ, подтверждающий изменение назначения здания',
    '558236000000': 'Документ, подтверждающий изменение назначения сооружения',
    '558237000000': 'Решение о предоставлении разрешения на условно разрешенный вид использования',
    '558238000000': 'Решение об определении (изменении) вида разрешенного использования',
    '558239000000': 'Документ (копия), воспроизводящий сведения о предоставлении разрешения на условно разрешенный вид использования, об определении (изменении) вида разрешенного использования',
    '558240000000': 'Документ, воспроизводящий сведения, содержащиеся в решении о присвоении, изменении адреса',
    '558241000000': 'Документ, воспроизводящий содержащиеся в разрешении на ввод объекта капитального строительства в эксплуатацию сведения',
    '558242000000': 'Документ, воспроизводящий сведения, содержащиеся в реестре объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
    '558243000000': 'Документ, воспроизводящий сведения, содержащиеся в акте Правительства Российской Федерации об исключении объекта недвижимости из единого государственного реестра объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
    '558244000000': 'Документ, содержащий сведения о дате поступления документов, предусмотренных статьей 17 Федерального закона "Об объектах культурного наследия (памятниках истории и культуры) народов Российской Федерации", в отношении объекта недвижимости',
    '558245000000': 'Решение (копия решения) соответствующего органа государственной власти об отказе включить объект недвижимости в единый государственный реестр объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
    '558246000000': 'Акт Правительства Российской Федерации об исключении объекта недвижимости из единого государственного реестра объектов культурного наследия',
    '558247000000': 'Документ, воспроизводящий сведения о наименовании водного объекта и установленных параметрах водоохранных зон и прибрежных защитных полос, зон затопления, подтопления и других зон с особыми условиями их использования',
    '558248000000': 'Документ, воспроизводящий содержащиеся в государственном лесном реестре сведения в отношении лесного участка',
    '558249000000': 'Документ, воспроизводящий сведения, содержащиеся во вступившем в силу акте об утверждении результатов определения кадастровой стоимости',
    '558250000000': 'Документ, воспроизводящий сведения, содержащиеся в решении об установлении или изменении границ зон с особыми условиями использования территорий',
    '558251000000': 'Документ, воспроизводящий сведения, содержащиеся в правовом акте, которым утверждены или изменены правила землепользования и застройки, включая сведения о территориальных зонах',
    '558252000000': 'Карта (план) объекта землеустройства',
    '558253000000': 'Декларация заинтересованного лица о выбранном виде разрешенного использования земельного участка',
    '558254000000': 'Документы, определяющие (определявшие) в соответствии с законодательством Российской Федерации местоположение границ земельного участка (земельных участков)',
    '558254010000': 'Землеустроительная документация',
    '558254020000': 'Лесоустроительная документация',
    '558254030000': 'Документы градостроительного зонирования (Правила землепользования и застройки)',
    '558254040000': 'Документация по планировке территории (проекты межевания территорий), в т.ч. документ по планировке территории в планируемых границах искусственного земельного участка',
    '558254050000': 'Копия проекта межевания земельных участков',
    '558254060000': 'Акт отвода земельных участков в натуре',
    '558254070000': 'Проект границ земельных участков',
    '558254080000': 'Проект (копии отдельных составных частей) организации и застройки территорий садоводческих, огороднических или дачных некоммерческих объединений граждан',
    '558254090000': 'Проект (копии отдельных составных частей) перераспределения сельскохозяйственных угодий и иных земель сельскохозяйственного назначения',
    '558254100000': 'Решение о предварительном согласовании мест размещения объектов',
    '558254110000': 'Копия решения общего собрания участников долевой собственности на земельный участок из земель сельскохозяйственного назначения об утверждении проекта межевания земельных участков',
    '558254120000': 'Копия документа, подтверждающего согласование проекта межевания земельного участка',
    '558254130000': 'Возражения заинтересованных лиц по поводу местоположения границ земельного участка',
    '558254140000': 'Документ, свидетельствующий о снятии возражений заинтересованных лиц по поводу местоположения границ земельного участка',
    '558254150000': 'Схема расположения земельных участков на кадастровых планах или кадастровых картах соответствующих территорий',
    '558254990000': 'Прочие документы, определяющие (определявшие) в соответствии с законодательством Российской Федерации местоположение границ земельного участка (земельных участков)',
    '558255000000': 'Картографические материалы',
    '558256000000': 'Материалы картографо-геодезического фонда',
    '558257000000': 'Документы, устанавливающие предельные минимальные и максимальные размеры, соответствующие виду разрешенного использования земельного участка',
    '558257010000': 'Федеральный закон',
    '558257020000': 'Закон субъекта Российской Федерации',
    '558257030000': 'Нормативный правовой акт органа местного самоуправления',
    '558258000000': 'Документ, содержащий информацию о ранее присвоенных государственных учетных номерах объекта недвижимости',
    '558259000000': 'Протокол образования земельных участков',
    '558260000000': 'Чертеж (абрис) помещения',
    '558261000000': 'Проектная документация здания',
    '558262000000': 'Проектная документация сооружения',
    '558263000000': 'Решение комиссии по рассмотрению споров о результатах определения кадастровой стоимости',
    '558264000000': 'Решение суда',
    '558299000000': 'Иной документ, содержащий описание объекта',
    '558300000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ ОПИСАНИЕ ЗАЯВИТЕЛЯ ИЛИ ЕГО ПРЕДСТАВИТЕЛЯ',
    '558301000000': 'Документы, подтверждающие полномочия представителя',
    '558301010000': 'Доверенность',
    '558301020000': 'Свидетельство о рождении',
    '558301030000': 'Свидетельство об усыновлении',
    '558301040000': 'Решение суда',
    '558301050000': 'Определение суда',
    '558301060000': 'Протокол об избрании (единоличного исполнительного органа юридического лица)',
    '558301070000': 'Выписка из протокола об избрании (единоличного исполнительного органа юридического лица)',
    '558301080000': 'Приказ о назначении (руководителя или иного уполномоченного лица)',
    '558301090000': 'Решение органов опеки и попечительства',
    '558301100000': 'Договор коммерческого представительства',
    '558301110000': 'Договор доверительного управления',
    '558301120000': 'Постановление судебного пристава-исполнителя',
    '558301130000': 'Протокол общего собрания',
    '558301140000': 'Акт органа государственной власти или органа местного самоуправления, подтверждающий полномочия представителя заявителя',
    '558301990000': 'Иной документ',
    '558400000000': 'ДОКУМЕНТЫ О ПРАВАХ, СДЕЛКАХ, ОГРАНИЧЕНИЯХ (ОБРЕМЕНЕНИЯХ)',
    '558401000000': 'Правоустанавливающие и правоудостоверяющие документы',
    '558401010000': 'Договоры / соглашения',
    '558401010100': 'Сделки об отчуждении',
    '558401010101': 'Договор купли-продажи',
    '558401010102': 'Договор мены',
    '558401010103': 'Договор дарения',
    '558401010104': 'Договор ренты',
    '558401010105': 'Договор пожизненного содержания с иждивением',
    '558401010106': 'Договор приватизации (договор передачи объекта недвижимости в собственность)',
    '558401010200': 'Другие сделки',
    '558401010201': 'Договор участия в долевом строительстве',
    '558401010202': 'Соглашение об определении (перераспределении) долей в праве общей долевой собственности',
    '558401010203': 'Брачный договор',
    '558401010204': 'Соглашение об отступном',
    '558401010205': 'Соглашение о разделе имущества',
    '558401010206': 'Соглашение о выделе доли',
    '558401010207': 'Инвестиционный договор (договор об инвестировании)',
    '558401010208': 'Мировое соглашение',
    '558401010209': 'Договор аренды (субаренды)',
    '558401010210': 'Договор об ипотеке',
    '558401010211': 'Договор безвозмездного срочного пользования земельным участком',
    '558401010212': 'Кредитный договор',
    '558401010213': 'Договор займа',
    '558401010214': 'Соглашение об установлении сервитута',
    '558401010215': 'Соглашение об изменении содержания закладной',
    '558401010216': 'Дополнительное соглашение (соглашение об изменении условий договора) к договору',
    '558401010217': 'Соглашение о расторжении договора',
    '558401010218': 'Соглашение об уступке прав требования по договору (договор о передаче прав и обязанностей)',
    '558401010219': 'Договор простого товарищества (договор о совместной деятельности)',
    '558401010220': 'Государственный контракт',
    '558401010299': 'Иная сделка',
    '558401020000': 'Акты органов государственной власти или органов местного самоуправления',
    '558401020100': 'Федеральный закон',
    '558401020200': 'Указ Президента Российской Федерации',
    '558401020300': 'Постановление Правительства Российской Федерации',
    '558401020400': 'Закон (законы Российской Федерации, субъекта Российской Федерации)',
    '558401020500': 'Документ о предоставлении земельных участков',
    '558401020600': 'Решение об образовании земельных участков',
    '558401020700': 'Акт об установлении сервитута',
    '558401020800': 'Акт об установлении ограничения (обременения)',
    '558401029900': 'Иные акты органов государственной власти или органов местного самоуправления',
    '558401030000': 'Свидетельство о праве на наследство',
    '558401030100': 'Свидетельство о праве на наследство по закону',
    '558401030200': 'Свидетельство о праве на наследство по завещанию',
    '558401040000': 'Вступившие в силу судебные акты',
    '558401040100': 'Судебный акт, устанавливающий запрет на совершение действий в сфере государственного кадастрового учета в отношении объекта недвижимости',
    '558401040200': 'Судебный акт о восстановлении аннулированных и исключенных из государственного кадастра недвижимости сведений об объекте недвижимости',
    '558401040300': 'Судебный акт об установлении обременения (ограничении) в использовании объекта недвижимости  (части объекта недвижимости)',
    '558401049900': 'Иные предусмотренные законодательством судебные акты',
    '558401050000': 'Акты (свидетельства) о правах на объекты недвижимости',
    '558401050100': 'Регистрационное удостоверение',
    '558401050200': 'Свидетельство о праве на землю',
    '558401050300': 'Государственный акт о праве на землю',
    '558401050400': 'Свидетельство о праве собственности',
    '558401059900': 'Иные акты, свидетельства о правах на объекты недвижимости',
    '558401060000': 'Документы на вновь возведенный (реконструированный) объект',
    '558401060100': 'Разрешение на ввод объекта в эксплуатацию',
    '558401060200': 'Разрешение на строительство',
    '558401060300': 'Акт ввода в эксплуатацию',
    '558401060400': 'Копия решения о создании искусственного земельного участка',
    '558401070000': 'Документы при упрощенном порядке оформления прав граждан на отдельные объекты недвижимого имущества',
    '558401070100': 'Выписка из похозяйственной книги о наличии у гражданина права на земельный участок',
    '558401070200': 'Кадастровый паспорт объекта недвижимости',
    '558401070300': 'Декларация об объекте недвижимого имущества',
    '558401080000': 'Прочие правоустанавливающие документы',
    '558401080100': 'Передаточный акт',
    '558401080200': 'Разделительный баланс',
    '558401080300': 'План приватизации',
    '558401080400': 'Правила доверительного управления',
    '558401080500': 'Акт описи и ареста имущества',
    '558401080600': 'Протокол о выделе земельного участка в счет земельной доли',
    '558401080700': 'Протокол общего собрания собственников помещений в многоквартирном доме',
    '558401080800': 'Отказ одаряемого принять дар (отказ от дара)',
    '558401080900': 'Соглашение о новации',
    '558401081000': 'Соглашение о разделе наследственного имущества',
    '558401081100': 'Соглашение об уплате алиментов',
    '558401081200': 'Документ, подтверждающий наличие, возникновение, переход ограничения (обременения) вещного права на объект недвижимости в пользу заявителя',
    '558401089900': 'Иной документ',
    '558402000000': 'СОПУТСТВУЮЩИЕ И ДОПОЛНИТЕЛЬНЫЕ ДОКУМЕНТЫ',
    '558402010000': 'Согласие супруга на совершение сделки',
    '558402020000': 'Согласие органов опеки и попечительства',
    '558402030000': 'Свидетельство о заключении брака',
    '558402040000': 'Свидетельство о расторжении брака',
    '558402050000': 'Решение об одобрении (о совершении) сделки',
    '558402060000': 'Справка о стоимости (справка о соотношении стоимости отчуждаемого объекта и балансовой стоимости имущества или активов хозяйственного общества)',
    '558402070000': 'Справка о заинтересованных лицах в сделке',
    '558402080000': 'Выписка из домовой книги (сведения о лицах, сохраняющих право проживания в жилом помещении после перехода права на него)',
    '558402090000': 'Выписка из лицевого счета (сведения о лицах, сохраняющих право проживания в жилом помещении после перехода права на него)',
    '558402100000': 'Протокол о результатах торгов',
    '558402110000': 'Лицензия (лицензия на осуществление определенных видов деятельности)',
    '558402120000': 'Проектная декларация',
    '558402130000': 'Отказ от преимущественного права покупки (для участников долевой собственности, для субъекта Российской Федерации при продаже земельного участка из состава земель сельскохозяйственного назначения)',
    '558402140000': 'Решение о создании юридического лица',
    '558402150000': 'Решение о реорганизации юридического лица',
    '558402160000': 'Решение о ликвидации юридического лица',
    '558402170000': 'Решение об утверждении оценки имущества (решение об утверждении оценки неденежных вкладов в уставный капитал общества)',
    '558402180000': 'Исполнительный лист',
    '558402190000': 'Договор поручения',
    '558402200000': 'Бухгалтерский баланс',
    '558402210000': 'Закладная',
    '558402220000': 'Добавочный лист к закладной',
    '558402230000': 'Выписка из реестра муниципальной собственности',
    '558402240000': 'Выписка из реестра собственности субъекта Российской Федерации',
    '558402250000': 'Выписка из реестра федерального имущества',
    '558402260000': 'Жилищный сертификат',
    '558402270000': 'Аудиторское заключение',
    '558402280000': 'Отчет о проведении независимой оценки (акт оценки)',
    '558402390000': 'Акт инвентаризации',
    '558402400000': 'Охранное обязательство собственника объекта культурного наследия',
    '558402990000': 'Иной документ',
    '558403000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ СВЕДЕНИЯ ЕГРП',
    '558403010000': 'Свидетельство о государственной регистрации права',
    '558403020000': 'Выписка о правах на объект недвижимого имущества',
    '558403030000': 'Выписка о переходе прав на объект недвижимого имущества',
    '558403040000': 'Выписка о правах отдельного лица на имеющиеся у него объекты недвижимого имущества',
    '558403050000': 'Выписка о признании правообладателя недееспособным или ограниченно дееспособным',
    '558403060000': 'Справка о содержании правоустанавливающих документов на объект недвижимого имущества',
    '558403070000': 'Справка о лицах, получивших сведения об объекте недвижимого имущества',
    '558403080000': 'Копии договоров и иных документов, выражающих содержание односторонних сделок, совершенных в простой письменной форме',
    '558403090000': 'Выписка из ЕГРП о принятии на учёт бесхозяйного объекта недвижимого имущества',
    '558403100000': 'Выписка из ЕГРП о принятии на учёт бесхозяйного объекта недвижимого имущества, от права собственности на который собственник отказался',
    '558403110000': 'Выписка из ЕГРП о бесхозяйном объекте недвижимого имущества, принятом на учёт',
    '558403120000': 'Выписка из единого государственного реестра прав на недвижимое имущество и сделок с ним, удостоверяющая проведение государственной регистрации возникновения и (или) перехода прав на недвижимое имущество',
    '558403990000': 'Иной документ',
    '558404000000': 'Соглашения и согласия об образовании земельных участков',
    '558404010000': 'Соглашение о разделе, об объединении, о перераспределении земельных участков или о выделе из земельных участков',
    '558404020000': 'Согласие на образование земельных участков',
    '558404030000': 'Соглашение об образовании общей долевой собственности на земельный участок, образуемый при выделе его в счет земельной доли или земельных долей',
    '558404040000': 'Соглашение об образовании общей совместной собственности на земельный участок, образуемый при выделе его в счет земельной доли или земельных долей',
    '558405000000': 'Документы, подтверждающие возникновение права собственности в отношении земельного участка в силу федерального закона вне зависимости от момента государственной регистрации этого права в ЕГРП',
    '558405010000': 'Копия решения о безвозмездной передаче военного недвижимого имущества из федеральной собственности в собственность субъекта Российской Федерации - города федерального значения Москвы или Санкт-Петербурга либо муниципальную собственность',
    '558405020000': 'Подлинник или копия письма органа исполнительной власти субъекта Российской Федерации - города федерального значения Москвы или Санкт-Петербурга либо органа местного самоуправления муниципального образования о согласовании границ образуемого земельного участка с приложением согласованного проекта границ земельного участка в случае, если акт согласования границ земельного участка не заверен подписью уполномоченного должностного лица соответствующего органа',
    '558405030000': 'Решение об изъятии земельных участков и (или) расположенных на них иных объектов недвижимого имущества в целях размещения олимпийских объектов',
    '558405040000': 'Копия акта приема-передачи объектов недвижимого имущества, в отношении которых принято решение об изъятии в целях размещения олимпийских объектов',
    '558405990000': 'Иные документы, подтверждающие возникновение права собственности в отношении земельного участка в силу федерального закона вне зависимости от момента государственной регистрации этого права в ЕГРП',
    '558500000000': 'Решения, уведомления, расписки',
    '558501000000': 'Документы о результатах государственного кадастрового учёта',
    '558501010000': 'РЕШЕНИЯ',
    '558501010100': 'Решение об отказе в предоставлении запрашиваемых сведений',
    '558501010200': 'Решение об отказе в исправлении кадастровой ошибки',
    '558501010300': 'Решение об отказе в исправлении технической ошибки',
    '558501010400': 'Решение об исправлении технической и кадастровой ошибок',
    '558501010500': 'Решение об отказе в осуществлении кадастровой процедуры',
    '558501010600': 'Решение о приостановлении осуществления кадастровой процедуры',
    '558501010700': 'Решение об отказе в снятии приостановления',
    '558501010800': 'Решение о снятии с кадастрового учёта земельных участков со статусом «временные» по заявлению заинтересованного лица',
    '558501010900': 'Решение об отказе в выдаче кадастрового паспорта',
    '558501011000': 'Решение об осуществлении кадастровой процедуры',
    '558501011100': 'Решение об аннулировании кадастровых сведений',
    '558501011200': 'Решение об отклонении заявления об исправлении технической ошибки',
    '558501011300': 'Решение о внесении записи о наличии возражения',
    '558501011400': 'Решение о погашении записи о наличии возражения',
    '558501011500': 'Решение о внесении записи о заявлении о невозможности государственной регистрации',
    '558501011600': 'Решение о погашении записи о заявлении о невозможности государственной регистрации',
    '558501020000': 'УВЕДОМЛЕНИЯ',
    '558501020100': 'Уведомление об отсутствии в ГКН запрашиваемых сведений',
    '558501020200': 'Уведомление об осуществлённом кадастровом учёте',
    '558501020300': 'Уведомление об отказе в приеме документов для внесения в Единый государственный реестр объектов капитального строительства (далее - Единый государственный реестр) сведений об ОКС',
    '558501020400': 'Уведомление об отказе в приеме документов для предоставления из Единого государственного реестра сведений об ОКС',
    '558501020500': 'Уведомление об устранении технической ошибки в сведениях ГКН',
    '558501020600': 'Уведомление об отказе в выдаче сведений об ОКС',
    '558501020700': 'Уведомление о приостановлении осуществления кадастровой процедуры',
    '558501020800': 'Уведомление об отказе в осуществлении кадастровой процедуры',
    '558501020900': 'Уведомление о регистрации права',
    '558501021000': 'Уведомление о приостановлении принятия на учёт имущества в качестве бесхозяйного',
    '558501021100': 'Сообщение об отказе в принятии на учёт имущества в качестве бесхозяйного',
    '558501021200': 'Уведомление о снятии с учёта имущества в качестве бесхозяйного',
    '558501021300': 'Уведомление о возврате заявления о наличии возражения в отношении зарегистрированного права на объект недвижимости без рассмотрения',
    '558501030000': 'ПРОЧИЕ',
    '558501030100': 'Расписка в получении соответствующих документов для проведения государственного кадастрового учёта',
    '558501030200': 'Протокол проверки документов',
    '558501030300': 'Акт определения кадастровой стоимости земельных участков',
    '558501030400': 'Протокол выявления технической ошибки',
    '558501030500': 'Акт определения кадастровой стоимости объектов недвижимости',
    '558501039900': 'Иные документы',
    '558502000000': 'ДОКУМЕНТЫ О РЕЗУЛЬТАТАХ РЕГИСТРАЦИИ ПРАВ',
    '558502010000': 'УВЕДОМЛЕНИЯ, СООБЩЕНИЯ',
    '558502010100': 'Уведомление о приостановлении государственной регистрации прав',
    '558502010200': 'Уведомление о прекращении государственной регистрации прав',
    '558502010300': 'Уведомление о зарегистрированных ограничениях (обременениях) прав',
    '558502010400': 'Уведомление о внесении изменений в ЕГРП',
    '558502010500': 'Уведомление об исправлении технической ошибки в записях единого государственного реестра прав на недвижимое имущество и сделок с ним',
    '558502010600': 'Сообщение об отказе в государственной регистрации прав',
    '558502010700': 'Сообщение об отказе в предоставлении сведений из ЕГРП',
    '558502010800': 'Уведомление об отсутствии в ЕГРП запрашиваемых сведений',
    '558502010900': 'Сообщение о приёме заявления о государственной регистрации права, ограничения (обременения) права на предприятие, сделки с ним',
    '558502011000': 'Сообщение о поступлении документов на государственную регистрацию договоров мены и (или) перехода права',
    '558502011100': 'Уведомление о возврате приложенных к заявлению документов без рассмотрения',
    '558502011200': 'Уведомление о государственной регистрации прекращения ограничения (обременения)',
    '558502011300': 'Уведомление об отсутствии сведений о лицах, получивших сведения об объектах недвижимого имущества',
    '558502011400': 'Уведомление о государственной регистрации права собственности субъекта Российской Федерации или муниципального образования на земельный участок или земельную долю вследствие отказа от соответствующего права правообладателем',
    '558502011500': 'Уведомление о поступлении решения суда, вступившего в законную силу, с указанием срока окончания осуществления государственной регистрации прав, в случае если отказ в государственной регистрации прав признан судом необоснованным',
    '558502011600': 'Уведомление о внесении изменений в единый государственный реестр прав на недвижимое имущество и сделок с ним в связи с изменением содержащихся в базовых государственных информационных ресурсах сведений о правообладателе (правообладателях)',
    '558502011700': 'Уведомление о возврате документов без рассмотрения при отказе в осуществлении государственного кадастрового учета',
    '558502020000': 'ПРОЧИЕ',
    '558502020100': 'Расписка в получении документов на государственную регистрацию прав',
    '558502029900': 'Иной документ',
    '558601000000': 'Расписка в получении извещений о проведении собрания о согласовании местоположения границ',
    '558602000000': 'Уведомление о вручении извещения о проведении собрания о согласовании местоположения границ',
    '558603000000': 'Копия страницы печатного издания, содержащей извещение о проведении собрания о согласовании местоположения границ земельного участка, включая первый лист, содержащего реквизиты такого печатного издания',
    '558699000000': 'Иные документы, свидетельствующие о соблюдении установленного порядка извещения заинтересованных лиц о проведении собрания о согласовании местоположения границ земельного участка'
};
//Территориальные зоны и зоны с особыми условиями использования территорий
var dZone = {
    '218010000000': 'Территориальные зоны',
    '218010010000': 'Жилая зона',
    '218010020000': 'Общественно-деловая зона',
    '218010030000': 'Производственная зона, зона инженерной и транспортной инфраструктур',
    '218010040000': 'Зона сельскохозяйственного использования',
    '218010050000': 'Зона рекреационного назначения',
    '218010060000': 'Зона особо охраняемых территорий',
    '218010070000': 'Зона специального назначения',
    '218010080000': 'Зона размещения военных объектов',
    '218010090000': 'Иная зона',
    '218020000000': 'Зоны с особыми условиями использования территории',
    '218020010000': 'Зоны охраны природных объектов',
    '218020010001': 'Территория особо охраняемого природного объекта',
    '218020010002': 'Охранная зона особо охраняемого природного объекта',
    '218020010003': 'Водоохранная зона',
    '218020010004': 'Прибрежная защитная полоса',
    '218020010005': 'Зона санитарной охраны источников водоснабжения и водопроводов питьевого назначения',
    '218020010006': 'Особо ценные земли',
    '218020020000': 'Зоны охраны искусственных объектов',
    '218020020001': 'Территория объекта культурного наследия',
    '218020020002': 'Зона охраны объекта культурного наследия',
    '218020020003': 'Охранная зона геодезического пункта',
    '218020020004': 'Охранная зона стационарного пункта наблюдений за состоянием окружающей природной среды',
    '218020020005': 'Охранная зона транспорта',
    '218020020006': 'Охранная зона инженерных коммуникаций',
    '218020020007': 'Охранная зона линий и сооружений связи и линий и сооружений радиофикации',
    '218020020008': 'Придорожная полоса',
    '218020030000': 'Зоны защиты населения',
    '218020030001': 'Запретная зона при военном складе',
    '218020030002': 'Запретный район при военном складе',
    '218020030003': 'Загрязненные земли',
    '218020030004': 'Охранная зона загрязненных земель',
    '218020030005': 'Санитарно-защитная зона предприятий, сооружений и иных объектов',
    '218020030006': 'Санитарный разрыв (санитарная полоса отчуждения)',
    '218020030007': 'Зона ограничения от передающего радиотехнического объекта',
    '218020030008': 'Район падения отделяющихся частей ракет',
    '218020040000': 'Прочие зоны с особыми условиями использования территории',
    '218020040001': 'Зона публичного сервитута',
    '218020040002': 'Зона резервирования земель',
    '218020040003': 'Горный отвод',
    '218020040004': 'Пригородная зона',
    '218020040005': 'Зеленая зона',
    '218020040006': 'Особая экономическая зона',
    '218020040007': 'Пограничная зона',
    '218020040008': 'Территория традиционного природопользования',
    '218020050000': 'Иные зоны с особыми условиями использования территории',
    '218020050001': 'Иная зона с особыми условиями использования территории'
};
// Классификатор видов использования земель
var dUtilizations = {
    '141000000000': 'Для размещения объектов сельскохозяйственного назначения и сельскохозяйственных угодий',
    '141001000000': 'Для сельскохозяйственного производства',
    '141001010000': 'Для использования в качестве сельскохозяйственных угодий',
    '141001020000': 'Для размещения зданий, строений, сооружений, используемых для производства, хранения и первичной переработки сельскохозяйственной продукции',
    '141001030000': 'Для размещения внутрихозяйственных дорог и коммуникаций',
    '141001040000': 'Для размещения водных объектов',
    '141002000000': 'Для ведения крестьянского (фермерского) хозяйства',
    '141003000000': 'Для ведения личного подсобного хозяйства',
    '141004000000': 'Для ведения гражданами садоводства и огородничества',
    '141005000000': 'Для ведения гражданами животноводства',
    '141006000000': 'Для дачного строительства',
    '141007000000': 'Для размещения древесно-кустарниковой растительности, предназначенной для защиты земель от воздействия негативных (вредных) природных, антропогенных и техногенных явлений',
    '141008000000': 'Для научно-исследовательских целей',
    '141009000000': 'Для учебных целей',
    '141010000000': 'Для сенокошения и выпаса скота гражданами',
    '141011000000': 'Фонд перераспределения',
    '141012000000': 'Для размещения объектов охотничьего хозяйства',
    '141013000000': 'Для размещения объектов рыбного хозяйства',
    '141014000000': 'Для иных видов сельскохозяйственного использования',
    '142000000000': 'Для размещения объектов, характерных для населённых пунктов',
    '142001000000': 'Для объектов жилой застройки',
    '142001010000': 'Для индивидуальной жилой застройки',
    '142001020000': 'Для многоквартирной застройки',
    '142001020100': 'Для малоэтажной застройки',
    '142001020200': 'Для среднеэтажной застройки',
    '142001020300': 'Для многоэтажной застройки',
    '142001020400': 'Для иных видов жилой застройки',
    '142001030000': 'Для размещения объектов дошкольного, начального, общего и среднего (полного) общего образования',
    '142001040000': 'Для размещения иных объектов, допустимых в жилых зонах и не перечисленных в классификаторе',
    '142002000000': 'Для объектов общественно-делового значения',
    '142002010000': 'Для размещения объектов социального и коммунально-бытового назначения',
    '142002020000': 'Для размещения объектов здравоохранения',
    '142002030000': 'Для размещения объектов культуры',
    '142002040000': 'Для размещения объектов торговли',
    '142002040100': 'Для размещения объектов розничной торговли',
    '142002040200': 'Для размещения объектов оптовой торговли',
    '142002050000': 'Для размещения объектов общественного питания',
    '142002060000': 'Для размещения объектов предпринимательской деятельности',
    '142002070000': 'Для размещения объектов среднего профессионального и высшего профессионального образования',
    '142002080000': 'Для размещения административных зданий',
    '142002090000': 'Для размещения научно-исследовательских учреждений',
    '142002100000': 'Для размещения культовых зданий',
    '142002110000': 'Для стоянок автомобильного транспорта',
    '142002120000': 'Для размещения объектов делового назначения, в том числе офисных центров',
    '142002130000': 'Для размещения объектов финансового назначения',
    '142002140000': 'Для размещения гостиниц',
    '142002150000': 'Для размещения подземных или многоэтажных гаражей',
    '142002160000': 'Для размещения индивидуальных гаражей',
    '142002170000': 'Для размещения иных объектов общественно-делового значения, обеспечивающих жизнь граждан',
    '142003000000': 'Для общего пользования (уличная сеть)',
    '142004000000': 'Для размещения объектов специального назначения',
    '142004010000': 'Для размещения кладбищ',
    '142004020000': 'Для размещения крематориев',
    '142004030000': 'Для размещения скотомогильников',
    '142004040000': 'Под объектами размещения отходов потребления',
    '142004050000': 'Под иными объектами специального назначения',
    '142005000000': 'Для размещения коммунальных, складских объектов',
    '142006000000': 'Для размещения объектов жилищно-коммунального хозяйства',
    '142007000000': 'Для иных видов использования, характерных для населённых пунктов',
    '143000000000': 'Для размещения объектов промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, обеспечения космической деятельности, обороны, безопасности и иного специального назначения',
    '143001000000': 'Для размещения промышленных объектов',
    '143001010000': 'Для размещения производственных и административных зданий, строений, сооружений и обслуживающих их объектов',
    '143001010100': 'Для размещения производственных зданий',
    '143001010200': 'Для размещения коммуникаций',
    '143001010300': 'Для размещения подъездных путей',
    '143001010400': 'Для размещения складских помещений',
    '143001010500': 'Для размещения административных зданий',
    '143001010600': 'Для размещения культурно-бытовых зданий',
    '143001010700': 'Для размещения иных сооружений промышленности',
    '143001020000': 'Для добычи и разработки полезных ископаемых',
    '143001030000': 'Для размещения иных объектов промышленности',
    '143002000000': 'Для размещения объектов энергетики',
    '143002010000': 'Для размещения электростанций и обслуживающих сооружений и объектов',
    '143002010100': 'Для размещения гидроэлектростанций',
    '143002010200': 'Для размещения атомных станций',
    '143002010300': 'Для размещения ядерных установок',
    '143002010400': 'Для размещения пунктов хранения ядерных материалов и радиоактивных веществ энергетики',
    '143002010500': 'Для размещения хранилищ радиоактивных отходов',
    '143002010600': 'Для размещения тепловых станций',
    '143002010700': 'Для размещения иных типов электростанций',
    '143002010800': 'Для размещения иных обслуживающих сооружений и объектов',
    '143002020000': 'Для размещения объектов электросетевого хозяйства',
    '143002020100': 'Для размещения воздушных линий электропередачи',
    '143002020200': 'Для размещения наземных сооружений кабельных линий электропередачи',
    '143002020300': 'Для размещения подстанций',
    '143002020400': 'Для размещения распределительных пунктов',
    '143002020500': 'Для размещения других сооружений и объектов электросетевого хозяйства',
    '143002030000': 'Для размещения иных объектов энергетики',
    '143003000000': 'Для размещения объектов транспорта',
    '143003010000': 'Для размещения и эксплуатации объектов железнодорожного транспорта',
    '143003010100': 'Для размещения железнодорожных путей и их конструктивных элементов',
    '143003010200': 'Для размещения полос отвода железнодорожных путей',
    '143003010300': 'Для размещения, эксплуатации, расширения и реконструкции строений, зданий, сооружений, в том числе железнодорожных вокзалов, железнодорожных станций, а также устройств и других объектов, необходимых для эксплуатации, содержания, строительства, реконструкции, ремонта, развития наземных и подземных зданий, строений, сооружений, устройств и других объектов железнодорожного транспорта',
    '143003010301': 'Для размещения железнодорожных вокзалов',
    '143003010302': 'Для размещения железнодорожных станций',
    '143003010303': 'Для размещения устройств и других объектов, необходимых для эксплуатации, содержания, строительства, реконструкции, ремонта, развития наземных и подземных зданий, строений, сооружений, устройств и других объектов железнодорожного транспорта',
    '143003020000': 'Для размещения и эксплуатации объектов автомобильного транспорта и объектов дорожного хозяйства',
    '143003020100': 'Для размещения автомобильных дорог и их конструктивных элементов',
    '143003020200': 'Для размещения полос отвода',
    '143003020300': 'Для размещения объектов дорожного сервиса в полосах отвода автомобильных дорог',
    '143003020400': 'Для размещения дорожных сооружений',
    '143003020500': 'Для размещения автовокзалов и автостанций',
    '143003020600': 'Для размещения иных объектов автомобильного транспорта и дорожного хозяйства',
    '143003030000': 'Для размещения и эксплуатации объектов морского, внутреннего водного транспорта',
    '143003030100': 'Для размещения искусственно созданных внутренних водных путей',
    '143003030200': 'Для размещения морских и речных портов, причалов, пристаней',
    '143003030300': 'Для размещения иных объектов морского, внутреннего водного транспорта',
    '143003030400': 'Для выделения береговой полосы',
    '143003040000': 'Для размещения и эксплуатации объектов воздушного транспорта',
    '143003040100': 'Для размещения аэропортов и аэродромов',
    '143003040200': 'Для размещения аэровокзалов',
    '143003040300': 'Для размещения взлетно-посадочных полос',
    '143003040400': 'Для размещения иных наземных объектов воздушного транспорта',
    '143003050000': 'Для размещения и эксплуатации объектов трубопроводного транспорта',
    '143003050100': 'Для размещения нефтепроводов',
    '143003050200': 'Для размещения газопроводов',
    '143003050300': 'Для размещения иных трубопроводов',
    '143003050400': 'Для размещения иных объектов трубопроводного транспорта',
    '143003060000': 'Для размещения и эксплуатации иных объектов транспорта',
    '143004000000': 'Для размещения объектов связи, радиовещания, телевидения, информатики',
    '143004010000': 'Для размещения эксплуатационных предприятий связи и обслуживания линий связи',
    '143004020000': 'Для размещения кабельных, радиорелейных и воздушных линий связи и линий радиофикации на трассах кабельных и воздушных линий связи и радиофикации и их охранные зоны',
    '143004030000': 'Для размещения подземных кабельных и воздушных линий связи и радиофикации и их охранные зоны',
    '143004040000': 'Для размещения наземных и подземных необслуживаемых усилительных пунктов на кабельных линиях связи и их охранные зоны',
    '143004050000': 'Для размещения наземных сооружений и инфраструктур спутниковой связи',
    '143004060000': 'Для размещения иных объектов связи, радиовещания, телевидения, информатики',
    '143005000000': 'Для размещения объектов, предназначенных для обеспечения космической деятельности',
    '143005010000': 'Для размещения космодромов, стартовых комплексов и пусковых установок',
    '143005020000': 'Для размещения командно-измерительных комплексов, центров и пунктов управления полетами космических объектов, приема, хранения и переработки информации',
    '143005030000': 'Для размещения баз хранения космической техники',
    '143005040000': 'Для размещения полигонов приземления космических объектов и взлетно-посадочных полос',
    '143005050000': 'Для размещения объектов экспериментальной базы для отработки космической техники',
    '143005060000': 'Для размещения центров и оборудования для подготовки космонавтов',
    '143005070000': 'Для размещения других наземных сооружений и техники, используемых при осуществлении космической деятельности',
    '143006000000': 'Для размещения объектов, предназначенных для обеспечения обороны и безопасности',
    '143006010000': 'Для обеспечения задач обороны',
    '143006010100': 'Для размещения военных организаций, учреждений и других объектов',
    '143006010200': 'Для дислокации войск и сил флота',
    '143006010300': 'Для проведения учений и иных мероприятий',
    '143006010400': 'Для испытательных полигонов',
    '143006010500': 'Для мест уничтожения оружия и захоронения отходов',
    '143006010600': 'Для создания запасов материальных ценностей в государственном и мобилизационном резервах (хранилища, склады и другие)',
    '143006010700': 'Для размещения иных объектов обороны',
    '143006020000': 'Для размещения объектов (территорий), обеспечивающих защиту и охрану Государственной границы Российской Федерации',
    '143006020100': 'Для обустройства и содержания инженерно-технических сооружений и заграждений',
    '143006020200': 'Для обустройства и содержания пограничных знаков',
    '143006020300': 'Для обустройства и содержания пограничных просек',
    '143006020400': 'Для обустройства и содержания коммуникаций',
    '143006020500': 'Для обустройства и содержания пунктов пропуска через Государственную границу Российской Федерации',
    '143006020600': 'Для размещения иных объектов для защиты и охраны Государственной границы Российской Федерации',
    '143006030000': 'Для размещения иных объектов обороны и безопасности',
    '143007000000': 'Для размещения иных объектов промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, обеспечения космической деятельности, обороны, безопасности и иного специального назначения',
    '144000000000': 'Для размещения особо охраняемых историко-культурных и природных объектов (территорий)',
    '144001000000': 'Для размещения особо охраняемых природных объектов (территорий)',
    '144001010000': 'Для размещения государственных природных заповедников (в том числе биосферных)',
    '144001020000': 'Для размещения государственных природных заказников',
    '144001030000': 'Для размещения национальных парков',
    '144001040000': 'Для размещения природных парков',
    '144001050000': 'Для размещения дендрологических парков',
    '144001060000': 'Для размещения ботанических садов',
    '144001070000': 'Для размещения объектов санаторного и курортного назначения',
    '144001080000': 'Территории месторождений минеральных вод, лечебных грязей, рапы лиманов и озер',
    '144001090000': 'Для традиционного природопользования',
    '144001100000': 'Для размещения иных особо охраняемых природных территорий (объектов)',
    '144002000000': 'Для размещения объектов (территорий) природоохранного назначения',
    '144003000000': 'Для размещения объектов (территорий) рекреационного назначения',
    '144003010000': 'Для размещения домов отдыха, пансионатов, кемпингов',
    '144003020000': 'Для размещения объектов физической культуры и спорта',
    '144003030000': 'Для размещения туристических баз, стационарных и палаточных туристско-оздоровительных лагерей, домов рыболова и охотника, детских туристических станций',
    '144003040000': 'Для размещения туристических парков',
    '144003050000': 'Для размещения лесопарков',
    '144003060000': 'Для размещения учебно-туристических троп и трасс',
    '144003070000': 'Для размещения детских и спортивных лагерей',
    '144003080000': 'Для размещения скверов, парков, городских садов',
    '144003090000': 'Для размещения пляжей',
    '144003100000': 'Для размещения иных объектов (территорий) рекреационного назначения',
    '144004000000': 'Для размещения объектов историко-культурного назначения',
    '144004010000': 'Для размещения объектов культурного наследия народов Российской Федерации (памятников истории и культуры), в том числе объектов археологического наследия',
    '144004020000': 'Для размещения военных и гражданских захоронений',
    '144005000000': 'Для размещения иных особо охраняемых историко-культурных и природных объектов (территорий)',
    '145000000000': 'Для размещения объектов лесного фонда',
    '145001000000': 'Для размещения лесной растительности',
    '145002000000': 'Для восстановления лесной растительности',
    '145003000000': 'Для прочих объектов лесного хозяйства',
    '146000000000': 'Для размещения объектов водного фонда',
    '146001000000': 'Под водными объектами',
    '146002000000': 'Для размещения гидротехнических сооружений',
    '146003000000': 'Для размещения иных сооружений, расположенных на водных объектах',
    '147000000000': 'Земли запаса (неиспользуемые)'
};
// Назначение зданий
var dAssBuilding = {
    '204001000000': 'Нежилое здание',
    '204002000000': 'Жилой дом',
    '204003000000': 'Многоквартирный дом'
};

var ParcelProperties;
var ConstructionProperties;
var UncompletedProperties;
var BuildingProperties;
var ZoneProperties;
var BoundProperties;

function getValueFromDict(Key, Dic) {
    for (var k in Dic) {
        if (k === Key) {
            return Dic[k];
        }
    }
}

module.exports.getProperties = function (Feature, FeatureType) {
    switch (FeatureType) {
        case 'Parcel' :
        {
            ParcelProperties = {
                objectType: 'ЗУ',
                "Кадастровый номер": '', // require
                "Статус": '01', // dStates require
                "Дата создания": '',
                "Тип объекта": '', //dParcels require
                "Категория земель": '', // dCategories // require
                "Площадь": {// requre
                    "Значение": 0, // require
                    "ед.изм": '', //dUnit require
                    "Точность": '' // d20_2
                },
                "Разрешённое использование": {// require
                    "по документу": '',
                    "по справочнику": '' // dUtilization require
                }
            };
            ParcelProperties["Кадастровый номер"] = Feature.CadastralNumber;
            ParcelProperties["Статус"] = getValueFromDict(Feature.State, dStates);
            ParcelProperties["Тип объекта"] = getValueFromDict(Feature.Name, dParcels);
            ParcelProperties["Категория земель"] = getValueFromDict(Feature.Category, dCategories);
            ParcelProperties["Дата создания"] = Feature.DateCreated;
            ParcelProperties["Разрешённое использование"]["по справочнику"] =
                    getValueFromDict(Feature.Utilization.Utilization, dUtilizations);
            ParcelProperties["Разрешённое использование"]["по документу"] = Feature.Utilization.ByDoc;
            break;
        }
        case 'Construction':
        {
            ConstructionProperties = {
                objectType: 'ОКС сооружение',
                cadastreNumber: '', // 
                AssignationName: '',
                Address: {
                    Note: ''
                }
            };
            if (Feature.CadastralNumber) {
                ConstructionProperties.cadastreNumber = Feature.CadastralNumber;
            } else {
                ConstructionProperties.cadastreNumber = '';
            }

            ConstructionProperties.AssignationName = Feature.AssignationName;
            ConstructionProperties.ObjectType = getValueFromDict(Feature.ObjectType, dZone);
            ConstructionProperties["Address"]["Note"] = Feature.Address.Note;
            break;
        }
        case 'Building':
        {
            BuildingProperties = {
                objectType: 'ОКС',
                cadastreNumber: '', // 
                AssignationName: '',
                Address: {
                    Note: ''
                }
            };
            if (Feature.CadastralNumber) {
                BuildingProperties.cadastreNumber = Feature.CadastralNumber;
            } else {
                BuildingProperties.cadastreNumber = '';
            }

            BuildingProperties.AssignationName = Feature.AssignationName;
            //BuildingProperties.objectType = getValueFromDict(Feature.ObjectType, dZone);
            BuildingProperties["Address"]["Note"] = Feature.Address.Note;
            break;
        }
        case 'Uncompleted':
        {
            UncompletedProperties = {
                objectType: 'ОКС незавершённый',
                cadastreNumber: '', // 
                AssignationName: '',
                Address: {
                    Note: ''
                }
            };
            if (Feature.CadastralNumber) {
                UncompletedProperties.cadastreNumber = Feature.CadastralNumber;
            } else {
                UncompletedProperties.cadastreNumber = '';
            }

            UncompletedProperties.AssignationName = Feature.AssignationName;
            //UncompletedProperties.objectType = getValueFromDict(Feature.ObjectType, dZone);
            UncompletedProperties["Address"]["Note"] = Feature.Address.Note;
            break;
        }
        case 'Zone' :
        {
            ZoneProperties = {
                objectType: 'Зона',
                accountNumber: '', // 
                description: '',
                territorialZone: {
                   
                },
                specialZone: {
                    contentRestrictions: ''
                }
            };
            ZoneProperties.accountNumber = Feature.AccountNumber;
            ZoneProperties.description = Feature.Description;
        }
        case 'Bound' :
        {
            BoundProperties = {
                objectType: 'Граница',
                accountNumber: '', // 
                description: ''
            };
            BoundProperties.accountNumber = Feature.AccountNumber;
            BoundProperties.description = Feature.Description;
        }
        default :
        {
            console.log('Тип объекта не распознан');
        }
    }
    return {
        parcelProperties: ParcelProperties,
        constructionProperties: ConstructionProperties,
        uncompletedProperties: UncompletedProperties,
        buildingProperties: BuildingProperties,
        zoneProperties: ZoneProperties,
        boundProperties: BoundProperties
    };
};
},{}],3:[function(require,module,exports){
var ES = require('./spatial/EntitySpatial.js');
var Props = require('./cadProps');

module.exports.GeoJSON = function (xmlData, reproject) {

    var geoJSONQuartal = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONBounds = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONZones = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONParcels = {
        'type': 'FeatureCollection',
        'features': []
    };
    var geoJSONRealty = {
        type: "FeatureCollection",
        features: []
    };
    // Отдельное хранилище для GeometryCollection
//    var geoJSONRealtyCollection = {
//        type: "FeatureCollection",
//        features: []
//    };
    var geoJSONOSMPoints = {
        type: "FeatureCollection",
        features: []
    };

    var _reproject = reproject || null;

    var AllData = $.xml2json(xmlData).CadastralBlocks.CadastralBlock;
    //console.log(AllData);

    // Может быть несколько СК
    var projMSK;
    if (_reproject !== null) {
        projMSK = AllData.CoordSystems;
    }

    // Обработка квартала. Не может быть многоконтурным           
    if (AllData.SpatialData !== null) {
        var spObj = ES.getEntitySpatial(AllData.SpatialData.EntitySpatial, projMSK, 'Quartal', false);
        if ((spObj === undefined) || (spObj.length === 0)) {
            console.log('Объект квартала с пустой геометрией! Объект будет пропущен.');
        }
        // Квартал
        var feature = {
            'type': 'Feature'
        };
        feature.geometry = spObj;
        // Остальные свойства....

        geoJSONQuartal.features.push(feature);
    } else {
        console.log('Нет описания пространственной составляющей квартала');
    }

    // Обработка границ. Не могут быть многоконтурными
    if (AllData.Bounds) {

        if (AllData.Bounds.Bound.splice) {
            for (var i = 0; i < AllData.Bounds.Bound.length; i++) {
                if (AllData.Bounds.Bound[i].Boundaries.Boundary.splice) {
                    for (var k = 0; k < AllData.Bounds.Bound[i].Boundaries.Boundary.length; k++) {
                        // Граница
                        var feature = {
                            'type': 'Feature'
                        };
                        if (AllData.Bounds.Bound[i].Boundaries.Boundary[k].EntitySpatial !== null) {
                            var spObj = ES.getEntitySpatial(AllData.Bounds.Bound[i].Boundaries.Boundary[k].EntitySpatial, projMSK, 'Bound', false);
                            if ((spObj === undefined) || (spObj.length === 0)) {
                                console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
                                continue;
                            }
                            feature.geometry = spObj;
                            // Остальные свойства....

                            geoJSONBounds.features.push(feature);
                        } else {
                            //console.log('Нет описания пространственной составляющей границы');
                        }
                    }
                } else {
                    // Граница
                    var feature = {
                        'type': 'Feature'
                    };
                    var spObj = ES.getEntitySpatial(AllData.Bounds.Bound[i].Boundaries.Boundary.EntitySpatial, projMSK, 'Bound', false);
                    if ((spObj === undefined) || (spObj.length === 0)) {
                        console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
                        continue;
                    }
                    //feature.geometry = spObj;
                    // Остальные свойства....
                    if (spObj) {
                        feature.geometry = spObj;
                        // Остальные свойства....
                        var props = Props.getProperties(AllData.Bounds.Bound[i], 'Bound');
                        if (props) {
                            feature.properties = props.boundProperties;
                        }
                        //console.log('Объект создан. КН:' + feature.properties.cadastreNumber);
                        geoJSONBounds.features.push(feature);
                    }
                    //geoJSONBounds.features.push(feature);
                }
            }
        } else {
            var spObj = ES.getEntitySpatial(AllData.Bounds.Bound.Boundaries.Boundary.EntitySpatial, projMSK, 'Bound', false);
            if ((spObj === undefined) || (spObj.length === 0)) {
                console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
            }
            //feature.geometry = spObj;
            // Остальные свойства....
            if (spObj) {
                feature.geometry = spObj;
                // Остальные свойства....
                var props = Props.getProperties(AllData.Bounds.Bound, 'Bound');
                if (props) {
                    feature.properties = props.boundProperties;
                }
                //console.log('Объект создан. КН:' + feature.properties.cadastreNumber);
                geoJSONBounds.features.push(feature);
            }
            //geoJSONBounds.features.push(feature);
        }
    }
    // Обработка зон. Не могут быть многоконтурными
    if (AllData.Zones) {

        if (AllData.Zones.Zone.splice) {
            for (var i = 0; i < AllData.Zones.Zone.length; i++) {
                // Зона
                var feature = {
                    'type': 'Feature'
                };
                if (AllData.Zones.Zone[i].EntitySpatial !== null) {
                    var spObj = ES.getEntitySpatial(AllData.Zones.Zone[i].EntitySpatial, projMSK, 'Zone', false);
                    if ((spObj === undefined) || (spObj.length === 0)) {
                        console.log('Объект Зоны с пустой геометрией! Объект будет пропущен.');
                        continue;
                    }
                    //feature.geometry = spObj;
                    if (spObj) {
                        feature.geometry = spObj;
                        // Остальные свойства....
                        var props = Props.getProperties(AllData.Zones.Zone[i], 'Zone');
                        if (props) {
                            feature.properties = props.zoneProperties;
                        }
                        //console.log('Объект создан. КН:' + feature.properties.cadastreNumber);
                        geoJSONZones.features.push(feature);
                    }
                    //geoJSONZones.features.push(feature);
                } else {
                    console.log('Нет описания пространственной составляющей зоны');
                }
            }
        } else {
            if (AllData.Zones.Zone.EntitySpatial !== null) {
                // Зона
                var feature = {
                    'type': 'Feature'
                };
                var spObj = ES.getEntitySpatial(AllData.Zones.Zone.EntitySpatial, projMSK, 'Zone', false);
                if ((spObj === undefined) || (spObj.length === 0)) {
                    console.log('Объект Зоны с пустой геометрией! Объект будет пропущен.');
                }
                //feature.geometry = spObj;
                if (spObj) {
                    feature.geometry = spObj;
                    // Остальные свойства....
                    var props = Props.getProperties(AllData.Zones.Zone, 'Zone');
                    if (props) {
                        feature.properties = props.zoneProperties;
                    }
                    //console.log('Объект создан. КН:' + feature.properties.cadastreNumber);
                    geoJSONZones.features.push(feature);
                }
                //geoJSONZones.features.push(feature);
            } else {
                console.log('Нет описания пространственной составляющей зоны');
            }
        }
    }
    // Обработка всех земельных участков
    for (var e = 0; e < AllData.Parcels.Parcel.length; e++) {
        var spObj = null;
        // Земельный участок
        var feature = {
            'type': 'Feature'
        };
        if (AllData.Parcels.Parcel[e].EntitySpatial !== undefined) {
            spObj = ES.getEntitySpatial(AllData.Parcels.Parcel[e].EntitySpatial, projMSK, 'Parcel', false);
            if ((spObj === undefined) || (spObj.length === 0)) {
                continue;
            }

        }
        // Многоконтурный
        else if (AllData.Parcels.Parcel[e].Contours) {
            var Contours = AllData.Parcels.Parcel[e].Contours.Contour;
            var multiPolygon = [];
            for (var c = 0; c < Contours.length; c++) {
                var es = Contours[c].EntitySpatial;
                var p = ES.getEntitySpatial(es, projMSK, 'Parcel', true);
                if (p) {
                    multiPolygon.push(p);
                }
            }
            spObj = {
                type: "MultiPolygon",
                coordinates: multiPolygon
            };
        } else {
            //console.log('Нет описания пространственной составляющей');
        }

        // Если нет геометрии, то объект не нужен
        if (spObj) {
            feature.geometry = spObj;
            // Остальные свойства....
            var props = Props.getProperties(AllData.Parcels.Parcel[e], 'Parcel');
            if (props) {
                feature.properties = props.parcelProperties;
            }
            //console.log('Объект создан. КН:' + feature.properties.cadastreNumber);
            geoJSONParcels.features.push(feature);
        }

    }
    // Обработка строений. могут быть составные из разных геометрий
    if (AllData.ObjectsRealty.ObjectRealty) {
        if (AllData.ObjectsRealty.ObjectRealty.splice) {

            function processES(EntitySpatial, oType) {
                var spObj = ES.getEntitySpatial(EntitySpatial, projMSK, oType, true);
                if (spObj) {
                    if (spObj.type === 'GeometryCollection') {
                        // GeoJSON с коллекцией трудно открывать на десктопе
                        // ogr2ogr -f GeoJSON -explodecollections explode doc2139433_xml_RealtyGC.geojson
                        // поэтому лучше создать фич по количеству объектов в коллекции
                        for (var k = 0; k < spObj.geometries.length; k++) {
                            feature.geometry = spObj.geometries[k];
                            geoJSONRealty.features.push(feature);
                        }
                        //geoJSONRealtyCollection.features.push(feature);
                        //console.log('Добавлен geoJSONRealtyGeometryCollection');
                        //console.log(spObj.geometries);
                    } else {
                        feature.geometry = spObj;
                        geoJSONRealty.features.push(feature);
                    }

                } else {
                    console.log('ОКС с пустой геометрией! Объект будет пропущен.');
                }
            }

            for (var i = 0; i < AllData.ObjectsRealty.ObjectRealty.length; i++) {
                var spObj = null;
                // ОКС
                var feature = {
                    'type': 'Feature'
                };
                // строения
                if (AllData.ObjectsRealty.ObjectRealty[i].Building) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Building.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Building, 'Building');
                        if (props) {
                            feature.properties = props.buildingProperties;
                            //console.log(props.buildingProperties);
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Building.EntitySpatial, 'Building');
                    }
                }
                // объекты незавершённого строительства
                else if (AllData.ObjectsRealty.ObjectRealty[i].Uncompleted) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Uncompleted.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Uncompleted, 'Uncompleted');
                        if (props) {
                            feature.properties = props.uncompletedProperties;
                            //console.log(props.uncompletedProperties);
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Uncompleted.EntitySpatial, 'Uncompleted');
                    }
                }
                // сооружения
                else if (AllData.ObjectsRealty.ObjectRealty[i].Construction) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Construction.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Construction, 'Construction');
                        if (props) {
                            feature.properties = props.constructionProperties;
                            //console.log(props.constructionProperties);
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Construction.EntitySpatial, 'Construction');
                    }
                }
            }
        }
    }
    // Обработка пунктов ОМС

    return {
        geoJSONQuartal: geoJSONQuartal,
        geoJSONBounds: geoJSONBounds,
        geoJSONZones: geoJSONZones,
        geoJSONParcels: geoJSONParcels,
        geoJSONRealty: geoJSONRealty
        //geoJSONRealtyGeometryCollection: geoJSONRealtyCollection
    };
};

},{"./cadProps":2,"./spatial/EntitySpatial.js":4}],4:[function(require,module,exports){
/**
 * Модуль обработки геометрии типа полигон.
 * Один внешний контур и 0 или более внутренних контуров-"дырок"
 * 
 * GeoJSON geometry типа tEntitySpatialLandOut
 */

//"geometry": {
//    "type": "Polygon",
//    "coordinates": [
//      [ [100.0, 0.0], [101.0, 0.0], [101.0, 1.0],
//        [100.0, 1.0], [100.0, 0.0] ]
//      ]
//  }

var projections = require('./SpatialSystems');

module.exports.getEntitySpatial = function (EntitySpatialObj, proj, oType, partOfMultu) {

//	this.geometry = {
//        type: '',
//		coordinates: []
//	};

    var _EntitySpatialObj = EntitySpatialObj;
    var _proj = proj || null;
    var Area = 0.0;
    var spatialSysName = null;
    var LineString = false;

    // Вычисление площади замкнутого контура
    function polygonArea(Xs, Ys, numPoints) {
        var area = 0;
        var j = numPoints - 1;
        for (var i = 0; i < numPoints; i++)
        {
            area = area + ((Xs[j]) + (Xs[i])) * ((Ys[j]) - (Ys[i]));
            j = i;  //j is previous vertex to i
        }
        return Math.abs(area / 2);
    }

    function convertCoord(coord) {
        // global
        if ((_proj === null) || (spatialSysName === null)) {
            return coord;
        } else {
            return proj4(projections.SpatialSystems[spatialSysName], 'EPSG:3857', coord);
        }
    }

    function getSpatialSysName() {
        var id = _EntitySpatialObj.EntSys;
        for (var i = 0; _proj.CoordSystem.length; i++) {
            if (_proj.CoordSystem[i].CsId === id) {
                return _proj.CoordSystem[i].Name;
            }
        }
        return null;
    }

    // Создание одного замкнутого контура или линии или окружности
    function createContour(SpatialElement) {
        var xs = [];
        var ys = [];
        var contour = [];
        var coord;
        var re_projected = [];
        // проверка на окружность
        if ((SpatialElement.SpelementUnit.TypeUnit === "Окружность" || "Точка") &&
                (SpatialElement.SpelementUnit.R !== undefined)) {
            coord = [Number(SpatialElement.SpelementUnit.Ordinate.Y), Number(SpatialElement.SpelementUnit.Ordinate.X)];
            re_projected = convertCoord(coord);
            return {
                'R': Number(SpatialElement.SpelementUnit.R),
                'Y': Number(re_projected[0]),
                'X': Number(re_projected[1])
            };
        } else {
            if (SpatialElement.SpelementUnit.length === 1)
                return null;
            var firstPoint = SpatialElement.SpelementUnit[0];
            var lastPoint = SpatialElement.SpelementUnit[SpatialElement.SpelementUnit.length - 1];
            if (firstPoint.SuNmb === lastPoint.SuNmb) {
                LineString = false;
                //console.log(LineString, firstPoint.SuNmb, lastPoint.SuNmb);
                for (var j = 0; j < SpatialElement.SpelementUnit.length - 1; j++) {
                    var point = SpatialElement.SpelementUnit[j];
                    var xy = [];
                    coord = [Number(point.Ordinate.Y), Number(point.Ordinate.X)];
                    re_projected = convertCoord(coord);
                    xy.push(Number(re_projected[0]));
                    xy.push(Number(re_projected[1]));
                    contour.push(xy);
                }
                contour.push(contour[0]);
                Area = polygonArea(xs, ys, xs.length);
            } else {
                LineString = true;
                //console.log(LineString, firstPoint.SuNmb, lastPoint.SuNmb);
                for (var j = 0; j < SpatialElement.SpelementUnit.length; j++) {
                    var point = SpatialElement.SpelementUnit[j];
                    var xy = [];
                    coord = [Number(point.Ordinate.Y), Number(point.Ordinate.X)];
                    re_projected = convertCoord(coord);
                    xy.push(Number(re_projected[0]));
                    xy.push(Number(re_projected[1]));
                    contour.push(xy);
                }
                // бывае что LineString имеет одинаковые первую и последнюю точки
                // но SuNmb разные.
//                if ((contour[0][0][0] === contour[0][contour[0].length-1][0]) &&
//                        (contour[0][0][1] === contour[0][contour[0].length-1][1])){
//                    delete(contour[0][contour.length-1]);
//                    console.log(contour[0][0][0], contour[0][contour[0].length-1][0],LineString);
//                }
            }
            //console.log(Area);
            return contour;
        }
    }

    function processSpatialElement(SpatialElement) {
        var cntrs = [];
        if (_proj !== null) {
            spatialSysName = getSpatialSysName();
        }
        // Утинная типизация для проверки наличия дырок в полигоне
        // В Росреестре не следят за порядком контуров полигона
        if (SpatialElement.splice) {
            var MaxArea;
            var MaxAreaIdx = 0;
            for (var k = 0; k < SpatialElement.length; k++) {
                var contour = SpatialElement[k];
                var cnt = createContour(contour);
                if (cnt)
                    cntrs.push(cnt);
                if (Area > MaxArea) {
                    MaxArea = Area;
                    MaxAreaIdx = k;
                }
            }
            // Перемещаем основной (наружний) контур в начало массива
            if (MaxAreaIdx > 0) {
                var mainCnt = cntrs.splice(MaxAreaIdx, 1);
                cntrs.splice(0, 0, mainCnt);
                //console.log('Номер основного контура был ' + MaxAreaIdx);
            }
            if ((cntrs !== null) || (cntrs !== undefined)) {
                return cntrs;
            } else {
                return null;
            }
        } else {
            cntrs.push(createContour(SpatialElement));
            if ((cntrs !== null) || (cntrs !== undefined)) {
                return cntrs;
            } else {
                return null;
            }
        }
    }

    // у сооружений может быть смешаная геометрия (LineString, LineString, Circle, LineString)
    // в этом случае контуры cntrs будут хранить коллекцию
    function processRealtySpatialElement(SpatialElement) {
        var cntrs = [];
        if (_proj !== null) {
            spatialSysName = getSpatialSysName();
        }
        if (SpatialElement.splice) {
            var MaxArea;
            var MaxAreaIdx = 0;
            for (var k = 0; k < SpatialElement.length; k++) {
                var contour = SpatialElement[k];
                var cnt = createContour(contour);
                if (cnt)
                    cntrs.push(cnt);
                if (Area > MaxArea) {
                    MaxArea = Area;
                    MaxAreaIdx = k;
                }
            }
            // Перемещаем основной (наружний) контур в начало массива
            if ((!LineString) && (MaxAreaIdx > 0)) {
                var mainCnt = cntrs.splice(MaxAreaIdx, 1);
                cntrs.splice(0, 0, mainCnt);
                //console.log('Номер основного контура был ' + MaxAreaIdx);
            }
        } else {
            cntrs.push(createContour(SpatialElement));
        }
        if (cntrs.length > 1) {
            collection = [];

            for (var i = 0; i < cntrs.length - 1; i++) {
                // Окружность
                if (cntrs[i].R) {
                    var points = approximateCircle(cntrs[i].X, cntrs[i].Y, cntrs[i].R);
                    collection.push({
                        "type": "Polygon",
                        "coordinates": [points]
                    });
                }
                // Полигон
                else if (!LineString) {
                    collection.push({
                        "type": "Polygon",
                        "coordinates": [cntrs[i]]
                    });
                } else {
                    collection.push({
                        "type": "LineString",
                        "coordinates": cntrs[i]
                    });
                }
            }
            return  {
                "type": "GeometryCollection",
                "geometries": collection
            };

        } else {
            // Окружность
            if (cntrs[0].R) {
                var points = approximateCircle(cntrs[0].X, cntrs[0].Y, cntrs[0].R);
                return {
                    "type": "Polygon",
                    "coordinates": [points]
                };
            }
            // Полигон
            else if (!LineString) {
                return{
                    "type": "Polygon",
                    "coordinates": [cntrs[0]]
                };
            } else {
                return{
                    "type": "LineString",
                    "coordinates": cntrs[0]
                };
            }
        }
    }

    function approximateCircle(X, Y, R) {
        var rotatedAngle, x, y;
        var sides = 32;
        var points = [];
        x = X + R; // сдвиг на окружность
        //console.log('approximateCircle');
        for (var d = 0; d < sides - 1; d++) {
            var xy = [];
            rotatedAngle = (d * 2 * Math.PI / sides);//angle + (d * 2 * Math.PI / sides);
            x = X + (R * Math.cos(rotatedAngle));
            y = Y + (R * Math.sin(rotatedAngle));
            coord = [Number(y), Number(x)];
            xy.push(coord[0]);
            xy.push(coord[1]);
            points.push(xy);
        }
        points.push(points[0]);
        return points;
    }

    if ((_EntitySpatialObj !== undefined) && (_EntitySpatialObj !== null)) {

        var cntrs = [];

        switch (oType) {
            case 'Parcel' :
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                // Если это для многоконтурного объекта, то возвращем массив контуров
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            case 'Construction':
            {
                return processRealtySpatialElement(_EntitySpatialObj.SpatialElement);
                break;
            }
            case 'Building':
            {
                return processRealtySpatialElement(_EntitySpatialObj.SpatialElement);
                break;
            }
            case 'Uncompleted':
            {
                return processRealtySpatialElement(_EntitySpatialObj.SpatialElement);
                break;
            }
            case 'Zone':
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            case 'Quartal':
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            case 'Bound':
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            default :
            {
                console.log('Тип объекта не распознан');
                return null;
            }
        }
    }

}
;

},{"./SpatialSystems":5}],5:[function(require,module,exports){
/* 
 * The MIT License
 *
 * Copyright 2015 filippov.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

/*  Сиcтемы координат имеют смысл для визуализации получаемых GeoJSON,
    для сохранения в файл нет надобности в преобразовании.
    Информация о системах координат хранится в теге <CoordSystems>
    <CoordSystems>
        <ns3:CoordSystem Name="МСК 70, зона 3" CsId="ID3" />
        <ns3:CoordSystem Name="МСК 70, зона 4" CsId="ID4" />
    </CoordSystems>
    их может быть несколько.
    У объектов в теге <EntitySpatial> указано в какой СК он имеет координаты,
    например:
    <EntitySpatial EntSys="ID3">

    проблемы конвертации у тех xml у который указано <ns3:CoordSystem Name="СК кадастрового округа" CsId="ID1" />
*/ 


module.exports.SpatialSystems = {
    // Томская область
    'МСК 70, зона 4': '+proj=tmerc +lat_0=0 +lon_0=83.73333333333 +k=1 +x_0=4250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs',
    'МСК 70, зона 2': '+proj=tmerc +lat_0=0 +lon_0=77.73333333333 +k=1 +x_0=2250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs',
    'МСК 70, зона 3': '+proj=tmerc +lat_0=0 +lon_0=80.73333333333 +k=1 +x_0=3250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs'
};
},{}]},{},[1])
//# sourceMappingURL=data:application/json;charset=utf-8;base64,eyJ2ZXJzaW9uIjozLCJzb3VyY2VzIjpbIm5vZGVfbW9kdWxlcy9ncnVudC1icm93c2VyaWZ5L25vZGVfbW9kdWxlcy9icm93c2VyaWZ5L25vZGVfbW9kdWxlcy9icm93c2VyLXBhY2svX3ByZWx1ZGUuanMiLCJzcmMvYXBwLmpzIiwic3JjL2NhZFByb3BzLmpzIiwic3JjL2NhZFhNTDJHZW9KU09OLmpzIiwic3JjL3NwYXRpYWwvRW50aXR5U3BhdGlhbC5qcyIsInNyYy9zcGF0aWFsL1NwYXRpYWxTeXN0ZW1zLmpzIl0sIm5hbWVzIjpbXSwibWFwcGluZ3MiOiJBQUFBO0FDQUE7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBOztBQ2xNQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7O0FDdjZCQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBOztBQy9UQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBOztBQzdWQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQSIsImZpbGUiOiJnZW5lcmF0ZWQuanMiLCJzb3VyY2VSb290IjoiIiwic291cmNlc0NvbnRlbnQiOlsiKGZ1bmN0aW9uIGUodCxuLHIpe2Z1bmN0aW9uIHMobyx1KXtpZighbltvXSl7aWYoIXRbb10pe3ZhciBhPXR5cGVvZiByZXF1aXJlPT1cImZ1bmN0aW9uXCImJnJlcXVpcmU7aWYoIXUmJmEpcmV0dXJuIGEobywhMCk7aWYoaSlyZXR1cm4gaShvLCEwKTt2YXIgZj1uZXcgRXJyb3IoXCJDYW5ub3QgZmluZCBtb2R1bGUgJ1wiK28rXCInXCIpO3Rocm93IGYuY29kZT1cIk1PRFVMRV9OT1RfRk9VTkRcIixmfXZhciBsPW5bb109e2V4cG9ydHM6e319O3Rbb11bMF0uY2FsbChsLmV4cG9ydHMsZnVuY3Rpb24oZSl7dmFyIG49dFtvXVsxXVtlXTtyZXR1cm4gcyhuP246ZSl9LGwsbC5leHBvcnRzLGUsdCxuLHIpfXJldHVybiBuW29dLmV4cG9ydHN9dmFyIGk9dHlwZW9mIHJlcXVpcmU9PVwiZnVuY3Rpb25cIiYmcmVxdWlyZTtmb3IodmFyIG89MDtvPHIubGVuZ3RoO28rKylzKHJbb10pO3JldHVybiBzfSkiLCIvKiBcbiAqIFRvIGNoYW5nZSB0aGlzIGxpY2Vuc2UgaGVhZGVyLCBjaG9vc2UgTGljZW5zZSBIZWFkZXJzIGluIFByb2plY3QgUHJvcGVydGllcy5cbiAqIFRvIGNoYW5nZSB0aGlzIHRlbXBsYXRlIGZpbGUsIGNob29zZSBUb29scyB8IFRlbXBsYXRlc1xuICogYW5kIG9wZW4gdGhlIHRlbXBsYXRlIGluIHRoZSBlZGl0b3IuXG4gKi9cblxuKGZ1bmN0aW9uICgpIHtcbiAgICB2YXIgQ29udmVydGVyID0gcmVxdWlyZSgnLi9jYWRYTUwyR2VvSlNPTi5qcycpO1xuXG4gICAgdmFyIHBhcmNlbFN0eWxlID0ge1xuICAgICAgICBmaWxsQ29sb3I6IFwiI2I4ZTUwZVwiLFxuICAgICAgICBjb2xvcjogXCIjMDAwXCIsXG4gICAgICAgIHdlaWdodDogMSxcbiAgICAgICAgb3BhY2l0eTogMSxcbiAgICAgICAgZmlsbE9wYWNpdHk6IDAuOFxuICAgIH07XG4gICAgdmFyIG9rc1N0eWxlID0ge1xuICAgICAgICBmaWxsQ29sb3I6IFwiI2ZmNzgwMFwiLFxuICAgICAgICBjb2xvcjogXCIjMDAwXCIsXG4gICAgICAgIHdlaWdodDogMSxcbiAgICAgICAgb3BhY2l0eTogMSxcbiAgICAgICAgZmlsbE9wYWNpdHk6IDAuNVxuICAgIH07XG4gICAgdmFyIHF1YXJ0YWxsU3R5bGUgPSB7XG4gICAgICAgIGZpbGxDb2xvcjogXCIjZTRkZWE0XCIsXG4gICAgICAgIGNvbG9yOiBcIiMwMDBcIixcbiAgICAgICAgd2VpZ2h0OiAxLFxuICAgICAgICBvcGFjaXR5OiAxLFxuICAgICAgICBmaWxsT3BhY2l0eTogMC4zXG4gICAgfTtcbiAgICB2YXIgem9uZVN0eWxlID0ge1xuICAgICAgICBmaWxsQ29sb3I6IFwiI2Y5MTQxNFwiLFxuICAgICAgICBjb2xvcjogXCIjMDAwXCIsXG4gICAgICAgIHdlaWdodDogMSxcbiAgICAgICAgb3BhY2l0eTogMSxcbiAgICAgICAgZmlsbE9wYWNpdHk6IDAuOFxuICAgIH07XG4gICAgdmFyIGJvdW5kbFN0eWxlID0ge1xuICAgICAgICBmaWxsQ29sb3I6IFwiIzRiNWM3MFwiLFxuICAgICAgICBjb2xvcjogXCIjMDAwXCIsXG4gICAgICAgIHdlaWdodDogMSxcbiAgICAgICAgb3BhY2l0eTogMSxcbiAgICAgICAgZmlsbE9wYWNpdHk6IDAuOFxuICAgIH07XG5cbiAgICBmdW5jdGlvbiBsYXllckZBY3RvcnkoZ2VvSlNPTiwgbGF5ZXJTdHlsZSkge1xuICAgICAgICBnZW9KU09OLmNycyA9IHtcbiAgICAgICAgICAgIFwidHlwZVwiOiBcIm5hbWVcIixcbiAgICAgICAgICAgIFwicHJvcGVydGllc1wiOiB7XG4gICAgICAgICAgICAgICAgXCJuYW1lXCI6IFwidXJuOm9nYzpkZWY6Y3JzOkVQU0c6OjM4NTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICB9O1xuICAgICAgICByZXR1cm4gTC5Qcm9qLmdlb0pzb24oXG4gICAgICAgICAgICAgICAgZ2VvSlNPTiwge1xuICAgICAgICAgICAgICAgICAgICBzdHlsZTogbGF5ZXJTdHlsZSxcbiAgICAgICAgICAgICAgICAgICAgb25FYWNoRmVhdHVyZTogZnVuY3Rpb24gKGZlYXR1cmUsIGxheWVyKVxuICAgICAgICAgICAgICAgICAgICB7XG4gICAgICAgICAgICAgICAgICAgICAgICAvL2xheWVyLmJpbmRQb3B1cChmZWF0dXJlLnByb3BlcnRpZXMpO1xuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICApO1xuICAgIH1cblxuICAgIHZhciBkYXRhID0ge1xuXG4gICAgICAgIGluaXQ6IGZ1bmN0aW9uIChtYXAsIHJlcHJvamVjdCkge1xuICAgICAgICAgICAgZGF0YS5fbWFwID0gbWFwO1xuICAgICAgICAgICAgZGF0YS5yZXByb2plY3QgPSByZXByb2plY3Q7XG4gICAgICAgICAgICBkYXRhLl9ncm91cHMgPSB7XG5cbiAgICAgICAgICAgIH07XG5cbiAgICAgICAgICAgIGRhdGEuX2V4cG9ydENvbnQgPSBkb2N1bWVudC5nZXRFbGVtZW50QnlJZCgnZXhwb3J0Q29udCcpO1xuICAgICAgICAgICAgZGF0YS5fZmlsZVByb2dyZXNzID0gZG9jdW1lbnQuZ2V0RWxlbWVudEJ5SWQoJ2ZpbGVQcm9ncmVzcycpO1xuICAgICAgICAgICAgdmFyIGV4cG9ydEljb24gPSBudWxsO1xuICAgICAgICAgICAgaWYgKG5hdmlnYXRvci5tc1NhdmVCbG9iKSB7IC8vIElFIDEwK1xuICAgICAgICAgICAgICAgIGV4cG9ydEljb24gPSBMLkRvbVV0aWwuY3JlYXRlKCdidXR0b24nLCAnYnV0dG9uJywgZGF0YS5fZXhwb3J0Q29udCk7XG4gICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgIGV4cG9ydEljb24gPSBMLkRvbVV0aWwuY3JlYXRlKCdhJywgJ2J1dHRvbicsIGRhdGEuX2V4cG9ydENvbnQpO1xuICAgICAgICAgICAgICAgIGV4cG9ydEljb24uc2V0QXR0cmlidXRlKCd0YXJnZXQnLCAnX2JsYW5rJyk7XG4gICAgICAgICAgICAgICAgZXhwb3J0SWNvbi5zZXRBdHRyaWJ1dGUoJ2hyZWYnLCAnJyk7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBleHBvcnRJY29uLmlubmVySFRNTCA9ICfQrdC60YHQv9C+0YDRgiDQsiBHZW9KU09OJztcbi8vICAgICAgdmFyIGNvbnZlcnRDb29yZCA9IEwuRG9tVXRpbC5nZXQoJ2NvbnZlcnRNU0snKTtcbi8vICAgICAgTC5Eb21VdGlsLnJlbW92ZUNsYXNzKGNvbnZlcnRDb29yZCwgJ2hpZGRlbicpO1xuICAgICAgICAgICAgZGF0YS5fY291bnRTcGFuID0gTC5Eb21VdGlsLmNyZWF0ZSgnc3BhbicsICcnLCBkYXRhLl9leHBvcnRDb250KTtcbiAgICAgICAgICAgIGV4cG9ydEljb24uYWRkRXZlbnRMaXN0ZW5lcignY2xpY2snLCBmdW5jdGlvbiAoKSB7XG4gICAgICAgICAgICAgICAgdmFyIG9iaiA9IGRhdGEuZ2V0QmxvYigpO1xuICAgICAgICAgICAgICAgIGlmIChuYXZpZ2F0b3IubXNTYXZlT3JPcGVuQmxvYikgeyAvLyBJRSAxMCtcbiAgICAgICAgICAgICAgICAgICAgbmF2aWdhdG9yLm1zU2F2ZU9yT3BlbkJsb2Iob2JqLmJsb2IsIG9iai5maWxlKTtcbiAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICBleHBvcnRJY29uLnNldEF0dHJpYnV0ZSgnZG93bmxvYWQnLCBvYmouZmlsZSk7XG4gICAgICAgICAgICAgICAgICAgIGV4cG9ydEljb24uc2V0QXR0cmlidXRlKCdocmVmJywgd2luZG93LlVSTC5jcmVhdGVPYmplY3RVUkwob2JqLmJsb2IpKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgZGF0YS5fY291bnRTcGFuLmlubmVySFRNTCA9ICco0LPQtdC+0LzQtdGC0YDQuNC5OiA8Yj4nICsgb2JqLmNvdW50ICsgJzwvYj4pJztcbiAgICAgICAgICAgIH0sIGZhbHNlKTtcbiAgICAgICAgICAgIEwuRG9tVXRpbC5hZGRDbGFzcyhkYXRhLl9leHBvcnRDb250LCAnaGlkZGVuJyk7XG4gICAgICAgICAgICBkYXRhLl9rcHRJbmZvID0gZG9jdW1lbnQuZ2V0RWxlbWVudEJ5SWQoJ2twdEluZm8nKTtcblxuICAgICAgICB9LFxuXG4gICAgICAgIGdldEJsb2I6IGZ1bmN0aW9uICgpIHtcbiAgICAgICAgICAgIHZhciBmYyA9IG51bGwsXG4gICAgICAgICAgICAgICAgICAgIGl0ZW1zID0gZGF0YS5fZ3JvdXBzO1xuICAgICAgICAgICAgZm9yICh2YXIgZyBpbiBpdGVtcykge1xuICAgICAgICAgICAgICAgIHZhciBnZW9qc29uID0gaXRlbXNbZ107XG4gICAgICAgICAgICAgICAgaWYgKGZjKSB7XG4gICAgICAgICAgICAgICAgICAgIEFycmF5LnByb3RvdHlwZS5wdXNoLmFwcGx5KGZjLmZlYXR1cmVzLCBnZW9qc29uLmZlYXR1cmVzKTtcbiAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICBmYyA9IGdlb2pzb247XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfVxuICAgICAgICAgICAgcmV0dXJuIHtcbiAgICAgICAgICAgICAgICBmaWxlOiAnZGF0YV8nICsgRGF0ZS5ub3coKSArICcuZ2VvanNvbicsXG4gICAgICAgICAgICAgICAgYmxvYjogbmV3IEJsb2IoW0pTT04uc3RyaW5naWZ5KGZjLCBudWxsLCAnXFx0JyldLCB7dHlwZTogJ3RleHQvanNvbjtjaGFyc2V0PXV0Zi04Oyd9KSxcbiAgICAgICAgICAgICAgICBjb3VudDogZmMgPyBmYy5mZWF0dXJlcy5sZW5ndGggOiAwXG4gICAgICAgICAgICB9O1xuICAgICAgICB9LFxuXG4gICAgICAgIHNlbGVjdEZpbGU6IGZ1bmN0aW9uIChlbCkge1xuICAgICAgICAgICAgZGF0YS5fa3B0SW5mby5pbm5lckhUTUwgPSAnJztcbiAgICAgICAgICAgIGRhdGEuX2ZpbGVQcm9ncmVzcy5pbm5lckhUTUwgPSAnJztcbiAgICAgICAgICAgIEwuRG9tVXRpbC5hZGRDbGFzcyhkYXRhLl9leHBvcnRDb250LCAnaGlkZGVuJyk7XG4gICAgICAgICAgICB2YXIgcmVhZGVyID0gbmV3IEZpbGVSZWFkZXIoKSxcbiAgICAgICAgICAgICAgICAgICAgZmlsZSA9IGVsLmZpbGVzWzBdO1xuICAgICAgICAgICAgXG4gICAgICAgICAgICByZWFkZXIub25lcnJvciA9IGZ1bmN0aW9uIChlKSB7XG4gICAgICAgICAgICAgICAgY29uc29sZS5sb2coZS5tZXNzYWdlKTtcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIHJlYWRlci5vbmxvYWQgPSBmdW5jdGlvbiAoKSB7XG4gICAgICAgICAgICAgICAgZGF0YS5fZmlsZVByb2dyZXNzLmlubmVySFRNTCA9ICfQt9Cw0LPRgNGD0LbQtdC90L46IDxiPicgKyBmaWxlLnNpemUgKyAnPC9iPiDQsdCw0LnRgic7XG5cbiAgICAgICAgICAgICAgICBpZiAoZGF0YS5fbWFwLmxheWVycykge1xuICAgICAgICAgICAgICAgICAgICBmb3IgKHZhciBpID0gMDsgaSA8IGRhdGEuX21hcC5sYXllcnMubGVuZ3RoOyBpKyspIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIGRhdGEuX21hcC5yZW1vdmVMYXllcihkYXRhLl9tYXAubGF5ZXJzW2ldKTtcbiAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICB2YXIgb2xkTGF5ZXJDb250cm9sID0gZG9jdW1lbnQuZ2V0RWxlbWVudHNCeUNsYXNzTmFtZSgnbGVhZmxldC1jb250cm9sLWxheWVycycpO1xuICAgICAgICAgICAgICAgIGlmIChvbGRMYXllckNvbnRyb2wubGVuZ3RoPjApIHtcbiAgICAgICAgICAgICAgICAgICAgTC5Eb21VdGlsLnJlbW92ZShvbGRMYXllckNvbnRyb2xbMF0pO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICBkYXRhLl9ncm91cHMgPSB7fTtcbiAgICAgICAgICAgICAgICBkYXRhLnBhcnNlRmlsZShyZWFkZXIpO1xuICAgICAgICAgICAgfTtcbiAgICAgICAgICAgIHJlYWRlci5vbnByb2dyZXNzID0gZnVuY3Rpb24gKGluZm8pIHtcbiAgICAgICAgICAgICAgICBpZiAoZGF0YS5sZW5ndGhDb21wdXRhYmxlKSB7XG4gICAgICAgICAgICAgICAgICAgIHZhciBjbnQgPSBpbmZvLmxvYWRlZCAvIGluZm8udG90YWw7XG4gICAgICAgICAgICAgICAgICAgIGRhdGEuX2ZpbGVQcm9ncmVzcy5pbm5lckhUTUwgPSAn0LfQsNCz0YDRg9C20LXQvdC+OiA8Yj4nICsgaW5mby5sb2FkZWQgKyAnPC9iPiDQsdCw0LnRgicgKyAoY250ID09PSAxID8gJycgOiAnKCcgKyBwYXJzZUludChjbnQgKiAxMDAsIDEwKSArICclKScpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH07XG4gICAgICAgICAgICBpZiAoZWwuZmlsZXMubGVuZ3RoKSB7XG4gICAgICAgICAgICAgICAgcmVhZGVyLnJlYWRBc1RleHQoZmlsZSk7XG4gICAgICAgICAgICB9XG4gICAgICAgIH0sXG5cbiAgICAgICAgcGFyc2VGaWxlOiBmdW5jdGlvbiAocmVhZGVyKSB7XG4gICAgICAgICAgICAvLyBodHRwczovL2JpdGJ1Y2tldC5vcmcvc3VyZW5yYW8veG1sMmpzb25cbiAgICAgICAgICAgIC8vIGh0dHA6Ly93d3cuY2hyb21lLWFsbG93LWZpbGUtYWNjZXNzLWZyb20tZmlsZS5jb20vXG4gICAgICAgICAgICB2YXIgcGFyc2VkRGF0YSA9IENvbnZlcnRlci5HZW9KU09OKHJlYWRlci5yZXN1bHQpO1xuICAgICAgICAgICAgdmFyIHBhcmNlbHMgPSBwYXJzZWREYXRhLmdlb0pTT05QYXJjZWxzO1xuICAgICAgICAgICAgdmFyIG9rcyA9IHBhcnNlZERhdGEuZ2VvSlNPTlJlYWx0eTtcbiAgICAgICAgICAgIHZhciB6b25lcyA9IHBhcnNlZERhdGEuZ2VvSlNPTlpvbmVzO1xuICAgICAgICAgICAgdmFyIHF1YXJ0YWwgPSBwYXJzZWREYXRhLmdlb0pTT05RdWFydGFsO1xuICAgICAgICAgICAgdmFyIGJvdW5kcyA9IHBhcnNlZERhdGEuZ2VvSlNPTkJvdW5kcztcbiAgICAgICAgICAgIGNvbnNvbGUubG9nKHpvbmVzKTtcbiAgICAgICAgICAgIGNvbnNvbGUubG9nKGJvdW5kcyk7XG4gICAgICAgICAgICBkYXRhLl9ncm91cHMgPSB7XG4gICAgICAgICAgICAgICAgcGFyY2VsczogcGFyY2VscyxcbiAgICAgICAgICAgICAgICBva3M6IG9rcyxcbiAgICAgICAgICAgICAgICB6b25lczogem9uZXMsXG4gICAgICAgICAgICAgICAgcXVhcnRhbDogcXVhcnRhbCxcbiAgICAgICAgICAgICAgICBib3VuZHM6IGJvdW5kc1xuICAgICAgICAgICAgfTtcblxuICAgICAgICAgICAgdmFyIG9rc0xheWVyID0gbGF5ZXJGQWN0b3J5KG9rcywgb2tzU3R5bGUpO1xuICAgICAgICAgICAgdmFyIHBhcmNlbExheWVyID0gbGF5ZXJGQWN0b3J5KHBhcmNlbHMsIHBhcmNlbFN0eWxlKTtcbiAgICAgICAgICAgIHZhciB6b25lTGF5ZXIgPSBsYXllckZBY3Rvcnkoem9uZXMsIHpvbmVTdHlsZSk7XG4gICAgICAgICAgICB2YXIgYm91bmRMYXllciA9IGxheWVyRkFjdG9yeShib3VuZHMsIGJvdW5kbFN0eWxlKTtcbiAgICAgICAgICAgIHZhciBxdWFydGFsTGF5ZXIgPSBsYXllckZBY3RvcnkocXVhcnRhbCwgcXVhcnRhbGxTdHlsZSk7XG5cbiAgICAgICAgICAgIHZhciBsYXllckNvbnRyb2wgPSBMLmNvbnRyb2wubGF5ZXJzKHt9LCB7XG4gICAgICAgICAgICAgICAgJ9Ca0LLQsNGA0YLQsNC7JzogcXVhcnRhbExheWVyLFxuICAgICAgICAgICAgICAgICfQk9GA0LDQvdC40YbRiyc6IGJvdW5kTGF5ZXIsXG4gICAgICAgICAgICAgICAgJ9CX0L7QvdGLJzogem9uZUxheWVyLFxuICAgICAgICAgICAgICAgICfQo9GH0LDRgdGC0LrQuCc6IHBhcmNlbExheWVyLFxuICAgICAgICAgICAgICAgICfQntCa0KEnOiBva3NMYXllclxuICAgICAgICAgICAgfSkuYWRkVG8oZGF0YS5fbWFwKTtcblxuICAgICAgICAgICAgZGF0YS5fbWFwLmZpdEJvdW5kcyhwYXJjZWxMYXllci5nZXRCb3VuZHMoKSk7XG4gICAgICAgICAgICBMLkRvbVV0aWwucmVtb3ZlQ2xhc3MoZGF0YS5fZXhwb3J0Q29udCwgJ2hpZGRlbicpO1xuICAgICAgICB9XG4gICAgfTtcbiAgICB3aW5kb3cuY29udmVydGVkRGF0YSA9IGRhdGE7XG59KSgpO1xuIiwiLyogXG4gKiBUaGUgTUlUIExpY2Vuc2VcbiAqXG4gKiBDb3B5cmlnaHQgMjAxNSBmaWxpcHBvdi5cbiAqXG4gKiBQZXJtaXNzaW9uIGlzIGhlcmVieSBncmFudGVkLCBmcmVlIG9mIGNoYXJnZSwgdG8gYW55IHBlcnNvbiBvYnRhaW5pbmcgYSBjb3B5XG4gKiBvZiB0aGlzIHNvZnR3YXJlIGFuZCBhc3NvY2lhdGVkIGRvY3VtZW50YXRpb24gZmlsZXMgKHRoZSBcIlNvZnR3YXJlXCIpLCB0byBkZWFsXG4gKiBpbiB0aGUgU29mdHdhcmUgd2l0aG91dCByZXN0cmljdGlvbiwgaW5jbHVkaW5nIHdpdGhvdXQgbGltaXRhdGlvbiB0aGUgcmlnaHRzXG4gKiB0byB1c2UsIGNvcHksIG1vZGlmeSwgbWVyZ2UsIHB1Ymxpc2gsIGRpc3RyaWJ1dGUsIHN1YmxpY2Vuc2UsIGFuZC9vciBzZWxsXG4gKiBjb3BpZXMgb2YgdGhlIFNvZnR3YXJlLCBhbmQgdG8gcGVybWl0IHBlcnNvbnMgdG8gd2hvbSB0aGUgU29mdHdhcmUgaXNcbiAqIGZ1cm5pc2hlZCB0byBkbyBzbywgc3ViamVjdCB0byB0aGUgZm9sbG93aW5nIGNvbmRpdGlvbnM6XG4gKlxuICogVGhlIGFib3ZlIGNvcHlyaWdodCBub3RpY2UgYW5kIHRoaXMgcGVybWlzc2lvbiBub3RpY2Ugc2hhbGwgYmUgaW5jbHVkZWQgaW5cbiAqIGFsbCBjb3BpZXMgb3Igc3Vic3RhbnRpYWwgcG9ydGlvbnMgb2YgdGhlIFNvZnR3YXJlLlxuICpcbiAqIFRIRSBTT0ZUV0FSRSBJUyBQUk9WSURFRCBcIkFTIElTXCIsIFdJVEhPVVQgV0FSUkFOVFkgT0YgQU5ZIEtJTkQsIEVYUFJFU1MgT1JcbiAqIElNUExJRUQsIElOQ0xVRElORyBCVVQgTk9UIExJTUlURUQgVE8gVEhFIFdBUlJBTlRJRVMgT0YgTUVSQ0hBTlRBQklMSVRZLFxuICogRklUTkVTUyBGT1IgQSBQQVJUSUNVTEFSIFBVUlBPU0UgQU5EIE5PTklORlJJTkdFTUVOVC4gSU4gTk8gRVZFTlQgU0hBTEwgVEhFXG4gKiBBVVRIT1JTIE9SIENPUFlSSUdIVCBIT0xERVJTIEJFIExJQUJMRSBGT1IgQU5ZIENMQUlNLCBEQU1BR0VTIE9SIE9USEVSXG4gKiBMSUFCSUxJVFksIFdIRVRIRVIgSU4gQU4gQUNUSU9OIE9GIENPTlRSQUNULCBUT1JUIE9SIE9USEVSV0lTRSwgQVJJU0lORyBGUk9NLFxuICogT1VUIE9GIE9SIElOIENPTk5FQ1RJT04gV0lUSCBUSEUgU09GVFdBUkUgT1IgVEhFIFVTRSBPUiBPVEhFUiBERUFMSU5HUyBJTlxuICogVEhFIFNPRlRXQVJFLlxuICovXG4ndXNlIHN0cmljdCc7XG4vLyBEaWN0c1xuXG4vLyDQodGC0LDRgtGD0YEg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4XG52YXIgZFN0YXRlcyA9IHtcbiAgICAnMDEnOiAn0KDQsNC90LXQtSDRg9GH0YLQtdC90L3Ri9C5JyxcbiAgICAnMDUnOiAn0JLRgNC10LzQtdC90L3Ri9C5JyxcbiAgICAnMDYnOiAn0KPRh9GC0LXQvdC90YvQuScsXG4gICAgJzA3JzogJ9Ch0L3Rj9GCINGBINGD0YfQtdGC0LAnLFxuICAgICcwOCc6ICfQkNC90L3Rg9C70LjRgNC+0LLQsNC90L3Ri9C5J1xufTtcbi8vINCi0LjQvyAg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4XG52YXIgZFBhcmNlbHMgPSB7XG4gICAgJzAxJzogJ9CX0LXQvNC70LXQv9C+0LvRjNC30L7QstCw0L3QuNC1JyxcbiAgICAnMDInOiAn0JXQtNC40L3QvtC1INC30LXQvNC70LXQv9C+0LvRjNC30L7QstCw0L3QuNC1JyxcbiAgICAnMDMnOiAn0J7QsdC+0YHQvtCx0LvQtdC90L3Ri9C5INGD0YfQsNGB0YLQvtC6JyxcbiAgICAnMDQnOiAn0KPRgdC70L7QstC90YvQuSDRg9GH0LDRgdGC0L7QuicsXG4gICAgJzA1JzogJ9Cc0L3QvtCz0L7QutC+0L3RgtGD0YDQvdGL0Lkg0YPRh9Cw0YHRgtC+0LonLFxuICAgICcwNic6ICfQl9C90LDRh9C10L3QuNC1INC+0YLRgdGD0YLRgdGC0LLRg9C10YInXG59O1xuLy8g0JrQsNGC0LXQs9C+0YDQuNGPINC30LXQvNC10LvRjFxudmFyIGRDYXRlZ29yaWVzID0ge1xuICAgICcwMDMwMDEwMDAwMDAnOiAn0JfQtdC80LvQuCDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcwMDMwMDIwMDAwMDAnOiAn0JfQtdC80LvQuCDQvdCw0YHQtdC70ZHQvdC90YvRhSDQv9GD0L3QutGC0L7QsicsXG4gICAgJzAwMzAwMzAwMDAwMCc6ICfQl9C10LzQu9C4INC/0YDQvtC80YvRiNC70LXQvdC90L7RgdGC0LgsINGN0L3QtdGA0LPQtdGC0LjQutC4LCDRgtGA0LDQvdGB0L/QvtGA0YLQsCwg0YHQstGP0LfQuCwg0YDQsNC00LjQvtCy0LXRidCw0L3QuNGPLCDRgtC10LvQtdCy0LjQtNC10L3QuNGPLCDQuNC90YTQvtGA0LzQsNGC0LjQutC4LCDQt9C10LzQu9C4INC00LvRjyDQvtCx0LXRgdC/0LXRh9C10L3QuNGPINC60L7RgdC80LjRh9C10YHQutC+0Lkg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4LCDQt9C10LzQu9C4INC+0LHQvtGA0L7QvdGLLCDQsdC10LfQvtC/0LDRgdC90L7RgdGC0Lgg0Lgg0LfQtdC80LvQuCDQuNC90L7Qs9C+INGB0L/QtdGG0LjQsNC70YzQvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzAwMzAwNDAwMDAwMCc6ICfQl9C10LzQu9C4INC+0YHQvtCx0L4g0L7RhdGA0LDQvdGP0LXQvNGL0YUg0YLQtdGA0YDQuNGC0L7RgNC40Lkg0Lgg0L7QsdGK0LXQutGC0L7QsicsXG4gICAgJzAwMzAwNTAwMDAwMCc6ICfQl9C10LzQu9C4INC70LXRgdC90L7Qs9C+INGE0L7QvdC00LAnLFxuICAgICcwMDMwMDYwMDAwMDAnOiAn0JfQtdC80LvQuCDQstC+0LTQvdC+0LPQviDRhNC+0L3QtNCwJyxcbiAgICAnMDAzMDA3MDAwMDAwJzogJ9CX0LXQvNC70Lgg0LfQsNC/0LDRgdCwJyxcbiAgICAnMDAzMDA4MDAwMDAwJzogJ9Ca0LDRgtC10LPQvtGA0LjRjyDQvdC1INGD0YHRgtCw0L3QvtCy0LvQtdC90LAnXG59O1xuLy8g0J7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjykg0L/RgNCw0LJcbnZhciBkRW5jdW1icmFuY2VzID0ge1xuICAgICcwMjIwMDEwMDAwMDAnOiAn0KHQtdGA0LLQuNGC0YPRgicsXG4gICAgJzAyMjAwMTAwMTAwMCc6ICfQn9GD0LHQu9C40YfQvdGL0Lkg0YHQtdGA0LLQuNGC0YPRgicsXG4gICAgJzAyMjAwMTAwMjAwMCc6ICfQp9Cw0YHRgtC90YvQuSDRgdC10YDQstC40YLRg9GCJyxcbiAgICAnMDIyMDAyMDAwMDAwJzogJ9CQ0YDQtdGB0YInLFxuICAgICcwMjIwMDMwMDAwMDAnOiAn0JfQsNC/0YDQtdGJ0LXQvdC40LUnLFxuICAgICcwMjIwMDQwMDAwMDAnOiAn0J7Qs9GA0LDQvdC40YfQtdC90LjRjyDQv9GA0LDQsiDQvdCwINC30LXQvNC10LvRjNC90YvQuSDRg9GH0LDRgdGC0L7Quiwg0L/RgNC10LTRg9GB0LzQvtGC0YDQtdC90L3Ri9C1INGB0YLQsNGC0YzRj9C80LggNTYsIDU2LjEg0JfQtdC80LXQu9GM0L3QvtCz0L4g0LrQvtC00LXQutGB0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4JyxcbiAgICAnMDIyMDA1MDAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0LjQt9GK0Y/RgtC40Lgg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAsINC20LjQu9C+0LPQviDQv9C+0LzQtdGJ0LXQvdC40Y8nLFxuICAgICcwMjIwMDYwMDAwMDAnOiAn0JDRgNC10L3QtNCwICjQsiDRgtC+0Lwg0YfQuNGB0LvQtSwg0YHRg9Cx0LDRgNC10L3QtNCwKScsXG4gICAgJzAyMjAwNzAwMDAwMCc6ICfQmNC/0L7RgtC10LrQsCcsXG4gICAgJzAyMjAwODAwMDAwMCc6ICfQmNC/0L7RgtC10LrQsCDQsiDRgdC40LvRgyDQt9Cw0LrQvtC90LAnLFxuICAgICcwMjIwMDkwMDAwMDAnOiAn0JHQtdC30LLQvtC30LzQtdC30LTQvdC+0LUgKNGB0YDQvtGH0L3QvtC1KSDQv9C+0LvRjNC30L7QstCw0L3QuNC1INC30LXQvNC10LvRjNC90YvQvC/Qu9C10YHQvdGL0Lwg0YPRh9Cw0YHRgtC60L7QvCcsXG4gICAgJzAyMjAxMDAwMDAwMCc6ICfQlNC+0LLQtdGA0LjRgtC10LvRjNC90L7QtSDRg9C/0YDQsNCy0LvQtdC90LjQtScsXG4gICAgJzAyMjAxMTAwMDAwMCc6ICfQoNC10L3RgtCwJyxcbiAgICAnMDIyMDEyMDAwMDAwJzogJ9CX0LDQv9GA0LXRgiDQvdCwINGB0L7QstC10YDRiNC10L3QuNC1INC00LXQudGB0YLQstC40Lkg0LIg0YHRhNC10YDQtSDQk9Ca0KMg0LIg0L7RgtC90L7RiNC10L3QuNC4INCe0J0nLFxuICAgICcwMjIwOTkwMDAwMDAnOiAn0JjQvdGL0LUg0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjykg0L/RgNCw0LInXG59O1xuLy8g0JXQtNC40L3QuNGG0Ysg0LjQt9C80LXRgNC10L3QuNC5XG52YXIgZFVuaXRzID0ge1xuICAgICcwMDMnOiAn0JzQuNC70LvQuNC80LXRgtGAJyxcbiAgICAnMDA0JzogJ9Ch0LDQvdGC0LjQvNC10YLRgCcsXG4gICAgJzAwNSc6ICfQlNC10YbQuNC80LXRgtGAJyxcbiAgICAnMDA2JzogJ9Cc0LXRgtGAJyxcbiAgICAnMDA4JzogJ9Ca0LjQu9C+0LzQtdGC0YAnLFxuICAgICcwMDknOiAn0JzQtdCz0LDQvNC10YLRgCcsXG4gICAgJzA0Nyc6ICfQnNC+0YDRgdC60LDRjyDQvNC40LvRjycsXG4gICAgJzA1MCc6ICfQmtCy0LDQtNGA0LDRgtC90YvQuSDQvNC40LvQu9C40LzQtdGC0YAnLFxuICAgICcwNTEnOiAn0JrQstCw0LTRgNCw0YLQvdGL0Lkg0YHQsNC90YLQuNC80LXRgtGAJyxcbiAgICAnMDUzJzogJ9Ca0LLQsNC00YDQsNGC0L3Ri9C5INC00LXRhtC40LzQtdGC0YAnLFxuICAgICcwNTUnOiAn0JrQstCw0LTRgNCw0YLQvdGL0Lkg0LzQtdGC0YAnLFxuICAgICcwNTgnOiAn0KLRi9GB0Y/Rh9CwINC60LLQsNC00YDQsNGC0L3Ri9GFINC80LXRgtGA0L7QsicsXG4gICAgJzA1OSc6ICfQk9C10LrRgtCw0YAnLFxuICAgICcwNjEnOiAn0JrQstCw0LTRgNCw0YLQvdGL0Lkg0LrQuNC70L7QvNC10YLRgCcsXG4gICAgJzEwOSc6ICfQkNGAICgxMDAg0LwyKScsXG4gICAgJzM1OSc6ICfQodGD0YLQutC4JyxcbiAgICAnMzYwJzogJ9Cd0LXQtNC10LvRjycsXG4gICAgJzM2MSc6ICfQlNC10LrQsNC00LAnLFxuICAgICczNjInOiAn0JzQtdGB0Y/RhicsXG4gICAgJzM2NCc6ICfQmtCy0LDRgNGC0LDQuycsXG4gICAgJzM2NSc6ICfQn9C+0LvRg9Cz0L7QtNC40LUnLFxuICAgICczNTYnOiAn0KfQsNGBJyxcbiAgICAnMzU1JzogJ9Cc0LjQvdGD0YLQsCAnLFxuICAgICczNjYnOiAn0JPQvtC0JyxcbiAgICAnMzgzJzogJ9Cg0YPQsdC70YwnLFxuICAgICczODQnOiAn0KLRi9GB0Y/Rh9CwINGA0YPQsdC70LXQuScsXG4gICAgJzM4NSc6ICfQnNC40LvQu9C40L7QvSDRgNGD0LHQu9C10LknLFxuICAgICczODYnOiAn0JzQuNC70LvQuNCw0YDQtCDRgNGD0LHQu9C10LknLFxuICAgICcxMDAwJzogJ9Cd0LXQvtC/0YDQtdC00LXQu9C10L3QvicsXG4gICAgJzEwMDEnOiAn0JfQvdCw0YfQtdC90LjQtSDQvtGC0YHRg9GC0YHRgtCy0YPQtdGCJyxcbiAgICAnMTAwMic6ICfQoNGD0LHQu9C10Lkg0LfQsCDQutCyLiDQvNC10YLRgCcsXG4gICAgJzEwMDMnOiAn0KDRg9Cx0LvQtdC5INC30LAg0LDRgCcsXG4gICAgJzEwMDQnOiAn0KDRg9Cx0LvQtdC5ICDQt9CwINCz0LXQutGC0LDRgCcsXG4gICAgJzEwMDUnOiAn0JjQvdGL0LUnLFxuICAgICcxMDA2JzogJ9Cg0YPQsdC70LXQuSDQt9CwINC60LIuINC60LwnLFxuICAgICcxMDA3JzogJ9Cg0LDQsdC+0YfQuNC5INC00LXQvdGMJ1xufTtcbi8vINCS0YHQtSDQtNC+0LrRg9C80LXQvdGC0YsgKNCh0LHQvtGA0L3QuNC6INC60LvQsNGB0YHQuNGE0LjQutCw0YLQvtGA0L7Qsiwg0LrQvtC00YsgOC4xLCA4LjIsIDU1NSwgNTU4LjEsIDU1OC4yLCA1NTguMywgNTU4LjQsIDU1OC41LCA1NTguNilcbnZhciBkQWxsRG9jdW1lbnRzID0ge1xuICAgICcwMDgwMDEwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLLCDRg9C00L7RgdGC0L7QstC10YDRj9GO0YnQuNC1INC70LjRh9C90L7RgdGC0Ywg0YTQuNC30LjRh9C10YHQutC+0LPQviDQu9C40YbQsCcsXG4gICAgJzAwODAwMTAwMTAwMCc6ICfQn9Cw0YHQv9C+0YDRgiDQs9GA0LDQttC00LDQvdC40L3QsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuICAgICcwMDgwMDEwMDIwMDAnOiAn0J/QsNGB0L/QvtGA0YIg0LPRgNCw0LbQtNCw0L3QuNC90LAg0KHQodCh0KAnLFxuICAgICcwMDgwMDEwMDMwMDAnOiAn0J/QsNGB0L/QvtGA0YIg0LPRgNCw0LbQtNCw0L3QuNC90LAg0LjQvdC+0YHRgtGA0LDQvdC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LAnLFxuICAgICcwMDgwMDEwMDQwMDAnOiAn0J7QsdGJ0LXQs9GA0LDQttC00LDQvdGB0LrQuNC5INC30LDQs9GA0LDQvdC40YfQvdGL0Lkg0L/QsNGB0L/QvtGA0YInLFxuICAgICcwMDgwMDEwMDUwMDAnOiAn0JfQsNCz0YDQsNC90LjRh9C90YvQuSDQv9Cw0YHQv9C+0YDRgiDQnNC40L3QuNGB0YLQtdGA0YHRgtCy0LAg0LzQvtGA0YHQutC+0LPQviDRhNC70L7RgtCwJyxcbiAgICAnMDA4MDAxMDA2MDAwJzogJ9CU0LjQv9C70L7QvNCw0YLQuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgicsXG4gICAgJzAwODAwMTAwNzAwMCc6ICfQn9Cw0YHQv9C+0YDRgiDQvNC+0YDRj9C60LAgKNGD0LTQvtGB0YLQvtCy0LXRgNC10L3QuNC1INC70LjRh9C90L7RgdGC0Lgg0LzQvtGA0Y/QutCwKScsXG4gICAgJzAwODAwMTAwODAwMCc6ICfQktC+0LXQvdC90YvQuSDQsdC40LvQtdGCINCy0L7QtdC90L3QvtGB0LvRg9C20LDRidC10LPQvicsXG4gICAgJzAwODAwMTAwOTAwMCc6ICfQktGA0LXQvNC10L3QvdC+0LUg0YPQtNC+0YHRgtC+0LLQtdGA0LXQvdC40LUsINCy0YvQtNCw0L3QvdC+0LUg0LLQt9Cw0LzQtdC9INCy0L7QtdC90L3QvtCz0L4g0LHQuNC70LXRgtCwJyxcbiAgICAnMDA4MDAxMDEwMDAwJzogJ9Cj0LTQvtGB0YLQvtCy0LXRgNC10L3QuNC1INC70LjRh9C90L7RgdGC0Lgg0L7RhNC40YbQtdGA0LAg0JzQuNC90LjRgdGC0LXRgNGB0YLQstCwINC+0LHQvtGA0L7QvdGLINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCwg0JzQuNC90LjRgdGC0LXRgNGB0YLQstCwINCy0L3Rg9GC0YDQtdC90L3QuNGFINC00LXQuyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0Lgg0LTRgNGD0LPQuNGFINCy0L7QuNC90YHQutC40YUg0YTQvtGA0LzQuNGA0L7QstCw0L3QuNC5INGBINC/0YDQuNC70L7QttC10L3QuNC10Lwg0YHQv9GA0LDQstC60Lgg0L4g0L/RgNC+0L/QuNGB0LrQtSAo0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCkg0KQtMzMnLFxuICAgICcwMDgwMDEwMTEwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0YDQvtC20LTQtdC90LjQuCcsXG4gICAgJzAwODAwMTAxMjAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDRgNCw0YHRgdC80L7RgtGA0LXQvdC40Lgg0YXQvtC00LDRgtCw0LnRgdGC0LLQsCDQviDQv9GA0LjQt9C90LDQvdC40Lgg0LHQtdC20LXQvdGG0LXQvCDQvdCwINGC0LXRgNGA0LjRgtC+0YDQuNC4INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQv9C+INGB0YPRidC10YHRgtCy0YMnLFxuICAgICcwMDgwMDEwMTMwMDAnOiAn0JLQuNC0INC90LAg0LbQuNGC0LXQu9GM0YHRgtCy0L4g0LjQvdC+0YHRgtGA0LDQvdC90L7Qs9C+INCz0YDQsNC20LTQsNC90LjQvdCwINC40LvQuCDQu9C40YbQsCDQsdC10Lcg0LPRgNCw0LbQtNCw0L3RgdGC0LLQsCcsXG4gICAgJzAwODAwMTAxNDAwMCc6ICfQodC/0YDQsNCy0LrQsCDQvtCxINC+0YHQstC+0LHQvtC20LTQtdC90LjQuCDQuNC3INC80LXRgdGCINC70LjRiNC10L3QuNGPINGB0LLQvtCx0L7QtNGLJyxcbiAgICAnMDA4MDAxMDE1MDAwJzogJ9CS0YDQtdC80LXQvdC90L7QtSDRg9C00L7RgdGC0L7QstC10YDQtdC90LjQtSDQu9C40YfQvdC+0YHRgtC4INCz0YDQsNC20LTQsNC90LjQvdCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG4gICAgJzAwODAwMTAxNjAwMCc6ICfQo9C00L7RgdGC0L7QstC10YDQtdC90LjQtSDQstGL0L3Rg9C20LTQtdC90L3QvtCz0L4g0L/QtdGA0LXRgdC10LvQtdC90YbQsCcsXG4gICAgJzAwODAwMTAxNzAwMCc6ICfQoNCw0LfRgNC10YjQtdC90LjQtSDQvdCwINCy0YDQtdC80LXQvdC90L7QtSDQv9GA0L7QttC40LLQsNC90LjQtSDQsiDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuICAgICcwMDgwMDEwMTgwMDAnOiAn0KPQtNC+0YHRgtC+0LLQtdGA0LXQvdC40LUg0LHQtdC20LXQvdGG0LAg0LIg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4JyxcbiAgICAnMDA4MDAxMDE5MDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INGA0LDRgdGB0LzQvtGC0YDQtdC90LjQuCDRhdC+0LTQsNGC0LDQudGB0YLQstCwINC+INC/0YDQuNC30L3QsNC90LjQuCDQu9C40YbQsCDQstGL0L3Rg9C20LTQtdC90L3Ri9C8INC/0LXRgNC10YHQtdC70LXQvdGG0LXQvCcsXG4gICAgJzAwODAwMTAyMDAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INCy0YDQtdC80LXQvdC90L7Qs9C+INGD0LHQtdC20LjRidCwINC90LAg0YLQtdGA0YDQuNGC0L7RgNC40Lgg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4JyxcbiAgICAnMDA4MDAxMDk5MDAwJzogJ9CY0L3Ri9C1INC00L7QutGD0LzQtdC90YLRiywg0L/RgNC10LTRg9GB0LzQvtGC0YDQtdC90L3Ri9C1INC30LDQutC+0L3QvtC00LDRgtC10LvRjNGB0YLQstC+0Lwg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC40LvQuCDQv9GA0LjQt9C90LDQstCw0LXQvNGL0LUg0LIg0YHQvtC+0YLQstC10YLRgdGC0LLQuNC4INGBINC80LXQttC00YPQvdCw0YDQvtC00L3Ri9C8INC00L7Qs9C+0LLQvtGA0L7QvCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0LIg0LrQsNGH0LXRgdGC0LLQtSDQtNC+0LrRg9C80LXQvdGC0L7Qsiwg0YPQtNC+0YHRgtC+0LLQtdGA0Y/RjtGJ0LjRhSDQu9C40YfQvdC+0YHRgtGMJyxcbiAgICAnMDA4MDAyMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0LjQtNC10L3RgtC40YTQuNGG0LjRgNGD0Y7RidC40LUg0Y7RgNC40LTQuNGH0LXRgdC60L7QtSDQu9C40YbQvicsXG4gICAgJzAwODAwMjAwMTAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDRjtGA0LjQtNC40YfQtdGB0LrQvtCz0L4g0LvQuNGG0LAnLFxuICAgICcwMDgwMDIwMDIwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0LLQvdC10YHQtdC90LjQuCDQt9Cw0L/QuNGB0LXQuSDQsiDQldCT0KDQrtCbJyxcbiAgICAnMDA4MDAyMDA0MDAwJzogJ9Cj0YHRgtCw0LInLFxuICAgICcwMDgwMDIwMDUwMDAnOiAn0KPRh9GA0LXQtNC40YLQtdC70YzQvdGL0Lkg0LTQvtCz0L7QstC+0YAnLFxuICAgICcwMDgwMDIwMDYwMDAnOiAn0J/QvtC70L7QttC10L3QuNC1ICjQvtCx0YnQtdC1INC/0L7Qu9C+0LbQtdC90LjQtSDQvtCxINC+0YDQs9Cw0L3QuNC30LDRhtC40LgpJyxcbiAgICAnMDA4MDAyMDA3MDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+ICjQuNC70Lgg0YPQstC10LTQvtC80LvQtdC90LjQtSkg0L4g0L/QvtGB0YLQsNC90L7QstC60LUg0L3QsCDRg9GH0ZHRgiDQsiDQvdCw0LvQvtCz0L7QstC+0Lwg0L7RgNCz0LDQvdC1INGBINGD0LrQsNC30LDQvdC40LXQvCDQmNCd0J0nLFxuICAgICcwMDgwMDIwMDgwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQldCT0KDQrtCbJyxcbiAgICAnMDA4MDAyMDk5MDAwJzogJ9CY0L3QvtC5INC00L7QutGD0LzQtdC90YInLFxuICAgICc1NTUwMDEwMDAwMDAnOiAn0JrQstC40YLQsNC90YbQuNGPJyxcbiAgICAnNTU1MDAyMDAwMDAwJzogJ9Cf0LvQsNGC0ZHQttC90L7QtSDQv9C+0YDRg9GH0LXQvdC40LUnLFxuICAgICc1NTUwMDMwMDAwMDAnOiAn0KfQtdC6JyxcbiAgICAnNTU1MDA0MDAwMDAwJzogJ9Cf0L7QtNGC0LLQtdGA0LbQtNC10L3QuNC1INGN0LvQtdC60YLRgNC+0L3QvdC+0LPQviDQv9C70LDRgtC10LbQsCcsXG4gICAgJzU1NTAwNTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC/0YDQsNCy0L4g0LfQsNGP0LLQuNGC0LXQu9GPINC90LAg0LHQtdC30LLQvtC30LzQtdC30LTQvdC+0LUg0L/QvtC70YPRh9C10L3QuNC1INGB0LLQtdC00LXQvdC40LknLFxuICAgICc1NTgxMDAwMDAwMDAnOiAn0JfQkNCv0JLQm9CV0J3QmNCvJyxcbiAgICAnNTU4MTAxMDAwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjRjyDQuCDQt9Cw0L/RgNC+0YHRiywg0YHQstGP0LfQsNC90L3Ri9C1INGBINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQvCDQutCw0LTQsNGB0YLRgNC+0LLRi9C8INGD0YfRkdGC0L7QvCcsXG4gICAgJzU1ODEwMTAxMDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5LCDQstC90LXRgdGR0L3QvdGL0YUg0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGAINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCwg0LIg0LLQuNC00LUg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQstGL0L/QuNGB0LrQuCDQvtCxINC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtGB0YLQuCwg0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INC/0LDRgdC/0L7RgNGC0LAg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INC4INC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDQv9C70LDQvdCwINGC0LXRgNGA0LjRgtC+0YDQuNC4LCDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INGB0L/RgNCw0LLQutC4INC+INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0YHRgtC+0LjQvNC+0YHRgtC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODEwMTAyMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/QvtGB0YLQsNC90L7QstC60LUg0L3QsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LrQsNC00LDRgdGC0YDQvtCy0YvQuSDRg9GH0ZHRgiDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTgxMDEwMzAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDQutCw0LTQsNGB0YLRgNC+0LLQvtC8INGD0YfRkdGC0LUg0LjQt9C80LXQvdC10L3QuNC5INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODEwMTA0MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQsiDQldC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCDQvtCx0YrQtdC60YLQvtCyINC60LDQv9C40YLQsNC70YzQvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCAo0JXQk9Cg0J7QmtChKSDRgdCy0LXQtNC10L3QuNC5INC+0LEg0L7QsdGK0LXQutGC0LUg0LrQsNC/0LjRgtCw0LvRjNC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwICjQntCa0KEpJyxcbiAgICAnNTU4MTAxMDUwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGB0LLQtdC00LXQvdC40Lkg0L7QsSDQntCa0KEnLFxuICAgICc1NTgxMDEwNjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INGB0L3Rj9GC0LjQuCDRgSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0YPRh9GR0YLQsCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTgxMDEwNzAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGAINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDRgdCy0LXQtNC10L3QuNC5INC+INGA0LDQvdC10LUg0YPRh9GC0ZHQvdC90L7QvCDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTgxMDEwODAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INC+0YjQuNCx0LrQuCcsXG4gICAgJzU1ODEwMTA5MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4INCyINGB0LLQtdC00LXQvdC40Y/RhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODEwMTA5MDEwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4INCyINGB0LLQtdC00LXQvdC40Y/RhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQvtCxINC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODEwMTA5MDIwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4INCyINGB0LLQtdC00LXQvdC40Y/RhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQviDQv9GA0L7RhdC+0LbQtNC10L3QuNC4INGD0YfQsNGB0YLQutCwINCT0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQs9GA0LDQvdC40YbRiyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lg7INC+INCz0YDQsNC90LjRhtCw0YUg0LzQtdC20LTRgyDRgdGD0LHRitC10LrRgtCw0LzQuCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lg7INC+INCz0YDQsNC90LjRhtCw0YUg0LzRg9C90LjRhtC40L/QsNC70YzQvdGL0YUg0L7QsdGA0LDQt9C+0LLQsNC90LjQuTsg0L4g0LPRgNCw0L3QuNGG0LDRhSDQvdCw0YHQtdC70ZHQvdC90YvRhSDQv9GD0L3QutGC0L7Qsjsg0L4g0YLQtdGA0YDQuNGC0L7RgNC40LDQu9GM0L3Ri9GFINC30L7QvdCw0YUg0Lgg0LfQvtC90LDRhSDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40Lk7INC+INC60LDRgNGC0L7Qs9GA0LDRhNC40YfQtdGB0LrQvtC5INC4INCz0LXQvtC00LXQt9C40YfQtdGB0LrQvtC5INC+0YHQvdC+0LLQsNGFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MTAxMTAwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9GA0LXQtNGB0YLQsNCy0LvQtdC90LjQuCDQtNC+0L/QvtC70L3QuNGC0LXQu9GM0L3Ri9GFINC00L7QutGD0LzQtdC90YLQvtCyINC90LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGA0L7QstGL0Lkg0YPRh9GR0YInLFxuICAgICc1NTgxMDExMTAwMDAnOiAn0JLQvdGD0YLRgNC40LLQtdC00L7QvNGB0YLQstC10L3QvdGL0Lkg0LfQsNC/0YDQvtGBINC40L3RhNC+0YDQvNCw0YbQuNC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MTAxMTIwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INC60L7Qv9C40Lgg0LTQvtC60YPQvNC10L3RgtCwLCDQvdCwINC+0YHQvdC+0LLQsNC90LjQuCDQutC+0YLQvtGA0L7Qs9C+INGB0LLQtdC00LXQvdC40Y8g0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LLQvdC10YHQtdC90Ysg0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGAINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODEwMTEzMDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5LCDQstC90LXRgdGR0L3QvdGL0YUg0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGAINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCwg0L/QvtGB0YDQtdC00YHRgtCy0L7QvCDQvtCx0LXRgdC/0LXRh9C10L3QuNGPINC00L7RgdGC0YPQv9CwINC6INC40L3RhNC+0YDQvNCw0YbQuNC+0L3QvdC+0LzRgyDRgNC10YHRg9GA0YHRgywg0YHQvtC00LXRgNC20LDRidC10LzRgyDRgdCy0LXQtNC10L3QuNGPINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MTAxMTQwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INC/0LXRgNC10YfQvdGPINC+0LHRitC10LrRgtC+0LIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4LCDQv9C+0LTQu9C10LbQsNGJ0LjRhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQvtGG0LXQvdC60LUnLFxuICAgICc1NTgxMDExNTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0YDQtdC60YDQsNGJ0LXQvdC40Lgg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INGD0YfRkdGC0LAnLFxuICAgICc1NTgxMDExNjAwMDAnOiAn0JzQtdC20LLQtdC00L7QvNGB0YLQstC10L3QvdGL0Lkg0LfQsNC/0YDQvtGBINC00L7QutGD0LzQtdC90YLQvtCyINCyINC+0YDQs9Cw0L3QsNGFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQstC70LDRgdGC0Lgg0Lgg0L7RgNCz0LDQvdCw0YUg0LzQtdGB0YLQvdC+0LPQviDRgdCw0LzQvtGD0L/RgNCw0LLQu9C10L3QuNGPJyxcbiAgICAnNTU4MTAxMTcwMDAwJzogJ9CX0LDQv9GA0L7RgSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQviDRgNCw0L3QtdC1INGD0YfRgtGR0L3QvdC+0Lwg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCyINC+0YDQs9Cw0L3QsNGFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQstC70LDRgdGC0LgsINC+0YDQs9Cw0L3QsNGFINC80LXRgdGC0L3QvtCz0L4g0YHQsNC80L7Rg9C/0YDQsNCy0LvQtdC90LjRjyDQuNC70Lgg0L7RgNCz0LDQvdCw0YUg0Lgg0L7RgNCz0LDQvdC40LfQsNGG0LjRj9GFINC/0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC80YMg0YLQtdGF0L3QuNGH0LXRgdC60L7QvNGDINGD0YfRkdGC0YMg0LggKNC40LvQuCkg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQuNC90LLQtdC90YLQsNGA0LjQt9Cw0YbQuNC4JyxcbiAgICAnNTU4MTAyMDAwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjRjyDQuCDQt9Cw0L/RgNC+0YHRiywg0YHQstGP0LfQsNC90L3Ri9C1INGBINGA0LXQs9C40YHRgtGA0LDRhtC40LXQuSDQv9GA0LDQsicsXG4gICAgJzU1ODEwMjAxMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LLQsCDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviwg0YHQtNC10LvQutC4INGBINC90LjQvCwg0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjyksINC/0LXRgNC10YXQvtC00LAsINC/0YDQtdC60YDQsNGJ0LXQvdC40Y8g0L/RgNCw0LLQsCDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQvicsXG4gICAgJzU1ODEwMjAyMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNC10LrRgNCw0YnQtdC90LjRjyDQv9GA0LDQstCwICjQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKSDQv9GA0LDQstCwKScsXG4gICAgJzU1ODEwMjAzMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQuNC30LzQtdC90LXQvdC40Lkg0LIg0JXQk9Cg0J8nLFxuICAgICc1NTgxMDIwNDAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCcsXG4gICAgJzU1ODEwMjA1MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/RgNC10LTRgdGC0LDQstC70LXQvdC40Lgg0LTQvtC/0L7Qu9C90LjRgtC10LvRjNC90YvRhSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQtNC70Y8g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LInLFxuICAgICc1NTgxMDIwNjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0YDQuNC+0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8JyxcbiAgICAnNTU4MTAyMDcwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQstC+0LfQvtCx0L3QvtCy0LvQtdC90LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCcsXG4gICAgJzU1ODEwMjA4MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/RgNC10LrRgNCw0YnQtdC90LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCcsXG4gICAgJzU1ODEwMjA5MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/QvtCy0YLQvtGA0L3QvtC5INCy0YvQtNCw0YfQtSDRgdCy0LjQtNC10YLQtdC70YzRgdGC0LLQsCDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQstCwJyxcbiAgICAnNTU4MTAyMTAwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGB0LLQtdC00LXQvdC40LksINGB0L7QtNC10YDQttCw0YnQuNGF0YHRjyDQsiDQldC00LjQvdC+0Lwg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC8INGA0LXQtdGB0YLRgNC1INC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwnLFxuICAgICc1NTgxMDIxMTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0L7RgdGC0LDQvdC+0LLQutC1INC90LAg0YPRh9GR0YIg0LHQtdGB0YXQvtC30Y/QudC90YvRhSDQvdC10LTQstC40LbQuNC80YvRhSDQstC10YnQtdC5JyxcbiAgICAnNTU4MTAyMTIwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQstGL0LTQsNGH0LUg0LfQsNC60LvQsNC00L3QvtC5ICjQvdC+0LLQvtC5INC30LDQutC70LDQtNC90L7QuSwg0LTRg9Cx0LvQuNC60LDRgtCwINC30LDQutC70LDQtNC90L7QuSwg0LDQvdC90YPQu9C40YDQvtCy0LDQvdC90L7QuSDQt9Cw0LrQu9Cw0LTQvdC+0LkpJyxcbiAgICAnNTU4MTAyMTMwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQstGL0LTQsNGH0LUg0LrQvtC/0LjQuSDQtNC+0LPQvtCy0L7RgNC+0LIg0Lgg0LjQvdGL0YUg0LTQvtC60YPQvNC10L3RgtC+0LIsINCy0YvRgNCw0LbQsNGO0YnQuNGFINGB0L7QtNC10YDQttCw0L3QuNC1INC+0LTQvdC+0YHRgtC+0YDQvtC90L3QuNGFINGB0LTQtdC70L7Quiwg0YHQvtCy0LXRgNGI0LXQvdC90YvRhSDQsiDQv9GA0L7RgdGC0L7QuSDQv9C40YHRjNC80LXQvdC90L7QuSDRhNC+0YDQvNC1JyxcbiAgICAnNTU4MTAyMTQwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9GA0LjQvtGB0YLQsNC90L7QstC70LXQvdC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40LgsINCy0L7Qt9Cy0YDQsNGC0LUg0LTQvtC60YPQvNC10L3RgtC+0LIg0LHQtdC3INC/0YDQvtCy0LXQtNC10L3QuNGPINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4LCDQv9GA0LXQtNGB0YLQsNCy0LvQtdC90LjQuCDQtNC+0L/QvtC70L3QuNGC0LXQu9GM0L3Ri9GFINC00L7QutGD0LzQtdC90YLQvtCyLCDQviDQstC+0LfQvtCx0L3QvtCy0LvQtdC90LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCwg0YDQsNC90LXQtSDQv9GA0LjQvtGB0YLQsNC90L7QstC70LXQvdC90L7QuSDQv9C+INC30LDRj9Cy0LvQtdC90LjRjiDQv9GA0LDQstC+0L7QsdC70LDQtNCw0YLQtdC70Y8sINGB0YLQvtGA0L7QvdGLICjRgdGC0L7RgNC+0L0pINGB0LTQtdC70LrQuCwg0LvQuNGG0LAsINGH0YzRkSDQv9GA0LDQstC+INC+0LPRgNCw0L3QuNGH0LjQstCw0LXRgtGB0Y8gKNC+0LHRgNC10LzQtdC90Y/QtdGC0YHRjyksINC70LjRhtCwLCDQsiDQv9C+0LvRjNC30YMg0LrQvtGC0L7RgNC+0LPQviDQv9GA0LDQstC+INC+0LPRgNCw0L3QuNGH0LjQstCw0LXRgtGB0Y8gKNC+0LHRgNC10LzQtdC90Y/QtdGC0YHRjyksINC30LDQutC+0L3QvdC+0LPQviDQstC70LDQtNC10LvRjNGG0LAg0LfQsNC60LvQsNC00L3QvtC5ICjQuNGFINC/0YDQtdC00YHRgtCw0LLQuNGC0LXQu9GPKScsXG4gICAgJzU1ODEwMjE1MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/QvtCy0YLQvtGA0L3QvtC5INCy0YvQtNCw0YfQtSDQvdC+0LLQvtCz0L4g0YHQstC40LTQtdGC0LXQu9GM0YHRgtCy0LAg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LLQsCwg0LLRi9C00LDRh9C1INC30LDQutC70LDQtNC90L7QuSwg0LLQvdC10YHQtdC90LjQuCDQuNC30LzQtdC90LXQvdC40Lkg0LIg0LfQsNC/0LjRgdGMINCV0LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwsINC/0L7Qs9Cw0YjQtdC90LjQuCDRgNC10LPQuNGB0YLRgNCw0YbQuNC+0L3QvdC+0Lkg0LfQsNC/0LjRgdC4INC+0LEg0LjQv9C+0YLQtdC60LUnLFxuICAgICc1NTgxMDIxNjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0YDQuNC90Y/RgtC40Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAg0LLQvdC+0LLRjCDQstC+INCy0LvQsNC00LXQvdC40LUsINC/0L7Qu9GM0LfQvtCy0LDQvdC40LUg0Lgg0YDQsNGB0L/QvtGA0Y/QttC10L3QuNC1ICjQsiDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLRjCknLFxuICAgICc1NTgxMDIxNzAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LIg0JXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCDQvtGC0LzQtdGC0LrQuCDQviDQvdCw0LvQuNGH0LjQuCDRgdGD0LTQtdCx0L3QvtCz0L4g0YHQv9C+0YDQsCDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LfQsNGA0LXQs9C40YHRgtGA0LjRgNC+0LLQsNC90L3QvtCz0L4g0L/RgNCw0LLQsCcsXG4gICAgJzU1ODEwMjE4MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4INCyINC30LDQv9C40YHRj9GFINCV0LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwsINC+INC90LDQu9C40YfQuNC4INCy0L7Qt9GA0LDQttC10L3QuNGPINCyINC+0YLQvdC+0YjQtdC90LjQuCDQt9Cw0YDQtdCz0LjRgdGC0YDQuNGA0L7QstCw0L3QvdC+0LPQviDQv9GA0LDQstCwINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCwg0L4g0L/QvtCz0LDRiNC10L3QuNC4INC30LDQv9C40YHQuCDQsiDQldC00LjQvdC+0Lwg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC8INGA0LXQtdGB0YLRgNC1INC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40Lwg0L4g0L3QsNC70LjRh9C40Lgg0LLQvtC30YDQsNC20LXQvdC40Y8g0LIg0L7RgtC90L7RiNC10L3QuNC4INC30LDRgNC10LPQuNGB0YLRgNC40YDQvtCy0LDQvdC90L7Qs9C+INC/0YDQsNCy0LAg0L3QsCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4LCDQviDQvdC10LLQvtC30LzQvtC20L3QvtGB0YLQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9C10YDQtdGF0L7QtNCwLCDQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKSwg0L/RgNC10LrRgNCw0YnQtdC90LjRjyDQv9GA0LDQstCwINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQsdC10Lcg0LvQuNGH0L3QvtCz0L4g0YPRh9Cw0YHRgtC40Y8g0YHQvtCx0YHRgtCy0LXQvdC90LjQutCwICjQtdCz0L4g0LfQsNC60L7QvdC90L7Qs9C+INC/0YDQtdC00YHRgtCw0LLQuNGC0LXQu9GPKSwg0L7QsSDQvtGC0LfRi9Cy0LUg0YDQsNC90LXQtSDQv9GA0LXQtNGB0YLQsNCy0LvQtdC90L3QvtCz0L4g0LfQsNGP0LLQu9C10L3QuNGPINC+INC90LXQstC+0LfQvNC+0LbQvdC+0YHRgtC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0LXRgNC10YXQvtC00LAsINC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pLCDQv9GA0LXQutGA0LDRidC10L3QuNGPINC/0YDQsNCy0LAg0L3QsCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCx0LXQtyDQu9C40YfQvdC+0LPQviDRg9GH0LDRgdGC0LjRjyDRgdC+0LHRgdGC0LLQtdC90L3QuNC60LAgKNC10LPQviDQt9Cw0LrQvtC90L3QvtCz0L4g0L/RgNC10LTRgdGC0LDQstC40YLQtdC70Y8pJyxcbiAgICAnNTU4MTAyMTkwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDRgdC60YDQtdC/0LvQtdC90LjQuCDQtNC+0LHQsNCy0L7Rh9C90L7Qs9C+INC70LjRgdGC0LAgKNC00L7QsdCw0LLQvtGH0L3Ri9GFINC70LjRgdGC0L7Qsikg0YEg0LfQsNC60LvQsNC00L3QvtC5JyxcbiAgICAnNTU4MTAyMjAwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGB0LLQtdC00LXQvdC40LksINGB0L7QtNC10YDQttCw0YnQuNGF0YHRjyDQsiDQldC00LjQvdC+0Lwg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC8INGA0LXQtdGB0YLRgNC1INC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwsINC/0L7RgdGA0LXQtNGB0YLQstC+0Lwg0L7QsdC10YHQv9C10YfQtdC90LjRjyDQtNC+0YHRgtGD0L/QsCDQuiDQuNC90YTQvtGA0LzQsNGG0LjQvtC90L3QvtC80YMg0YDQtdGB0YPRgNGB0YMsINGB0L7QtNC10YDQttCw0YnQtdC80YMg0YHQstC10LTQtdC90LjRjyDQldC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8JyxcbiAgICAnNTU4MTAyMjEwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQt9Cw0LrQvtC90L3QvtCz0L4g0LLQu9Cw0LTQtdC70YzRhtCwINC30LDQutC70LDQtNC90L7QuScsXG4gICAgJzU1ODEwMjIyMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQuNC30LzQtdC90LXQvdC40Lkg0LIg0LfQsNC/0LjRgdGMINCV0LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwsINC/0L7Qs9Cw0YjQtdC90LjQuCDRgNC10LPQuNGB0YLRgNCw0YbQuNC+0L3QvdC+0Lkg0LfQsNC/0LjRgdC4INC+0LEg0LjQv9C+0YLQtdC60LUnLFxuICAgICc1NTgxMDMwMDAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNGPINC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDRg9GH0ZHRgtC1INC30LTQsNC90LjQuSwg0YHQvtC+0YDRg9C20LXQvdC40LksINC/0L7QvNC10YnQtdC90LjQuSwg0L7QsdGK0LXQutGC0L7QsiDQvdC10LfQsNCy0LXRgNGI0ZHQvdC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwICjQvtCx0YrQtdC60YLQvtCyINGD0YfRkdGC0LApINC4INC30LDQv9GA0L7RgdGLINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0YHQstC10LTQtdC90LjQuSwg0LLQvdC10YHRkdC90L3Ri9GFINCyINCV0LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAJyxcbiAgICAnNTU4MTAzMDEwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9C+0YHRgtCw0L3QvtCy0LrQtSDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRg9GH0ZHRgiDQvtCx0YrQtdC60YLQsCDRg9GH0ZHRgtCwJyxcbiAgICAnNTU4MTAzMDIwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INCyINCV0JPQoNCe0JrQoSDRgdCy0LXQtNC10L3QuNC5INC+INGA0LDQvdC10LUg0YPRh9GC0ZHQvdC90L7QvCDQvtCx0YrQtdC60YLQtSDQutCw0L/QuNGC0LDQu9GM0L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAnLFxuICAgICc1NTgxMDMwMzAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDRg9GH0ZHRgtC1INC40LfQvNC10L3QtdC90LjQuSDQvtCx0YrQtdC60YLQsCDRg9GH0ZHRgtCwJyxcbiAgICAnNTU4MTAzMDQwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDRgdC90Y/RgtC40Lgg0YEg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YPRh9GR0YLQsCDQvtCx0YrQtdC60YLQsCDRg9GH0ZHRgtCwJyxcbiAgICAnNTU4MTAzMDUwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQvtCxINC40YHQv9GA0LDQstC70LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60LgnLFxuICAgICc1NTgxMDMwNjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC60LvRjtGH0LXQvdC40Lgg0YHQstC10LTQtdC90LjQuSDQuNC3INCV0JPQoNCe0JrQoSwg0L3QvtGB0Y/RidC40YUg0LLRgNC10LzQtdC90L3Ri9C5INGF0LDRgNCw0LrRgtC10YAnLFxuICAgICc1NTgxMDMwNzAwMDAnOiAn0JfQsNC/0YDQvtGBINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0LrQvtC/0LjQuCDQtNC+0LrRg9C80LXQvdGC0LAsINC90LAg0L7RgdC90L7QstCw0L3QuNC4INC60L7RgtC+0YDQvtCz0L4g0YHQstC10LTQtdC90LjRjyDQvtCxINC+0LHRitC10LrRgtC1INCy0L3QtdGB0LXQvdGLINCyINCV0LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAJyxcbiAgICAnNTU4MTAzMDgwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGB0LLQtdC00LXQvdC40LksINCy0L3QtdGB0LXQvdC90YvRhSDQsiDQldC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCcsXG4gICAgJzU1ODEwMzA5MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/RgNC10LTRgdGC0LDQstC70LXQvdC40Lgg0LTQvtC/0L7Qu9C90LjRgtC10LvRjNC90YvRhSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRg9GH0ZHRgicsXG4gICAgJzU1ODEwNDAwMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLQvtC30LLRgNCw0YLQtSDQv9C70LDRgtC10LbQsCcsXG4gICAgJzU1ODE5OTAwMDAwMCc6ICfQmNC90L7QtSDQt9Cw0Y/QstC70LXQvdC40LUnLFxuICAgICc1NTgyMDAwMDAwMDAnOiAn0JTQntCa0KPQnNCV0J3QotCrLCDQodCe0JTQldCg0JbQkNCp0JjQlSDQntCf0JjQodCQ0J3QmNCVINCe0JHQqtCV0JrQotCQJyxcbiAgICAnNTU4MjAxMDAwMDAwJzogJ9Ce0L/QuNGB0LDQvdC40LUg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuICAgICc1NTgyMDIwMDAwMDAnOiAn0JfQtdC80LvQtdGD0YHRgtGA0L7QuNGC0LXQu9GM0L3QvtC1INC00LXQu9C+JyxcbiAgICAnNTU4MjAzMDAwMDAwJzogJ9Cc0LXQttC10LLQvtC5INC/0LvQsNC9JyxcbiAgICAnNTU4MjA0MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIgKNC60L7Qv9C40Y8pLCDQvdCwINC+0YHQvdC+0LLQsNC90LjQuCDQutC+0YLQvtGA0L7Qs9C+INGB0LLQtdC00LXQvdC40Y8g0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LLQvdC10YHQtdC90Ysg0LIg0JPQmtCdJyxcbiAgICAnNTU4MjA1MDAwMDAwJzogJ9Ci0LXRhdC90LjRh9C10YHQutC40Lkg0L/QsNGB0L/QvtGA0YIg0L7QsdGK0LXQutGC0LAg0YPRh9GR0YLQsCcsXG4gICAgJzU1ODIwNTAxMDAwMCc6ICfQotC10YXQvdC40YfQtdGB0LrQuNC5INC/0LDRgdC/0L7RgNGCINC00L7QvNC+0LLQu9Cw0LTQtdC90LjRjycsXG4gICAgJzU1ODIwNTAyMDAwMCc6ICfQotC10YXQvdC40YfQtdGB0LrQuNC5INC/0LDRgdC/0L7RgNGCINC30LTQsNC90LjRjyAo0YHRgtGA0L7QtdC90LjRjyknLFxuICAgICc1NTgyMDUwMzAwMDAnOiAn0KLQtdGF0L3QuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgiDQttC40LvQvtCz0L4g0L/QvtC80LXRidC10L3QuNGPICjQutCy0LDRgNGC0LjRgNGLKScsXG4gICAgJzU1ODIwNTA0MDAwMCc6ICfQotC10YXQvdC40YfQtdGB0LrQuNC5INC/0LDRgdC/0L7RgNGCINC+0LHRitC10LrRgtCwINC40L3QtNC40LLQuNC00YPQsNC70YzQvdC+0LPQviDQttC40LvQuNGJ0L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAnLFxuICAgICc1NTgyMDUwNTAwMDAnOiAn0KLQtdGF0L3QuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgiDRgdC+0L7RgNGD0LbQtdC90LjRjycsXG4gICAgJzU1ODIwNTA2MDAwMCc6ICfQotC10YXQvdC40YfQtdGB0LrQuNC5INC/0LDRgdC/0L7RgNGCINC+0LHRitC10LrRgtCwINC90LXQt9Cw0LLQtdGA0YjRkdC90L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAnLFxuICAgICc1NTgyMDYwMDAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDRgtC10YXQvdC40YfQtdGB0LrQvtCz0L4g0L/QsNGB0L/QvtGA0YLQsCcsXG4gICAgJzU1ODIwNjAxMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INGC0LXRhdC90LjRh9C10YHQutC+0LPQviDQv9Cw0YHQv9C+0YDRgtCwINC90LAg0LfQtNCw0L3QuNC1ICjRgdGC0YDQvtC10L3QuNC1KScsXG4gICAgJzU1ODIwNjAyMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INGC0LXRhdC90LjRh9C10YHQutC+0LPQviDQv9Cw0YHQv9C+0YDRgtCwINCR0KLQmCcsXG4gICAgJzU1ODIwNzAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCICjQutC+0L/QuNGPKSwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDRgNCw0LfRgNC10YjQtdC90LjQtSDQt9C10LzQtdC70YzQvdC+0LPQviDRgdC/0L7RgNCwINC+INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQuCDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNGPINCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG4gICAgJzU1ODIwODAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCICjQutC+0L/QuNGPKSwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQv9GA0LjQvdCw0LTQu9C10LbQvdC+0YHRgtGMINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwINC6INC+0L/RgNC10LTQtdC70LXQvdC90L7QuSDQutCw0YLQtdCz0L7RgNC40Lgg0LfQtdC80LXQu9GMJyxcbiAgICAnNTU4MjA5MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIgKNC60L7Qv9C40Y8pLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INGD0YHRgtCw0L3QvtCy0LvQtdC90L3QvtC1INGA0LDQt9GA0LXRiNC10L3QvdC+0LUg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40LUg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuICAgICc1NTgyMTAwMDAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQv9C70LDQvSDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCAo0LLRi9C/0LjRgdC60LAg0LjQtyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQt9C10LzQtdC70YzQvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwKScsXG4gICAgJzU1ODIxMTAwMDAwMCc6ICfQn9C70LDQvdGLINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MjExMDEwMDAwJzogJ9Ci0LXRhdC90LjRh9C10YHQutC40Lkg0L/Qu9Cw0L0g0LfQtNCw0L3QuNGPLCDRgdC+0L7RgNGD0LbQtdC90LjRjywg0L/QvtC80LXRidC10L3QuNGPINC70LjQsdC+INC+0LHRitC10LrRgtCwINC90LXQt9Cw0LLQtdGA0YjRkdC90L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAnLFxuICAgICc1NTgyMTEwMjAwMDAnOiAn0J/Qu9Cw0L0g0YPRh9Cw0YHRgtC60LAg0LvQtdGB0L3QvtCz0L4g0YTQvtC90LTQsCcsXG4gICAgJzU1ODIxMTAzMDAwMCc6ICfQn9C70LDQvSDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTgyMTEwNDAwMDAnOiAn0K3QutGB0L/Qu9C40LrQsNGG0LjRjyDQuiDQv9C+0Y3RgtCw0LbQvdC+0LzRgyDQv9C70LDQvdGDJyxcbiAgICAnNTU4MjEyMDAwMDAwJzogJ9CU0LXQutC70LDRgNCw0YbQuNGPINC+0LEg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MjEzMDAwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L/QsNGB0L/QvtGA0YIg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MjEzMDEwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L/QsNGB0L/QvtGA0YIg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuICAgICc1NTgyMTMwMjAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQv9Cw0YHQv9C+0YDRgiDQv9C+0LzQtdGJ0LXQvdC40Y8gKNCy0YvQv9C40YHQutCwINC40Lcg0JPQmtCdKScsXG4gICAgJzU1ODIxMzAzMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC/0LDRgdC/0L7RgNGCINC30LTQsNC90LjRjywg0YHQvtC+0YDRg9C20LXQvdC40Y8sINC+0LHRitC10LrRgtCwINC90LXQt9Cw0LLQtdGA0YjRkdC90L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAnLFxuICAgICc1NTgyMTQwMDAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0LDRjyDQstGL0L/QuNGB0LrQsCDQvtCxINC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODIxNDAxMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLQsNGPINCy0YvQv9C40YHQutCwINC+INC30LXQvNC10LvRjNC90L7QvCDRg9GH0LDRgdGC0LrQtScsXG4gICAgJzU1ODIxNDAyMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLQsNGPINCy0YvQv9C40YHQutCwINC+INC30LTQsNC90LjQuCwg0YHQvtC+0YDRg9C20LXQvdC40LgsINC+0LHRitC10LrRgtC1INC90LXQt9Cw0LLQtdGA0YjRkdC90L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAnLFxuICAgICc1NTgyMTYwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQuNC30LzQtdC90LXQvdC40LUg0L3QsNC30L3QsNGH0LXQvdC40Y8g0LfQtNCw0L3QuNGPLCDQv9C+0LzQtdGJ0LXQvdC40Y8g0LjQu9C4INGB0L7QvtGA0YPQttC10L3QuNGPLCDQvdCw0LjQvNC10L3QvtCy0LDQvdC40Y8g0YHQvtC+0YDRg9C20LXQvdC40Y8nLFxuICAgICc1NTgyMTcwMDAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQv9C70LDQvSDRgtC10YDRgNC40YLQvtGA0LjQuCcsXG4gICAgJzU1ODIxODAwMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLQsNGPINGB0L/RgNCw0LLQutCwINC+INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0YHRgtC+0LjQvNC+0YHRgtC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODIxOTAwMDAwMCc6ICfQkNC60YIg0L7QsdGB0LvQtdC00L7QstCw0L3QuNGPLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC/0YDQtdC60YDQsNGJ0LXQvdC40LUg0YHRg9GJ0LXRgdGC0LLQvtCy0LDQvdC40Y8g0L7QsdGK0LXQutGC0LAg0YPRh9GR0YLQsCcsXG4gICAgJzU1ODIyMDAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0YssINCyINCy0LjQtNC1INC60L7RgtC+0YDRi9GFINC/0YDQtdC00L7RgdGC0LDQstC70Y/RjtGC0YHRjyDRgdCy0LXQtNC10L3QuNGPINCV0LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwJyxcbiAgICAnNTU4MjIwMDEwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0KDQtdC10YHRgtGA0LAsINGB0L7QtNC10YDQttCw0YnQsNGPINC+0YLQvdC+0YHRj9GJ0LjQtdGB0Y8g0Log0LjQvdGE0L7RgNC80LDRhtC40Lgg0L7Qs9GA0LDQvdC40YfQtdC90L3QvtCz0L4g0LTQvtGB0YLRg9C/0LAg0YHQstC10LTQtdC90LjRjyDQvtCxINC+0LHRitC10LrRgtC1INGD0YfQtdGC0LAnLFxuICAgICc1NTgyMjAwMjAwMDAnOiAn0KHQv9GA0LDQstC60LAsINGB0L7QtNC10YDQttCw0YnQsNGPLCDQstC90LXRgdGR0L3QvdGL0LUg0LIg0JXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAg0YHQstC10LTQtdC90LjRjyDQviDQv9GA0LXQutGA0LDRidC10L3QuNC4INGB0YPRidC10YHRgtCy0L7QstCw0L3QuNGPINC+0LHRitC10LrRgtCwINGD0YfRkdGC0LAnLFxuICAgICc1NTgyMjAwMzAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQoNC10LXRgdGC0YDQsCwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LDRjyDRhNCw0LrRgiDQvtGC0YHRg9GC0YHRgtCy0LjRjyDQsiDQoNC10LXRgdGC0YDQtSDRgdCy0LXQtNC10L3QuNC5INC+0LEg0L7QsdGK0LXQutGC0LUg0YPRh9C10YLQsCcsXG4gICAgJzU1ODIyMTAwMDAwMCc6ICfQn9Cg0J7Qp9CY0JUnLFxuICAgICc1NTgyMjEwMTAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0L3QtdC+0LHRhdC+0LTQuNC80L7RgdGC0Lgg0YPRgdGC0YDQsNC90LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQvtGI0LjQsdC60LgnLFxuICAgICc1NTgyMjEwMjAwMDAnOiAn0JzQtdC20LTRg9C90LDRgNC+0LTQvdGL0Lkg0LTQvtCz0L7QstC+0YAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4LCDQsiDRgdC+0L7RgtCy0LXRgtGB0YLQstC40Lgg0YEg0LrQvtGC0L7RgNGL0Lwg0YPRgdGC0LDQvdC+0LLQu9C10L3QviDQuNC70Lgg0LjQt9C80LXQvdC10L3QviDQv9GA0L7RhdC+0LbQtNC10L3QuNC1INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQs9GA0LDQvdC40YbRiyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuICAgICc1NTgyMjEwMzAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0YHQvtC00LXRgNC20LDRidC40Lkg0L3QtdC+0LHRhdC+0LTQuNC80YvQtSDQtNC70Y8g0LLQvdC10YHQtdC90LjRjyDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LrQsNC00LDRgdGC0YAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INGB0LLQtdC00LXQvdC40Y8g0L4g0LPRgNCw0L3QuNGG0LDRhSDQvNC10LbQtNGDINGB0YPQsdGK0LXQutGC0LDQvNC4INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCwg0LPRgNCw0L3QuNGG0LDRhSDQvNGD0L3QuNGG0LjQv9Cw0LvRjNC90L7Qs9C+INC+0LHRgNCw0LfQvtCy0LDQvdC40Y8sINCz0YDQsNC90LjRhtCw0YUg0L3QsNGB0LXQu9GR0L3QvdC+0LPQviDQv9GD0L3QutGC0LAnLFxuICAgICc1NTgyMjEwNDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0YHQvtC00LXRgNC20LDRidC40Lkg0L3QtdC+0LHRhdC+0LTQuNC80YvQtSDQtNC70Y8g0LLQvdC10YHQtdC90LjRjyDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LrQsNC00LDRgdGC0YAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INGB0LLQtdC00LXQvdC40Y8g0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0LjQu9C4INC40LfQvNC10L3QtdC90LjQuCDRgtC10YDRgNC40YLQvtGA0LjQsNC70YzQvdC+0Lkg0LfQvtC90Ysg0LjQu9C4INC30L7QvdGLINGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuSwg0LvQuNCx0L4g0L7QsSDQvtGC0LzQtdC90LUg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNGPINGC0LDQutC+0Lkg0LfQvtC90YsnLFxuICAgICc1NTgyMjEwNTAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0L/RgNC40YHQstC+0LXQvdC40LgsINC40LfQvNC10L3QtdC90LjQuCDQsNC00YDQtdGB0LAnLFxuICAgICc1NTgyMjEwNjAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLINC+0YDQs9Cw0L3QvtCyLCDQvtGB0YPRidC10YHRgtCy0LvRj9GO0YnQuNGFINCy0LXQtNC10L3QuNC1INC70LXRgdC90L7Qs9C+INC4INCy0L7QtNC90L7Qs9C+INC60LDQtNCw0YHRgtGA0LAsINGB0L7QtNC10YDQttCw0YnQuNC1INGB0LLQtdC00LXQvdC40Y8g0L4g0L/RgNC40YDQvtC00L3Ri9GFINC+0LHRitC10LrRgtCw0YUnLFxuICAgICc1NTgyMjEwNzAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0YHQvtC00LXRgNC20LDRidC40Lkg0YHQstC10LTQtdC90LjRjyDQvtCxINCw0LTRgNC10YHQtSDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTgyMjEwODAwMDAnOiAn0JDQutGCINC+0LEg0YPRgtCy0LXRgNC20LTQtdC90LjQuCDRgNC10LfRg9C70YzRgtCw0YLQvtCyINC+0L/RgNC10LTQtdC70LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDRgdGC0L7QuNC80L7RgdGC0LgnLFxuICAgICc1NTgyMjE5OTAwMDAnOiAn0JjQvdC+0Lkg0LTQvtC60YPQvNC10L3Rgiwg0YHQvtC00LXRgNC20LDRidC40Lkg0L7Qv9C40YHQsNC90LjQtSDQvtCx0YrQtdC60YLQsCcsXG4gICAgJzU1ODIyMjAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjywg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINC80LXQttC00YPQvdCw0YDQvtC00L3QvtC8INC00L7Qs9C+0LLQvtGA0LUg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4LCDQsiDRgdC+0L7RgtCy0LXRgtGB0YLQstC40Lgg0YEg0LrQvtGC0L7RgNGL0Lwg0YPRgdGC0LDQvdC+0LLQu9C10L3QviDQuNC70Lgg0LjQt9C80LXQvdC10L3QviDQv9GA0L7RhdC+0LbQtNC10L3QuNC1INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQs9GA0LDQvdC40YbRiyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgsINCwINGC0LDQutC20LUg0YHQstC10LTQtdC90LjRjyDQviDRhNC10LTQtdGA0LDQu9GM0L3QvtC8INC30LDQutC+0L3QtSwg0LrQvtGC0L7RgNGL0Lwg0YDQsNGC0LjRhNC40YbQuNGA0L7QstCw0L0g0LzQtdC20LTRg9C90LDRgNC+0LTQvdGL0Lkg0LTQvtCz0L7QstC+0YAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4LCDQuCDQvtCxINC+0YTQuNGG0LjQsNC70YzQvdC+0Lwg0L7Qv9GD0LHQu9C40LrQvtCy0LDQvdC40Lgg0YLQsNC60L7Qs9C+INGE0LXQtNC10YDQsNC70YzQvdC+0LPQviDQt9Cw0LrQvtC90LAnLFxuICAgICc1NTgyMjMwMDAwMDAnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDQuNC30LzQtdC90LXQvdC40Lgg0LPRgNCw0L3QuNGGINC80LXQttC00YMg0YHRg9Cx0YrQtdC60YLQsNC80Lgg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4JyxcbiAgICAnNTU4MjI0MDAwMDAwJzogJ9CX0LDQutC+0L0g0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0LjQu9C4INC40LfQvNC10L3QtdC90LjQuCDQs9GA0LDQvdC40YYg0LzRg9C90LjRhtC40L/QsNC70YzQvdGL0YUg0L7QsdGA0LDQt9C+0LLQsNC90LjQuSDQu9C40LHQviDQviDQv9GA0LXQvtCx0YDQsNC30L7QstCw0L3QuNC4INC80YPQvdC40YbQuNC/0LDQu9GM0L3Ri9GFINC+0LHRgNCw0LfQvtCy0LDQvdC40LknLFxuICAgICc1NTgyMjUwMDAwMDAnOiAn0JDQutGCINGD0L/QvtC70L3QvtC80L7Rh9C10L3QvdC+0LPQviDQvtGA0LPQsNC90LAg0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0LjQu9C4INC40LfQvNC10L3QtdC90LjQuCDQs9GA0LDQvdC40YYg0L3QsNGB0LXQu9GR0L3QvdGL0YUg0L/Rg9C90LrRgtC+0LInLFxuICAgICc1NTgyMjYwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INC90LXQvtCx0YXQvtC00LjQvNGL0LUg0LTQu9GPINCy0L3QtdGB0LXQvdC40Y8g0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGAINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDRgdCy0LXQtNC10L3QuNGPINC+INCz0YDQsNC90LjRhtCw0YUg0LzQtdC20LTRgyDRgdGD0LHRitC10LrRgtCw0LzQuCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgsINCz0YDQsNC90LjRhtCw0YUg0LzRg9C90LjRhtC40L/QsNC70YzQvdC+0LPQviDQvtCx0YDQsNC30L7QstCw0L3QuNGPLCDQs9GA0LDQvdC40YbQsNGFINC90LDRgdC10LvRkdC90L3QvtCz0L4g0L/Rg9C90LrRgtCwLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0YPRgtCy0LXRgNC20LTRkdC90L3Ri9GFINC+0YDQs9Cw0L3QsNC80Lgg0LLQu9Cw0YHRgtC4INC00L7QutGD0LzQtdC90YLQsNGFJyxcbiAgICAnNTU4MjI3MDAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INC40LvQuCDQuNC30LzQtdC90LXQvdC40Lgg0LPRgNCw0L3QuNGGINC30L7QvSDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LknLFxuICAgICc1NTgyMjgwMDAwMDAnOiAn0J/RgNCw0LLQvtCy0L7QuSDQsNC60YIsINC60L7RgtC+0YDRi9C8INGD0YLQstC10YDQttC00LXQvdGLINC40LvQuCDQuNC30LzQtdC90LXQvdGLINC/0YDQsNCy0LjQu9CwINC30LXQvNC70LXQv9C+0LvRjNC30L7QstCw0L3QuNGPINC4INC30LDRgdGC0YDQvtC50LrQuCcsXG4gICAgJzU1ODIyOTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC40LfQvNC10L3QtdC90LjQtSDQvdCw0LfQvdCw0YfQtdC90LjRjyDQv9C+0LzQtdGJ0LXQvdC40Y8nLFxuICAgICc1NTgyMzAwMDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0L/QtdGA0LXQstC+0LTQtSDQttC40LvQvtCz0L4g0L/QvtC80LXRidC10L3QuNGPINCyINC90LXQttC40LvQvtC1INC/0L7QvNC10YnQtdC90LjQtSwg0L3QtdC20LjQu9C+0LPQviDQv9C+0LzQtdGJ0LXQvdC40Y8g0LIg0LbQuNC70L7QtSDQv9C+0LzQtdGJ0LXQvdC40LUnLFxuICAgICc1NTgyMzEwMDAwMDAnOiAn0JDQutGCINC/0YDQuNC10LzQvtGH0L3QvtC5INC60L7QvNC40YHRgdC40LgsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0LfQsNCy0LXRgNGI0LXQvdC40LUg0L/QtdGA0LXRg9GB0YLRgNC+0LnRgdGC0LLQsCDQuCAo0LjQu9C4KSDQv9C10YDQtdC/0LvQsNC90LjRgNC+0LLQutC4INC4ICjQuNC70LgpINC40L3Ri9GFINGA0LDQsdC+0YInLFxuICAgICc1NTgyMzIwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40LUg0YHQstC10LTQtdC90LjRjyDQvtCxINC40LfQvNC10L3QtdC90LjQuCDQvdCw0LfQvdCw0YfQtdC90LjRjyDQv9C+0LzQtdGJ0LXQvdC40Y8nLFxuICAgICc1NTgyMzMwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDRgNC10YjQtdC90LjQuCDQviDQv9C10YDQtdCy0L7QtNC1INC20LjQu9C+0LPQviDQv9C+0LzQtdGJ0LXQvdC40Y8g0LIg0L3QtdC20LjQu9C+0LUg0L/QvtC80LXRidC10L3QuNC1LCDQvdC10LbQuNC70L7Qs9C+INC/0L7QvNC10YnQtdC90LjRjyDQsiDQttC40LvQvtC1INC/0L7QvNC10YnQtdC90LjQtScsXG4gICAgJzU1ODIzNDAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjywg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINCw0LrRgtC1INC/0YDQuNC10LzQvtGH0L3QvtC5INC60L7QvNC40YHRgdC40LgsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC10Lwg0LfQsNCy0LXRgNGI0LXQvdC40LUg0L/QtdGA0LXRg9GB0YLRgNC+0LnRgdGC0LLQsCDQuCAo0LjQu9C4KSDQv9C10YDQtdC/0LvQsNC90LjRgNC+0LLQutC4INC4ICjQuNC70LgpINC40L3Ri9GFINGA0LDQsdC+0YInLFxuICAgICc1NTgyMzUwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQuNC30LzQtdC90LXQvdC40LUg0L3QsNC30L3QsNGH0LXQvdC40Y8g0LfQtNCw0L3QuNGPJyxcbiAgICAnNTU4MjM2MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0LjQt9C80LXQvdC10L3QuNC1INC90LDQt9C90LDRh9C10L3QuNGPINGB0L7QvtGA0YPQttC10L3QuNGPJyxcbiAgICAnNTU4MjM3MDAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0YDQsNC30YDQtdGI0LXQvdC40Y8g0L3QsCDRg9GB0LvQvtCy0L3QviDRgNCw0LfRgNC10YjQtdC90L3Ri9C5INCy0LjQtCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjycsXG4gICAgJzU1ODIzODAwMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0L/RgNC10LTQtdC70LXQvdC40LggKNC40LfQvNC10L3QtdC90LjQuCkg0LLQuNC00LAg0YDQsNC30YDQtdGI0LXQvdC90L7Qs9C+INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPJyxcbiAgICAnNTU4MjM5MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIgKNC60L7Qv9C40Y8pLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjyDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGA0LDQt9GA0LXRiNC10L3QuNGPINC90LAg0YPRgdC70L7QstC90L4g0YDQsNC30YDQtdGI0LXQvdC90YvQuSDQstC40LQg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8sINC+0LEg0L7Qv9GA0LXQtNC10LvQtdC90LjQuCAo0LjQt9C80LXQvdC10L3QuNC4KSDQstC40LTQsCDRgNCw0LfRgNC10YjQtdC90L3QvtCz0L4g0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8nLFxuICAgICc1NTgyNDAwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDRgNC10YjQtdC90LjQuCDQviDQv9GA0LjRgdCy0L7QtdC90LjQuCwg0LjQt9C80LXQvdC10L3QuNC4INCw0LTRgNC10YHQsCcsXG4gICAgJzU1ODI0MTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINGA0LDQt9GA0LXRiNC10L3QuNC4INC90LAg0LLQstC+0LQg0L7QsdGK0LXQutGC0LAg0LrQsNC/0LjRgtCw0LvRjNC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwINCyINGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjRjiDRgdCy0LXQtNC10L3QuNGPJyxcbiAgICAnNTU4MjQyMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0YDQtdC10YHRgtGA0LUg0L7QsdGK0LXQutGC0L7QsiDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8gKNC/0LDQvNGP0YLQvdC40LrQvtCyINC40YHRgtC+0YDQuNC4INC4INC60YPQu9GM0YLRg9GA0YspINC90LDRgNC+0LTQvtCyINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG4gICAgJzU1ODI0MzAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjywg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINCw0LrRgtC1INCf0YDQsNCy0LjRgtC10LvRjNGB0YLQstCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQvtCxINC40YHQutC70Y7Rh9C10L3QuNC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQuNC3INC10LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC+0LHRitC10LrRgtC+0LIg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPICjQv9Cw0LzRj9GC0L3QuNC60L7QsiDQuNGB0YLQvtGA0LjQuCDQuCDQutGD0LvRjNGC0YPRgNGLKSDQvdCw0YDQvtC00L7QsiDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuICAgICc1NTgyNDQwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0YHQvtC00LXRgNC20LDRidC40Lkg0YHQstC10LTQtdC90LjRjyDQviDQtNCw0YLQtSDQv9C+0YHRgtGD0L/Qu9C10L3QuNGPINC00L7QutGD0LzQtdC90YLQvtCyLCDQv9GA0LXQtNGD0YHQvNC+0YLRgNC10L3QvdGL0YUg0YHRgtCw0YLRjNC10LkgMTcg0KTQtdC00LXRgNCw0LvRjNC90L7Qs9C+INC30LDQutC+0L3QsCBcItCe0LEg0L7QsdGK0LXQutGC0LDRhSDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8gKNC/0LDQvNGP0YLQvdC40LrQsNGFINC40YHRgtC+0YDQuNC4INC4INC60YPQu9GM0YLRg9GA0YspINC90LDRgNC+0LTQvtCyINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuFwiLCDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MjQ1MDAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1ICjQutC+0L/QuNGPINGA0LXRiNC10L3QuNGPKSDRgdC+0L7RgtCy0LXRgtGB0YLQstGD0Y7RidC10LPQviDQvtGA0LPQsNC90LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCy0LvQsNGB0YLQuCDQvtCxINC+0YLQutCw0LfQtSDQstC60LvRjtGH0LjRgtGMINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LIg0LXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAg0L7QsdGK0LXQutGC0L7QsiDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8gKNC/0LDQvNGP0YLQvdC40LrQvtCyINC40YHRgtC+0YDQuNC4INC4INC60YPQu9GM0YLRg9GA0YspINC90LDRgNC+0LTQvtCyINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG4gICAgJzU1ODI0NjAwMDAwMCc6ICfQkNC60YIg0J/RgNCw0LLQuNGC0LXQu9GM0YHRgtCy0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC+0LEg0LjRgdC60LvRjtGH0LXQvdC40Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INC40Lcg0LXQtNC40L3QvtCz0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YDQtdC10YHRgtGA0LAg0L7QsdGK0LXQutGC0L7QsiDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8nLFxuICAgICc1NTgyNDcwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8g0L4g0L3QsNC40LzQtdC90L7QstCw0L3QuNC4INCy0L7QtNC90L7Qs9C+INC+0LHRitC10LrRgtCwINC4INGD0YHRgtCw0L3QvtCy0LvQtdC90L3Ri9GFINC/0LDRgNCw0LzQtdGC0YDQsNGFINCy0L7QtNC+0L7RhdGA0LDQvdC90YvRhSDQt9C+0L0g0Lgg0L/RgNC40LHRgNC10LbQvdGL0YUg0LfQsNGJ0LjRgtC90YvRhSDQv9C+0LvQvtGBLCDQt9C+0L0g0LfQsNGC0L7Qv9C70LXQvdC40Y8sINC/0L7QtNGC0L7Qv9C70LXQvdC40Y8g0Lgg0LTRgNGD0LPQuNGFINC30L7QvSDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRhSDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjycsXG4gICAgJzU1ODI0ODAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDQu9C10YHQvdC+0Lwg0YDQtdC10YHRgtGA0LUg0YHQstC10LTQtdC90LjRjyDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LvQtdGB0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuICAgICc1NTgyNDkwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQstC+INCy0YHRgtGD0L/QuNCy0YjQtdC8INCyINGB0LjQu9GDINCw0LrRgtC1INC+0LEg0YPRgtCy0LXRgNC20LTQtdC90LjQuCDRgNC10LfRg9C70YzRgtCw0YLQvtCyINC+0L/RgNC10LTQtdC70LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDRgdGC0L7QuNC80L7RgdGC0LgnLFxuICAgICc1NTgyNTAwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDRgNC10YjQtdC90LjQuCDQvtCxINGD0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQuNC70Lgg0LjQt9C80LXQvdC10L3QuNC4INCz0YDQsNC90LjRhiDQt9C+0L0g0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC5JyxcbiAgICAnNTU4MjUxMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0L/RgNCw0LLQvtCy0L7QvCDQsNC60YLQtSwg0LrQvtGC0L7RgNGL0Lwg0YPRgtCy0LXRgNC20LTQtdC90Ysg0LjQu9C4INC40LfQvNC10L3QtdC90Ysg0L/RgNCw0LLQuNC70LAg0LfQtdC80LvQtdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0Lgg0LfQsNGB0YLRgNC+0LnQutC4LCDQstC60LvRjtGH0LDRjyDRgdCy0LXQtNC10L3QuNGPINC+INGC0LXRgNGA0LjRgtC+0YDQuNCw0LvRjNC90YvRhSDQt9C+0L3QsNGFJyxcbiAgICAnNTU4MjUyMDAwMDAwJzogJ9Ca0LDRgNGC0LAgKNC/0LvQsNC9KSDQvtCx0YrQtdC60YLQsCDQt9C10LzQu9C10YPRgdGC0YDQvtC50YHRgtCy0LAnLFxuICAgICc1NTgyNTMwMDAwMDAnOiAn0JTQtdC60LvQsNGA0LDRhtC40Y8g0LfQsNC40L3RgtC10YDQtdGB0L7QstCw0L3QvdC+0LPQviDQu9C40YbQsCDQviDQstGL0LHRgNCw0L3QvdC+0Lwg0LLQuNC00LUg0YDQsNC30YDQtdGI0LXQvdC90L7Qs9C+INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcbiAgICAnNTU4MjU0MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0L7Qv9GA0LXQtNC10LvRj9GO0YnQuNC1ICjQvtC/0YDQtdC00LXQu9GP0LLRiNC40LUpINCyINGB0L7QvtGC0LLQtdGC0YHRgtCy0LjQuCDRgSDQt9Cw0LrQvtC90L7QtNCw0YLQtdC70YzRgdGC0LLQvtC8INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNC1INCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCAo0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LIpJyxcbiAgICAnNTU4MjU0MDEwMDAwJzogJ9CX0LXQvNC70LXRg9GB0YLRgNC+0LjRgtC10LvRjNC90LDRjyDQtNC+0LrRg9C80LXQvdGC0LDRhtC40Y8nLFxuICAgICc1NTgyNTQwMjAwMDAnOiAn0JvQtdGB0L7Rg9GB0YLRgNC+0LjRgtC10LvRjNC90LDRjyDQtNC+0LrRg9C80LXQvdGC0LDRhtC40Y8nLFxuICAgICc1NTgyNTQwMzAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLINCz0YDQsNC00L7RgdGC0YDQvtC40YLQtdC70YzQvdC+0LPQviDQt9C+0L3QuNGA0L7QstCw0L3QuNGPICjQn9GA0LDQstC40LvQsCDQt9C10LzQu9C10L/QvtC70YzQt9C+0LLQsNC90LjRjyDQuCDQt9Cw0YHRgtGA0L7QudC60LgpJyxcbiAgICAnNTU4MjU0MDQwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLQsNGG0LjRjyDQv9C+INC/0LvQsNC90LjRgNC+0LLQutC1INGC0LXRgNGA0LjRgtC+0YDQuNC4ICjQv9GA0L7QtdC60YLRiyDQvNC10LbQtdCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LkpLCDQsiDRgi7Rhy4g0LTQvtC60YPQvNC10L3RgiDQv9C+INC/0LvQsNC90LjRgNC+0LLQutC1INGC0LXRgNGA0LjRgtC+0YDQuNC4INCyINC/0LvQsNC90LjRgNGD0LXQvNGL0YUg0LPRgNCw0L3QuNGG0LDRhSDQuNGB0LrRg9GB0YHRgtCy0LXQvdC90L7Qs9C+INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcbiAgICAnNTU4MjU0MDUwMDAwJzogJ9Ca0L7Qv9C40Y8g0L/RgNC+0LXQutGC0LAg0LzQtdC20LXQstCw0L3QuNGPINC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcbiAgICAnNTU4MjU0MDYwMDAwJzogJ9CQ0LrRgiDQvtGC0LLQvtC00LAg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LIg0LIg0L3QsNGC0YPRgNC1JyxcbiAgICAnNTU4MjU0MDcwMDAwJzogJ9Cf0YDQvtC10LrRgiDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuICAgICc1NTgyNTQwODAwMDAnOiAn0J/RgNC+0LXQutGCICjQutC+0L/QuNC4INC+0YLQtNC10LvRjNC90YvRhSDRgdC+0YHRgtCw0LLQvdGL0YUg0YfQsNGB0YLQtdC5KSDQvtGA0LPQsNC90LjQt9Cw0YbQuNC4INC4INC30LDRgdGC0YDQvtC50LrQuCDRgtC10YDRgNC40YLQvtGA0LjQuSDRgdCw0LTQvtCy0L7QtNGH0LXRgdC60LjRhSwg0L7Qs9C+0YDQvtC00L3QuNGH0LXRgdC60LjRhSDQuNC70Lgg0LTQsNGH0L3Ri9GFINC90LXQutC+0LzQvNC10YDRh9C10YHQutC40YUg0L7QsdGK0LXQtNC40L3QtdC90LjQuSDQs9GA0LDQttC00LDQvScsXG4gICAgJzU1ODI1NDA5MDAwMCc6ICfQn9GA0L7QtdC60YIgKNC60L7Qv9C40Lgg0L7RgtC00LXQu9GM0L3Ri9GFINGB0L7RgdGC0LDQstC90YvRhSDRh9Cw0YHRgtC10LkpINC/0LXRgNC10YDQsNGB0L/RgNC10LTQtdC70LXQvdC40Y8g0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90YvRhSDRg9Cz0L7QtNC40Lkg0Lgg0LjQvdGL0YUg0LfQtdC80LXQu9GMINGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzU1ODI1NDEwMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQv9GA0LXQtNCy0LDRgNC40YLQtdC70YzQvdC+0Lwg0YHQvtCz0LvQsNGB0L7QstCw0L3QuNC4INC80LXRgdGCINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LInLFxuICAgICc1NTgyNTQxMTAwMDAnOiAn0JrQvtC/0LjRjyDRgNC10YjQtdC90LjRjyDQvtCx0YnQtdCz0L4g0YHQvtCx0YDQsNC90LjRjyDRg9GH0LDRgdGC0L3QuNC60L7QsiDQtNC+0LvQtdCy0L7QuSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDQvdCwINC30LXQvNC10LvRjNC90YvQuSDRg9GH0LDRgdGC0L7QuiDQuNC3INC30LXQvNC10LvRjCDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8g0L7QsSDRg9GC0LLQtdGA0LbQtNC10L3QuNC4INC/0YDQvtC10LrRgtCwINC80LXQttC10LLQsNC90LjRjyDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG4gICAgJzU1ODI1NDEyMDAwMCc6ICfQmtC+0L/QuNGPINC00L7QutGD0LzQtdC90YLQsCwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LXQs9C+INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQtSDQv9GA0L7QtdC60YLQsCDQvNC10LbQtdCy0LDQvdC40Y8g0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuICAgICc1NTgyNTQxMzAwMDAnOiAn0JLQvtC30YDQsNC20LXQvdC40Y8g0LfQsNC40L3RgtC10YDQtdGB0L7QstCw0L3QvdGL0YUg0LvQuNGGINC/0L4g0L/QvtCy0L7QtNGDINC80LXRgdGC0L7Qv9C+0LvQvtC20LXQvdC40Y8g0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcbiAgICAnNTU4MjU0MTQwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINGB0LLQuNC00LXRgtC10LvRjNGB0YLQstGD0Y7RidC40Lkg0L4g0YHQvdGP0YLQuNC4INCy0L7Qt9GA0LDQttC10L3QuNC5INC30LDQuNC90YLQtdGA0LXRgdC+0LLQsNC90L3Ri9GFINC70LjRhiDQv9C+INC/0L7QstC+0LTRgyDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNGPINCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG4gICAgJzU1ODI1NDE1MDAwMCc6ICfQodGF0LXQvNCwINGA0LDRgdC/0L7Qu9C+0LbQtdC90LjRjyDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsiDQvdCwINC60LDQtNCw0YHRgtGA0L7QstGL0YUg0L/Qu9Cw0L3QsNGFINC40LvQuCDQutCw0LTQsNGB0YLRgNC+0LLRi9GFINC60LDRgNGC0LDRhSDRgdC+0L7RgtCy0LXRgtGB0YLQstGD0Y7RidC40YUg0YLQtdGA0YDQuNGC0L7RgNC40LknLFxuICAgICc1NTgyNTQ5OTAwMDAnOiAn0J/RgNC+0YfQuNC1INC00L7QutGD0LzQtdC90YLRiywg0L7Qv9GA0LXQtNC10LvRj9GO0YnQuNC1ICjQvtC/0YDQtdC00LXQu9GP0LLRiNC40LUpINCyINGB0L7QvtGC0LLQtdGC0YHRgtCy0LjQuCDRgSDQt9Cw0LrQvtC90L7QtNCw0YLQtdC70YzRgdGC0LLQvtC8INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNC1INCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCAo0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LIpJyxcbiAgICAnNTU4MjU1MDAwMDAwJzogJ9Ca0LDRgNGC0L7Qs9GA0LDRhNC40YfQtdGB0LrQuNC1INC80LDRgtC10YDQuNCw0LvRiycsXG4gICAgJzU1ODI1NjAwMDAwMCc6ICfQnNCw0YLQtdGA0LjQsNC70Ysg0LrQsNGA0YLQvtCz0YDQsNGE0L4t0LPQtdC+0LTQtdC30LjRh9C10YHQutC+0LPQviDRhNC+0L3QtNCwJyxcbiAgICAnNTU4MjU3MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0YPRgdGC0LDQvdCw0LLQu9C40LLQsNGO0YnQuNC1INC/0YDQtdC00LXQu9GM0L3Ri9C1INC80LjQvdC40LzQsNC70YzQvdGL0LUg0Lgg0LzQsNC60YHQuNC80LDQu9GM0L3Ri9C1INGA0LDQt9C80LXRgNGLLCDRgdC+0L7RgtCy0LXRgtGB0YLQstGD0Y7RidC40LUg0LLQuNC00YMg0YDQsNC30YDQtdGI0LXQvdC90L7Qs9C+INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcbiAgICAnNTU4MjU3MDEwMDAwJzogJ9Ck0LXQtNC10YDQsNC70YzQvdGL0Lkg0LfQsNC60L7QvScsXG4gICAgJzU1ODI1NzAyMDAwMCc6ICfQl9Cw0LrQvtC9INGB0YPQsdGK0LXQutGC0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4JyxcbiAgICAnNTU4MjU3MDMwMDAwJzogJ9Cd0L7RgNC80LDRgtC40LLQvdGL0Lkg0L/RgNCw0LLQvtCy0L7QuSDQsNC60YIg0L7RgNCz0LDQvdCwINC80LXRgdGC0L3QvtCz0L4g0YHQsNC80L7Rg9C/0YDQsNCy0LvQtdC90LjRjycsXG4gICAgJzU1ODI1ODAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDRgdC+0LTQtdGA0LbQsNGJ0LjQuSDQuNC90YTQvtGA0LzQsNGG0LjRjiDQviDRgNCw0L3QtdC1INC/0YDQuNGB0LLQvtC10L3QvdGL0YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9GFINGD0YfQtdGC0L3Ri9GFINC90L7QvNC10YDQsNGFINC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODI1OTAwMDAwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INC+0LHRgNCw0LfQvtCy0LDQvdC40Y8g0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuICAgICc1NTgyNjAwMDAwMDAnOiAn0KfQtdGA0YLQtdC2ICjQsNCx0YDQuNGBKSDQv9C+0LzQtdGJ0LXQvdC40Y8nLFxuICAgICc1NTgyNjEwMDAwMDAnOiAn0J/RgNC+0LXQutGC0L3QsNGPINC00L7QutGD0LzQtdC90YLQsNGG0LjRjyDQt9C00LDQvdC40Y8nLFxuICAgICc1NTgyNjIwMDAwMDAnOiAn0J/RgNC+0LXQutGC0L3QsNGPINC00L7QutGD0LzQtdC90YLQsNGG0LjRjyDRgdC+0L7RgNGD0LbQtdC90LjRjycsXG4gICAgJzU1ODI2MzAwMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQutC+0LzQuNGB0YHQuNC4INC/0L4g0YDQsNGB0YHQvNC+0YLRgNC10L3QuNGOINGB0L/QvtGA0L7QsiDQviDRgNC10LfRg9C70YzRgtCw0YLQsNGFINC+0L/RgNC10LTQtdC70LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDRgdGC0L7QuNC80L7RgdGC0LgnLFxuICAgICc1NTgyNjQwMDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0YHRg9C00LAnLFxuICAgICc1NTgyOTkwMDAwMDAnOiAn0JjQvdC+0Lkg0LTQvtC60YPQvNC10L3Rgiwg0YHQvtC00LXRgNC20LDRidC40Lkg0L7Qv9C40YHQsNC90LjQtSDQvtCx0YrQtdC60YLQsCcsXG4gICAgJzU1ODMwMDAwMDAwMCc6ICfQlNCe0JrQo9Cc0JXQndCi0KssINCh0J7QlNCV0KDQltCQ0KnQmNCVINCe0J/QmNCh0JDQndCY0JUg0JfQkNCv0JLQmNCi0JXQm9CvINCY0JvQmCDQldCT0J4g0J/QoNCV0JTQodCi0JDQktCY0KLQldCb0K8nLFxuICAgICc1NTgzMDEwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC1INC/0L7Qu9C90L7QvNC+0YfQuNGPINC/0YDQtdC00YHRgtCw0LLQuNGC0LXQu9GPJyxcbiAgICAnNTU4MzAxMDEwMDAwJzogJ9CU0L7QstC10YDQtdC90L3QvtGB0YLRjCcsXG4gICAgJzU1ODMwMTAyMDAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDRgNC+0LbQtNC10L3QuNC4JyxcbiAgICAnNTU4MzAxMDMwMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+0LEg0YPRgdGL0L3QvtCy0LvQtdC90LjQuCcsXG4gICAgJzU1ODMwMTA0MDAwMCc6ICfQoNC10YjQtdC90LjQtSDRgdGD0LTQsCcsXG4gICAgJzU1ODMwMTA1MDAwMCc6ICfQntC/0YDQtdC00LXQu9C10L3QuNC1INGB0YPQtNCwJyxcbiAgICAnNTU4MzAxMDYwMDAwJzogJ9Cf0YDQvtGC0L7QutC+0Lsg0L7QsSDQuNC30LHRgNCw0L3QuNC4ICjQtdC00LjQvdC+0LvQuNGH0L3QvtCz0L4g0LjRgdC/0L7Qu9C90LjRgtC10LvRjNC90L7Qs9C+INC+0YDQs9Cw0L3QsCDRjtGA0LjQtNC40YfQtdGB0LrQvtCz0L4g0LvQuNGG0LApJyxcbiAgICAnNTU4MzAxMDcwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0L/RgNC+0YLQvtC60L7Qu9CwINC+0LEg0LjQt9Cx0YDQsNC90LjQuCAo0LXQtNC40L3QvtC70LjRh9C90L7Qs9C+INC40YHQv9C+0LvQvdC40YLQtdC70YzQvdC+0LPQviDQvtGA0LPQsNC90LAg0Y7RgNC40LTQuNGH0LXRgdC60L7Qs9C+INC70LjRhtCwKScsXG4gICAgJzU1ODMwMTA4MDAwMCc6ICfQn9GA0LjQutCw0Lcg0L4g0L3QsNC30L3QsNGH0LXQvdC40LggKNGA0YPQutC+0LLQvtC00LjRgtC10LvRjyDQuNC70Lgg0LjQvdC+0LPQviDRg9C/0L7Qu9C90L7QvNC+0YfQtdC90L3QvtCz0L4g0LvQuNGG0LApJyxcbiAgICAnNTU4MzAxMDkwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0YDQs9Cw0L3QvtCyINC+0L/QtdC60Lgg0Lgg0L/QvtC/0LXRh9C40YLQtdC70YzRgdGC0LLQsCcsXG4gICAgJzU1ODMwMTEwMDAwMCc6ICfQlNC+0LPQvtCy0L7RgCDQutC+0LzQvNC10YDRh9C10YHQutC+0LPQviDQv9GA0LXQtNGB0YLQsNCy0LjRgtC10LvRjNGB0YLQstCwJyxcbiAgICAnNTU4MzAxMTEwMDAwJzogJ9CU0L7Qs9C+0LLQvtGAINC00L7QstC10YDQuNGC0LXQu9GM0L3QvtCz0L4g0YPQv9GA0LDQstC70LXQvdC40Y8nLFxuICAgICc1NTgzMDExMjAwMDAnOiAn0J/QvtGB0YLQsNC90L7QstC70LXQvdC40LUg0YHRg9C00LXQsdC90L7Qs9C+INC/0YDQuNGB0YLQsNCy0LAt0LjRgdC/0L7Qu9C90LjRgtC10LvRjycsXG4gICAgJzU1ODMwMTEzMDAwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INC+0LHRidC10LPQviDRgdC+0LHRgNCw0L3QuNGPJyxcbiAgICAnNTU4MzAxMTQwMDAwJzogJ9CQ0LrRgiDQvtGA0LPQsNC90LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCy0LvQsNGB0YLQuCDQuNC70Lgg0L7RgNCz0LDQvdCwINC80LXRgdGC0L3QvtCz0L4g0YHQsNC80L7Rg9C/0YDQsNCy0LvQtdC90LjRjywg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQv9C+0LvQvdC+0LzQvtGH0LjRjyDQv9GA0LXQtNGB0YLQsNCy0LjRgtC10LvRjyDQt9Cw0Y/QstC40YLQtdC70Y8nLFxuICAgICc1NTgzMDE5OTAwMDAnOiAn0JjQvdC+0Lkg0LTQvtC60YPQvNC10L3RgicsXG4gICAgJzU1ODQwMDAwMDAwMCc6ICfQlNCe0JrQo9Cc0JXQndCi0Ksg0J4g0J/QoNCQ0JLQkNClLCDQodCU0JXQm9Ca0JDQpSwg0J7Qk9Cg0JDQndCY0KfQldCd0JjQr9ClICjQntCR0KDQldCc0JXQndCV0J3QmNCv0KUpJyxcbiAgICAnNTU4NDAxMDAwMDAwJzogJ9Cf0YDQsNCy0L7Rg9GB0YLQsNC90LDQstC70LjQstCw0Y7RidC40LUg0Lgg0L/RgNCw0LLQvtGD0LTQvtGB0YLQvtCy0LXRgNGP0Y7RidC40LUg0LTQvtC60YPQvNC10L3RgtGLJyxcbiAgICAnNTU4NDAxMDEwMDAwJzogJ9CU0L7Qs9C+0LLQvtGA0YsgLyDRgdC+0LPQu9Cw0YjQtdC90LjRjycsXG4gICAgJzU1ODQwMTAxMDEwMCc6ICfQodC00LXQu9C60Lgg0L7QsSDQvtGC0YfRg9C20LTQtdC90LjQuCcsXG4gICAgJzU1ODQwMTAxMDEwMSc6ICfQlNC+0LPQvtCy0L7RgCDQutGD0L/Qu9C4LdC/0YDQvtC00LDQttC4JyxcbiAgICAnNTU4NDAxMDEwMTAyJzogJ9CU0L7Qs9C+0LLQvtGAINC80LXQvdGLJyxcbiAgICAnNTU4NDAxMDEwMTAzJzogJ9CU0L7Qs9C+0LLQvtGAINC00LDRgNC10L3QuNGPJyxcbiAgICAnNTU4NDAxMDEwMTA0JzogJ9CU0L7Qs9C+0LLQvtGAINGA0LXQvdGC0YsnLFxuICAgICc1NTg0MDEwMTAxMDUnOiAn0JTQvtCz0L7QstC+0YAg0L/QvtC20LjQt9C90LXQvdC90L7Qs9C+INGB0L7QtNC10YDQttCw0L3QuNGPINGBINC40LbQtNC40LLQtdC90LjQtdC8JyxcbiAgICAnNTU4NDAxMDEwMTA2JzogJ9CU0L7Qs9C+0LLQvtGAINC/0YDQuNCy0LDRgtC40LfQsNGG0LjQuCAo0LTQvtCz0L7QstC+0YAg0L/QtdGA0LXQtNCw0YfQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LIg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0YwpJyxcbiAgICAnNTU4NDAxMDEwMjAwJzogJ9CU0YDRg9Cz0LjQtSDRgdC00LXQu9C60LgnLFxuICAgICc1NTg0MDEwMTAyMDEnOiAn0JTQvtCz0L7QstC+0YAg0YPRh9Cw0YHRgtC40Y8g0LIg0LTQvtC70LXQstC+0Lwg0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LUnLFxuICAgICc1NTg0MDEwMTAyMDInOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDQvtC/0YDQtdC00LXQu9C10L3QuNC4ICjQv9C10YDQtdGA0LDRgdC/0YDQtdC00LXQu9C10L3QuNC4KSDQtNC+0LvQtdC5INCyINC/0YDQsNCy0LUg0L7QsdGJ0LXQuSDQtNC+0LvQtdCy0L7QuSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCcsXG4gICAgJzU1ODQwMTAxMDIwMyc6ICfQkdGA0LDRh9C90YvQuSDQtNC+0LPQvtCy0L7RgCcsXG4gICAgJzU1ODQwMTAxMDIwNCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINC+0YLRgdGC0YPQv9C90L7QvCcsXG4gICAgJzU1ODQwMTAxMDIwNSc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQviDRgNCw0LfQtNC10LvQtSDQuNC80YPRidC10YHRgtCy0LAnLFxuICAgICc1NTg0MDEwMTAyMDYnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L4g0LLRi9C00LXQu9C1INC00L7Qu9C4JyxcbiAgICAnNTU4NDAxMDEwMjA3JzogJ9CY0L3QstC10YHRgtC40YbQuNC+0L3QvdGL0Lkg0LTQvtCz0L7QstC+0YAgKNC00L7Qs9C+0LLQvtGAINC+0LEg0LjQvdCy0LXRgdGC0LjRgNC+0LLQsNC90LjQuCknLFxuICAgICc1NTg0MDEwMTAyMDgnOiAn0JzQuNGA0L7QstC+0LUg0YHQvtCz0LvQsNGI0LXQvdC40LUnLFxuICAgICc1NTg0MDEwMTAyMDknOiAn0JTQvtCz0L7QstC+0YAg0LDRgNC10L3QtNGLICjRgdGD0LHQsNGA0LXQvdC00YspJyxcbiAgICAnNTU4NDAxMDEwMjEwJzogJ9CU0L7Qs9C+0LLQvtGAINC+0LEg0LjQv9C+0YLQtdC60LUnLFxuICAgICc1NTg0MDEwMTAyMTEnOiAn0JTQvtCz0L7QstC+0YAg0LHQtdC30LLQvtC30LzQtdC30LTQvdC+0LPQviDRgdGA0L7Rh9C90L7Qs9C+INC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0LfQtdC80LXQu9GM0L3Ri9C8INGD0YfQsNGB0YLQutC+0LwnLFxuICAgICc1NTg0MDEwMTAyMTInOiAn0JrRgNC10LTQuNGC0L3Ri9C5INC00L7Qs9C+0LLQvtGAJyxcbiAgICAnNTU4NDAxMDEwMjEzJzogJ9CU0L7Qs9C+0LLQvtGAINC30LDQudC80LAnLFxuICAgICc1NTg0MDEwMTAyMTQnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0YHQtdGA0LLQuNGC0YPRgtCwJyxcbiAgICAnNTU4NDAxMDEwMjE1JzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0LjQt9C80LXQvdC10L3QuNC4INGB0L7QtNC10YDQttCw0L3QuNGPINC30LDQutC70LDQtNC90L7QuScsXG4gICAgJzU1ODQwMTAxMDIxNic6ICfQlNC+0L/QvtC70L3QuNGC0LXQu9GM0L3QvtC1INGB0L7Qs9C70LDRiNC10L3QuNC1ICjRgdC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINC40LfQvNC10L3QtdC90LjQuCDRg9GB0LvQvtCy0LjQuSDQtNC+0LPQvtCy0L7RgNCwKSDQuiDQtNC+0LPQvtCy0L7RgNGDJyxcbiAgICAnNTU4NDAxMDEwMjE3JzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+INGA0LDRgdGC0L7RgNC20LXQvdC40Lgg0LTQvtCz0L7QstC+0YDQsCcsXG4gICAgJzU1ODQwMTAxMDIxOCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINGD0YHRgtGD0L/QutC1INC/0YDQsNCyINGC0YDQtdCx0L7QstCw0L3QuNGPINC/0L4g0LTQvtCz0L7QstC+0YDRgyAo0LTQvtCz0L7QstC+0YAg0L4g0L/QtdGA0LXQtNCw0YfQtSDQv9GA0LDQsiDQuCDQvtCx0Y/Qt9Cw0L3QvdC+0YHRgtC10LkpJyxcbiAgICAnNTU4NDAxMDEwMjE5JzogJ9CU0L7Qs9C+0LLQvtGAINC/0YDQvtGB0YLQvtCz0L4g0YLQvtCy0LDRgNC40YnQtdGB0YLQstCwICjQtNC+0LPQvtCy0L7RgCDQviDRgdC+0LLQvNC10YHRgtC90L7QuSDQtNC10Y/RgtC10LvRjNC90L7RgdGC0LgpJyxcbiAgICAnNTU4NDAxMDEwMjIwJzogJ9CT0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutC+0L3RgtGA0LDQutGCJyxcbiAgICAnNTU4NDAxMDEwMjk5JzogJ9CY0L3QsNGPINGB0LTQtdC70LrQsCcsXG4gICAgJzU1ODQwMTAyMDAwMCc6ICfQkNC60YLRiyDQvtGA0LPQsNC90L7QsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LLQu9Cw0YHRgtC4INC40LvQuCDQvtGA0LPQsNC90L7QsiDQvNC10YHRgtC90L7Qs9C+INGB0LDQvNC+0YPQv9GA0LDQstC70LXQvdC40Y8nLFxuICAgICc1NTg0MDEwMjAxMDAnOiAn0KTQtdC00LXRgNCw0LvRjNC90YvQuSDQt9Cw0LrQvtC9JyxcbiAgICAnNTU4NDAxMDIwMjAwJzogJ9Cj0LrQsNC3INCf0YDQtdC30LjQtNC10L3RgtCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG4gICAgJzU1ODQwMTAyMDMwMCc6ICfQn9C+0YHRgtCw0L3QvtCy0LvQtdC90LjQtSDQn9GA0LDQstC40YLQtdC70YzRgdGC0LLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuICAgICc1NTg0MDEwMjA0MDAnOiAn0JfQsNC60L7QvSAo0LfQsNC60L7QvdGLINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCwg0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgpJyxcbiAgICAnNTU4NDAxMDIwNTAwJzogJ9CU0L7QutGD0LzQtdC90YIg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG4gICAgJzU1ODQwMTAyMDYwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0LHRgNCw0LfQvtCy0LDQvdC40Lgg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuICAgICc1NTg0MDEwMjA3MDAnOiAn0JDQutGCINC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INGB0LXRgNCy0LjRgtGD0YLQsCcsXG4gICAgJzU1ODQwMTAyMDgwMCc6ICfQkNC60YIg0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjyknLFxuICAgICc1NTg0MDEwMjk5MDAnOiAn0JjQvdGL0LUg0LDQutGC0Ysg0L7RgNCz0LDQvdC+0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCy0LvQsNGB0YLQuCDQuNC70Lgg0L7RgNCz0LDQvdC+0LIg0LzQtdGB0YLQvdC+0LPQviDRgdCw0LzQvtGD0L/RgNCw0LLQu9C10L3QuNGPJyxcbiAgICAnNTU4NDAxMDMwMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INC/0YDQsNCy0LUg0L3QsCDQvdCw0YHQu9C10LTRgdGC0LLQvicsXG4gICAgJzU1ODQwMTAzMDEwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQv9GA0LDQstC1INC90LAg0L3QsNGB0LvQtdC00YHRgtCy0L4g0L/QviDQt9Cw0LrQvtC90YMnLFxuICAgICc1NTg0MDEwMzAyMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0L/RgNCw0LLQtSDQvdCwINC90LDRgdC70LXQtNGB0YLQstC+INC/0L4g0LfQsNCy0LXRidCw0L3QuNGOJyxcbiAgICAnNTU4NDAxMDQwMDAwJzogJ9CS0YHRgtGD0L/QuNCy0YjQuNC1INCyINGB0LjQu9GDINGB0YPQtNC10LHQvdGL0LUg0LDQutGC0YsnLFxuICAgICc1NTg0MDEwNDAxMDAnOiAn0KHRg9C00LXQsdC90YvQuSDQsNC60YIsINGD0YHRgtCw0L3QsNCy0LvQuNCy0LDRjtGJ0LjQuSDQt9Cw0L/RgNC10YIg0L3QsCDRgdC+0LLQtdGA0YjQtdC90LjQtSDQtNC10LnRgdGC0LLQuNC5INCyINGB0YTQtdGA0LUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INGD0YfQtdGC0LAg0LIg0L7RgtC90L7RiNC10L3QuNC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODQwMTA0MDIwMCc6ICfQodGD0LTQtdCx0L3Ri9C5INCw0LrRgiDQviDQstC+0YHRgdGC0LDQvdC+0LLQu9C10L3QuNC4INCw0L3QvdGD0LvQuNGA0L7QstCw0L3QvdGL0YUg0Lgg0LjRgdC60LvRjtGH0LXQvdC90YvRhSDQuNC3INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INGB0LLQtdC00LXQvdC40Lkg0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTg0MDEwNDAzMDAnOiAn0KHRg9C00LXQsdC90YvQuSDQsNC60YIg0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0L7QsdGA0LXQvNC10L3QtdC90LjRjyAo0L7Qs9GA0LDQvdC40YfQtdC90LjQuCkg0LIg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4ICAo0YfQsNGB0YLQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgpJyxcbiAgICAnNTU4NDAxMDQ5OTAwJzogJ9CY0L3Ri9C1INC/0YDQtdC00YPRgdC80L7RgtGA0LXQvdC90YvQtSDQt9Cw0LrQvtC90L7QtNCw0YLQtdC70YzRgdGC0LLQvtC8INGB0YPQtNC10LHQvdGL0LUg0LDQutGC0YsnLFxuICAgICc1NTg0MDEwNTAwMDAnOiAn0JDQutGC0YsgKNGB0LLQuNC00LXRgtC10LvRjNGB0YLQstCwKSDQviDQv9GA0LDQstCw0YUg0L3QsCDQvtCx0YrQtdC60YLRiyDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTg0MDEwNTAxMDAnOiAn0KDQtdCz0LjRgdGC0YDQsNGG0LjQvtC90L3QvtC1INGD0LTQvtGB0YLQvtCy0LXRgNC10L3QuNC1JyxcbiAgICAnNTU4NDAxMDUwMjAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INC/0YDQsNCy0LUg0L3QsCDQt9C10LzQu9GOJyxcbiAgICAnNTU4NDAxMDUwMzAwJzogJ9CT0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQsNC60YIg0L4g0L/RgNCw0LLQtSDQvdCwINC30LXQvNC70Y4nLFxuICAgICc1NTg0MDEwNTA0MDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0L/RgNCw0LLQtSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCcsXG4gICAgJzU1ODQwMTA1OTkwMCc6ICfQmNC90YvQtSDQsNC60YLRiywg0YHQstC40LTQtdGC0LXQu9GM0YHRgtCy0LAg0L4g0L/RgNCw0LLQsNGFINC90LAg0L7QsdGK0LXQutGC0Ysg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4NDAxMDYwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiyDQvdCwINCy0L3QvtCy0Ywg0LLQvtC30LLQtdC00LXQvdC90YvQuSAo0YDQtdC60L7QvdGB0YLRgNGD0LjRgNC+0LLQsNC90L3Ri9C5KSDQvtCx0YrQtdC60YInLFxuICAgICc1NTg0MDEwNjAxMDAnOiAn0KDQsNC30YDQtdGI0LXQvdC40LUg0L3QsCDQstCy0L7QtCDQvtCx0YrQtdC60YLQsCDQsiDRjdC60YHQv9C70YPQsNGC0LDRhtC40Y4nLFxuICAgICc1NTg0MDEwNjAyMDAnOiAn0KDQsNC30YDQtdGI0LXQvdC40LUg0L3QsCDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQvicsXG4gICAgJzU1ODQwMTA2MDMwMCc6ICfQkNC60YIg0LLQstC+0LTQsCDQsiDRjdC60YHQv9C70YPQsNGC0LDRhtC40Y4nLFxuICAgICc1NTg0MDEwNjA0MDAnOiAn0JrQvtC/0LjRjyDRgNC10YjQtdC90LjRjyDQviDRgdC+0LfQtNCw0L3QuNC4INC40YHQutGD0YHRgdGC0LLQtdC90L3QvtCz0L4g0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuICAgICc1NTg0MDEwNzAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLINC/0YDQuCDRg9C/0YDQvtGJ0LXQvdC90L7QvCDQv9C+0YDRj9C00LrQtSDQvtGE0L7RgNC80LvQtdC90LjRjyDQv9GA0LDQsiDQs9GA0LDQttC00LDQvSDQvdCwINC+0YLQtNC10LvRjNC90YvQtSDQvtCx0YrQtdC60YLRiyDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG4gICAgJzU1ODQwMTA3MDEwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INC/0L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7QuSDQutC90LjQs9C4INC+INC90LDQu9C40YfQuNC4INGDINCz0YDQsNC20LTQsNC90LjQvdCwINC/0YDQsNCy0LAg0L3QsCDQt9C10LzQtdC70YzQvdGL0Lkg0YPRh9Cw0YHRgtC+0LonLFxuICAgICc1NTg0MDEwNzAyMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQv9Cw0YHQv9C+0YDRgiDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTg0MDEwNzAzMDAnOiAn0JTQtdC60LvQsNGA0LDRhtC40Y8g0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG4gICAgJzU1ODQwMTA4MDAwMCc6ICfQn9GA0L7Rh9C40LUg0L/RgNCw0LLQvtGD0YHRgtCw0L3QsNCy0LvQuNCy0LDRjtGJ0LjQtSDQtNC+0LrRg9C80LXQvdGC0YsnLFxuICAgICc1NTg0MDEwODAxMDAnOiAn0J/QtdGA0LXQtNCw0YLQvtGH0L3Ri9C5INCw0LrRgicsXG4gICAgJzU1ODQwMTA4MDIwMCc6ICfQoNCw0LfQtNC10LvQuNGC0LXQu9GM0L3Ri9C5INCx0LDQu9Cw0L3RgScsXG4gICAgJzU1ODQwMTA4MDMwMCc6ICfQn9C70LDQvSDQv9GA0LjQstCw0YLQuNC30LDRhtC40LgnLFxuICAgICc1NTg0MDEwODA0MDAnOiAn0J/RgNCw0LLQuNC70LAg0LTQvtCy0LXRgNC40YLQtdC70YzQvdC+0LPQviDRg9C/0YDQsNCy0LvQtdC90LjRjycsXG4gICAgJzU1ODQwMTA4MDUwMCc6ICfQkNC60YIg0L7Qv9C40YHQuCDQuCDQsNGA0LXRgdGC0LAg0LjQvNGD0YnQtdGB0YLQstCwJyxcbiAgICAnNTU4NDAxMDgwNjAwJzogJ9Cf0YDQvtGC0L7QutC+0Lsg0L4g0LLRi9C00LXQu9C1INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwINCyINGB0YfQtdGCINC30LXQvNC10LvRjNC90L7QuSDQtNC+0LvQuCcsXG4gICAgJzU1ODQwMTA4MDcwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INC+0LHRidC10LPQviDRgdC+0LHRgNCw0L3QuNGPINGB0L7QsdGB0YLQstC10L3QvdC40LrQvtCyINC/0L7QvNC10YnQtdC90LjQuSDQsiDQvNC90L7Qs9C+0LrQstCw0YDRgtC40YDQvdC+0Lwg0LTQvtC80LUnLFxuICAgICc1NTg0MDEwODA4MDAnOiAn0J7RgtC60LDQtyDQvtC00LDRgNGP0LXQvNC+0LPQviDQv9GA0LjQvdGP0YLRjCDQtNCw0YAgKNC+0YLQutCw0Lcg0L7RgiDQtNCw0YDQsCknLFxuICAgICc1NTg0MDEwODA5MDAnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L4g0L3QvtCy0LDRhtC40LgnLFxuICAgICc1NTg0MDEwODEwMDAnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L4g0YDQsNC30LTQtdC70LUg0L3QsNGB0LvQtdC00YHRgtCy0LXQvdC90L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG4gICAgJzU1ODQwMTA4MTEwMCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINGD0L/Qu9Cw0YLQtSDQsNC70LjQvNC10L3RgtC+0LInLFxuICAgICc1NTg0MDEwODEyMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQvdCw0LvQuNGH0LjQtSwg0LLQvtC30L3QuNC60L3QvtCy0LXQvdC40LUsINC/0LXRgNC10YXQvtC0INC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pINCy0LXRidC90L7Qs9C+INC/0YDQsNCy0LAg0L3QsCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCyINC/0L7Qu9GM0LfRgyDQt9Cw0Y/QstC40YLQtdC70Y8nLFxuICAgICc1NTg0MDEwODk5MDAnOiAn0JjQvdC+0Lkg0LTQvtC60YPQvNC10L3RgicsXG4gICAgJzU1ODQwMjAwMDAwMCc6ICfQodCe0J/Qo9Ci0KHQotCS0KPQrtCp0JjQlSDQmCDQlNCe0J/QntCb0J3QmNCi0JXQm9Cs0J3Qq9CVINCU0J7QmtCj0JzQldCd0KLQqycsXG4gICAgJzU1ODQwMjAxMDAwMCc6ICfQodC+0LPQu9Cw0YHQuNC1INGB0YPQv9GA0YPQs9CwINC90LAg0YHQvtCy0LXRgNGI0LXQvdC40LUg0YHQtNC10LvQutC4JyxcbiAgICAnNTU4NDAyMDIwMDAwJzogJ9Ch0L7Qs9C70LDRgdC40LUg0L7RgNCz0LDQvdC+0LIg0L7Qv9C10LrQuCDQuCDQv9C+0L/QtdGH0LjRgtC10LvRjNGB0YLQstCwJyxcbiAgICAnNTU4NDAyMDMwMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INC30LDQutC70Y7Rh9C10L3QuNC4INCx0YDQsNC60LAnLFxuICAgICc1NTg0MDIwNDAwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0YDQsNGB0YLQvtGA0LbQtdC90LjQuCDQsdGA0LDQutCwJyxcbiAgICAnNTU4NDAyMDUwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7QtNC+0LHRgNC10L3QuNC4ICjQviDRgdC+0LLQtdGA0YjQtdC90LjQuCkg0YHQtNC10LvQutC4JyxcbiAgICAnNTU4NDAyMDYwMDAwJzogJ9Ch0L/RgNCw0LLQutCwINC+INGB0YLQvtC40LzQvtGB0YLQuCAo0YHQv9GA0LDQstC60LAg0L4g0YHQvtC+0YLQvdC+0YjQtdC90LjQuCDRgdGC0L7QuNC80L7RgdGC0Lgg0L7RgtGH0YPQttC00LDQtdC80L7Qs9C+INC+0LHRitC10LrRgtCwINC4INCx0LDQu9Cw0L3RgdC+0LLQvtC5INGB0YLQvtC40LzQvtGB0YLQuCDQuNC80YPRidC10YHRgtCy0LAg0LjQu9C4INCw0LrRgtC40LLQvtCyINGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0L7QsdGJ0LXRgdGC0LLQsCknLFxuICAgICc1NTg0MDIwNzAwMDAnOiAn0KHQv9GA0LDQstC60LAg0L4g0LfQsNC40L3RgtC10YDQtdGB0L7QstCw0L3QvdGL0YUg0LvQuNGG0LDRhSDQsiDRgdC00LXQu9C60LUnLFxuICAgICc1NTg0MDIwODAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQtNC+0LzQvtCy0L7QuSDQutC90LjQs9C4ICjRgdCy0LXQtNC10L3QuNGPINC+INC70LjRhtCw0YUsINGB0L7RhdGA0LDQvdGP0Y7RidC40YUg0L/RgNCw0LLQviDQv9GA0L7QttC40LLQsNC90LjRjyDQsiDQttC40LvQvtC8INC/0L7QvNC10YnQtdC90LjQuCDQv9C+0YHQu9C1INC/0LXRgNC10YXQvtC00LAg0L/RgNCw0LLQsCDQvdCwINC90LXQs9C+KScsXG4gICAgJzU1ODQwMjA5MDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INC70LjRhtC10LLQvtCz0L4g0YHRh9C10YLQsCAo0YHQstC10LTQtdC90LjRjyDQviDQu9C40YbQsNGFLCDRgdC+0YXRgNCw0L3Rj9GO0YnQuNGFINC/0YDQsNCy0L4g0L/RgNC+0LbQuNCy0LDQvdC40Y8g0LIg0LbQuNC70L7QvCDQv9C+0LzQtdGJ0LXQvdC40Lgg0L/QvtGB0LvQtSDQv9C10YDQtdGF0L7QtNCwINC/0YDQsNCy0LAg0L3QsCDQvdC10LPQviknLFxuICAgICc1NTg0MDIxMDAwMDAnOiAn0J/RgNC+0YLQvtC60L7QuyDQviDRgNC10LfRg9C70YzRgtCw0YLQsNGFINGC0L7RgNCz0L7QsicsXG4gICAgJzU1ODQwMjExMDAwMCc6ICfQm9C40YbQtdC90LfQuNGPICjQu9C40YbQtdC90LfQuNGPINC90LAg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40LUg0L7Qv9GA0LXQtNC10LvQtdC90L3Ri9GFINCy0LjQtNC+0LIg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4KScsXG4gICAgJzU1ODQwMjEyMDAwMCc6ICfQn9GA0L7QtdC60YLQvdCw0Y8g0LTQtdC60LvQsNGA0LDRhtC40Y8nLFxuICAgICc1NTg0MDIxMzAwMDAnOiAn0J7RgtC60LDQtyDQvtGCINC/0YDQtdC40LzRg9GJ0LXRgdGC0LLQtdC90L3QvtCz0L4g0L/RgNCw0LLQsCDQv9C+0LrRg9C/0LrQuCAo0LTQu9GPINGD0YfQsNGB0YLQvdC40LrQvtCyINC00L7Qu9C10LLQvtC5INGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4LCDQtNC70Y8g0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0L/RgNC4INC/0YDQvtC00LDQttC1INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwINC40Lcg0YHQvtGB0YLQsNCy0LAg0LfQtdC80LXQu9GMINGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjyknLFxuICAgICc1NTg0MDIxNDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0YHQvtC30LTQsNC90LjQuCDRjtGA0LjQtNC40YfQtdGB0LrQvtCz0L4g0LvQuNGG0LAnLFxuICAgICc1NTg0MDIxNTAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0YDQtdC+0YDQs9Cw0L3QuNC30LDRhtC40Lgg0Y7RgNC40LTQuNGH0LXRgdC60L7Qs9C+INC70LjRhtCwJyxcbiAgICAnNTU4NDAyMTYwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC70LjQutCy0LjQtNCw0YbQuNC4INGO0YDQuNC00LjRh9C10YHQutC+0LPQviDQu9C40YbQsCcsXG4gICAgJzU1ODQwMjE3MDAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINGD0YLQstC10YDQttC00LXQvdC40Lgg0L7RhtC10L3QutC4INC40LzRg9GJ0LXRgdGC0LLQsCAo0YDQtdGI0LXQvdC40LUg0L7QsSDRg9GC0LLQtdGA0LbQtNC10L3QuNC4INC+0YbQtdC90LrQuCDQvdC10LTQtdC90LXQttC90YvRhSDQstC60LvQsNC00L7QsiDQsiDRg9GB0YLQsNCy0L3Ri9C5INC60LDQv9C40YLQsNC7INC+0LHRidC10YHRgtCy0LApJyxcbiAgICAnNTU4NDAyMTgwMDAwJzogJ9CY0YHQv9C+0LvQvdC40YLQtdC70YzQvdGL0Lkg0LvQuNGB0YInLFxuICAgICc1NTg0MDIxOTAwMDAnOiAn0JTQvtCz0L7QstC+0YAg0L/QvtGA0YPRh9C10L3QuNGPJyxcbiAgICAnNTU4NDAyMjAwMDAwJzogJ9CR0YPRhdCz0LDQu9GC0LXRgNGB0LrQuNC5INCx0LDQu9Cw0L3RgScsXG4gICAgJzU1ODQwMjIxMDAwMCc6ICfQl9Cw0LrQu9Cw0LTQvdCw0Y8nLFxuICAgICc1NTg0MDIyMjAwMDAnOiAn0JTQvtCx0LDQstC+0YfQvdGL0Lkg0LvQuNGB0YIg0Log0LfQsNC60LvQsNC00L3QvtC5JyxcbiAgICAnNTU4NDAyMjMwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0YDQtdC10YHRgtGA0LAg0LzRg9C90LjRhtC40L/QsNC70YzQvdC+0Lkg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0LgnLFxuICAgICc1NTg0MDIyNDAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDRgNC10LXRgdGC0YDQsCDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDRgdGD0LHRitC10LrRgtCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG4gICAgJzU1ODQwMjI1MDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INGA0LXQtdGB0YLRgNCwINGE0LXQtNC10YDQsNC70YzQvdC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuICAgICc1NTg0MDIyNjAwMDAnOiAn0JbQuNC70LjRidC90YvQuSDRgdC10YDRgtC40YTQuNC60LDRgicsXG4gICAgJzU1ODQwMjI3MDAwMCc6ICfQkNGD0LTQuNGC0L7RgNGB0LrQvtC1INC30LDQutC70Y7Rh9C10L3QuNC1JyxcbiAgICAnNTU4NDAyMjgwMDAwJzogJ9Ce0YLRh9C10YIg0L4g0L/RgNC+0LLQtdC00LXQvdC40Lgg0L3QtdC30LDQstC40YHQuNC80L7QuSDQvtGG0LXQvdC60LggKNCw0LrRgiDQvtGG0LXQvdC60LgpJyxcbiAgICAnNTU4NDAyMzkwMDAwJzogJ9CQ0LrRgiDQuNC90LLQtdC90YLQsNGA0LjQt9Cw0YbQuNC4JyxcbiAgICAnNTU4NDAyNDAwMDAwJzogJ9Ce0YXRgNCw0L3QvdC+0LUg0L7QsdGP0LfQsNGC0LXQu9GM0YHRgtCy0L4g0YHQvtCx0YHRgtCy0LXQvdC90LjQutCwINC+0LHRitC10LrRgtCwINC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNGB0LvQtdC00LjRjycsXG4gICAgJzU1ODQwMjk5MDAwMCc6ICfQmNC90L7QuSDQtNC+0LrRg9C80LXQvdGCJyxcbiAgICAnNTU4NDAzMDAwMDAwJzogJ9CU0J7QmtCj0JzQldCd0KLQqywg0KHQntCU0JXQoNCW0JDQqdCY0JUg0KHQktCV0JTQldCd0JjQryDQldCT0KDQnycsXG4gICAgJzU1ODQwMzAxMDAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQstCwJyxcbiAgICAnNTU4NDAzMDIwMDAwJzogJ9CS0YvQv9C40YHQutCwINC+INC/0YDQsNCy0LDRhSDQvdCwINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG4gICAgJzU1ODQwMzAzMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQviDQv9C10YDQtdGF0L7QtNC1INC/0YDQsNCyINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcbiAgICAnNTU4NDAzMDQwMDAwJzogJ9CS0YvQv9C40YHQutCwINC+INC/0YDQsNCy0LDRhSDQvtGC0LTQtdC70YzQvdC+0LPQviDQu9C40YbQsCDQvdCwINC40LzQtdGO0YnQuNC10YHRjyDRgyDQvdC10LPQviDQvtCx0YrQtdC60YLRiyDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG4gICAgJzU1ODQwMzA1MDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQviDQv9GA0LjQt9C90LDQvdC40Lgg0L/RgNCw0LLQvtC+0LHQu9Cw0LTQsNGC0LXQu9GPINC90LXQtNC10LXRgdC/0L7RgdC+0LHQvdGL0Lwg0LjQu9C4INC+0LPRgNCw0L3QuNGH0LXQvdC90L4g0LTQtdC10YHQv9C+0YHQvtCx0L3Ri9C8JyxcbiAgICAnNTU4NDAzMDYwMDAwJzogJ9Ch0L/RgNCw0LLQutCwINC+INGB0L7QtNC10YDQttCw0L3QuNC4INC/0YDQsNCy0L7Rg9GB0YLQsNC90LDQstC70LjQstCw0Y7RidC40YUg0LTQvtC60YPQvNC10L3RgtC+0LIg0L3QsCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuICAgICc1NTg0MDMwNzAwMDAnOiAn0KHQv9GA0LDQstC60LAg0L4g0LvQuNGG0LDRhSwg0L/QvtC70YPRh9C40LLRiNC40YUg0YHQstC10LTQtdC90LjRjyDQvtCxINC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcbiAgICAnNTU4NDAzMDgwMDAwJzogJ9Ca0L7Qv9C40Lgg0LTQvtCz0L7QstC+0YDQvtCyINC4INC40L3Ri9GFINC00L7QutGD0LzQtdC90YLQvtCyLCDQstGL0YDQsNC20LDRjtGJ0LjRhSDRgdC+0LTQtdGA0LbQsNC90LjQtSDQvtC00L3QvtGB0YLQvtGA0L7QvdC90LjRhSDRgdC00LXQu9C+0LosINGB0L7QstC10YDRiNC10L3QvdGL0YUg0LIg0L/RgNC+0YHRgtC+0Lkg0L/QuNGB0YzQvNC10L3QvdC+0Lkg0YTQvtGA0LzQtScsXG4gICAgJzU1ODQwMzA5MDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INCV0JPQoNCfINC+INC/0YDQuNC90Y/RgtC40Lgg0L3QsCDRg9GH0ZHRgiDQsdC10YHRhdC+0LfRj9C50L3QvtCz0L4g0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuICAgICc1NTg0MDMxMDAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQldCT0KDQnyDQviDQv9GA0LjQvdGP0YLQuNC4INC90LAg0YPRh9GR0YIg0LHQtdGB0YXQvtC30Y/QudC90L7Qs9C+INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwLCDQvtGCINC/0YDQsNCy0LAg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Lgg0L3QsCDQutC+0YLQvtGA0YvQuSDRgdC+0LHRgdGC0LLQtdC90L3QuNC6INC+0YLQutCw0LfQsNC70YHRjycsXG4gICAgJzU1ODQwMzExMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INCV0JPQoNCfINC+INCx0LXRgdGF0L7Qt9GP0LnQvdC+0Lwg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAsINC/0YDQuNC90Y/RgtC+0Lwg0L3QsCDRg9GH0ZHRgicsXG4gICAgJzU1ODQwMzEyMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INC10LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwsINGD0LTQvtGB0YLQvtCy0LXRgNGP0Y7RidCw0Y8g0L/RgNC+0LLQtdC00LXQvdC40LUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0LLQvtC30L3QuNC60L3QvtCy0LXQvdC40Y8g0LggKNC40LvQuCkg0L/QtdGA0LXRhdC+0LTQsCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQvicsXG4gICAgJzU1ODQwMzk5MDAwMCc6ICfQmNC90L7QuSDQtNC+0LrRg9C80LXQvdGCJyxcbiAgICAnNTU4NDA0MDAwMDAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNGPINC4INGB0L7Qs9C70LDRgdC40Y8g0L7QsSDQvtCx0YDQsNC30L7QstCw0L3QuNC4INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcbiAgICAnNTU4NDA0MDEwMDAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+INGA0LDQt9C00LXQu9C1LCDQvtCxINC+0LHRitC10LTQuNC90LXQvdC40LgsINC+INC/0LXRgNC10YDQsNGB0L/RgNC10LTQtdC70LXQvdC40Lgg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LIg0LjQu9C4INC+INCy0YvQtNC10LvQtSDQuNC3INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcbiAgICAnNTU4NDA0MDIwMDAwJzogJ9Ch0L7Qs9C70LDRgdC40LUg0L3QsCDQvtCx0YDQsNC30L7QstCw0L3QuNC1INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcbiAgICAnNTU4NDA0MDMwMDAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0L7QsdGA0LDQt9C+0LLQsNC90LjQuCDQvtCx0YnQtdC5INC00L7Qu9C10LLQvtC5INGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4INC90LAg0LfQtdC80LXQu9GM0L3Ri9C5INGD0YfQsNGB0YLQvtC6LCDQvtCx0YDQsNC30YPQtdC80YvQuSDQv9GA0Lgg0LLRi9C00LXQu9C1INC10LPQviDQsiDRgdGH0LXRgiDQt9C10LzQtdC70YzQvdC+0Lkg0LTQvtC70Lgg0LjQu9C4INC30LXQvNC10LvRjNC90YvRhSDQtNC+0LvQtdC5JyxcbiAgICAnNTU4NDA0MDQwMDAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0L7QsdGA0LDQt9C+0LLQsNC90LjQuCDQvtCx0YnQtdC5INGB0L7QstC80LXRgdGC0L3QvtC5INGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4INC90LAg0LfQtdC80LXQu9GM0L3Ri9C5INGD0YfQsNGB0YLQvtC6LCDQvtCx0YDQsNC30YPQtdC80YvQuSDQv9GA0Lgg0LLRi9C00LXQu9C1INC10LPQviDQsiDRgdGH0LXRgiDQt9C10LzQtdC70YzQvdC+0Lkg0LTQvtC70Lgg0LjQu9C4INC30LXQvNC10LvRjNC90YvRhSDQtNC+0LvQtdC5JyxcbiAgICAnNTU4NDA1MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQtSDQstC+0LfQvdC40LrQvdC+0LLQtdC90LjQtSDQv9GA0LDQstCwINGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4INCyINC+0YLQvdC+0YjQtdC90LjQuCDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDQsiDRgdC40LvRgyDRhNC10LTQtdGA0LDQu9GM0L3QvtCz0L4g0LfQsNC60L7QvdCwINCy0L3QtSDQt9Cw0LLQuNGB0LjQvNC+0YHRgtC4INC+0YIg0LzQvtC80LXQvdGC0LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0Y3RgtC+0LPQviDQv9GA0LDQstCwINCyINCV0JPQoNCfJyxcbiAgICAnNTU4NDA1MDEwMDAwJzogJ9Ca0L7Qv9C40Y8g0YDQtdGI0LXQvdC40Y8g0L4g0LHQtdC30LLQvtC30LzQtdC30LTQvdC+0Lkg0L/QtdGA0LXQtNCw0YfQtSDQstC+0LXQvdC90L7Qs9C+INC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwINC40Lcg0YTQtdC00LXRgNCw0LvRjNC90L7QuSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDQsiDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLRjCDRgdGD0LHRitC10LrRgtCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCAtINCz0L7RgNC+0LTQsCDRhNC10LTQtdGA0LDQu9GM0L3QvtCz0L4g0LfQvdCw0YfQtdC90LjRjyDQnNC+0YHQutCy0Ysg0LjQu9C4INCh0LDQvdC60YIt0J/QtdGC0LXRgNCx0YPRgNCz0LAg0LvQuNCx0L4g0LzRg9C90LjRhtC40L/QsNC70YzQvdGD0Y4g0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0YwnLFxuICAgICc1NTg0MDUwMjAwMDAnOiAn0J/QvtC00LvQuNC90L3QuNC6INC40LvQuCDQutC+0L/QuNGPINC/0LjRgdGM0LzQsCDQvtGA0LPQsNC90LAg0LjRgdC/0L7Qu9C90LjRgtC10LvRjNC90L7QuSDQstC70LDRgdGC0Lgg0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LggLSDQs9C+0YDQvtC00LAg0YTQtdC00LXRgNCw0LvRjNC90L7Qs9C+INC30L3QsNGH0LXQvdC40Y8g0JzQvtGB0LrQstGLINC40LvQuCDQodCw0L3QutGCLdCf0LXRgtC10YDQsdGD0YDQs9CwINC70LjQsdC+INC+0YDQs9Cw0L3QsCDQvNC10YHRgtC90L7Qs9C+INGB0LDQvNC+0YPQv9GA0LDQstC70LXQvdC40Y8g0LzRg9C90LjRhtC40L/QsNC70YzQvdC+0LPQviDQvtCx0YDQsNC30L7QstCw0L3QuNGPINC+INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQuCDQs9GA0LDQvdC40YYg0L7QsdGA0LDQt9GD0LXQvNC+0LPQviDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDRgSDQv9GA0LjQu9C+0LbQtdC90LjQtdC8INGB0L7Qs9C70LDRgdC+0LLQsNC90L3QvtCz0L4g0L/RgNC+0LXQutGC0LAg0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwINCyINGB0LvRg9GH0LDQtSwg0LXRgdC70Lgg0LDQutGCINGB0L7Qs9C70LDRgdC+0LLQsNC90LjRjyDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAg0L3QtSDQt9Cw0LLQtdGA0LXQvSDQv9C+0LTQv9C40YHRjNGOINGD0L/QvtC70L3QvtC80L7Rh9C10L3QvdC+0LPQviDQtNC+0LvQttC90L7RgdGC0L3QvtCz0L4g0LvQuNGG0LAg0YHQvtC+0YLQstC10YLRgdGC0LLRg9GO0YnQtdCz0L4g0L7RgNCz0LDQvdCwJyxcbiAgICAnNTU4NDA1MDMwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0LjQt9GK0Y/RgtC40Lgg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LIg0LggKNC40LvQuCkg0YDQsNGB0L/QvtC70L7QttC10L3QvdGL0YUg0L3QsCDQvdC40YUg0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCDQsiDRhtC10LvRj9GFINGA0LDQt9C80LXRidC10L3QuNGPINC+0LvQuNC80L/QuNC50YHQutC40YUg0L7QsdGK0LXQutGC0L7QsicsXG4gICAgJzU1ODQwNTA0MDAwMCc6ICfQmtC+0L/QuNGPINCw0LrRgtCwINC/0YDQuNC10LzQsC3Qv9C10YDQtdC00LDRh9C4INC+0LHRitC10LrRgtC+0LIg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAsINCyINC+0YLQvdC+0YjQtdC90LjQuCDQutC+0YLQvtGA0YvRhSDQv9GA0LjQvdGP0YLQviDRgNC10YjQtdC90LjQtSDQvtCxINC40LfRitGP0YLQuNC4INCyINGG0LXQu9GP0YUg0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7Qu9C40LzQv9C40LnRgdC60LjRhSDQvtCx0YrQtdC60YLQvtCyJyxcbiAgICAnNTU4NDA1OTkwMDAwJzogJ9CY0L3Ri9C1INC00L7QutGD0LzQtdC90YLRiywg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQtSDQstC+0LfQvdC40LrQvdC+0LLQtdC90LjQtSDQv9GA0LDQstCwINGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4INCyINC+0YLQvdC+0YjQtdC90LjQuCDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDQsiDRgdC40LvRgyDRhNC10LTQtdGA0LDQu9GM0L3QvtCz0L4g0LfQsNC60L7QvdCwINCy0L3QtSDQt9Cw0LLQuNGB0LjQvNC+0YHRgtC4INC+0YIg0LzQvtC80LXQvdGC0LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0Y3RgtC+0LPQviDQv9GA0LDQstCwINCyINCV0JPQoNCfJyxcbiAgICAnNTU4NTAwMDAwMDAwJzogJ9Cg0LXRiNC10L3QuNGPLCDRg9Cy0LXQtNC+0LzQu9C10L3QuNGPLCDRgNCw0YHQv9C40YHQutC4JyxcbiAgICAnNTU4NTAxMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiyDQviDRgNC10LfRg9C70YzRgtCw0YLQsNGFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDRg9GH0ZHRgtCwJyxcbiAgICAnNTU4NTAxMDEwMDAwJzogJ9Cg0JXQqNCV0J3QmNCvJyxcbiAgICAnNTU4NTAxMDEwMTAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0LfQsNC/0YDQsNGI0LjQstCw0LXQvNGL0YUg0YHQstC10LTQtdC90LjQuScsXG4gICAgJzU1ODUwMTAxMDIwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L7RiNC40LHQutC4JyxcbiAgICAnNTU4NTAxMDEwMzAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC40YHQv9GA0LDQstC70LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60LgnLFxuICAgICc1NTg1MDEwMTA0MDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0Lgg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQvtGI0LjQsdC+0LonLFxuICAgICc1NTg1MDEwMTA1MDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40Lgg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQv9GA0L7RhtC10LTRg9GA0YsnLFxuICAgICc1NTg1MDEwMTA2MDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QuNC4INC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L/RgNC+0YbQtdC00YPRgNGLJyxcbiAgICAnNTU4NTAxMDEwNzAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINGB0L3Rj9GC0LjQuCDQv9GA0LjQvtGB0YLQsNC90L7QstC70LXQvdC40Y8nLFxuICAgICc1NTg1MDEwMTA4MDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0YHQvdGP0YLQuNC4INGBINC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDRg9GH0ZHRgtCwINC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyINGB0L4g0YHRgtCw0YLRg9GB0L7QvCDCq9Cy0YDQtdC80LXQvdC90YvQtcK7INC/0L4g0LfQsNGP0LLQu9C10L3QuNGOINC30LDQuNC90YLQtdGA0LXRgdC+0LLQsNC90L3QvtCz0L4g0LvQuNGG0LAnLFxuICAgICc1NTg1MDEwMTA5MDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0LLRi9C00LDRh9C1INC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDQv9Cw0YHQv9C+0YDRgtCwJyxcbiAgICAnNTU4NTAxMDExMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40Lgg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQv9GA0L7RhtC10LTRg9GA0YsnLFxuICAgICc1NTg1MDEwMTExMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQsNC90L3Rg9C70LjRgNC+0LLQsNC90LjQuCDQutCw0LTQsNGB0YLRgNC+0LLRi9GFINGB0LLQtdC00LXQvdC40LknLFxuICAgICc1NTg1MDEwMTEyMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtGC0LrQu9C+0L3QtdC90LjQuCDQt9Cw0Y/QstC70LXQvdC40Y8g0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4JyxcbiAgICAnNTU4NTAxMDExMzAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LfQsNC/0LjRgdC4INC+INC90LDQu9C40YfQuNC4INCy0L7Qt9GA0LDQttC10L3QuNGPJyxcbiAgICAnNTU4NTAxMDExNDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC/0L7Qs9Cw0YjQtdC90LjQuCDQt9Cw0L/QuNGB0Lgg0L4g0L3QsNC70LjRh9C40Lgg0LLQvtC30YDQsNC20LXQvdC40Y8nLFxuICAgICc1NTg1MDEwMTE1MDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQt9Cw0L/QuNGB0Lgg0L4g0LfQsNGP0LLQu9C10L3QuNC4INC+INC90LXQstC+0LfQvNC+0LbQvdC+0YHRgtC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4JyxcbiAgICAnNTU4NTAxMDExNjAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC/0L7Qs9Cw0YjQtdC90LjQuCDQt9Cw0L/QuNGB0Lgg0L4g0LfQsNGP0LLQu9C10L3QuNC4INC+INC90LXQstC+0LfQvNC+0LbQvdC+0YHRgtC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4JyxcbiAgICAnNTU4NTAxMDIwMDAwJzogJ9Cj0JLQldCU0J7QnNCb0JXQndCY0K8nLFxuICAgICc1NTg1MDEwMjAxMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINC+0YLRgdGD0YLRgdGC0LLQuNC4INCyINCT0JrQnSDQt9Cw0L/RgNCw0YjQuNCy0LDQtdC80YvRhSDRgdCy0LXQtNC10L3QuNC5JyxcbiAgICAnNTU4NTAxMDIwMjAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQvtGB0YPRidC10YHRgtCy0LvRkdC90L3QvtC8INC60LDQtNCw0YHRgtGA0L7QstC+0Lwg0YPRh9GR0YLQtScsXG4gICAgJzU1ODUwMTAyMDMwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC/0YDQuNC10LzQtSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQtNC70Y8g0LLQvdC10YHQtdC90LjRjyDQsiDQldC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCDQvtCx0YrQtdC60YLQvtCyINC60LDQv9C40YLQsNC70YzQvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCAo0LTQsNC70LXQtSAtINCV0LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAKSDRgdCy0LXQtNC10L3QuNC5INC+0LEg0J7QmtChJyxcbiAgICAnNTU4NTAxMDIwNDAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0L/RgNC40LXQvNC1INC00L7QutGD0LzQtdC90YLQvtCyINC00LvRjyDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNGPINC40Lcg0JXQtNC40L3QvtCz0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YDQtdC10YHRgtGA0LAg0YHQstC10LTQtdC90LjQuSDQvtCxINCe0JrQoScsXG4gICAgJzU1ODUwMTAyMDUwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0YPRgdGC0YDQsNC90LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60Lgg0LIg0YHQstC10LTQtdC90LjRj9GFINCT0JrQnScsXG4gICAgJzU1ODUwMTAyMDYwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINCy0YvQtNCw0YfQtSDRgdCy0LXQtNC10L3QuNC5INC+0LEg0J7QmtChJyxcbiAgICAnNTU4NTAxMDIwNzAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QuNC4INC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L/RgNC+0YbQtdC00YPRgNGLJyxcbiAgICAnNTU4NTAxMDIwODAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40Lgg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQv9GA0L7RhtC10LTRg9GA0YsnLFxuICAgICc1NTg1MDEwMjA5MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCy0LAnLFxuICAgICc1NTg1MDEwMjEwMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQv9GA0LjQvtGB0YLQsNC90L7QstC70LXQvdC40Lgg0L/RgNC40L3Rj9GC0LjRjyDQvdCwINGD0YfRkdGCINC40LzRg9GJ0LXRgdGC0LLQsCDQsiDQutCw0YfQtdGB0YLQstC1INCx0LXRgdGF0L7Qt9GP0LnQvdC+0LPQvicsXG4gICAgJzU1ODUwMTAyMTEwMCc6ICfQodC+0L7QsdGJ0LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0L/RgNC40L3Rj9GC0LjQuCDQvdCwINGD0YfRkdGCINC40LzRg9GJ0LXRgdGC0LLQsCDQsiDQutCw0YfQtdGB0YLQstC1INCx0LXRgdGF0L7Qt9GP0LnQvdC+0LPQvicsXG4gICAgJzU1ODUwMTAyMTIwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INGB0L3Rj9GC0LjQuCDRgSDRg9GH0ZHRgtCwINC40LzRg9GJ0LXRgdGC0LLQsCDQsiDQutCw0YfQtdGB0YLQstC1INCx0LXRgdGF0L7Qt9GP0LnQvdC+0LPQvicsXG4gICAgJzU1ODUwMTAyMTMwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INCy0L7Qt9Cy0YDQsNGC0LUg0LfQsNGP0LLQu9C10L3QuNGPINC+INC90LDQu9C40YfQuNC4INCy0L7Qt9GA0LDQttC10L3QuNGPINCyINC+0YLQvdC+0YjQtdC90LjQuCDQt9Cw0YDQtdCz0LjRgdGC0YDQuNGA0L7QstCw0L3QvdC+0LPQviDQv9GA0LDQstCwINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQsdC10Lcg0YDQsNGB0YHQvNC+0YLRgNC10L3QuNGPJyxcbiAgICAnNTU4NTAxMDMwMDAwJzogJ9Cf0KDQntCn0JjQlScsXG4gICAgJzU1ODUwMTAzMDEwMCc6ICfQoNCw0YHQv9C40YHQutCwINCyINC/0L7Qu9GD0YfQtdC90LjQuCDRgdC+0L7RgtCy0LXRgtGB0YLQstGD0Y7RidC40YUg0LTQvtC60YPQvNC10L3RgtC+0LIg0LTQu9GPINC/0YDQvtCy0LXQtNC10L3QuNGPINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDRg9GH0ZHRgtCwJyxcbiAgICAnNTU4NTAxMDMwMjAwJzogJ9Cf0YDQvtGC0L7QutC+0Lsg0L/RgNC+0LLQtdGA0LrQuCDQtNC+0LrRg9C80LXQvdGC0L7QsicsXG4gICAgJzU1ODUwMTAzMDMwMCc6ICfQkNC60YIg0L7Qv9GA0LXQtNC10LvQtdC90LjRjyDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INGB0YLQvtC40LzQvtGB0YLQuCDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG4gICAgJzU1ODUwMTAzMDQwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INCy0YvRj9Cy0LvQtdC90LjRjyDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCcsXG4gICAgJzU1ODUwMTAzMDUwMCc6ICfQkNC60YIg0L7Qv9GA0LXQtNC10LvQtdC90LjRjyDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INGB0YLQvtC40LzQvtGB0YLQuCDQvtCx0YrQtdC60YLQvtCyINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODUwMTAzOTkwMCc6ICfQmNC90YvQtSDQtNC+0LrRg9C80LXQvdGC0YsnLFxuICAgICc1NTg1MDIwMDAwMDAnOiAn0JTQntCa0KPQnNCV0J3QotCrINCeINCg0JXQl9Cj0JvQrNCi0JDQotCQ0KUg0KDQldCT0JjQodCi0KDQkNCm0JjQmCDQn9Cg0JDQkicsXG4gICAgJzU1ODUwMjAxMDAwMCc6ICfQo9CS0JXQlNCe0JzQm9CV0J3QmNCvLCDQodCe0J7QkdCp0JXQndCY0K8nLFxuICAgICc1NTg1MDIwMTAxMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQv9GA0LjQvtGB0YLQsNC90L7QstC70LXQvdC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LInLFxuICAgICc1NTg1MDIwMTAyMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQv9GA0LXQutGA0LDRidC10L3QuNC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCyJyxcbiAgICAnNTU4NTAyMDEwMzAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LfQsNGA0LXQs9C40YHRgtGA0LjRgNC+0LLQsNC90L3Ri9GFINC+0LPRgNCw0L3QuNGH0LXQvdC40Y/RhSAo0L7QsdGA0LXQvNC10L3QtdC90LjRj9GFKSDQv9GA0LDQsicsXG4gICAgJzU1ODUwMjAxMDQwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LjQt9C80LXQvdC10L3QuNC5INCyINCV0JPQoNCfJyxcbiAgICAnNTU4NTAyMDEwNTAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4INCyINC30LDQv9C40YHRj9GFINC10LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwnLFxuICAgICc1NTg1MDIwMTA2MDAnOiAn0KHQvtC+0LHRidC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCyJyxcbiAgICAnNTU4NTAyMDEwNzAwJzogJ9Ch0L7QvtCx0YnQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGB0LLQtdC00LXQvdC40Lkg0LjQtyDQldCT0KDQnycsXG4gICAgJzU1ODUwMjAxMDgwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgtGB0YPRgtGB0YLQstC40Lgg0LIg0JXQk9Cg0J8g0LfQsNC/0YDQsNGI0LjQstCw0LXQvNGL0YUg0YHQstC10LTQtdC90LjQuScsXG4gICAgJzU1ODUwMjAxMDkwMCc6ICfQodC+0L7QsdGJ0LXQvdC40LUg0L4g0L/RgNC40ZHQvNC1INC30LDRj9Cy0LvQtdC90LjRjyDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQstCwLCDQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKSDQv9GA0LDQstCwINC90LAg0L/RgNC10LTQv9GA0LjRj9GC0LjQtSwg0YHQtNC10LvQutC4INGBINC90LjQvCcsXG4gICAgJzU1ODUwMjAxMTAwMCc6ICfQodC+0L7QsdGJ0LXQvdC40LUg0L4g0L/QvtGB0YLRg9C/0LvQtdC90LjQuCDQtNC+0LrRg9C80LXQvdGC0L7QsiDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YPRjiDRgNC10LPQuNGB0YLRgNCw0YbQuNGOINC00L7Qs9C+0LLQvtGA0L7QsiDQvNC10L3RiyDQuCAo0LjQu9C4KSDQv9C10YDQtdGF0L7QtNCwINC/0YDQsNCy0LAnLFxuICAgICc1NTg1MDIwMTExMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQstC+0LfQstGA0LDRgtC1INC/0YDQuNC70L7QttC10L3QvdGL0YUg0Log0LfQsNGP0LLQu9C10L3QuNGOINC00L7QutGD0LzQtdC90YLQvtCyINCx0LXQtyDRgNCw0YHRgdC80L7RgtGA0LXQvdC40Y8nLFxuICAgICc1NTg1MDIwMTEyMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LXQutGA0LDRidC10L3QuNGPINC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pJyxcbiAgICAnNTU4NTAyMDExMzAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQvtGC0YHRg9GC0YHRgtCy0LjQuCDRgdCy0LXQtNC10L3QuNC5INC+INC70LjRhtCw0YUsINC/0L7Qu9GD0YfQuNCy0YjQuNGFINGB0LLQtdC00LXQvdC40Y8g0L7QsSDQvtCx0YrQtdC60YLQsNGFINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcbiAgICAnNTU4NTAyMDExNDAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LLQsCDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDRgdGD0LHRitC10LrRgtCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQuNC70Lgg0LzRg9C90LjRhtC40L/QsNC70YzQvdC+0LPQviDQvtCx0YDQsNC30L7QstCw0L3QuNGPINC90LAg0LfQtdC80LXQu9GM0L3Ri9C5INGD0YfQsNGB0YLQvtC6INC40LvQuCDQt9C10LzQtdC70YzQvdGD0Y4g0LTQvtC70Y4g0LLRgdC70LXQtNGB0YLQstC40LUg0L7RgtC60LDQt9CwINC+0YIg0YHQvtC+0YLQstC10YLRgdGC0LLRg9GO0YnQtdCz0L4g0L/RgNCw0LLQsCDQv9GA0LDQstC+0L7QsdC70LDQtNCw0YLQtdC70LXQvCcsXG4gICAgJzU1ODUwMjAxMTUwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INC/0L7RgdGC0YPQv9C70LXQvdC40Lgg0YDQtdGI0LXQvdC40Y8g0YHRg9C00LAsINCy0YHRgtGD0L/QuNCy0YjQtdCz0L4g0LIg0LfQsNC60L7QvdC90YPRjiDRgdC40LvRgywg0YEg0YPQutCw0LfQsNC90LjQtdC8INGB0YDQvtC60LAg0L7QutC+0L3Rh9Cw0L3QuNGPINC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNGPINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCyLCDQsiDRgdC70YPRh9Cw0LUg0LXRgdC70Lgg0L7RgtC60LDQtyDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQsiDQv9GA0LjQt9C90LDQvSDRgdGD0LTQvtC8INC90LXQvtCx0L7RgdC90L7QstCw0L3QvdGL0LwnLFxuICAgICc1NTg1MDIwMTE2MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INC40LfQvNC10L3QtdC90LjQuSDQsiDQtdC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8INCyINGB0LLRj9C30Lgg0YEg0LjQt9C80LXQvdC10L3QuNC10Lwg0YHQvtC00LXRgNC20LDRidC40YXRgdGPINCyINCx0LDQt9C+0LLRi9GFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvRhSDQuNC90YTQvtGA0LzQsNGG0LjQvtC90L3Ri9GFINGA0LXRgdGD0YDRgdCw0YUg0YHQstC10LTQtdC90LjQuSDQviDQv9GA0LDQstC+0L7QsdC70LDQtNCw0YLQtdC70LUgKNC/0YDQsNCy0L7QvtCx0LvQsNC00LDRgtC10LvRj9GFKScsXG4gICAgJzU1ODUwMjAxMTcwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INCy0L7Qt9Cy0YDQsNGC0LUg0LTQvtC60YPQvNC10L3RgtC+0LIg0LHQtdC3INGA0LDRgdGB0LzQvtGC0YDQtdC90LjRjyDQv9GA0Lgg0L7RgtC60LDQt9C1INCyINC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDRg9GH0LXRgtCwJyxcbiAgICAnNTU4NTAyMDIwMDAwJzogJ9Cf0KDQntCn0JjQlScsXG4gICAgJzU1ODUwMjAyMDEwMCc6ICfQoNCw0YHQv9C40YHQutCwINCyINC/0L7Qu9GD0YfQtdC90LjQuCDQtNC+0LrRg9C80LXQvdGC0L7QsiDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YPRjiDRgNC10LPQuNGB0YLRgNCw0YbQuNGOINC/0YDQsNCyJyxcbiAgICAnNTU4NTAyMDI5OTAwJzogJ9CY0L3QvtC5INC00L7QutGD0LzQtdC90YInLFxuICAgICc1NTg2MDEwMDAwMDAnOiAn0KDQsNGB0L/QuNGB0LrQsCDQsiDQv9C+0LvRg9GH0LXQvdC40Lgg0LjQt9Cy0LXRidC10L3QuNC5INC+INC/0YDQvtCy0LXQtNC10L3QuNC4INGB0L7QsdGA0LDQvdC40Y8g0L4g0YHQvtCz0LvQsNGB0L7QstCw0L3QuNC4INC80LXRgdGC0L7Qv9C+0LvQvtC20LXQvdC40Y8g0LPRgNCw0L3QuNGGJyxcbiAgICAnNTU4NjAyMDAwMDAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LLRgNGD0YfQtdC90LjQuCDQuNC30LLQtdGJ0LXQvdC40Y8g0L4g0L/RgNC+0LLQtdC00LXQvdC40Lgg0YHQvtCx0YDQsNC90LjRjyDQviDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40Lgg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjRjyDQs9GA0LDQvdC40YYnLFxuICAgICc1NTg2MDMwMDAwMDAnOiAn0JrQvtC/0LjRjyDRgdGC0YDQsNC90LjRhtGLINC/0LXRh9Cw0YLQvdC+0LPQviDQuNC30LTQsNC90LjRjywg0YHQvtC00LXRgNC20LDRidC10Lkg0LjQt9Cy0LXRidC10L3QuNC1INC+INC/0YDQvtCy0LXQtNC10L3QuNC4INGB0L7QsdGA0LDQvdC40Y8g0L4g0YHQvtCz0LvQsNGB0L7QstCw0L3QuNC4INC80LXRgdGC0L7Qv9C+0LvQvtC20LXQvdC40Y8g0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwLCDQstC60LvRjtGH0LDRjyDQv9C10YDQstGL0Lkg0LvQuNGB0YIsINGB0L7QtNC10YDQttCw0YnQtdCz0L4g0YDQtdC60LLQuNC30LjRgtGLINGC0LDQutC+0LPQviDQv9C10YfQsNGC0L3QvtCz0L4g0LjQt9C00LDQvdC40Y8nLFxuICAgICc1NTg2OTkwMDAwMDAnOiAn0JjQvdGL0LUg0LTQvtC60YPQvNC10L3RgtGLLCDRgdCy0LjQtNC10YLQtdC70YzRgdGC0LLRg9GO0YnQuNC1INC+INGB0L7QsdC70Y7QtNC10L3QuNC4INGD0YHRgtCw0L3QvtCy0LvQtdC90L3QvtCz0L4g0L/QvtGA0Y/QtNC60LAg0LjQt9Cy0LXRidC10L3QuNGPINC30LDQuNC90YLQtdGA0LXRgdC+0LLQsNC90L3Ri9GFINC70LjRhiDQviDQv9GA0L7QstC10LTQtdC90LjQuCDRgdC+0LHRgNCw0L3QuNGPINC+INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQuCDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNGPINCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCdcbn07XG4vL9Ci0LXRgNGA0LjRgtC+0YDQuNCw0LvRjNC90YvQtSDQt9C+0L3RiyDQuCDQt9C+0L3RiyDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LlcbnZhciBkWm9uZSA9IHtcbiAgICAnMjE4MDEwMDAwMDAwJzogJ9Ci0LXRgNGA0LjRgtC+0YDQuNCw0LvRjNC90YvQtSDQt9C+0L3RiycsXG4gICAgJzIxODAxMDAxMDAwMCc6ICfQltC40LvQsNGPINC30L7QvdCwJyxcbiAgICAnMjE4MDEwMDIwMDAwJzogJ9Ce0LHRidC10YHRgtCy0LXQvdC90L4t0LTQtdC70L7QstCw0Y8g0LfQvtC90LAnLFxuICAgICcyMTgwMTAwMzAwMDAnOiAn0J/RgNC+0LjQt9Cy0L7QtNGB0YLQstC10L3QvdCw0Y8g0LfQvtC90LAsINC30L7QvdCwINC40L3QttC10L3QtdGA0L3QvtC5INC4INGC0YDQsNC90YHQv9C+0YDRgtC90L7QuSDQuNC90YTRgNCw0YHRgtGA0YPQutGC0YPRgCcsXG4gICAgJzIxODAxMDA0MDAwMCc6ICfQl9C+0L3QsCDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8nLFxuICAgICcyMTgwMTAwNTAwMDAnOiAn0JfQvtC90LAg0YDQtdC60YDQtdCw0YbQuNC+0L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzIxODAxMDA2MDAwMCc6ICfQl9C+0L3QsCDQvtGB0L7QsdC+INC+0YXRgNCw0L3Rj9C10LzRi9GFINGC0LXRgNGA0LjRgtC+0YDQuNC5JyxcbiAgICAnMjE4MDEwMDcwMDAwJzogJ9CX0L7QvdCwINGB0L/QtdGG0LjQsNC70YzQvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzIxODAxMDA4MDAwMCc6ICfQl9C+0L3QsCDRgNCw0LfQvNC10YnQtdC90LjRjyDQstC+0LXQvdC90YvRhSDQvtCx0YrQtdC60YLQvtCyJyxcbiAgICAnMjE4MDEwMDkwMDAwJzogJ9CY0L3QsNGPINC30L7QvdCwJyxcbiAgICAnMjE4MDIwMDAwMDAwJzogJ9CX0L7QvdGLINGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuCcsXG4gICAgJzIxODAyMDAxMDAwMCc6ICfQl9C+0L3RiyDQvtGF0YDQsNC90Ysg0L/RgNC40YDQvtC00L3Ri9GFINC+0LHRitC10LrRgtC+0LInLFxuICAgICcyMTgwMjAwMTAwMDEnOiAn0KLQtdGA0YDQuNGC0L7RgNC40Y8g0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80L7Qs9C+INC/0YDQuNGA0L7QtNC90L7Qs9C+INC+0LHRitC10LrRgtCwJyxcbiAgICAnMjE4MDIwMDEwMDAyJzogJ9Ce0YXRgNCw0L3QvdCw0Y8g0LfQvtC90LAg0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80L7Qs9C+INC/0YDQuNGA0L7QtNC90L7Qs9C+INC+0LHRitC10LrRgtCwJyxcbiAgICAnMjE4MDIwMDEwMDAzJzogJ9CS0L7QtNC+0L7RhdGA0LDQvdC90LDRjyDQt9C+0L3QsCcsXG4gICAgJzIxODAyMDAxMDAwNCc6ICfQn9GA0LjQsdGA0LXQttC90LDRjyDQt9Cw0YnQuNGC0L3QsNGPINC/0L7Qu9C+0YHQsCcsXG4gICAgJzIxODAyMDAxMDAwNSc6ICfQl9C+0L3QsCDRgdCw0L3QuNGC0LDRgNC90L7QuSDQvtGF0YDQsNC90Ysg0LjRgdGC0L7Rh9C90LjQutC+0LIg0LLQvtC00L7RgdC90LDQsdC20LXQvdC40Y8g0Lgg0LLQvtC00L7Qv9GA0L7QstC+0LTQvtCyINC/0LjRgtGM0LXQstC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzIxODAyMDAxMDAwNic6ICfQntGB0L7QsdC+INGG0LXQvdC90YvQtSDQt9C10LzQu9C4JyxcbiAgICAnMjE4MDIwMDIwMDAwJzogJ9CX0L7QvdGLINC+0YXRgNCw0L3RiyDQuNGB0LrRg9GB0YHRgtCy0LXQvdC90YvRhSDQvtCx0YrQtdC60YLQvtCyJyxcbiAgICAnMjE4MDIwMDIwMDAxJzogJ9Ci0LXRgNGA0LjRgtC+0YDQuNGPINC+0LHRitC10LrRgtCwINC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNGB0LvQtdC00LjRjycsXG4gICAgJzIxODAyMDAyMDAwMic6ICfQl9C+0L3QsCDQvtGF0YDQsNC90Ysg0L7QsdGK0LXQutGC0LAg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPJyxcbiAgICAnMjE4MDIwMDIwMDAzJzogJ9Ce0YXRgNCw0L3QvdCw0Y8g0LfQvtC90LAg0LPQtdC+0LTQtdC30LjRh9C10YHQutC+0LPQviDQv9GD0L3QutGC0LAnLFxuICAgICcyMTgwMjAwMjAwMDQnOiAn0J7RhdGA0LDQvdC90LDRjyDQt9C+0L3QsCDRgdGC0LDRhtC40L7QvdCw0YDQvdC+0LPQviDQv9GD0L3QutGC0LAg0L3QsNCx0LvRjtC00LXQvdC40Lkg0LfQsCDRgdC+0YHRgtC+0Y/QvdC40LXQvCDQvtC60YDRg9C20LDRjtGJ0LXQuSDQv9GA0LjRgNC+0LTQvdC+0Lkg0YHRgNC10LTRiycsXG4gICAgJzIxODAyMDAyMDAwNSc6ICfQntGF0YDQsNC90L3QsNGPINC30L7QvdCwINGC0YDQsNC90YHQv9C+0YDRgtCwJyxcbiAgICAnMjE4MDIwMDIwMDA2JzogJ9Ce0YXRgNCw0L3QvdCw0Y8g0LfQvtC90LAg0LjQvdC20LXQvdC10YDQvdGL0YUg0LrQvtC80LzRg9C90LjQutCw0YbQuNC5JyxcbiAgICAnMjE4MDIwMDIwMDA3JzogJ9Ce0YXRgNCw0L3QvdCw0Y8g0LfQvtC90LAg0LvQuNC90LjQuSDQuCDRgdC+0L7RgNGD0LbQtdC90LjQuSDRgdCy0Y/Qt9C4INC4INC70LjQvdC40Lkg0Lgg0YHQvtC+0YDRg9C20LXQvdC40Lkg0YDQsNC00LjQvtGE0LjQutCw0YbQuNC4JyxcbiAgICAnMjE4MDIwMDIwMDA4JzogJ9Cf0YDQuNC00L7RgNC+0LbQvdCw0Y8g0L/QvtC70L7RgdCwJyxcbiAgICAnMjE4MDIwMDMwMDAwJzogJ9CX0L7QvdGLINC30LDRidC40YLRiyDQvdCw0YHQtdC70LXQvdC40Y8nLFxuICAgICcyMTgwMjAwMzAwMDEnOiAn0JfQsNC/0YDQtdGC0L3QsNGPINC30L7QvdCwINC/0YDQuCDQstC+0LXQvdC90L7QvCDRgdC60LvQsNC00LUnLFxuICAgICcyMTgwMjAwMzAwMDInOiAn0JfQsNC/0YDQtdGC0L3Ri9C5INGA0LDQudC+0L0g0L/RgNC4INCy0L7QtdC90L3QvtC8INGB0LrQu9Cw0LTQtScsXG4gICAgJzIxODAyMDAzMDAwMyc6ICfQl9Cw0LPRgNGP0LfQvdC10L3QvdGL0LUg0LfQtdC80LvQuCcsXG4gICAgJzIxODAyMDAzMDAwNCc6ICfQntGF0YDQsNC90L3QsNGPINC30L7QvdCwINC30LDQs9GA0Y/Qt9C90LXQvdC90YvRhSDQt9C10LzQtdC70YwnLFxuICAgICcyMTgwMjAwMzAwMDUnOiAn0KHQsNC90LjRgtCw0YDQvdC+LdC30LDRidC40YLQvdCw0Y8g0LfQvtC90LAg0L/RgNC10LTQv9GA0LjRj9GC0LjQuSwg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsicsXG4gICAgJzIxODAyMDAzMDAwNic6ICfQodCw0L3QuNGC0LDRgNC90YvQuSDRgNCw0LfRgNGL0LIgKNGB0LDQvdC40YLQsNGA0L3QsNGPINC/0L7Qu9C+0YHQsCDQvtGC0YfRg9C20LTQtdC90LjRjyknLFxuICAgICcyMTgwMjAwMzAwMDcnOiAn0JfQvtC90LAg0L7Qs9GA0LDQvdC40YfQtdC90LjRjyDQvtGCINC/0LXRgNC10LTQsNGO0YnQtdCz0L4g0YDQsNC00LjQvtGC0LXRhdC90LjRh9C10YHQutC+0LPQviDQvtCx0YrQtdC60YLQsCcsXG4gICAgJzIxODAyMDAzMDAwOCc6ICfQoNCw0LnQvtC9INC/0LDQtNC10L3QuNGPINC+0YLQtNC10LvRj9GO0YnQuNGF0YHRjyDRh9Cw0YHRgtC10Lkg0YDQsNC60LXRgicsXG4gICAgJzIxODAyMDA0MDAwMCc6ICfQn9GA0L7Rh9C40LUg0LfQvtC90Ysg0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC4JyxcbiAgICAnMjE4MDIwMDQwMDAxJzogJ9CX0L7QvdCwINC/0YPQsdC70LjRh9C90L7Qs9C+INGB0LXRgNCy0LjRgtGD0YLQsCcsXG4gICAgJzIxODAyMDA0MDAwMic6ICfQl9C+0L3QsCDRgNC10LfQtdGA0LLQuNGA0L7QstCw0L3QuNGPINC30LXQvNC10LvRjCcsXG4gICAgJzIxODAyMDA0MDAwMyc6ICfQk9C+0YDQvdGL0Lkg0L7RgtCy0L7QtCcsXG4gICAgJzIxODAyMDA0MDAwNCc6ICfQn9GA0LjQs9C+0YDQvtC00L3QsNGPINC30L7QvdCwJyxcbiAgICAnMjE4MDIwMDQwMDA1JzogJ9CX0LXQu9C10L3QsNGPINC30L7QvdCwJyxcbiAgICAnMjE4MDIwMDQwMDA2JzogJ9Ce0YHQvtCx0LDRjyDRjdC60L7QvdC+0LzQuNGH0LXRgdC60LDRjyDQt9C+0L3QsCcsXG4gICAgJzIxODAyMDA0MDAwNyc6ICfQn9C+0LPRgNCw0L3QuNGH0L3QsNGPINC30L7QvdCwJyxcbiAgICAnMjE4MDIwMDQwMDA4JzogJ9Ci0LXRgNGA0LjRgtC+0YDQuNGPINGC0YDQsNC00LjRhtC40L7QvdC90L7Qs9C+INC/0YDQuNGA0L7QtNC+0L/QvtC70YzQt9C+0LLQsNC90LjRjycsXG4gICAgJzIxODAyMDA1MDAwMCc6ICfQmNC90YvQtSDQt9C+0L3RiyDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LgnLFxuICAgICcyMTgwMjAwNTAwMDEnOiAn0JjQvdCw0Y8g0LfQvtC90LAg0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC4J1xufTtcbi8vINCa0LvQsNGB0YHQuNGE0LjQutCw0YLQvtGAINCy0LjQtNC+0LIg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0LfQtdC80LXQu9GMXG52YXIgZFV0aWxpemF0aW9ucyA9IHtcbiAgICAnMTQxMDAwMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjyDQuCDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3Ri9GFINGD0LPQvtC00LjQuScsXG4gICAgJzE0MTAwMTAwMDAwMCc6ICfQlNC70Y8g0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC/0YDQvtC40LfQstC+0LTRgdGC0LLQsCcsXG4gICAgJzE0MTAwMTAxMDAwMCc6ICfQlNC70Y8g0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0LIg0LrQsNGH0LXRgdGC0LLQtSDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3Ri9GFINGD0LPQvtC00LjQuScsXG4gICAgJzE0MTAwMTAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LfQtNCw0L3QuNC5LCDRgdGC0YDQvtC10L3QuNC5LCDRgdC+0L7RgNGD0LbQtdC90LjQuSwg0LjRgdC/0L7Qu9GM0LfRg9C10LzRi9GFINC00LvRjyDQv9GA0L7QuNC30LLQvtC00YHRgtCy0LAsINGF0YDQsNC90LXQvdC40Y8g0Lgg0L/QtdGA0LLQuNGH0L3QvtC5INC/0LXRgNC10YDQsNCx0L7RgtC60Lgg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7QuSDQv9GA0L7QtNGD0LrRhtC40LgnLFxuICAgICcxNDEwMDEwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCy0L3Rg9GC0YDQuNGF0L7Qt9GP0LnRgdGC0LLQtdC90L3Ri9GFINC00L7RgNC+0LMg0Lgg0LrQvtC80LzRg9C90LjQutCw0YbQuNC5JyxcbiAgICAnMTQxMDAxMDQwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQstC+0LTQvdGL0YUg0L7QsdGK0LXQutGC0L7QsicsXG4gICAgJzE0MTAwMjAwMDAwMCc6ICfQlNC70Y8g0LLQtdC00LXQvdC40Y8g0LrRgNC10YHRgtGM0Y/QvdGB0LrQvtCz0L4gKNGE0LXRgNC80LXRgNGB0LrQvtCz0L4pINGF0L7Qt9GP0LnRgdGC0LLQsCcsXG4gICAgJzE0MTAwMzAwMDAwMCc6ICfQlNC70Y8g0LLQtdC00LXQvdC40Y8g0LvQuNGH0L3QvtCz0L4g0L/QvtC00YHQvtCx0L3QvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcbiAgICAnMTQxMDA0MDAwMDAwJzogJ9CU0LvRjyDQstC10LTQtdC90LjRjyDQs9GA0LDQttC00LDQvdCw0LzQuCDRgdCw0LTQvtCy0L7QtNGB0YLQstCwINC4INC+0LPQvtGA0L7QtNC90LjRh9C10YHRgtCy0LAnLFxuICAgICcxNDEwMDUwMDAwMDAnOiAn0JTQu9GPINCy0LXQtNC10L3QuNGPINCz0YDQsNC20LTQsNC90LDQvNC4INC20LjQstC+0YLQvdC+0LLQvtC00YHRgtCy0LAnLFxuICAgICcxNDEwMDYwMDAwMDAnOiAn0JTQu9GPINC00LDRh9C90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwJyxcbiAgICAnMTQxMDA3MDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQtNGA0LXQstC10YHQvdC+LdC60YPRgdGC0LDRgNC90LjQutC+0LLQvtC5INGA0LDRgdGC0LjRgtC10LvRjNC90L7RgdGC0LgsINC/0YDQtdC00L3QsNC30L3QsNGH0LXQvdC90L7QuSDQtNC70Y8g0LfQsNGJ0LjRgtGLINC30LXQvNC10LvRjCDQvtGCINCy0L7Qt9C00LXQudGB0YLQstC40Y8g0L3QtdCz0LDRgtC40LLQvdGL0YUgKNCy0YDQtdC00L3Ri9GFKSDQv9GA0LjRgNC+0LTQvdGL0YUsINCw0L3RgtGA0L7Qv9C+0LPQtdC90L3Ri9GFINC4INGC0LXRhdC90L7Qs9C10L3QvdGL0YUg0Y/QstC70LXQvdC40LknLFxuICAgICcxNDEwMDgwMDAwMDAnOiAn0JTQu9GPINC90LDRg9GH0L3Qvi3QuNGB0YHQu9C10LTQvtCy0LDRgtC10LvRjNGB0LrQuNGFINGG0LXQu9C10LknLFxuICAgICcxNDEwMDkwMDAwMDAnOiAn0JTQu9GPINGD0YfQtdCx0L3Ri9GFINGG0LXQu9C10LknLFxuICAgICcxNDEwMTAwMDAwMDAnOiAn0JTQu9GPINGB0LXQvdC+0LrQvtGI0LXQvdC40Y8g0Lgg0LLRi9C/0LDRgdCwINGB0LrQvtGC0LAg0LPRgNCw0LbQtNCw0L3QsNC80LgnLFxuICAgICcxNDEwMTEwMDAwMDAnOiAn0KTQvtC90LQg0L/QtdGA0LXRgNCw0YHQv9GA0LXQtNC10LvQtdC90LjRjycsXG4gICAgJzE0MTAxMjAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQvtGF0L7RgtC90LjRh9GM0LXQs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG4gICAgJzE0MTAxMzAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgNGL0LHQvdC+0LPQviDRhdC+0LfRj9C50YHRgtCy0LAnLFxuICAgICcxNDEwMTQwMDAwMDAnOiAn0JTQu9GPINC40L3Ri9GFINCy0LjQtNC+0LIg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPJyxcbiAgICAnMTQyMDAwMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyLCDRhdCw0YDQsNC60YLQtdGA0L3Ri9GFINC00LvRjyDQvdCw0YHQtdC70ZHQvdC90YvRhSDQv9GD0L3QutGC0L7QsicsXG4gICAgJzE0MjAwMTAwMDAwMCc6ICfQlNC70Y8g0L7QsdGK0LXQutGC0L7QsiDQttC40LvQvtC5INC30LDRgdGC0YDQvtC50LrQuCcsXG4gICAgJzE0MjAwMTAxMDAwMCc6ICfQlNC70Y8g0LjQvdC00LjQstC40LTRg9Cw0LvRjNC90L7QuSDQttC40LvQvtC5INC30LDRgdGC0YDQvtC50LrQuCcsXG4gICAgJzE0MjAwMTAyMDAwMCc6ICfQlNC70Y8g0LzQvdC+0LPQvtC60LLQsNGA0YLQuNGA0L3QvtC5INC30LDRgdGC0YDQvtC50LrQuCcsXG4gICAgJzE0MjAwMTAyMDEwMCc6ICfQlNC70Y8g0LzQsNC70L7RjdGC0LDQttC90L7QuSDQt9Cw0YHRgtGA0L7QudC60LgnLFxuICAgICcxNDIwMDEwMjAyMDAnOiAn0JTQu9GPINGB0YDQtdC00L3QtdGN0YLQsNC20L3QvtC5INC30LDRgdGC0YDQvtC50LrQuCcsXG4gICAgJzE0MjAwMTAyMDMwMCc6ICfQlNC70Y8g0LzQvdC+0LPQvtGN0YLQsNC20L3QvtC5INC30LDRgdGC0YDQvtC50LrQuCcsXG4gICAgJzE0MjAwMTAyMDQwMCc6ICfQlNC70Y8g0LjQvdGL0YUg0LLQuNC00L7QsiDQttC40LvQvtC5INC30LDRgdGC0YDQvtC50LrQuCcsXG4gICAgJzE0MjAwMTAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQtNC+0YjQutC+0LvRjNC90L7Qs9C+LCDQvdCw0YfQsNC70YzQvdC+0LPQviwg0L7QsdGJ0LXQs9C+INC4INGB0YDQtdC00L3QtdCz0L4gKNC/0L7Qu9C90L7Qs9C+KSDQvtCx0YnQtdCz0L4g0L7QsdGA0LDQt9C+0LLQsNC90LjRjycsXG4gICAgJzE0MjAwMTA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7Qsiwg0LTQvtC/0YPRgdGC0LjQvNGL0YUg0LIg0LbQuNC70YvRhSDQt9C+0L3QsNGFINC4INC90LUg0L/QtdGA0LXRh9C40YHQu9C10L3QvdGL0YUg0LIg0LrQu9Cw0YHRgdC40YTQuNC60LDRgtC+0YDQtScsXG4gICAgJzE0MjAwMjAwMDAwMCc6ICfQlNC70Y8g0L7QsdGK0LXQutGC0L7QsiDQvtCx0YnQtdGB0YLQstC10L3QvdC+LdC00LXQu9C+0LLQvtCz0L4g0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzE0MjAwMjAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgdC+0YbQuNCw0LvRjNC90L7Qs9C+INC4INC60L7QvNC80YPQvdCw0LvRjNC90L4t0LHRi9GC0L7QstC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzE0MjAwMjAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQt9C00YDQsNCy0L7QvtGF0YDQsNC90LXQvdC40Y8nLFxuICAgICcxNDIwMDIwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LrRg9C70YzRgtGD0YDRiycsXG4gICAgJzE0MjAwMjA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgtC+0YDQs9C+0LLQu9C4JyxcbiAgICAnMTQyMDAyMDQwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGA0L7Qt9C90LjRh9C90L7QuSDRgtC+0YDQs9C+0LLQu9C4JyxcbiAgICAnMTQyMDAyMDQwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC+0L/RgtC+0LLQvtC5INGC0L7RgNCz0L7QstC70LgnLFxuICAgICcxNDIwMDIwNTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0L7QsdGJ0LXRgdGC0LLQtdC90L3QvtCz0L4g0L/QuNGC0LDQvdC40Y8nLFxuICAgICcxNDIwMDIwNjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0L/RgNC10LTQv9GA0LjQvdC40LzQsNGC0LXQu9GM0YHQutC+0Lkg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4JyxcbiAgICAnMTQyMDAyMDcwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGB0YDQtdC00L3QtdCz0L4g0L/RgNC+0YTQtdGB0YHQuNC+0L3QsNC70YzQvdC+0LPQviDQuCDQstGL0YHRiNC10LPQviDQv9GA0L7RhNC10YHRgdC40L7QvdCw0LvRjNC90L7Qs9C+INC+0LHRgNCw0LfQvtCy0LDQvdC40Y8nLFxuICAgICcxNDIwMDIwODAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCw0LTQvNC40L3QuNGB0YLRgNCw0YLQuNCy0L3Ri9GFINC30LTQsNC90LjQuScsXG4gICAgJzE0MjAwMjA5MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L3QsNGD0YfQvdC+LdC40YHRgdC70LXQtNC+0LLQsNGC0LXQu9GM0YHQutC40YUg0YPRh9GA0LXQttC00LXQvdC40LknLFxuICAgICcxNDIwMDIxMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60YPQu9GM0YLQvtCy0YvRhSDQt9C00LDQvdC40LknLFxuICAgICcxNDIwMDIxMTAwMDAnOiAn0JTQu9GPINGB0YLQvtGP0L3QvtC6INCw0LLRgtC+0LzQvtCx0LjQu9GM0L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuICAgICcxNDIwMDIxMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LTQtdC70L7QstC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjywg0LIg0YLQvtC8INGH0LjRgdC70LUg0L7RhNC40YHQvdGL0YUg0YbQtdC90YLRgNC+0LInLFxuICAgICcxNDIwMDIxMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YTQuNC90LDQvdGB0L7QstC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzE0MjAwMjE0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LPQvtGB0YLQuNC90LjRhicsXG4gICAgJzE0MjAwMjE1MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/QvtC00LfQtdC80L3Ri9GFINC40LvQuCDQvNC90L7Qs9C+0Y3RgtCw0LbQvdGL0YUg0LPQsNGA0LDQttC10LknLFxuICAgICcxNDIwMDIxNjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3QtNC40LLQuNC00YPQsNC70YzQvdGL0YUg0LPQsNGA0LDQttC10LknLFxuICAgICcxNDIwMDIxNzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0L7QsdGJ0LXRgdGC0LLQtdC90L3Qvi3QtNC10LvQvtCy0L7Qs9C+INC30L3QsNGH0LXQvdC40Y8sINC+0LHQtdGB0L/QtdGH0LjQstCw0Y7RidC40YUg0LbQuNC30L3RjCDQs9GA0LDQttC00LDQvScsXG4gICAgJzE0MjAwMzAwMDAwMCc6ICfQlNC70Y8g0L7QsdGJ0LXQs9C+INC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8gKNGD0LvQuNGH0L3QsNGPINGB0LXRgtGMKScsXG4gICAgJzE0MjAwNDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgdC/0LXRhtC40LDQu9GM0L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcxNDIwMDQwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60LvQsNC00LHQuNGJJyxcbiAgICAnMTQyMDA0MDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutGA0LXQvNCw0YLQvtGA0LjQtdCyJyxcbiAgICAnMTQyMDA0MDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRgdC60L7RgtC+0LzQvtCz0LjQu9GM0L3QuNC60L7QsicsXG4gICAgJzE0MjAwNDA0MDAwMCc6ICfQn9C+0LQg0L7QsdGK0LXQutGC0LDQvNC4INGA0LDQt9C80LXRidC10L3QuNGPINC+0YLRhdC+0LTQvtCyINC/0L7RgtGA0LXQsdC70LXQvdC40Y8nLFxuICAgICcxNDIwMDQwNTAwMDAnOiAn0J/QvtC0INC40L3Ri9C80Lgg0L7QsdGK0LXQutGC0LDQvNC4INGB0L/QtdGG0LjQsNC70YzQvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzE0MjAwNTAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LrQvtC80LzRg9C90LDQu9GM0L3Ri9GFLCDRgdC60LvQsNC00YHQutC40YUg0L7QsdGK0LXQutGC0L7QsicsXG4gICAgJzE0MjAwNjAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQttC40LvQuNGJ0L3Qvi3QutC+0LzQvNGD0L3QsNC70YzQvdC+0LPQviDRhdC+0LfRj9C50YHRgtCy0LAnLFxuICAgICcxNDIwMDcwMDAwMDAnOiAn0JTQu9GPINC40L3Ri9GFINCy0LjQtNC+0LIg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8sINGF0LDRgNCw0LrRgtC10YDQvdGL0YUg0LTQu9GPINC90LDRgdC10LvRkdC90L3Ri9GFINC/0YPQvdC60YLQvtCyJyxcbiAgICAnMTQzMDAwMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC/0YDQvtC80YvRiNC70LXQvdC90L7RgdGC0LgsINGN0L3QtdGA0LPQtdGC0LjQutC4LCDRgtGA0LDQvdGB0L/QvtGA0YLQsCwg0YHQstGP0LfQuCwg0YDQsNC00LjQvtCy0LXRidCw0L3QuNGPLCDRgtC10LvQtdCy0LjQtNC10L3QuNGPLCDQuNC90YTQvtGA0LzQsNGC0LjQutC4LCDQvtCx0LXRgdC/0LXRh9C10L3QuNGPINC60L7RgdC80LjRh9C10YHQutC+0Lkg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4LCDQvtCx0L7RgNC+0L3Riywg0LHQtdC30L7Qv9Cw0YHQvdC+0YHRgtC4INC4INC40L3QvtCz0L4g0YHQv9C10YbQuNCw0LvRjNC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcbiAgICAnMTQzMDAxMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9GA0L7QvNGL0YjQu9C10L3QvdGL0YUg0L7QsdGK0LXQutGC0L7QsicsXG4gICAgJzE0MzAwMTAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/RgNC+0LjQt9Cy0L7QtNGB0YLQstC10L3QvdGL0YUg0Lgg0LDQtNC80LjQvdC40YHRgtGA0LDRgtC40LLQvdGL0YUg0LfQtNCw0L3QuNC5LCDRgdGC0YDQvtC10L3QuNC5LCDRgdC+0L7RgNGD0LbQtdC90LjQuSDQuCDQvtCx0YHQu9GD0LbQuNCy0LDRjtGJ0LjRhSDQuNGFINC+0LHRitC10LrRgtC+0LInLFxuICAgICcxNDMwMDEwMTAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0YDQvtC40LfQstC+0LTRgdGC0LLQtdC90L3Ri9GFINC30LTQsNC90LjQuScsXG4gICAgJzE0MzAwMTAxMDIwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LrQvtC80LzRg9C90LjQutCw0YbQuNC5JyxcbiAgICAnMTQzMDAxMDEwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9C+0LTRitC10LfQtNC90YvRhSDQv9GD0YLQtdC5JyxcbiAgICAnMTQzMDAxMDEwNDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRgdC60LvQsNC00YHQutC40YUg0L/QvtC80LXRidC10L3QuNC5JyxcbiAgICAnMTQzMDAxMDEwNTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsNC00LzQuNC90LjRgdGC0YDQsNGC0LjQstC90YvRhSDQt9C00LDQvdC40LknLFxuICAgICcxNDMwMDEwMTA2MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60YPQu9GM0YLRg9GA0L3Qvi3QsdGL0YLQvtCy0YvRhSDQt9C00LDQvdC40LknLFxuICAgICcxNDMwMDEwMTA3MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINGB0L7QvtGA0YPQttC10L3QuNC5INC/0YDQvtC80YvRiNC70LXQvdC90L7RgdGC0LgnLFxuICAgICcxNDMwMDEwMjAwMDAnOiAn0JTQu9GPINC00L7QsdGL0YfQuCDQuCDRgNCw0LfRgNCw0LHQvtGC0LrQuCDQv9C+0LvQtdC30L3Ri9GFINC40YHQutC+0L/QsNC10LzRi9GFJyxcbiAgICAnMTQzMDAxMDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC/0YDQvtC80YvRiNC70LXQvdC90L7RgdGC0LgnLFxuICAgICcxNDMwMDIwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0Y3QvdC10YDQs9C10YLQuNC60LgnLFxuICAgICcxNDMwMDIwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGN0LvQtdC60YLRgNC+0YHRgtCw0L3RhtC40Lkg0Lgg0L7QsdGB0LvRg9C20LjQstCw0Y7RidC40YUg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0L7QsdGK0LXQutGC0L7QsicsXG4gICAgJzE0MzAwMjAxMDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LPQuNC00YDQvtGN0LvQtdC60YLRgNC+0YHRgtCw0L3RhtC40LknLFxuICAgICcxNDMwMDIwMTAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCw0YLQvtC80L3Ri9GFINGB0YLQsNC90YbQuNC5JyxcbiAgICAnMTQzMDAyMDEwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRj9C00LXRgNC90YvRhSDRg9GB0YLQsNC90L7QstC+0LonLFxuICAgICcxNDMwMDIwMTA0MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0YPQvdC60YLQvtCyINGF0YDQsNC90LXQvdC40Y8g0Y/QtNC10YDQvdGL0YUg0LzQsNGC0LXRgNC40LDQu9C+0LIg0Lgg0YDQsNC00LjQvtCw0LrRgtC40LLQvdGL0YUg0LLQtdGJ0LXRgdGC0LIg0Y3QvdC10YDQs9C10YLQuNC60LgnLFxuICAgICcxNDMwMDIwMTA1MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGF0YDQsNC90LjQu9C40Ykg0YDQsNC00LjQvtCw0LrRgtC40LLQvdGL0YUg0L7RgtGF0L7QtNC+0LInLFxuICAgICcxNDMwMDIwMTA2MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGC0LXQv9C70L7QstGL0YUg0YHRgtCw0L3RhtC40LknLFxuICAgICcxNDMwMDIwMTA3MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINGC0LjQv9C+0LIg0Y3Qu9C10LrRgtGA0L7RgdGC0LDQvdGG0LjQuScsXG4gICAgJzE0MzAwMjAxMDgwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGB0LvRg9C20LjQstCw0Y7RidC40YUg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0L7QsdGK0LXQutGC0L7QsicsXG4gICAgJzE0MzAwMjAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRjdC70LXQutGC0YDQvtGB0LXRgtC10LLQvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcbiAgICAnMTQzMDAyMDIwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQstC+0LfQtNGD0YjQvdGL0YUg0LvQuNC90LjQuSDRjdC70LXQutGC0YDQvtC/0LXRgNC10LTQsNGH0LgnLFxuICAgICcxNDMwMDIwMjAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC90LDQt9C10LzQvdGL0YUg0YHQvtC+0YDRg9C20LXQvdC40Lkg0LrQsNCx0LXQu9GM0L3Ri9GFINC70LjQvdC40Lkg0Y3Qu9C10LrRgtGA0L7Qv9C10YDQtdC00LDRh9C4JyxcbiAgICAnMTQzMDAyMDIwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9C+0LTRgdGC0LDQvdGG0LjQuScsXG4gICAgJzE0MzAwMjAyMDQwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YDQsNGB0L/RgNC10LTQtdC70LjRgtC10LvRjNC90YvRhSDQv9GD0L3QutGC0L7QsicsXG4gICAgJzE0MzAwMjAyMDUwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LTRgNGD0LPQuNGFINGB0L7QvtGA0YPQttC10L3QuNC5INC4INC+0LHRitC10LrRgtC+0LIg0Y3Qu9C10LrRgtGA0L7RgdC10YLQtdCy0L7Qs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG4gICAgJzE0MzAwMjAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDRjdC90LXRgNCz0LXRgtC40LrQuCcsXG4gICAgJzE0MzAwMzAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG4gICAgJzE0MzAwMzAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0Lgg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4INC+0LHRitC10LrRgtC+0LIg0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuICAgICcxNDMwMDMwMTAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90YvRhSDQv9GD0YLQtdC5INC4INC40YUg0LrQvtC90YHRgtGA0YPQutGC0LjQstC90YvRhSDRjdC70LXQvNC10L3RgtC+0LInLFxuICAgICcxNDMwMDMwMTAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0L7Qu9C+0YEg0L7RgtCy0L7QtNCwINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90YvRhSDQv9GD0YLQtdC5JyxcbiAgICAnMTQzMDAzMDEwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjywg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4LCDRgNCw0YHRiNC40YDQtdC90LjRjyDQuCDRgNC10LrQvtC90YHRgtGA0YPQutGG0LjQuCDRgdGC0YDQvtC10L3QuNC5LCDQt9C00LDQvdC40LksINGB0L7QvtGA0YPQttC10L3QuNC5LCDQsiDRgtC+0Lwg0YfQuNGB0LvQtSDQttC10LvQtdC30L3QvtC00L7RgNC+0LbQvdGL0YUg0LLQvtC60LfQsNC70L7Qsiwg0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3Ri9GFINGB0YLQsNC90YbQuNC5LCDQsCDRgtCw0LrQttC1INGD0YHRgtGA0L7QudGB0YLQsiDQuCDQtNGA0YPQs9C40YUg0L7QsdGK0LXQutGC0L7Qsiwg0L3QtdC+0LHRhdC+0LTQuNC80YvRhSDQtNC70Y8g0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4LCDRgdC+0LTQtdGA0LbQsNC90LjRjywg0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAsINGA0LXQutC+0L3RgdGC0YDRg9C60YbQuNC4LCDRgNC10LzQvtC90YLQsCwg0YDQsNC30LLQuNGC0LjRjyDQvdCw0LfQtdC80L3Ri9GFINC4INC/0L7QtNC30LXQvNC90YvRhSDQt9C00LDQvdC40LksINGB0YLRgNC+0LXQvdC40LksINGB0L7QvtGA0YPQttC10L3QuNC5LCDRg9GB0YLRgNC+0LnRgdGC0LIg0Lgg0LTRgNGD0LPQuNGFINC+0LHRitC10LrRgtC+0LIg0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuICAgICcxNDMwMDMwMTAzMDEnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90YvRhSDQstC+0LrQt9Cw0LvQvtCyJyxcbiAgICAnMTQzMDAzMDEwMzAyJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQttC10LvQtdC30L3QvtC00L7RgNC+0LbQvdGL0YUg0YHRgtCw0L3RhtC40LknLFxuICAgICcxNDMwMDMwMTAzMDMnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGD0YHRgtGA0L7QudGB0YLQsiDQuCDQtNGA0YPQs9C40YUg0L7QsdGK0LXQutGC0L7Qsiwg0L3QtdC+0LHRhdC+0LTQuNC80YvRhSDQtNC70Y8g0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4LCDRgdC+0LTQtdGA0LbQsNC90LjRjywg0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAsINGA0LXQutC+0L3RgdGC0YDRg9C60YbQuNC4LCDRgNC10LzQvtC90YLQsCwg0YDQsNC30LLQuNGC0LjRjyDQvdCw0LfQtdC80L3Ri9GFINC4INC/0L7QtNC30LXQvNC90YvRhSDQt9C00LDQvdC40LksINGB0YLRgNC+0LXQvdC40LksINGB0L7QvtGA0YPQttC10L3QuNC5LCDRg9GB0YLRgNC+0LnRgdGC0LIg0Lgg0LTRgNGD0LPQuNGFINC+0LHRitC10LrRgtC+0LIg0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuICAgICcxNDMwMDMwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC4INGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCDQvtCx0YrQtdC60YLQvtCyINCw0LLRgtC+0LzQvtCx0LjQu9GM0L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAg0Lgg0L7QsdGK0LXQutGC0L7QsiDQtNC+0YDQvtC20L3QvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcbiAgICAnMTQzMDAzMDIwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsNCy0YLQvtC80L7QsdC40LvRjNC90YvRhSDQtNC+0YDQvtCzINC4INC40YUg0LrQvtC90YHRgtGA0YPQutGC0LjQstC90YvRhSDRjdC70LXQvNC10L3RgtC+0LInLFxuICAgICcxNDMwMDMwMjAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0L7Qu9C+0YEg0L7RgtCy0L7QtNCwJyxcbiAgICAnMTQzMDAzMDIwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC00L7RgNC+0LbQvdC+0LPQviDRgdC10YDQstC40YHQsCDQsiDQv9C+0LvQvtGB0LDRhSDQvtGC0LLQvtC00LAg0LDQstGC0L7QvNC+0LHQuNC70YzQvdGL0YUg0LTQvtGA0L7QsycsXG4gICAgJzE0MzAwMzAyMDQwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LTQvtGA0L7QttC90YvRhSDRgdC+0L7RgNGD0LbQtdC90LjQuScsXG4gICAgJzE0MzAwMzAyMDUwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LDQstGC0L7QstC+0LrQt9Cw0LvQvtCyINC4INCw0LLRgtC+0YHRgtCw0L3RhtC40LknLFxuICAgICcxNDMwMDMwMjA2MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0LDQstGC0L7QvNC+0LHQuNC70YzQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCDQuCDQtNC+0YDQvtC20L3QvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcbiAgICAnMTQzMDAzMDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuCDRjdC60YHQv9C70YPQsNGC0LDRhtC40Lgg0L7QsdGK0LXQutGC0L7QsiDQvNC+0YDRgdC60L7Qs9C+LCDQstC90YPRgtGA0LXQvdC90LXQs9C+INCy0L7QtNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcbiAgICAnMTQzMDAzMDMwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNGB0LrRg9GB0YHRgtCy0LXQvdC90L4g0YHQvtC30LTQsNC90L3Ri9GFINCy0L3Rg9GC0YDQtdC90L3QuNGFINCy0L7QtNC90YvRhSDQv9GD0YLQtdC5JyxcbiAgICAnMTQzMDAzMDMwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvNC+0YDRgdC60LjRhSDQuCDRgNC10YfQvdGL0YUg0L/QvtGA0YLQvtCyLCDQv9GA0LjRh9Cw0LvQvtCyLCDQv9GA0LjRgdGC0LDQvdC10LknLFxuICAgICcxNDMwMDMwMzAzMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0LzQvtGA0YHQutC+0LPQviwg0LLQvdGD0YLRgNC10L3QvdC10LPQviDQstC+0LTQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG4gICAgJzE0MzAwMzAzMDQwMCc6ICfQlNC70Y8g0LLRi9C00LXQu9C10L3QuNGPINCx0LXRgNC10LPQvtCy0L7QuSDQv9C+0LvQvtGB0YsnLFxuICAgICcxNDMwMDMwNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC4INGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCDQvtCx0YrQtdC60YLQvtCyINCy0L7Qt9C00YPRiNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcbiAgICAnMTQzMDAzMDQwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsNGN0YDQvtC/0L7RgNGC0L7QsiDQuCDQsNGN0YDQvtC00YDQvtC80L7QsicsXG4gICAgJzE0MzAwMzA0MDIwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LDRjdGA0L7QstC+0LrQt9Cw0LvQvtCyJyxcbiAgICAnMTQzMDAzMDQwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQstC30LvQtdGC0L3Qvi3Qv9C+0YHQsNC00L7Rh9C90YvRhSDQv9C+0LvQvtGBJyxcbiAgICAnMTQzMDAzMDQwNDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvdCw0LfQtdC80L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0LLQvtC30LTRg9GI0L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuICAgICcxNDMwMDMwNTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC4INGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCDQvtCx0YrQtdC60YLQvtCyINGC0YDRg9Cx0L7Qv9GA0L7QstC+0LTQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG4gICAgJzE0MzAwMzA1MDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L3QtdGE0YLQtdC/0YDQvtCy0L7QtNC+0LInLFxuICAgICcxNDMwMDMwNTAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCz0LDQt9C+0L/RgNC+0LLQvtC00L7QsicsXG4gICAgJzE0MzAwMzA1MDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0YLRgNGD0LHQvtC/0YDQvtCy0L7QtNC+0LInLFxuICAgICcxNDMwMDMwNTA0MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0YLRgNGD0LHQvtC/0YDQvtCy0L7QtNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcbiAgICAnMTQzMDAzMDYwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuCDRjdC60YHQv9C70YPQsNGC0LDRhtC40Lgg0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG4gICAgJzE0MzAwNDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgdCy0Y/Qt9C4LCDRgNCw0LTQuNC+0LLQtdGJ0LDQvdC40Y8sINGC0LXQu9C10LLQuNC00LXQvdC40Y8sINC40L3RhNC+0YDQvNCw0YLQuNC60LgnLFxuICAgICcxNDMwMDQwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQvtC90L3Ri9GFINC/0YDQtdC00L/RgNC40Y/RgtC40Lkg0YHQstGP0LfQuCDQuCDQvtCx0YHQu9GD0LbQuNCy0LDQvdC40Y8g0LvQuNC90LjQuSDRgdCy0Y/Qt9C4JyxcbiAgICAnMTQzMDA0MDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutCw0LHQtdC70YzQvdGL0YUsINGA0LDQtNC40L7RgNC10LvQtdC50L3Ri9GFINC4INCy0L7Qt9C00YPRiNC90YvRhSDQu9C40L3QuNC5INGB0LLRj9C30Lgg0Lgg0LvQuNC90LjQuSDRgNCw0LTQuNC+0YTQuNC60LDRhtC40Lgg0L3QsCDRgtGA0LDRgdGB0LDRhSDQutCw0LHQtdC70YzQvdGL0YUg0Lgg0LLQvtC30LTRg9GI0L3Ri9GFINC70LjQvdC40Lkg0YHQstGP0LfQuCDQuCDRgNCw0LTQuNC+0YTQuNC60LDRhtC40Lgg0Lgg0LjRhSDQvtGF0YDQsNC90L3Ri9C1INC30L7QvdGLJyxcbiAgICAnMTQzMDA0MDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9C+0LTQt9C10LzQvdGL0YUg0LrQsNCx0LXQu9GM0L3Ri9GFINC4INCy0L7Qt9C00YPRiNC90YvRhSDQu9C40L3QuNC5INGB0LLRj9C30Lgg0Lgg0YDQsNC00LjQvtGE0LjQutCw0YbQuNC4INC4INC40YUg0L7RhdGA0LDQvdC90YvQtSDQt9C+0L3RiycsXG4gICAgJzE0MzAwNDA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L3QsNC30LXQvNC90YvRhSDQuCDQv9C+0LTQt9C10LzQvdGL0YUg0L3QtdC+0LHRgdC70YPQttC40LLQsNC10LzRi9GFINGD0YHQuNC70LjRgtC10LvRjNC90YvRhSDQv9GD0L3QutGC0L7QsiDQvdCwINC60LDQsdC10LvRjNC90YvRhSDQu9C40L3QuNGP0YUg0YHQstGP0LfQuCDQuCDQuNGFINC+0YXRgNCw0L3QvdGL0LUg0LfQvtC90YsnLFxuICAgICcxNDMwMDQwNTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC90LDQt9C10LzQvdGL0YUg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0LjQvdGE0YDQsNGB0YLRgNGD0LrRgtGD0YAg0YHQv9GD0YLQvdC40LrQvtCy0L7QuSDRgdCy0Y/Qt9C4JyxcbiAgICAnMTQzMDA0MDYwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINGB0LLRj9C30LgsINGA0LDQtNC40L7QstC10YnQsNC90LjRjywg0YLQtdC70LXQstC40LTQtdC90LjRjywg0LjQvdGE0L7RgNC80LDRgtC40LrQuCcsXG4gICAgJzE0MzAwNTAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7Qsiwg0L/RgNC10LTQvdCw0LfQvdCw0YfQtdC90L3Ri9GFINC00LvRjyDQvtCx0LXRgdC/0LXRh9C10L3QuNGPINC60L7RgdC80LjRh9C10YHQutC+0Lkg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4JyxcbiAgICAnMTQzMDA1MDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutC+0YHQvNC+0LTRgNC+0LzQvtCyLCDRgdGC0LDRgNGC0L7QstGL0YUg0LrQvtC80L/Qu9C10LrRgdC+0LIg0Lgg0L/Rg9GB0LrQvtCy0YvRhSDRg9GB0YLQsNC90L7QstC+0LonLFxuICAgICcxNDMwMDUwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60L7QvNCw0L3QtNC90L4t0LjQt9C80LXRgNC40YLQtdC70YzQvdGL0YUg0LrQvtC80L/Qu9C10LrRgdC+0LIsINGG0LXQvdGC0YDQvtCyINC4INC/0YPQvdC60YLQvtCyINGD0L/RgNCw0LLQu9C10L3QuNGPINC/0L7Qu9C10YLQsNC80Lgg0LrQvtGB0LzQuNGH0LXRgdC60LjRhSDQvtCx0YrQtdC60YLQvtCyLCDQv9GA0LjQtdC80LAsINGF0YDQsNC90LXQvdC40Y8g0Lgg0L/QtdGA0LXRgNCw0LHQvtGC0LrQuCDQuNC90YTQvtGA0LzQsNGG0LjQuCcsXG4gICAgJzE0MzAwNTAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LHQsNC3INGF0YDQsNC90LXQvdC40Y8g0LrQvtGB0LzQuNGH0LXRgdC60L7QuSDRgtC10YXQvdC40LrQuCcsXG4gICAgJzE0MzAwNTA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/QvtC70LjQs9C+0L3QvtCyINC/0YDQuNC30LXQvNC70LXQvdC40Y8g0LrQvtGB0LzQuNGH0LXRgdC60LjRhSDQvtCx0YrQtdC60YLQvtCyINC4INCy0LfQu9C10YLQvdC+LdC/0L7RgdCw0LTQvtGH0L3Ri9GFINC/0L7Qu9C+0YEnLFxuICAgICcxNDMwMDUwNTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0Y3QutGB0L/QtdGA0LjQvNC10L3RgtCw0LvRjNC90L7QuSDQsdCw0LfRiyDQtNC70Y8g0L7RgtGA0LDQsdC+0YLQutC4INC60L7RgdC80LjRh9C10YHQutC+0Lkg0YLQtdGF0L3QuNC60LgnLFxuICAgICcxNDMwMDUwNjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGG0LXQvdGC0YDQvtCyINC4INC+0LHQvtGA0YPQtNC+0LLQsNC90LjRjyDQtNC70Y8g0L/QvtC00LPQvtGC0L7QstC60Lgg0LrQvtGB0LzQvtC90LDQstGC0L7QsicsXG4gICAgJzE0MzAwNTA3MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LTRgNGD0LPQuNGFINC90LDQt9C10LzQvdGL0YUg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0YLQtdGF0L3QuNC60LgsINC40YHQv9C+0LvRjNC30YPQtdC80YvRhSDQv9GA0Lgg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40Lgg0LrQvtGB0LzQuNGH0LXRgdC60L7QuSDQtNC10Y/RgtC10LvRjNC90L7RgdGC0LgnLFxuICAgICcxNDMwMDYwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIsINC/0YDQtdC00L3QsNC30L3QsNGH0LXQvdC90YvRhSDQtNC70Y8g0L7QsdC10YHQv9C10YfQtdC90LjRjyDQvtCx0L7RgNC+0L3RiyDQuCDQsdC10LfQvtC/0LDRgdC90L7RgdGC0LgnLFxuICAgICcxNDMwMDYwMTAwMDAnOiAn0JTQu9GPINC+0LHQtdGB0L/QtdGH0LXQvdC40Y8g0LfQsNC00LDRhyDQvtCx0L7RgNC+0L3RiycsXG4gICAgJzE0MzAwNjAxMDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LLQvtC10L3QvdGL0YUg0L7RgNCz0LDQvdC40LfQsNGG0LjQuSwg0YPRh9GA0LXQttC00LXQvdC40Lkg0Lgg0LTRgNGD0LPQuNGFINC+0LHRitC10LrRgtC+0LInLFxuICAgICcxNDMwMDYwMTAyMDAnOiAn0JTQu9GPINC00LjRgdC70L7QutCw0YbQuNC4INCy0L7QudGB0Log0Lgg0YHQuNC7INGE0LvQvtGC0LAnLFxuICAgICcxNDMwMDYwMTAzMDAnOiAn0JTQu9GPINC/0YDQvtCy0LXQtNC10L3QuNGPINGD0YfQtdC90LjQuSDQuCDQuNC90YvRhSDQvNC10YDQvtC/0YDQuNGP0YLQuNC5JyxcbiAgICAnMTQzMDA2MDEwNDAwJzogJ9CU0LvRjyDQuNGB0L/Ri9GC0LDRgtC10LvRjNC90YvRhSDQv9C+0LvQuNCz0L7QvdC+0LInLFxuICAgICcxNDMwMDYwMTA1MDAnOiAn0JTQu9GPINC80LXRgdGCINGD0L3QuNGH0YLQvtC20LXQvdC40Y8g0L7RgNGD0LbQuNGPINC4INC30LDRhdC+0YDQvtC90LXQvdC40Y8g0L7RgtGF0L7QtNC+0LInLFxuICAgICcxNDMwMDYwMTA2MDAnOiAn0JTQu9GPINGB0L7Qt9C00LDQvdC40Y8g0LfQsNC/0LDRgdC+0LIg0LzQsNGC0LXRgNC40LDQu9GM0L3Ri9GFINGG0LXQvdC90L7RgdGC0LXQuSDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lwg0Lgg0LzQvtCx0LjQu9C40LfQsNGG0LjQvtC90L3QvtC8INGA0LXQt9C10YDQstCw0YUgKNGF0YDQsNC90LjQu9C40YnQsCwg0YHQutC70LDQtNGLINC4INC00YDRg9Cz0LjQtSknLFxuICAgICcxNDMwMDYwMTA3MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0L7QsdC+0YDQvtC90YsnLFxuICAgICcxNDMwMDYwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIgKNGC0LXRgNGA0LjRgtC+0YDQuNC5KSwg0L7QsdC10YHQv9C10YfQuNCy0LDRjtGJ0LjRhSDQt9Cw0YnQuNGC0YMg0Lgg0L7RhdGA0LDQvdGDINCT0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQs9GA0LDQvdC40YbRiyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuICAgICcxNDMwMDYwMjAxMDAnOiAn0JTQu9GPINC+0LHRg9GB0YLRgNC+0LnRgdGC0LLQsCDQuCDRgdC+0LTQtdGA0LbQsNC90LjRjyDQuNC90LbQtdC90LXRgNC90L4t0YLQtdGF0L3QuNGH0LXRgdC60LjRhSDRgdC+0L7RgNGD0LbQtdC90LjQuSDQuCDQt9Cw0LPRgNCw0LbQtNC10L3QuNC5JyxcbiAgICAnMTQzMDA2MDIwMjAwJzogJ9CU0LvRjyDQvtCx0YPRgdGC0YDQvtC50YHRgtCy0LAg0Lgg0YHQvtC00LXRgNC20LDQvdC40Y8g0L/QvtCz0YDQsNC90LjRh9C90YvRhSDQt9C90LDQutC+0LInLFxuICAgICcxNDMwMDYwMjAzMDAnOiAn0JTQu9GPINC+0LHRg9GB0YLRgNC+0LnRgdGC0LLQsCDQuCDRgdC+0LTQtdGA0LbQsNC90LjRjyDQv9C+0LPRgNCw0L3QuNGH0L3Ri9GFINC/0YDQvtGB0LXQuicsXG4gICAgJzE0MzAwNjAyMDQwMCc6ICfQlNC70Y8g0L7QsdGD0YHRgtGA0L7QudGB0YLQstCwINC4INGB0L7QtNC10YDQttCw0L3QuNGPINC60L7QvNC80YPQvdC40LrQsNGG0LjQuScsXG4gICAgJzE0MzAwNjAyMDUwMCc6ICfQlNC70Y8g0L7QsdGD0YHRgtGA0L7QudGB0YLQstCwINC4INGB0L7QtNC10YDQttCw0L3QuNGPINC/0YPQvdC60YLQvtCyINC/0YDQvtC/0YPRgdC60LAg0YfQtdGA0LXQtyDQk9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGD0Y4g0LPRgNCw0L3QuNGG0YMg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4JyxcbiAgICAnMTQzMDA2MDIwNjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC00LvRjyDQt9Cw0YnQuNGC0Ysg0Lgg0L7RhdGA0LDQvdGLINCT0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQs9GA0LDQvdC40YbRiyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuICAgICcxNDMwMDYwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0L7QsdC+0YDQvtC90Ysg0Lgg0LHQtdC30L7Qv9Cw0YHQvdC+0YHRgtC4JyxcbiAgICAnMTQzMDA3MDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC/0YDQvtC80YvRiNC70LXQvdC90L7RgdGC0LgsINGN0L3QtdGA0LPQtdGC0LjQutC4LCDRgtGA0LDQvdGB0L/QvtGA0YLQsCwg0YHQstGP0LfQuCwg0YDQsNC00LjQvtCy0LXRidCw0L3QuNGPLCDRgtC10LvQtdCy0LjQtNC10L3QuNGPLCDQuNC90YTQvtGA0LzQsNGC0LjQutC4LCDQvtCx0LXRgdC/0LXRh9C10L3QuNGPINC60L7RgdC80LjRh9C10YHQutC+0Lkg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4LCDQvtCx0L7RgNC+0L3Riywg0LHQtdC30L7Qv9Cw0YHQvdC+0YHRgtC4INC4INC40L3QvtCz0L4g0YHQv9C10YbQuNCw0LvRjNC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcbiAgICAnMTQ0MDAwMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtGB0L7QsdC+INC+0YXRgNCw0L3Rj9C10LzRi9GFINC40YHRgtC+0YDQuNC60L4t0LrRg9C70YzRgtGD0YDQvdGL0YUg0Lgg0L/RgNC40YDQvtC00L3Ri9GFINC+0LHRitC10LrRgtC+0LIgKNGC0LXRgNGA0LjRgtC+0YDQuNC5KScsXG4gICAgJzE0NDAwMTAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80YvRhSDQv9GA0LjRgNC+0LTQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiAo0YLQtdGA0YDQuNGC0L7RgNC40LkpJyxcbiAgICAnMTQ0MDAxMDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0YUg0L/RgNC40YDQvtC00L3Ri9GFINC30LDQv9C+0LLQtdC00L3QuNC60L7QsiAo0LIg0YLQvtC8INGH0LjRgdC70LUg0LHQuNC+0YHRhNC10YDQvdGL0YUpJyxcbiAgICAnMTQ0MDAxMDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0YUg0L/RgNC40YDQvtC00L3Ri9GFINC30LDQutCw0LfQvdC40LrQvtCyJyxcbiAgICAnMTQ0MDAxMDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvdCw0YbQuNC+0L3QsNC70YzQvdGL0YUg0L/QsNGA0LrQvtCyJyxcbiAgICAnMTQ0MDAxMDQwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9GA0LjRgNC+0LTQvdGL0YUg0L/QsNGA0LrQvtCyJyxcbiAgICAnMTQ0MDAxMDUwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQtNC10L3QtNGA0L7Qu9C+0LPQuNGH0LXRgdC60LjRhSDQv9Cw0YDQutC+0LInLFxuICAgICcxNDQwMDEwNjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCx0L7RgtCw0L3QuNGH0LXRgdC60LjRhSDRgdCw0LTQvtCyJyxcbiAgICAnMTQ0MDAxMDcwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGB0LDQvdCw0YLQvtGA0L3QvtCz0L4g0Lgg0LrRg9GA0L7RgNGC0L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcxNDQwMDEwODAwMDAnOiAn0KLQtdGA0YDQuNGC0L7RgNC40Lgg0LzQtdGB0YLQvtGA0L7QttC00LXQvdC40Lkg0LzQuNC90LXRgNCw0LvRjNC90YvRhSDQstC+0LQsINC70LXRh9C10LHQvdGL0YUg0LPRgNGP0LfQtdC5LCDRgNCw0L/RiyDQu9C40LzQsNC90L7QsiDQuCDQvtC30LXRgCcsXG4gICAgJzE0NDAwMTA5MDAwMCc6ICfQlNC70Y8g0YLRgNCw0LTQuNGG0LjQvtC90L3QvtCz0L4g0L/RgNC40YDQvtC00L7Qv9C+0LvRjNC30L7QstCw0L3QuNGPJyxcbiAgICAnMTQ0MDAxMTAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtGB0L7QsdC+INC+0YXRgNCw0L3Rj9C10LzRi9GFINC/0YDQuNGA0L7QtNC90YvRhSDRgtC10YDRgNC40YLQvtGA0LjQuSAo0L7QsdGK0LXQutGC0L7QsiknLFxuICAgICcxNDQwMDIwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIgKNGC0LXRgNGA0LjRgtC+0YDQuNC5KSDQv9GA0LjRgNC+0LTQvtC+0YXRgNCw0L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzE0NDAwMzAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiAo0YLQtdGA0YDQuNGC0L7RgNC40LkpINGA0LXQutGA0LXQsNGG0LjQvtC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcxNDQwMDMwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC00L7QvNC+0LIg0L7RgtC00YvRhdCwLCDQv9Cw0L3RgdC40L7QvdCw0YLQvtCyLCDQutC10LzQv9C40L3Qs9C+0LInLFxuICAgICcxNDQwMDMwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YTQuNC30LjRh9C10YHQutC+0Lkg0LrRg9C70YzRgtGD0YDRiyDQuCDRgdC/0L7RgNGC0LAnLFxuICAgICcxNDQwMDMwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGC0YPRgNC40YHRgtC40YfQtdGB0LrQuNGFINCx0LDQtywg0YHRgtCw0YbQuNC+0L3QsNGA0L3Ri9GFINC4INC/0LDQu9Cw0YLQvtGH0L3Ri9GFINGC0YPRgNC40YHRgtGB0LrQvi3QvtC30LTQvtGA0L7QstC40YLQtdC70YzQvdGL0YUg0LvQsNCz0LXRgNC10LksINC00L7QvNC+0LIg0YDRi9Cx0L7Qu9C+0LLQsCDQuCDQvtGF0L7RgtC90LjQutCwLCDQtNC10YLRgdC60LjRhSDRgtGD0YDQuNGB0YLQuNGH0LXRgdC60LjRhSDRgdGC0LDQvdGG0LjQuScsXG4gICAgJzE0NDAwMzA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YLRg9GA0LjRgdGC0LjRh9C10YHQutC40YUg0L/QsNGA0LrQvtCyJyxcbiAgICAnMTQ0MDAzMDUwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQu9C10YHQvtC/0LDRgNC60L7QsicsXG4gICAgJzE0NDAwMzA2MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YPRh9C10LHQvdC+LdGC0YPRgNC40YHRgtC40YfQtdGB0LrQuNGFINGC0YDQvtC/INC4INGC0YDQsNGB0YEnLFxuICAgICcxNDQwMDMwNzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC00LXRgtGB0LrQuNGFINC4INGB0L/QvtGA0YLQuNCy0L3Ri9GFINC70LDQs9C10YDQtdC5JyxcbiAgICAnMTQ0MDAzMDgwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRgdC60LLQtdGA0L7Qsiwg0L/QsNGA0LrQvtCyLCDQs9C+0YDQvtC00YHQutC40YUg0YHQsNC00L7QsicsXG4gICAgJzE0NDAwMzA5MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/Qu9GP0LbQtdC5JyxcbiAgICAnMTQ0MDAzMTAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyICjRgtC10YDRgNC40YLQvtGA0LjQuSkg0YDQtdC60YDQtdCw0YbQuNC+0L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzE0NDAwNDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQuNGB0YLQvtGA0LjQutC+LdC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcxNDQwMDQwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPINC90LDRgNC+0LTQvtCyINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCAo0L/QsNC80Y/RgtC90LjQutC+0LIg0LjRgdGC0L7RgNC40Lgg0Lgg0LrRg9C70YzRgtGD0YDRiyksINCyINGC0L7QvCDRh9C40YHQu9C1INC+0LHRitC10LrRgtC+0LIg0LDRgNGF0LXQvtC70L7Qs9C40YfQtdGB0LrQvtCz0L4g0L3QsNGB0LvQtdC00LjRjycsXG4gICAgJzE0NDAwNDAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LLQvtC10L3QvdGL0YUg0Lgg0LPRgNCw0LbQtNCw0L3RgdC60LjRhSDQt9Cw0YXQvtGA0L7QvdC10L3QuNC5JyxcbiAgICAnMTQ0MDA1MDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtGB0L7QsdC+INC+0YXRgNCw0L3Rj9C10LzRi9GFINC40YHRgtC+0YDQuNC60L4t0LrRg9C70YzRgtGD0YDQvdGL0YUg0Lgg0L/RgNC40YDQvtC00L3Ri9GFINC+0LHRitC10LrRgtC+0LIgKNGC0LXRgNGA0LjRgtC+0YDQuNC5KScsXG4gICAgJzE0NTAwMDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQu9C10YHQvdC+0LPQviDRhNC+0L3QtNCwJyxcbiAgICAnMTQ1MDAxMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQu9C10YHQvdC+0Lkg0YDQsNGB0YLQuNGC0LXQu9GM0L3QvtGB0YLQuCcsXG4gICAgJzE0NTAwMjAwMDAwMCc6ICfQlNC70Y8g0LLQvtGB0YHRgtCw0L3QvtCy0LvQtdC90LjRjyDQu9C10YHQvdC+0Lkg0YDQsNGB0YLQuNGC0LXQu9GM0L3QvtGB0YLQuCcsXG4gICAgJzE0NTAwMzAwMDAwMCc6ICfQlNC70Y8g0L/RgNC+0YfQuNGFINC+0LHRitC10LrRgtC+0LIg0LvQtdGB0L3QvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcbiAgICAnMTQ2MDAwMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINCy0L7QtNC90L7Qs9C+INGE0L7QvdC00LAnLFxuICAgICcxNDYwMDEwMDAwMDAnOiAn0J/QvtC0INCy0L7QtNC90YvQvNC4INC+0LHRitC10LrRgtCw0LzQuCcsXG4gICAgJzE0NjAwMjAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LPQuNC00YDQvtGC0LXRhdC90LjRh9C10YHQutC40YUg0YHQvtC+0YDRg9C20LXQvdC40LknLFxuICAgICcxNDYwMDMwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINGB0L7QvtGA0YPQttC10L3QuNC5LCDRgNCw0YHQv9C+0LvQvtC20LXQvdC90YvRhSDQvdCwINCy0L7QtNC90YvRhSDQvtCx0YrQtdC60YLQsNGFJyxcbiAgICAnMTQ3MDAwMDAwMDAwJzogJ9CX0LXQvNC70Lgg0LfQsNC/0LDRgdCwICjQvdC10LjRgdC/0L7Qu9GM0LfRg9C10LzRi9C1KSdcbn07XG4vLyDQndCw0LfQvdCw0YfQtdC90LjQtSDQt9C00LDQvdC40LlcbnZhciBkQXNzQnVpbGRpbmcgPSB7XG4gICAgJzIwNDAwMTAwMDAwMCc6ICfQndC10LbQuNC70L7QtSDQt9C00LDQvdC40LUnLFxuICAgICcyMDQwMDIwMDAwMDAnOiAn0JbQuNC70L7QuSDQtNC+0LwnLFxuICAgICcyMDQwMDMwMDAwMDAnOiAn0JzQvdC+0LPQvtC60LLQsNGA0YLQuNGA0L3Ri9C5INC00L7QvCdcbn07XG5cbnZhciBQYXJjZWxQcm9wZXJ0aWVzO1xudmFyIENvbnN0cnVjdGlvblByb3BlcnRpZXM7XG52YXIgVW5jb21wbGV0ZWRQcm9wZXJ0aWVzO1xudmFyIEJ1aWxkaW5nUHJvcGVydGllcztcbnZhciBab25lUHJvcGVydGllcztcbnZhciBCb3VuZFByb3BlcnRpZXM7XG5cbmZ1bmN0aW9uIGdldFZhbHVlRnJvbURpY3QoS2V5LCBEaWMpIHtcbiAgICBmb3IgKHZhciBrIGluIERpYykge1xuICAgICAgICBpZiAoayA9PT0gS2V5KSB7XG4gICAgICAgICAgICByZXR1cm4gRGljW2tdO1xuICAgICAgICB9XG4gICAgfVxufVxuXG5tb2R1bGUuZXhwb3J0cy5nZXRQcm9wZXJ0aWVzID0gZnVuY3Rpb24gKEZlYXR1cmUsIEZlYXR1cmVUeXBlKSB7XG4gICAgc3dpdGNoIChGZWF0dXJlVHlwZSkge1xuICAgICAgICBjYXNlICdQYXJjZWwnIDpcbiAgICAgICAge1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllcyA9IHtcbiAgICAgICAgICAgICAgICBvYmplY3RUeXBlOiAn0JfQoycsXG4gICAgICAgICAgICAgICAgXCLQmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC90L7QvNC10YBcIjogJycsIC8vIHJlcXVpcmVcbiAgICAgICAgICAgICAgICBcItCh0YLQsNGC0YPRgVwiOiAnMDEnLCAvLyBkU3RhdGVzIHJlcXVpcmVcbiAgICAgICAgICAgICAgICBcItCU0LDRgtCwINGB0L7Qt9C00LDQvdC40Y9cIjogJycsXG4gICAgICAgICAgICAgICAgXCLQotC40L8g0L7QsdGK0LXQutGC0LBcIjogJycsIC8vZFBhcmNlbHMgcmVxdWlyZVxuICAgICAgICAgICAgICAgIFwi0JrQsNGC0LXQs9C+0YDQuNGPINC30LXQvNC10LvRjFwiOiAnJywgLy8gZENhdGVnb3JpZXMgLy8gcmVxdWlyZVxuICAgICAgICAgICAgICAgIFwi0J/Qu9C+0YnQsNC00YxcIjogey8vIHJlcXVyZVxuICAgICAgICAgICAgICAgICAgICBcItCX0L3QsNGH0LXQvdC40LVcIjogMCwgLy8gcmVxdWlyZVxuICAgICAgICAgICAgICAgICAgICBcItC10LQu0LjQt9C8XCI6ICcnLCAvL2RVbml0IHJlcXVpcmVcbiAgICAgICAgICAgICAgICAgICAgXCLQotC+0YfQvdC+0YHRgtGMXCI6ICcnIC8vIGQyMF8yXG4gICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBcItCg0LDQt9GA0LXRiNGR0L3QvdC+0LUg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40LVcIjogey8vIHJlcXVpcmVcbiAgICAgICAgICAgICAgICAgICAgXCLQv9C+INC00L7QutGD0LzQtdC90YLRg1wiOiAnJyxcbiAgICAgICAgICAgICAgICAgICAgXCLQv9C+INGB0L/RgNCw0LLQvtGH0L3QuNC60YNcIjogJycgLy8gZFV0aWxpemF0aW9uIHJlcXVpcmVcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9O1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllc1tcItCa0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L3QvtC80LXRgFwiXSA9IEZlYXR1cmUuQ2FkYXN0cmFsTnVtYmVyO1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllc1tcItCh0YLQsNGC0YPRgVwiXSA9IGdldFZhbHVlRnJvbURpY3QoRmVhdHVyZS5TdGF0ZSwgZFN0YXRlcyk7XG4gICAgICAgICAgICBQYXJjZWxQcm9wZXJ0aWVzW1wi0KLQuNC/INC+0LHRitC10LrRgtCwXCJdID0gZ2V0VmFsdWVGcm9tRGljdChGZWF0dXJlLk5hbWUsIGRQYXJjZWxzKTtcbiAgICAgICAgICAgIFBhcmNlbFByb3BlcnRpZXNbXCLQmtCw0YLQtdCz0L7RgNC40Y8g0LfQtdC80LXQu9GMXCJdID0gZ2V0VmFsdWVGcm9tRGljdChGZWF0dXJlLkNhdGVnb3J5LCBkQ2F0ZWdvcmllcyk7XG4gICAgICAgICAgICBQYXJjZWxQcm9wZXJ0aWVzW1wi0JTQsNGC0LAg0YHQvtC30LTQsNC90LjRj1wiXSA9IEZlYXR1cmUuRGF0ZUNyZWF0ZWQ7XG4gICAgICAgICAgICBQYXJjZWxQcm9wZXJ0aWVzW1wi0KDQsNC30YDQtdGI0ZHQvdC90L7QtSDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjQtVwiXVtcItC/0L4g0YHQv9GA0LDQstC+0YfQvdC40LrRg1wiXSA9XG4gICAgICAgICAgICAgICAgICAgIGdldFZhbHVlRnJvbURpY3QoRmVhdHVyZS5VdGlsaXphdGlvbi5VdGlsaXphdGlvbiwgZFV0aWxpemF0aW9ucyk7XG4gICAgICAgICAgICBQYXJjZWxQcm9wZXJ0aWVzW1wi0KDQsNC30YDQtdGI0ZHQvdC90L7QtSDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjQtVwiXVtcItC/0L4g0LTQvtC60YPQvNC10L3RgtGDXCJdID0gRmVhdHVyZS5VdGlsaXphdGlvbi5CeURvYztcbiAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICB9XG4gICAgICAgIGNhc2UgJ0NvbnN0cnVjdGlvbic6XG4gICAgICAgIHtcbiAgICAgICAgICAgIENvbnN0cnVjdGlvblByb3BlcnRpZXMgPSB7XG4gICAgICAgICAgICAgICAgb2JqZWN0VHlwZTogJ9Ce0JrQoSDRgdC+0L7RgNGD0LbQtdC90LjQtScsXG4gICAgICAgICAgICAgICAgY2FkYXN0cmVOdW1iZXI6ICcnLCAvLyBcbiAgICAgICAgICAgICAgICBBc3NpZ25hdGlvbk5hbWU6ICcnLFxuICAgICAgICAgICAgICAgIEFkZHJlc3M6IHtcbiAgICAgICAgICAgICAgICAgICAgTm90ZTogJydcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9O1xuICAgICAgICAgICAgaWYgKEZlYXR1cmUuQ2FkYXN0cmFsTnVtYmVyKSB7XG4gICAgICAgICAgICAgICAgQ29uc3RydWN0aW9uUHJvcGVydGllcy5jYWRhc3RyZU51bWJlciA9IEZlYXR1cmUuQ2FkYXN0cmFsTnVtYmVyO1xuICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICBDb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyID0gJyc7XG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICAgIENvbnN0cnVjdGlvblByb3BlcnRpZXMuQXNzaWduYXRpb25OYW1lID0gRmVhdHVyZS5Bc3NpZ25hdGlvbk5hbWU7XG4gICAgICAgICAgICBDb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzLk9iamVjdFR5cGUgPSBnZXRWYWx1ZUZyb21EaWN0KEZlYXR1cmUuT2JqZWN0VHlwZSwgZFpvbmUpO1xuICAgICAgICAgICAgQ29uc3RydWN0aW9uUHJvcGVydGllc1tcIkFkZHJlc3NcIl1bXCJOb3RlXCJdID0gRmVhdHVyZS5BZGRyZXNzLk5vdGU7XG4gICAgICAgICAgICBicmVhaztcbiAgICAgICAgfVxuICAgICAgICBjYXNlICdCdWlsZGluZyc6XG4gICAgICAgIHtcbiAgICAgICAgICAgIEJ1aWxkaW5nUHJvcGVydGllcyA9IHtcbiAgICAgICAgICAgICAgICBvYmplY3RUeXBlOiAn0J7QmtChJyxcbiAgICAgICAgICAgICAgICBjYWRhc3RyZU51bWJlcjogJycsIC8vIFxuICAgICAgICAgICAgICAgIEFzc2lnbmF0aW9uTmFtZTogJycsXG4gICAgICAgICAgICAgICAgQWRkcmVzczoge1xuICAgICAgICAgICAgICAgICAgICBOb3RlOiAnJ1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH07XG4gICAgICAgICAgICBpZiAoRmVhdHVyZS5DYWRhc3RyYWxOdW1iZXIpIHtcbiAgICAgICAgICAgICAgICBCdWlsZGluZ1Byb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIgPSBGZWF0dXJlLkNhZGFzdHJhbE51bWJlcjtcbiAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgQnVpbGRpbmdQcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyID0gJyc7XG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICAgIEJ1aWxkaW5nUHJvcGVydGllcy5Bc3NpZ25hdGlvbk5hbWUgPSBGZWF0dXJlLkFzc2lnbmF0aW9uTmFtZTtcbiAgICAgICAgICAgIC8vQnVpbGRpbmdQcm9wZXJ0aWVzLm9iamVjdFR5cGUgPSBnZXRWYWx1ZUZyb21EaWN0KEZlYXR1cmUuT2JqZWN0VHlwZSwgZFpvbmUpO1xuICAgICAgICAgICAgQnVpbGRpbmdQcm9wZXJ0aWVzW1wiQWRkcmVzc1wiXVtcIk5vdGVcIl0gPSBGZWF0dXJlLkFkZHJlc3MuTm90ZTtcbiAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICB9XG4gICAgICAgIGNhc2UgJ1VuY29tcGxldGVkJzpcbiAgICAgICAge1xuICAgICAgICAgICAgVW5jb21wbGV0ZWRQcm9wZXJ0aWVzID0ge1xuICAgICAgICAgICAgICAgIG9iamVjdFR5cGU6ICfQntCa0KEg0L3QtdC30LDQstC10YDRiNGR0L3QvdGL0LknLFxuICAgICAgICAgICAgICAgIGNhZGFzdHJlTnVtYmVyOiAnJywgLy8gXG4gICAgICAgICAgICAgICAgQXNzaWduYXRpb25OYW1lOiAnJyxcbiAgICAgICAgICAgICAgICBBZGRyZXNzOiB7XG4gICAgICAgICAgICAgICAgICAgIE5vdGU6ICcnXG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfTtcbiAgICAgICAgICAgIGlmIChGZWF0dXJlLkNhZGFzdHJhbE51bWJlcikge1xuICAgICAgICAgICAgICAgIFVuY29tcGxldGVkUHJvcGVydGllcy5jYWRhc3RyZU51bWJlciA9IEZlYXR1cmUuQ2FkYXN0cmFsTnVtYmVyO1xuICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICBVbmNvbXBsZXRlZFByb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIgPSAnJztcbiAgICAgICAgICAgIH1cblxuICAgICAgICAgICAgVW5jb21wbGV0ZWRQcm9wZXJ0aWVzLkFzc2lnbmF0aW9uTmFtZSA9IEZlYXR1cmUuQXNzaWduYXRpb25OYW1lO1xuICAgICAgICAgICAgLy9VbmNvbXBsZXRlZFByb3BlcnRpZXMub2JqZWN0VHlwZSA9IGdldFZhbHVlRnJvbURpY3QoRmVhdHVyZS5PYmplY3RUeXBlLCBkWm9uZSk7XG4gICAgICAgICAgICBVbmNvbXBsZXRlZFByb3BlcnRpZXNbXCJBZGRyZXNzXCJdW1wiTm90ZVwiXSA9IEZlYXR1cmUuQWRkcmVzcy5Ob3RlO1xuICAgICAgICAgICAgYnJlYWs7XG4gICAgICAgIH1cbiAgICAgICAgY2FzZSAnWm9uZScgOlxuICAgICAgICB7XG4gICAgICAgICAgICBab25lUHJvcGVydGllcyA9IHtcbiAgICAgICAgICAgICAgICBvYmplY3RUeXBlOiAn0JfQvtC90LAnLFxuICAgICAgICAgICAgICAgIGFjY291bnROdW1iZXI6ICcnLCAvLyBcbiAgICAgICAgICAgICAgICBkZXNjcmlwdGlvbjogJycsXG4gICAgICAgICAgICAgICAgdGVycml0b3JpYWxab25lOiB7XG4gICAgICAgICAgICAgICAgICAgXG4gICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBzcGVjaWFsWm9uZToge1xuICAgICAgICAgICAgICAgICAgICBjb250ZW50UmVzdHJpY3Rpb25zOiAnJ1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH07XG4gICAgICAgICAgICBab25lUHJvcGVydGllcy5hY2NvdW50TnVtYmVyID0gRmVhdHVyZS5BY2NvdW50TnVtYmVyO1xuICAgICAgICAgICAgWm9uZVByb3BlcnRpZXMuZGVzY3JpcHRpb24gPSBGZWF0dXJlLkRlc2NyaXB0aW9uO1xuICAgICAgICB9XG4gICAgICAgIGNhc2UgJ0JvdW5kJyA6XG4gICAgICAgIHtcbiAgICAgICAgICAgIEJvdW5kUHJvcGVydGllcyA9IHtcbiAgICAgICAgICAgICAgICBvYmplY3RUeXBlOiAn0JPRgNCw0L3QuNGG0LAnLFxuICAgICAgICAgICAgICAgIGFjY291bnROdW1iZXI6ICcnLCAvLyBcbiAgICAgICAgICAgICAgICBkZXNjcmlwdGlvbjogJydcbiAgICAgICAgICAgIH07XG4gICAgICAgICAgICBCb3VuZFByb3BlcnRpZXMuYWNjb3VudE51bWJlciA9IEZlYXR1cmUuQWNjb3VudE51bWJlcjtcbiAgICAgICAgICAgIEJvdW5kUHJvcGVydGllcy5kZXNjcmlwdGlvbiA9IEZlYXR1cmUuRGVzY3JpcHRpb247XG4gICAgICAgIH1cbiAgICAgICAgZGVmYXVsdCA6XG4gICAgICAgIHtcbiAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQotC40L8g0L7QsdGK0LXQutGC0LAg0L3QtSDRgNCw0YHQv9C+0LfQvdCw0L0nKTtcbiAgICAgICAgfVxuICAgIH1cbiAgICByZXR1cm4ge1xuICAgICAgICBwYXJjZWxQcm9wZXJ0aWVzOiBQYXJjZWxQcm9wZXJ0aWVzLFxuICAgICAgICBjb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzOiBDb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzLFxuICAgICAgICB1bmNvbXBsZXRlZFByb3BlcnRpZXM6IFVuY29tcGxldGVkUHJvcGVydGllcyxcbiAgICAgICAgYnVpbGRpbmdQcm9wZXJ0aWVzOiBCdWlsZGluZ1Byb3BlcnRpZXMsXG4gICAgICAgIHpvbmVQcm9wZXJ0aWVzOiBab25lUHJvcGVydGllcyxcbiAgICAgICAgYm91bmRQcm9wZXJ0aWVzOiBCb3VuZFByb3BlcnRpZXNcbiAgICB9O1xufTsiLCJ2YXIgRVMgPSByZXF1aXJlKCcuL3NwYXRpYWwvRW50aXR5U3BhdGlhbC5qcycpO1xudmFyIFByb3BzID0gcmVxdWlyZSgnLi9jYWRQcm9wcycpO1xuXG5tb2R1bGUuZXhwb3J0cy5HZW9KU09OID0gZnVuY3Rpb24gKHhtbERhdGEsIHJlcHJvamVjdCkge1xuXG4gICAgdmFyIGdlb0pTT05RdWFydGFsID0ge1xuICAgICAgICB0eXBlOiBcIkZlYXR1cmVDb2xsZWN0aW9uXCIsXG4gICAgICAgIGZlYXR1cmVzOiBbXVxuICAgIH07XG4gICAgdmFyIGdlb0pTT05Cb3VuZHMgPSB7XG4gICAgICAgIHR5cGU6IFwiRmVhdHVyZUNvbGxlY3Rpb25cIixcbiAgICAgICAgZmVhdHVyZXM6IFtdXG4gICAgfTtcbiAgICB2YXIgZ2VvSlNPTlpvbmVzID0ge1xuICAgICAgICB0eXBlOiBcIkZlYXR1cmVDb2xsZWN0aW9uXCIsXG4gICAgICAgIGZlYXR1cmVzOiBbXVxuICAgIH07XG4gICAgdmFyIGdlb0pTT05QYXJjZWxzID0ge1xuICAgICAgICAndHlwZSc6ICdGZWF0dXJlQ29sbGVjdGlvbicsXG4gICAgICAgICdmZWF0dXJlcyc6IFtdXG4gICAgfTtcbiAgICB2YXIgZ2VvSlNPTlJlYWx0eSA9IHtcbiAgICAgICAgdHlwZTogXCJGZWF0dXJlQ29sbGVjdGlvblwiLFxuICAgICAgICBmZWF0dXJlczogW11cbiAgICB9O1xuICAgIC8vINCe0YLQtNC10LvRjNC90L7QtSDRhdGA0LDQvdC40LvQuNGJ0LUg0LTQu9GPIEdlb21ldHJ5Q29sbGVjdGlvblxuLy8gICAgdmFyIGdlb0pTT05SZWFsdHlDb2xsZWN0aW9uID0ge1xuLy8gICAgICAgIHR5cGU6IFwiRmVhdHVyZUNvbGxlY3Rpb25cIixcbi8vICAgICAgICBmZWF0dXJlczogW11cbi8vICAgIH07XG4gICAgdmFyIGdlb0pTT05PU01Qb2ludHMgPSB7XG4gICAgICAgIHR5cGU6IFwiRmVhdHVyZUNvbGxlY3Rpb25cIixcbiAgICAgICAgZmVhdHVyZXM6IFtdXG4gICAgfTtcblxuICAgIHZhciBfcmVwcm9qZWN0ID0gcmVwcm9qZWN0IHx8IG51bGw7XG5cbiAgICB2YXIgQWxsRGF0YSA9ICQueG1sMmpzb24oeG1sRGF0YSkuQ2FkYXN0cmFsQmxvY2tzLkNhZGFzdHJhbEJsb2NrO1xuICAgIC8vY29uc29sZS5sb2coQWxsRGF0YSk7XG5cbiAgICAvLyDQnNC+0LbQtdGCINCx0YvRgtGMINC90LXRgdC60L7Qu9GM0LrQviDQodCaXG4gICAgdmFyIHByb2pNU0s7XG4gICAgaWYgKF9yZXByb2plY3QgIT09IG51bGwpIHtcbiAgICAgICAgcHJvak1TSyA9IEFsbERhdGEuQ29vcmRTeXN0ZW1zO1xuICAgIH1cblxuICAgIC8vINCe0LHRgNCw0LHQvtGC0LrQsCDQutCy0LDRgNGC0LDQu9CwLiDQndC1INC80L7QttC10YIg0LHRi9GC0Ywg0LzQvdC+0LPQvtC60L7QvdGC0YPRgNC90YvQvCAgICAgICAgICAgXG4gICAgaWYgKEFsbERhdGEuU3BhdGlhbERhdGEgIT09IG51bGwpIHtcbiAgICAgICAgdmFyIHNwT2JqID0gRVMuZ2V0RW50aXR5U3BhdGlhbChBbGxEYXRhLlNwYXRpYWxEYXRhLkVudGl0eVNwYXRpYWwsIHByb2pNU0ssICdRdWFydGFsJywgZmFsc2UpO1xuICAgICAgICBpZiAoKHNwT2JqID09PSB1bmRlZmluZWQpIHx8IChzcE9iai5sZW5ndGggPT09IDApKSB7XG4gICAgICAgICAgICBjb25zb2xlLmxvZygn0J7QsdGK0LXQutGCINC60LLQsNGA0YLQsNC70LAg0YEg0L/Rg9GB0YLQvtC5INCz0LXQvtC80LXRgtGA0LjQtdC5ISDQntCx0YrQtdC60YIg0LHRg9C00LXRgiDQv9GA0L7Qv9GD0YnQtdC9LicpO1xuICAgICAgICB9XG4gICAgICAgIC8vINCa0LLQsNGA0YLQsNC7XG4gICAgICAgIHZhciBmZWF0dXJlID0ge1xuICAgICAgICAgICAgJ3R5cGUnOiAnRmVhdHVyZSdcbiAgICAgICAgfTtcbiAgICAgICAgZmVhdHVyZS5nZW9tZXRyeSA9IHNwT2JqO1xuICAgICAgICAvLyDQntGB0YLQsNC70YzQvdGL0LUg0YHQstC+0LnRgdGC0LLQsC4uLi5cblxuICAgICAgICBnZW9KU09OUXVhcnRhbC5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgIH0gZWxzZSB7XG4gICAgICAgIGNvbnNvbGUubG9nKCfQndC10YIg0L7Qv9C40YHQsNC90LjRjyDQv9GA0L7RgdGC0YDQsNC90YHRgtCy0LXQvdC90L7QuSDRgdC+0YHRgtCw0LLQu9GP0Y7RidC10Lkg0LrQstCw0YDRgtCw0LvQsCcpO1xuICAgIH1cblxuICAgIC8vINCe0LHRgNCw0LHQvtGC0LrQsCDQs9GA0LDQvdC40YYuINCd0LUg0LzQvtCz0YPRgiDQsdGL0YLRjCDQvNC90L7Qs9C+0LrQvtC90YLRg9GA0L3Ri9C80LhcbiAgICBpZiAoQWxsRGF0YS5Cb3VuZHMpIHtcblxuICAgICAgICBpZiAoQWxsRGF0YS5Cb3VuZHMuQm91bmQuc3BsaWNlKSB7XG4gICAgICAgICAgICBmb3IgKHZhciBpID0gMDsgaSA8IEFsbERhdGEuQm91bmRzLkJvdW5kLmxlbmd0aDsgaSsrKSB7XG4gICAgICAgICAgICAgICAgaWYgKEFsbERhdGEuQm91bmRzLkJvdW5kW2ldLkJvdW5kYXJpZXMuQm91bmRhcnkuc3BsaWNlKSB7XG4gICAgICAgICAgICAgICAgICAgIGZvciAodmFyIGsgPSAwOyBrIDwgQWxsRGF0YS5Cb3VuZHMuQm91bmRbaV0uQm91bmRhcmllcy5Cb3VuZGFyeS5sZW5ndGg7IGsrKykge1xuICAgICAgICAgICAgICAgICAgICAgICAgLy8g0JPRgNCw0L3QuNGG0LBcbiAgICAgICAgICAgICAgICAgICAgICAgIHZhciBmZWF0dXJlID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICd0eXBlJzogJ0ZlYXR1cmUnXG4gICAgICAgICAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgICAgICAgICAgaWYgKEFsbERhdGEuQm91bmRzLkJvdW5kW2ldLkJvdW5kYXJpZXMuQm91bmRhcnlba10uRW50aXR5U3BhdGlhbCAhPT0gbnVsbCkge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIHZhciBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoQWxsRGF0YS5Cb3VuZHMuQm91bmRbaV0uQm91bmRhcmllcy5Cb3VuZGFyeVtrXS5FbnRpdHlTcGF0aWFsLCBwcm9qTVNLLCAnQm91bmQnLCBmYWxzZSk7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgaWYgKChzcE9iaiA9PT0gdW5kZWZpbmVkKSB8fCAoc3BPYmoubGVuZ3RoID09PSAwKSkge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0J7QsdGK0LXQutGCINCT0YDQsNC90LjRhtGLINGBINC/0YPRgdGC0L7QuSDQs9C10L7QvNC10YLRgNC40LXQuSEg0J7QsdGK0LXQutGCINCx0YPQtNC10YIg0L/RgNC+0L/Rg9GJ0LXQvS4nKTtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgY29udGludWU7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAvLyDQntGB0YLQsNC70YzQvdGL0LUg0YHQstC+0LnRgdGC0LLQsC4uLi5cblxuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGdlb0pTT05Cb3VuZHMuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZygn0J3QtdGCINC+0L/QuNGB0LDQvdC40Y8g0L/RgNC+0YHRgtGA0LDQvdGB0YLQstC10L3QvdC+0Lkg0YHQvtGB0YLQsNCy0LvRj9GO0YnQtdC5INCz0YDQsNC90LjRhtGLJyk7XG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICAvLyDQk9GA0LDQvdC40YbQsFxuICAgICAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICd0eXBlJzogJ0ZlYXR1cmUnXG4gICAgICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICAgICAgICAgIHZhciBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoQWxsRGF0YS5Cb3VuZHMuQm91bmRbaV0uQm91bmRhcmllcy5Cb3VuZGFyeS5FbnRpdHlTcGF0aWFsLCBwcm9qTVNLLCAnQm91bmQnLCBmYWxzZSk7XG4gICAgICAgICAgICAgICAgICAgIGlmICgoc3BPYmogPT09IHVuZGVmaW5lZCkgfHwgKHNwT2JqLmxlbmd0aCA9PT0gMCkpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQntCx0YrQtdC60YIg0JPRgNCw0L3QuNGG0Ysg0YEg0L/Rg9GB0YLQvtC5INCz0LXQvtC80LXRgtGA0LjQtdC5ISDQntCx0YrQtdC60YIg0LHRg9C00LXRgiDQv9GA0L7Qv9GD0YnQtdC9LicpO1xuICAgICAgICAgICAgICAgICAgICAgICAgY29udGludWU7XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgLy9mZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAgICAgICAgIC8vINCe0YHRgtCw0LvRjNC90YvQtSDRgdCy0L7QudGB0YLQstCwLi4uLlxuICAgICAgICAgICAgICAgICAgICBpZiAoc3BPYmopIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgICAgICAgICAgICAgICAgIC8vINCe0YHRgtCw0LvRjNC90YvQtSDRgdCy0L7QudGB0YLQstCwLi4uLlxuICAgICAgICAgICAgICAgICAgICAgICAgdmFyIHByb3BzID0gUHJvcHMuZ2V0UHJvcGVydGllcyhBbGxEYXRhLkJvdW5kcy5Cb3VuZFtpXSwgJ0JvdW5kJyk7XG4gICAgICAgICAgICAgICAgICAgICAgICBpZiAocHJvcHMpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLnByb3BlcnRpZXMgPSBwcm9wcy5ib3VuZFByb3BlcnRpZXM7XG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQntCx0YrQtdC60YIg0YHQvtC30LTQsNC9LiDQmtCdOicgKyBmZWF0dXJlLnByb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIpO1xuICAgICAgICAgICAgICAgICAgICAgICAgZ2VvSlNPTkJvdW5kcy5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIC8vZ2VvSlNPTkJvdW5kcy5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgIHZhciBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoQWxsRGF0YS5Cb3VuZHMuQm91bmQuQm91bmRhcmllcy5Cb3VuZGFyeS5FbnRpdHlTcGF0aWFsLCBwcm9qTVNLLCAnQm91bmQnLCBmYWxzZSk7XG4gICAgICAgICAgICBpZiAoKHNwT2JqID09PSB1bmRlZmluZWQpIHx8IChzcE9iai5sZW5ndGggPT09IDApKSB7XG4gICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDQk9GA0LDQvdC40YbRiyDRgSDQv9GD0YHRgtC+0Lkg0LPQtdC+0LzQtdGC0YDQuNC10LkhINCe0LHRitC10LrRgiDQsdGD0LTQtdGCINC/0YDQvtC/0YPRidC10L0uJyk7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICAvL2ZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgICAgIC8vINCe0YHRgtCw0LvRjNC90YvQtSDRgdCy0L7QudGB0YLQstCwLi4uLlxuICAgICAgICAgICAgaWYgKHNwT2JqKSB7XG4gICAgICAgICAgICAgICAgZmVhdHVyZS5nZW9tZXRyeSA9IHNwT2JqO1xuICAgICAgICAgICAgICAgIC8vINCe0YHRgtCw0LvRjNC90YvQtSDRgdCy0L7QudGB0YLQstCwLi4uLlxuICAgICAgICAgICAgICAgIHZhciBwcm9wcyA9IFByb3BzLmdldFByb3BlcnRpZXMoQWxsRGF0YS5Cb3VuZHMuQm91bmQsICdCb3VuZCcpO1xuICAgICAgICAgICAgICAgIGlmIChwcm9wcykge1xuICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLnByb3BlcnRpZXMgPSBwcm9wcy5ib3VuZFByb3BlcnRpZXM7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDRgdC+0LfQtNCw0L0uINCa0J06JyArIGZlYXR1cmUucHJvcGVydGllcy5jYWRhc3RyZU51bWJlcik7XG4gICAgICAgICAgICAgICAgZ2VvSlNPTkJvdW5kcy5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgLy9nZW9KU09OQm91bmRzLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgIH1cbiAgICB9XG4gICAgLy8g0J7QsdGA0LDQsdC+0YLQutCwINC30L7QvS4g0J3QtSDQvNC+0LPRg9GCINCx0YvRgtGMINC80L3QvtCz0L7QutC+0L3RgtGD0YDQvdGL0LzQuFxuICAgIGlmIChBbGxEYXRhLlpvbmVzKSB7XG5cbiAgICAgICAgaWYgKEFsbERhdGEuWm9uZXMuWm9uZS5zcGxpY2UpIHtcbiAgICAgICAgICAgIGZvciAodmFyIGkgPSAwOyBpIDwgQWxsRGF0YS5ab25lcy5ab25lLmxlbmd0aDsgaSsrKSB7XG4gICAgICAgICAgICAgICAgLy8g0JfQvtC90LBcbiAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICAgICAgICAgJ3R5cGUnOiAnRmVhdHVyZSdcbiAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgIGlmIChBbGxEYXRhLlpvbmVzLlpvbmVbaV0uRW50aXR5U3BhdGlhbCAhPT0gbnVsbCkge1xuICAgICAgICAgICAgICAgICAgICB2YXIgc3BPYmogPSBFUy5nZXRFbnRpdHlTcGF0aWFsKEFsbERhdGEuWm9uZXMuWm9uZVtpXS5FbnRpdHlTcGF0aWFsLCBwcm9qTVNLLCAnWm9uZScsIGZhbHNlKTtcbiAgICAgICAgICAgICAgICAgICAgaWYgKChzcE9iaiA9PT0gdW5kZWZpbmVkKSB8fCAoc3BPYmoubGVuZ3RoID09PSAwKSkge1xuICAgICAgICAgICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDQl9C+0L3RiyDRgSDQv9GD0YHRgtC+0Lkg0LPQtdC+0LzQtdGC0YDQuNC10LkhINCe0LHRitC10LrRgiDQsdGD0LTQtdGCINC/0YDQvtC/0YPRidC10L0uJyk7XG4gICAgICAgICAgICAgICAgICAgICAgICBjb250aW51ZTtcbiAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAvL2ZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgICAgICAgICAgICAgaWYgKHNwT2JqKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAgICAgICAgICAgICAvLyDQntGB0YLQsNC70YzQvdGL0LUg0YHQstC+0LnRgdGC0LLQsC4uLi5cbiAgICAgICAgICAgICAgICAgICAgICAgIHZhciBwcm9wcyA9IFByb3BzLmdldFByb3BlcnRpZXMoQWxsRGF0YS5ab25lcy5ab25lW2ldLCAnWm9uZScpO1xuICAgICAgICAgICAgICAgICAgICAgICAgaWYgKHByb3BzKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5wcm9wZXJ0aWVzID0gcHJvcHMuem9uZVByb3BlcnRpZXM7XG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQntCx0YrQtdC60YIg0YHQvtC30LTQsNC9LiDQmtCdOicgKyBmZWF0dXJlLnByb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIpO1xuICAgICAgICAgICAgICAgICAgICAgICAgZ2VvSlNPTlpvbmVzLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgLy9nZW9KU09OWm9uZXMuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0J3QtdGCINC+0L/QuNGB0LDQvdC40Y8g0L/RgNC+0YHRgtGA0LDQvdGB0YLQstC10L3QvdC+0Lkg0YHQvtGB0YLQsNCy0LvRj9GO0YnQtdC5INC30L7QvdGLJyk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfVxuICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgaWYgKEFsbERhdGEuWm9uZXMuWm9uZS5FbnRpdHlTcGF0aWFsICE9PSBudWxsKSB7XG4gICAgICAgICAgICAgICAgLy8g0JfQvtC90LBcbiAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICAgICAgICAgJ3R5cGUnOiAnRmVhdHVyZSdcbiAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgIHZhciBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoQWxsRGF0YS5ab25lcy5ab25lLkVudGl0eVNwYXRpYWwsIHByb2pNU0ssICdab25lJywgZmFsc2UpO1xuICAgICAgICAgICAgICAgIGlmICgoc3BPYmogPT09IHVuZGVmaW5lZCkgfHwgKHNwT2JqLmxlbmd0aCA9PT0gMCkpIHtcbiAgICAgICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDQl9C+0L3RiyDRgSDQv9GD0YHRgtC+0Lkg0LPQtdC+0LzQtdGC0YDQuNC10LkhINCe0LHRitC10LrRgiDQsdGD0LTQtdGCINC/0YDQvtC/0YPRidC10L0uJyk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIC8vZmVhdHVyZS5nZW9tZXRyeSA9IHNwT2JqO1xuICAgICAgICAgICAgICAgIGlmIChzcE9iaikge1xuICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAgICAgICAgIC8vINCe0YHRgtCw0LvRjNC90YvQtSDRgdCy0L7QudGB0YLQstCwLi4uLlxuICAgICAgICAgICAgICAgICAgICB2YXIgcHJvcHMgPSBQcm9wcy5nZXRQcm9wZXJ0aWVzKEFsbERhdGEuWm9uZXMuWm9uZSwgJ1pvbmUnKTtcbiAgICAgICAgICAgICAgICAgICAgaWYgKHByb3BzKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLnByb3BlcnRpZXMgPSBwcm9wcy56b25lUHJvcGVydGllcztcbiAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQntCx0YrQtdC60YIg0YHQvtC30LTQsNC9LiDQmtCdOicgKyBmZWF0dXJlLnByb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIpO1xuICAgICAgICAgICAgICAgICAgICBnZW9KU09OWm9uZXMuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgLy9nZW9KU09OWm9uZXMuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Cd0LXRgiDQvtC/0LjRgdCw0L3QuNGPINC/0YDQvtGB0YLRgNCw0L3RgdGC0LLQtdC90L3QvtC5INGB0L7RgdGC0LDQstC70Y/RjtGJ0LXQuSDQt9C+0L3RiycpO1xuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuICAgIC8vINCe0LHRgNCw0LHQvtGC0LrQsCDQstGB0LXRhSDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QslxuICAgIGZvciAodmFyIGUgPSAwOyBlIDwgQWxsRGF0YS5QYXJjZWxzLlBhcmNlbC5sZW5ndGg7IGUrKykge1xuICAgICAgICB2YXIgc3BPYmogPSBudWxsO1xuICAgICAgICAvLyDQl9C10LzQtdC70YzQvdGL0Lkg0YPRh9Cw0YHRgtC+0LpcbiAgICAgICAgdmFyIGZlYXR1cmUgPSB7XG4gICAgICAgICAgICAndHlwZSc6ICdGZWF0dXJlJ1xuICAgICAgICB9O1xuICAgICAgICBpZiAoQWxsRGF0YS5QYXJjZWxzLlBhcmNlbFtlXS5FbnRpdHlTcGF0aWFsICE9PSB1bmRlZmluZWQpIHtcbiAgICAgICAgICAgIHNwT2JqID0gRVMuZ2V0RW50aXR5U3BhdGlhbChBbGxEYXRhLlBhcmNlbHMuUGFyY2VsW2VdLkVudGl0eVNwYXRpYWwsIHByb2pNU0ssICdQYXJjZWwnLCBmYWxzZSk7XG4gICAgICAgICAgICBpZiAoKHNwT2JqID09PSB1bmRlZmluZWQpIHx8IChzcE9iai5sZW5ndGggPT09IDApKSB7XG4gICAgICAgICAgICAgICAgY29udGludWU7XG4gICAgICAgICAgICB9XG5cbiAgICAgICAgfVxuICAgICAgICAvLyDQnNC90L7Qs9C+0LrQvtC90YLRg9GA0L3Ri9C5XG4gICAgICAgIGVsc2UgaWYgKEFsbERhdGEuUGFyY2Vscy5QYXJjZWxbZV0uQ29udG91cnMpIHtcbiAgICAgICAgICAgIHZhciBDb250b3VycyA9IEFsbERhdGEuUGFyY2Vscy5QYXJjZWxbZV0uQ29udG91cnMuQ29udG91cjtcbiAgICAgICAgICAgIHZhciBtdWx0aVBvbHlnb24gPSBbXTtcbiAgICAgICAgICAgIGZvciAodmFyIGMgPSAwOyBjIDwgQ29udG91cnMubGVuZ3RoOyBjKyspIHtcbiAgICAgICAgICAgICAgICB2YXIgZXMgPSBDb250b3Vyc1tjXS5FbnRpdHlTcGF0aWFsO1xuICAgICAgICAgICAgICAgIHZhciBwID0gRVMuZ2V0RW50aXR5U3BhdGlhbChlcywgcHJvak1TSywgJ1BhcmNlbCcsIHRydWUpO1xuICAgICAgICAgICAgICAgIGlmIChwKSB7XG4gICAgICAgICAgICAgICAgICAgIG11bHRpUG9seWdvbi5wdXNoKHApO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIHNwT2JqID0ge1xuICAgICAgICAgICAgICAgIHR5cGU6IFwiTXVsdGlQb2x5Z29uXCIsXG4gICAgICAgICAgICAgICAgY29vcmRpbmF0ZXM6IG11bHRpUG9seWdvblxuICAgICAgICAgICAgfTtcbiAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgIC8vY29uc29sZS5sb2coJ9Cd0LXRgiDQvtC/0LjRgdCw0L3QuNGPINC/0YDQvtGB0YLRgNCw0L3RgdGC0LLQtdC90L3QvtC5INGB0L7RgdGC0LDQstC70Y/RjtGJ0LXQuScpO1xuICAgICAgICB9XG5cbiAgICAgICAgLy8g0JXRgdC70Lgg0L3QtdGCINCz0LXQvtC80LXRgtGA0LjQuCwg0YLQviDQvtCx0YrQtdC60YIg0L3QtSDQvdGD0LbQtdC9XG4gICAgICAgIGlmIChzcE9iaikge1xuICAgICAgICAgICAgZmVhdHVyZS5nZW9tZXRyeSA9IHNwT2JqO1xuICAgICAgICAgICAgLy8g0J7RgdGC0LDQu9GM0L3Ri9C1INGB0LLQvtC50YHRgtCy0LAuLi4uXG4gICAgICAgICAgICB2YXIgcHJvcHMgPSBQcm9wcy5nZXRQcm9wZXJ0aWVzKEFsbERhdGEuUGFyY2Vscy5QYXJjZWxbZV0sICdQYXJjZWwnKTtcbiAgICAgICAgICAgIGlmIChwcm9wcykge1xuICAgICAgICAgICAgICAgIGZlYXR1cmUucHJvcGVydGllcyA9IHByb3BzLnBhcmNlbFByb3BlcnRpZXM7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQntCx0YrQtdC60YIg0YHQvtC30LTQsNC9LiDQmtCdOicgKyBmZWF0dXJlLnByb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIpO1xuICAgICAgICAgICAgZ2VvSlNPTlBhcmNlbHMuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgfVxuXG4gICAgfVxuICAgIC8vINCe0LHRgNCw0LHQvtGC0LrQsCDRgdGC0YDQvtC10L3QuNC5LiDQvNC+0LPRg9GCINCx0YvRgtGMINGB0L7RgdGC0LDQstC90YvQtSDQuNC3INGA0LDQt9C90YvRhSDQs9C10L7QvNC10YLRgNC40LlcbiAgICBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eSkge1xuICAgICAgICBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eS5zcGxpY2UpIHtcblxuICAgICAgICAgICAgZnVuY3Rpb24gcHJvY2Vzc0VTKEVudGl0eVNwYXRpYWwsIG9UeXBlKSB7XG4gICAgICAgICAgICAgICAgdmFyIHNwT2JqID0gRVMuZ2V0RW50aXR5U3BhdGlhbChFbnRpdHlTcGF0aWFsLCBwcm9qTVNLLCBvVHlwZSwgdHJ1ZSk7XG4gICAgICAgICAgICAgICAgaWYgKHNwT2JqKSB7XG4gICAgICAgICAgICAgICAgICAgIGlmIChzcE9iai50eXBlID09PSAnR2VvbWV0cnlDb2xsZWN0aW9uJykge1xuICAgICAgICAgICAgICAgICAgICAgICAgLy8gR2VvSlNPTiDRgSDQutC+0LvQu9C10LrRhtC40LXQuSDRgtGA0YPQtNC90L4g0L7RgtC60YDRi9Cy0LDRgtGMINC90LAg0LTQtdGB0LrRgtC+0L/QtVxuICAgICAgICAgICAgICAgICAgICAgICAgLy8gb2dyMm9nciAtZiBHZW9KU09OIC1leHBsb2RlY29sbGVjdGlvbnMgZXhwbG9kZSBkb2MyMTM5NDMzX3htbF9SZWFsdHlHQy5nZW9qc29uXG4gICAgICAgICAgICAgICAgICAgICAgICAvLyDQv9C+0Y3RgtC+0LzRgyDQu9GD0YfRiNC1INGB0L7Qt9C00LDRgtGMINGE0LjRhyDQv9C+INC60L7Qu9C40YfQtdGB0YLQstGDINC+0LHRitC10LrRgtC+0LIg0LIg0LrQvtC70LvQtdC60YbQuNC4XG4gICAgICAgICAgICAgICAgICAgICAgICBmb3IgKHZhciBrID0gMDsgayA8IHNwT2JqLmdlb21ldHJpZXMubGVuZ3RoOyBrKyspIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmouZ2VvbWV0cmllc1trXTtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBnZW9KU09OUmVhbHR5LmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICAvL2dlb0pTT05SZWFsdHlDb2xsZWN0aW9uLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQlNC+0LHQsNCy0LvQtdC9IGdlb0pTT05SZWFsdHlHZW9tZXRyeUNvbGxlY3Rpb24nKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2coc3BPYmouZ2VvbWV0cmllcyk7XG4gICAgICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAgICAgICAgICAgICBnZW9KU09OUmVhbHR5LmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgIH1cblxuICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQntCa0KEg0YEg0L/Rg9GB0YLQvtC5INCz0LXQvtC80LXRgtGA0LjQtdC5ISDQntCx0YrQtdC60YIg0LHRg9C00LXRgiDQv9GA0L7Qv9GD0YnQtdC9LicpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cblxuICAgICAgICAgICAgZm9yICh2YXIgaSA9IDA7IGkgPCBBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5Lmxlbmd0aDsgaSsrKSB7XG4gICAgICAgICAgICAgICAgdmFyIHNwT2JqID0gbnVsbDtcbiAgICAgICAgICAgICAgICAvLyDQntCa0KFcbiAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICAgICAgICAgJ3R5cGUnOiAnRmVhdHVyZSdcbiAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgIC8vINGB0YLRgNC+0LXQvdC40Y9cbiAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5CdWlsZGluZykge1xuICAgICAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5CdWlsZGluZy5FbnRpdHlTcGF0aWFsKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICB2YXIgcHJvcHMgPSBQcm9wcy5nZXRQcm9wZXJ0aWVzKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uQnVpbGRpbmcsICdCdWlsZGluZycpO1xuICAgICAgICAgICAgICAgICAgICAgICAgaWYgKHByb3BzKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5wcm9wZXJ0aWVzID0gcHJvcHMuYnVpbGRpbmdQcm9wZXJ0aWVzO1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2cocHJvcHMuYnVpbGRpbmdQcm9wZXJ0aWVzKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgIHByb2Nlc3NFUyhBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLkJ1aWxkaW5nLkVudGl0eVNwYXRpYWwsICdCdWlsZGluZycpO1xuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIC8vINC+0LHRitC10LrRgtGLINC90LXQt9Cw0LLQtdGA0YjRkdC90L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LBcbiAgICAgICAgICAgICAgICBlbHNlIGlmIChBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLlVuY29tcGxldGVkKSB7XG4gICAgICAgICAgICAgICAgICAgIGlmIChBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLlVuY29tcGxldGVkLkVudGl0eVNwYXRpYWwpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIHZhciBwcm9wcyA9IFByb3BzLmdldFByb3BlcnRpZXMoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5VbmNvbXBsZXRlZCwgJ1VuY29tcGxldGVkJyk7XG4gICAgICAgICAgICAgICAgICAgICAgICBpZiAocHJvcHMpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLnByb3BlcnRpZXMgPSBwcm9wcy51bmNvbXBsZXRlZFByb3BlcnRpZXM7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZyhwcm9wcy51bmNvbXBsZXRlZFByb3BlcnRpZXMpO1xuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICAgcHJvY2Vzc0VTKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uVW5jb21wbGV0ZWQuRW50aXR5U3BhdGlhbCwgJ1VuY29tcGxldGVkJyk7XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgLy8g0YHQvtC+0YDRg9C20LXQvdC40Y9cbiAgICAgICAgICAgICAgICBlbHNlIGlmIChBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLkNvbnN0cnVjdGlvbikge1xuICAgICAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5Db25zdHJ1Y3Rpb24uRW50aXR5U3BhdGlhbCkge1xuICAgICAgICAgICAgICAgICAgICAgICAgdmFyIHByb3BzID0gUHJvcHMuZ2V0UHJvcGVydGllcyhBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLkNvbnN0cnVjdGlvbiwgJ0NvbnN0cnVjdGlvbicpO1xuICAgICAgICAgICAgICAgICAgICAgICAgaWYgKHByb3BzKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5wcm9wZXJ0aWVzID0gcHJvcHMuY29uc3RydWN0aW9uUHJvcGVydGllcztcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKHByb3BzLmNvbnN0cnVjdGlvblByb3BlcnRpZXMpO1xuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICAgcHJvY2Vzc0VTKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uQ29uc3RydWN0aW9uLkVudGl0eVNwYXRpYWwsICdDb25zdHJ1Y3Rpb24nKTtcbiAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cbiAgICAvLyDQntCx0YDQsNCx0L7RgtC60LAg0L/Rg9C90LrRgtC+0LIg0J7QnNChXG5cbiAgICByZXR1cm4ge1xuICAgICAgICBnZW9KU09OUXVhcnRhbDogZ2VvSlNPTlF1YXJ0YWwsXG4gICAgICAgIGdlb0pTT05Cb3VuZHM6IGdlb0pTT05Cb3VuZHMsXG4gICAgICAgIGdlb0pTT05ab25lczogZ2VvSlNPTlpvbmVzLFxuICAgICAgICBnZW9KU09OUGFyY2VsczogZ2VvSlNPTlBhcmNlbHMsXG4gICAgICAgIGdlb0pTT05SZWFsdHk6IGdlb0pTT05SZWFsdHlcbiAgICAgICAgLy9nZW9KU09OUmVhbHR5R2VvbWV0cnlDb2xsZWN0aW9uOiBnZW9KU09OUmVhbHR5Q29sbGVjdGlvblxuICAgIH07XG59O1xuIiwiLyoqXG4gKiDQnNC+0LTRg9C70Ywg0L7QsdGA0LDQsdC+0YLQutC4INCz0LXQvtC80LXRgtGA0LjQuCDRgtC40L/QsCDQv9C+0LvQuNCz0L7QvS5cbiAqINCe0LTQuNC9INCy0L3QtdGI0L3QuNC5INC60L7QvdGC0YPRgCDQuCAwINC40LvQuCDQsdC+0LvQtdC1INCy0L3Rg9GC0YDQtdC90L3QuNGFINC60L7QvdGC0YPRgNC+0LItXCLQtNGL0YDQvtC6XCJcbiAqIFxuICogR2VvSlNPTiBnZW9tZXRyeSDRgtC40L/QsCB0RW50aXR5U3BhdGlhbExhbmRPdXRcbiAqL1xuXG4vL1wiZ2VvbWV0cnlcIjoge1xuLy8gICAgXCJ0eXBlXCI6IFwiUG9seWdvblwiLFxuLy8gICAgXCJjb29yZGluYXRlc1wiOiBbXG4vLyAgICAgIFsgWzEwMC4wLCAwLjBdLCBbMTAxLjAsIDAuMF0sIFsxMDEuMCwgMS4wXSxcbi8vICAgICAgICBbMTAwLjAsIDEuMF0sIFsxMDAuMCwgMC4wXSBdXG4vLyAgICAgIF1cbi8vICB9XG5cbnZhciBwcm9qZWN0aW9ucyA9IHJlcXVpcmUoJy4vU3BhdGlhbFN5c3RlbXMnKTtcblxubW9kdWxlLmV4cG9ydHMuZ2V0RW50aXR5U3BhdGlhbCA9IGZ1bmN0aW9uIChFbnRpdHlTcGF0aWFsT2JqLCBwcm9qLCBvVHlwZSwgcGFydE9mTXVsdHUpIHtcblxuLy9cdHRoaXMuZ2VvbWV0cnkgPSB7XG4vLyAgICAgICAgdHlwZTogJycsXG4vL1x0XHRjb29yZGluYXRlczogW11cbi8vXHR9O1xuXG4gICAgdmFyIF9FbnRpdHlTcGF0aWFsT2JqID0gRW50aXR5U3BhdGlhbE9iajtcbiAgICB2YXIgX3Byb2ogPSBwcm9qIHx8IG51bGw7XG4gICAgdmFyIEFyZWEgPSAwLjA7XG4gICAgdmFyIHNwYXRpYWxTeXNOYW1lID0gbnVsbDtcbiAgICB2YXIgTGluZVN0cmluZyA9IGZhbHNlO1xuXG4gICAgLy8g0JLRi9GH0LjRgdC70LXQvdC40LUg0L/Qu9C+0YnQsNC00Lgg0LfQsNC80LrQvdGD0YLQvtCz0L4g0LrQvtC90YLRg9GA0LBcbiAgICBmdW5jdGlvbiBwb2x5Z29uQXJlYShYcywgWXMsIG51bVBvaW50cykge1xuICAgICAgICB2YXIgYXJlYSA9IDA7XG4gICAgICAgIHZhciBqID0gbnVtUG9pbnRzIC0gMTtcbiAgICAgICAgZm9yICh2YXIgaSA9IDA7IGkgPCBudW1Qb2ludHM7IGkrKylcbiAgICAgICAge1xuICAgICAgICAgICAgYXJlYSA9IGFyZWEgKyAoKFhzW2pdKSArIChYc1tpXSkpICogKChZc1tqXSkgLSAoWXNbaV0pKTtcbiAgICAgICAgICAgIGogPSBpOyAgLy9qIGlzIHByZXZpb3VzIHZlcnRleCB0byBpXG4gICAgICAgIH1cbiAgICAgICAgcmV0dXJuIE1hdGguYWJzKGFyZWEgLyAyKTtcbiAgICB9XG5cbiAgICBmdW5jdGlvbiBjb252ZXJ0Q29vcmQoY29vcmQpIHtcbiAgICAgICAgLy8gZ2xvYmFsXG4gICAgICAgIGlmICgoX3Byb2ogPT09IG51bGwpIHx8IChzcGF0aWFsU3lzTmFtZSA9PT0gbnVsbCkpIHtcbiAgICAgICAgICAgIHJldHVybiBjb29yZDtcbiAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgIHJldHVybiBwcm9qNChwcm9qZWN0aW9ucy5TcGF0aWFsU3lzdGVtc1tzcGF0aWFsU3lzTmFtZV0sICdFUFNHOjM4NTcnLCBjb29yZCk7XG4gICAgICAgIH1cbiAgICB9XG5cbiAgICBmdW5jdGlvbiBnZXRTcGF0aWFsU3lzTmFtZSgpIHtcbiAgICAgICAgdmFyIGlkID0gX0VudGl0eVNwYXRpYWxPYmouRW50U3lzO1xuICAgICAgICBmb3IgKHZhciBpID0gMDsgX3Byb2ouQ29vcmRTeXN0ZW0ubGVuZ3RoOyBpKyspIHtcbiAgICAgICAgICAgIGlmIChfcHJvai5Db29yZFN5c3RlbVtpXS5Dc0lkID09PSBpZCkge1xuICAgICAgICAgICAgICAgIHJldHVybiBfcHJvai5Db29yZFN5c3RlbVtpXS5OYW1lO1xuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgICAgIHJldHVybiBudWxsO1xuICAgIH1cblxuICAgIC8vINCh0L7Qt9C00LDQvdC40LUg0L7QtNC90L7Qs9C+INC30LDQvNC60L3Rg9GC0L7Qs9C+INC60L7QvdGC0YPRgNCwINC40LvQuCDQu9C40L3QuNC4INC40LvQuCDQvtC60YDRg9C20L3QvtGB0YLQuFxuICAgIGZ1bmN0aW9uIGNyZWF0ZUNvbnRvdXIoU3BhdGlhbEVsZW1lbnQpIHtcbiAgICAgICAgdmFyIHhzID0gW107XG4gICAgICAgIHZhciB5cyA9IFtdO1xuICAgICAgICB2YXIgY29udG91ciA9IFtdO1xuICAgICAgICB2YXIgY29vcmQ7XG4gICAgICAgIHZhciByZV9wcm9qZWN0ZWQgPSBbXTtcbiAgICAgICAgLy8g0L/RgNC+0LLQtdGA0LrQsCDQvdCwINC+0LrRgNGD0LbQvdC+0YHRgtGMXG4gICAgICAgIGlmICgoU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5UeXBlVW5pdCA9PT0gXCLQntC60YDRg9C20L3QvtGB0YLRjFwiIHx8IFwi0KLQvtGH0LrQsFwiKSAmJlxuICAgICAgICAgICAgICAgIChTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0LlIgIT09IHVuZGVmaW5lZCkpIHtcbiAgICAgICAgICAgIGNvb3JkID0gW051bWJlcihTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0Lk9yZGluYXRlLlkpLCBOdW1iZXIoU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5PcmRpbmF0ZS5YKV07XG4gICAgICAgICAgICByZV9wcm9qZWN0ZWQgPSBjb252ZXJ0Q29vcmQoY29vcmQpO1xuICAgICAgICAgICAgcmV0dXJuIHtcbiAgICAgICAgICAgICAgICAnUic6IE51bWJlcihTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0LlIpLFxuICAgICAgICAgICAgICAgICdZJzogTnVtYmVyKHJlX3Byb2plY3RlZFswXSksXG4gICAgICAgICAgICAgICAgJ1gnOiBOdW1iZXIocmVfcHJvamVjdGVkWzFdKVxuICAgICAgICAgICAgfTtcbiAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgIGlmIChTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0Lmxlbmd0aCA9PT0gMSlcbiAgICAgICAgICAgICAgICByZXR1cm4gbnVsbDtcbiAgICAgICAgICAgIHZhciBmaXJzdFBvaW50ID0gU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdFswXTtcbiAgICAgICAgICAgIHZhciBsYXN0UG9pbnQgPSBTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0W1NwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXQubGVuZ3RoIC0gMV07XG4gICAgICAgICAgICBpZiAoZmlyc3RQb2ludC5TdU5tYiA9PT0gbGFzdFBvaW50LlN1Tm1iKSB7XG4gICAgICAgICAgICAgICAgTGluZVN0cmluZyA9IGZhbHNlO1xuICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2coTGluZVN0cmluZywgZmlyc3RQb2ludC5TdU5tYiwgbGFzdFBvaW50LlN1Tm1iKTtcbiAgICAgICAgICAgICAgICBmb3IgKHZhciBqID0gMDsgaiA8IFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXQubGVuZ3RoIC0gMTsgaisrKSB7XG4gICAgICAgICAgICAgICAgICAgIHZhciBwb2ludCA9IFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXRbal07XG4gICAgICAgICAgICAgICAgICAgIHZhciB4eSA9IFtdO1xuICAgICAgICAgICAgICAgICAgICBjb29yZCA9IFtOdW1iZXIocG9pbnQuT3JkaW5hdGUuWSksIE51bWJlcihwb2ludC5PcmRpbmF0ZS5YKV07XG4gICAgICAgICAgICAgICAgICAgIHJlX3Byb2plY3RlZCA9IGNvbnZlcnRDb29yZChjb29yZCk7XG4gICAgICAgICAgICAgICAgICAgIHh5LnB1c2goTnVtYmVyKHJlX3Byb2plY3RlZFswXSkpO1xuICAgICAgICAgICAgICAgICAgICB4eS5wdXNoKE51bWJlcihyZV9wcm9qZWN0ZWRbMV0pKTtcbiAgICAgICAgICAgICAgICAgICAgY29udG91ci5wdXNoKHh5KTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgY29udG91ci5wdXNoKGNvbnRvdXJbMF0pO1xuICAgICAgICAgICAgICAgIEFyZWEgPSBwb2x5Z29uQXJlYSh4cywgeXMsIHhzLmxlbmd0aCk7XG4gICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgIExpbmVTdHJpbmcgPSB0cnVlO1xuICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2coTGluZVN0cmluZywgZmlyc3RQb2ludC5TdU5tYiwgbGFzdFBvaW50LlN1Tm1iKTtcbiAgICAgICAgICAgICAgICBmb3IgKHZhciBqID0gMDsgaiA8IFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXQubGVuZ3RoOyBqKyspIHtcbiAgICAgICAgICAgICAgICAgICAgdmFyIHBvaW50ID0gU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdFtqXTtcbiAgICAgICAgICAgICAgICAgICAgdmFyIHh5ID0gW107XG4gICAgICAgICAgICAgICAgICAgIGNvb3JkID0gW051bWJlcihwb2ludC5PcmRpbmF0ZS5ZKSwgTnVtYmVyKHBvaW50Lk9yZGluYXRlLlgpXTtcbiAgICAgICAgICAgICAgICAgICAgcmVfcHJvamVjdGVkID0gY29udmVydENvb3JkKGNvb3JkKTtcbiAgICAgICAgICAgICAgICAgICAgeHkucHVzaChOdW1iZXIocmVfcHJvamVjdGVkWzBdKSk7XG4gICAgICAgICAgICAgICAgICAgIHh5LnB1c2goTnVtYmVyKHJlX3Byb2plY3RlZFsxXSkpO1xuICAgICAgICAgICAgICAgICAgICBjb250b3VyLnB1c2goeHkpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAvLyDQsdGL0LLQsNC1INGH0YLQviBMaW5lU3RyaW5nINC40LzQtdC10YIg0L7QtNC40L3QsNC60L7QstGL0LUg0L/QtdGA0LLRg9GOINC4INC/0L7RgdC70LXQtNC90Y7RjiDRgtC+0YfQutC4XG4gICAgICAgICAgICAgICAgLy8g0L3QviBTdU5tYiDRgNCw0LfQvdGL0LUuXG4vLyAgICAgICAgICAgICAgICBpZiAoKGNvbnRvdXJbMF1bMF1bMF0gPT09IGNvbnRvdXJbMF1bY29udG91clswXS5sZW5ndGgtMV1bMF0pICYmXG4vLyAgICAgICAgICAgICAgICAgICAgICAgIChjb250b3VyWzBdWzBdWzFdID09PSBjb250b3VyWzBdW2NvbnRvdXJbMF0ubGVuZ3RoLTFdWzFdKSl7XG4vLyAgICAgICAgICAgICAgICAgICAgZGVsZXRlKGNvbnRvdXJbMF1bY29udG91ci5sZW5ndGgtMV0pO1xuLy8gICAgICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKGNvbnRvdXJbMF1bMF1bMF0sIGNvbnRvdXJbMF1bY29udG91clswXS5sZW5ndGgtMV1bMF0sTGluZVN0cmluZyk7XG4vLyAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICAvL2NvbnNvbGUubG9nKEFyZWEpO1xuICAgICAgICAgICAgcmV0dXJuIGNvbnRvdXI7XG4gICAgICAgIH1cbiAgICB9XG5cbiAgICBmdW5jdGlvbiBwcm9jZXNzU3BhdGlhbEVsZW1lbnQoU3BhdGlhbEVsZW1lbnQpIHtcbiAgICAgICAgdmFyIGNudHJzID0gW107XG4gICAgICAgIGlmIChfcHJvaiAhPT0gbnVsbCkge1xuICAgICAgICAgICAgc3BhdGlhbFN5c05hbWUgPSBnZXRTcGF0aWFsU3lzTmFtZSgpO1xuICAgICAgICB9XG4gICAgICAgIC8vINCj0YLQuNC90L3QsNGPINGC0LjQv9C40LfQsNGG0LjRjyDQtNC70Y8g0L/RgNC+0LLQtdGA0LrQuCDQvdCw0LvQuNGH0LjRjyDQtNGL0YDQvtC6INCyINC/0L7Qu9C40LPQvtC90LVcbiAgICAgICAgLy8g0JIg0KDQvtGB0YDQtdC10YHRgtGA0LUg0L3QtSDRgdC70LXQtNGP0YIg0LfQsCDQv9C+0YDRj9C00LrQvtC8INC60L7QvdGC0YPRgNC+0LIg0L/QvtC70LjQs9C+0L3QsFxuICAgICAgICBpZiAoU3BhdGlhbEVsZW1lbnQuc3BsaWNlKSB7XG4gICAgICAgICAgICB2YXIgTWF4QXJlYTtcbiAgICAgICAgICAgIHZhciBNYXhBcmVhSWR4ID0gMDtcbiAgICAgICAgICAgIGZvciAodmFyIGsgPSAwOyBrIDwgU3BhdGlhbEVsZW1lbnQubGVuZ3RoOyBrKyspIHtcbiAgICAgICAgICAgICAgICB2YXIgY29udG91ciA9IFNwYXRpYWxFbGVtZW50W2tdO1xuICAgICAgICAgICAgICAgIHZhciBjbnQgPSBjcmVhdGVDb250b3VyKGNvbnRvdXIpO1xuICAgICAgICAgICAgICAgIGlmIChjbnQpXG4gICAgICAgICAgICAgICAgICAgIGNudHJzLnB1c2goY250KTtcbiAgICAgICAgICAgICAgICBpZiAoQXJlYSA+IE1heEFyZWEpIHtcbiAgICAgICAgICAgICAgICAgICAgTWF4QXJlYSA9IEFyZWE7XG4gICAgICAgICAgICAgICAgICAgIE1heEFyZWFJZHggPSBrO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIC8vINCf0LXRgNC10LzQtdGJ0LDQtdC8INC+0YHQvdC+0LLQvdC+0LkgKNC90LDRgNGD0LbQvdC40LkpINC60L7QvdGC0YPRgCDQsiDQvdCw0YfQsNC70L4g0LzQsNGB0YHQuNCy0LBcbiAgICAgICAgICAgIGlmIChNYXhBcmVhSWR4ID4gMCkge1xuICAgICAgICAgICAgICAgIHZhciBtYWluQ250ID0gY250cnMuc3BsaWNlKE1heEFyZWFJZHgsIDEpO1xuICAgICAgICAgICAgICAgIGNudHJzLnNwbGljZSgwLCAwLCBtYWluQ250KTtcbiAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQndC+0LzQtdGAINC+0YHQvdC+0LLQvdC+0LPQviDQutC+0L3RgtGD0YDQsCDQsdGL0LsgJyArIE1heEFyZWFJZHgpO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgaWYgKChjbnRycyAhPT0gbnVsbCkgfHwgKGNudHJzICE9PSB1bmRlZmluZWQpKSB7XG4gICAgICAgICAgICAgICAgcmV0dXJuIGNudHJzO1xuICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICByZXR1cm4gbnVsbDtcbiAgICAgICAgICAgIH1cbiAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgIGNudHJzLnB1c2goY3JlYXRlQ29udG91cihTcGF0aWFsRWxlbWVudCkpO1xuICAgICAgICAgICAgaWYgKChjbnRycyAhPT0gbnVsbCkgfHwgKGNudHJzICE9PSB1bmRlZmluZWQpKSB7XG4gICAgICAgICAgICAgICAgcmV0dXJuIGNudHJzO1xuICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICByZXR1cm4gbnVsbDtcbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cblxuICAgIC8vINGDINGB0L7QvtGA0YPQttC10L3QuNC5INC80L7QttC10YIg0LHRi9GC0Ywg0YHQvNC10YjQsNC90LDRjyDQs9C10L7QvNC10YLRgNC40Y8gKExpbmVTdHJpbmcsIExpbmVTdHJpbmcsIENpcmNsZSwgTGluZVN0cmluZylcbiAgICAvLyDQsiDRjdGC0L7QvCDRgdC70YPRh9Cw0LUg0LrQvtC90YLRg9GA0YsgY250cnMg0LHRg9C00YPRgiDRhdGA0LDQvdC40YLRjCDQutC+0LvQu9C10LrRhtC40Y5cbiAgICBmdW5jdGlvbiBwcm9jZXNzUmVhbHR5U3BhdGlhbEVsZW1lbnQoU3BhdGlhbEVsZW1lbnQpIHtcbiAgICAgICAgdmFyIGNudHJzID0gW107XG4gICAgICAgIGlmIChfcHJvaiAhPT0gbnVsbCkge1xuICAgICAgICAgICAgc3BhdGlhbFN5c05hbWUgPSBnZXRTcGF0aWFsU3lzTmFtZSgpO1xuICAgICAgICB9XG4gICAgICAgIGlmIChTcGF0aWFsRWxlbWVudC5zcGxpY2UpIHtcbiAgICAgICAgICAgIHZhciBNYXhBcmVhO1xuICAgICAgICAgICAgdmFyIE1heEFyZWFJZHggPSAwO1xuICAgICAgICAgICAgZm9yICh2YXIgayA9IDA7IGsgPCBTcGF0aWFsRWxlbWVudC5sZW5ndGg7IGsrKykge1xuICAgICAgICAgICAgICAgIHZhciBjb250b3VyID0gU3BhdGlhbEVsZW1lbnRba107XG4gICAgICAgICAgICAgICAgdmFyIGNudCA9IGNyZWF0ZUNvbnRvdXIoY29udG91cik7XG4gICAgICAgICAgICAgICAgaWYgKGNudClcbiAgICAgICAgICAgICAgICAgICAgY250cnMucHVzaChjbnQpO1xuICAgICAgICAgICAgICAgIGlmIChBcmVhID4gTWF4QXJlYSkge1xuICAgICAgICAgICAgICAgICAgICBNYXhBcmVhID0gQXJlYTtcbiAgICAgICAgICAgICAgICAgICAgTWF4QXJlYUlkeCA9IGs7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfVxuICAgICAgICAgICAgLy8g0J/QtdGA0LXQvNC10YnQsNC10Lwg0L7RgdC90L7QstC90L7QuSAo0L3QsNGA0YPQttC90LjQuSkg0LrQvtC90YLRg9GAINCyINC90LDRh9Cw0LvQviDQvNCw0YHRgdC40LLQsFxuICAgICAgICAgICAgaWYgKCghTGluZVN0cmluZykgJiYgKE1heEFyZWFJZHggPiAwKSkge1xuICAgICAgICAgICAgICAgIHZhciBtYWluQ250ID0gY250cnMuc3BsaWNlKE1heEFyZWFJZHgsIDEpO1xuICAgICAgICAgICAgICAgIGNudHJzLnNwbGljZSgwLCAwLCBtYWluQ250KTtcbiAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQndC+0LzQtdGAINC+0YHQvdC+0LLQvdC+0LPQviDQutC+0L3RgtGD0YDQsCDQsdGL0LsgJyArIE1heEFyZWFJZHgpO1xuICAgICAgICAgICAgfVxuICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgY250cnMucHVzaChjcmVhdGVDb250b3VyKFNwYXRpYWxFbGVtZW50KSk7XG4gICAgICAgIH1cbiAgICAgICAgaWYgKGNudHJzLmxlbmd0aCA+IDEpIHtcbiAgICAgICAgICAgIGNvbGxlY3Rpb24gPSBbXTtcblxuICAgICAgICAgICAgZm9yICh2YXIgaSA9IDA7IGkgPCBjbnRycy5sZW5ndGggLSAxOyBpKyspIHtcbiAgICAgICAgICAgICAgICAvLyDQntC60YDRg9C20L3QvtGB0YLRjFxuICAgICAgICAgICAgICAgIGlmIChjbnRyc1tpXS5SKSB7XG4gICAgICAgICAgICAgICAgICAgIHZhciBwb2ludHMgPSBhcHByb3hpbWF0ZUNpcmNsZShjbnRyc1tpXS5YLCBjbnRyc1tpXS5ZLCBjbnRyc1tpXS5SKTtcbiAgICAgICAgICAgICAgICAgICAgY29sbGVjdGlvbi5wdXNoKHtcbiAgICAgICAgICAgICAgICAgICAgICAgIFwidHlwZVwiOiBcIlBvbHlnb25cIixcbiAgICAgICAgICAgICAgICAgICAgICAgIFwiY29vcmRpbmF0ZXNcIjogW3BvaW50c11cbiAgICAgICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIC8vINCf0L7Qu9C40LPQvtC9XG4gICAgICAgICAgICAgICAgZWxzZSBpZiAoIUxpbmVTdHJpbmcpIHtcbiAgICAgICAgICAgICAgICAgICAgY29sbGVjdGlvbi5wdXNoKHtcbiAgICAgICAgICAgICAgICAgICAgICAgIFwidHlwZVwiOiBcIlBvbHlnb25cIixcbiAgICAgICAgICAgICAgICAgICAgICAgIFwiY29vcmRpbmF0ZXNcIjogW2NudHJzW2ldXVxuICAgICAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICBjb2xsZWN0aW9uLnB1c2goe1xuICAgICAgICAgICAgICAgICAgICAgICAgXCJ0eXBlXCI6IFwiTGluZVN0cmluZ1wiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXCJjb29yZGluYXRlc1wiOiBjbnRyc1tpXVxuICAgICAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICByZXR1cm4gIHtcbiAgICAgICAgICAgICAgICBcInR5cGVcIjogXCJHZW9tZXRyeUNvbGxlY3Rpb25cIixcbiAgICAgICAgICAgICAgICBcImdlb21ldHJpZXNcIjogY29sbGVjdGlvblxuICAgICAgICAgICAgfTtcblxuICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgLy8g0J7QutGA0YPQttC90L7RgdGC0YxcbiAgICAgICAgICAgIGlmIChjbnRyc1swXS5SKSB7XG4gICAgICAgICAgICAgICAgdmFyIHBvaW50cyA9IGFwcHJveGltYXRlQ2lyY2xlKGNudHJzWzBdLlgsIGNudHJzWzBdLlksIGNudHJzWzBdLlIpO1xuICAgICAgICAgICAgICAgIHJldHVybiB7XG4gICAgICAgICAgICAgICAgICAgIFwidHlwZVwiOiBcIlBvbHlnb25cIixcbiAgICAgICAgICAgICAgICAgICAgXCJjb29yZGluYXRlc1wiOiBbcG9pbnRzXVxuICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICAvLyDQn9C+0LvQuNCz0L7QvVxuICAgICAgICAgICAgZWxzZSBpZiAoIUxpbmVTdHJpbmcpIHtcbiAgICAgICAgICAgICAgICByZXR1cm57XG4gICAgICAgICAgICAgICAgICAgIFwidHlwZVwiOiBcIlBvbHlnb25cIixcbiAgICAgICAgICAgICAgICAgICAgXCJjb29yZGluYXRlc1wiOiBbY250cnNbMF1dXG4gICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgcmV0dXJue1xuICAgICAgICAgICAgICAgICAgICBcInR5cGVcIjogXCJMaW5lU3RyaW5nXCIsXG4gICAgICAgICAgICAgICAgICAgIFwiY29vcmRpbmF0ZXNcIjogY250cnNbMF1cbiAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuXG4gICAgZnVuY3Rpb24gYXBwcm94aW1hdGVDaXJjbGUoWCwgWSwgUikge1xuICAgICAgICB2YXIgcm90YXRlZEFuZ2xlLCB4LCB5O1xuICAgICAgICB2YXIgc2lkZXMgPSAzMjtcbiAgICAgICAgdmFyIHBvaW50cyA9IFtdO1xuICAgICAgICB4ID0gWCArIFI7IC8vINGB0LTQstC40LMg0L3QsCDQvtC60YDRg9C20L3QvtGB0YLRjFxuICAgICAgICAvL2NvbnNvbGUubG9nKCdhcHByb3hpbWF0ZUNpcmNsZScpO1xuICAgICAgICBmb3IgKHZhciBkID0gMDsgZCA8IHNpZGVzIC0gMTsgZCsrKSB7XG4gICAgICAgICAgICB2YXIgeHkgPSBbXTtcbiAgICAgICAgICAgIHJvdGF0ZWRBbmdsZSA9IChkICogMiAqIE1hdGguUEkgLyBzaWRlcyk7Ly9hbmdsZSArIChkICogMiAqIE1hdGguUEkgLyBzaWRlcyk7XG4gICAgICAgICAgICB4ID0gWCArIChSICogTWF0aC5jb3Mocm90YXRlZEFuZ2xlKSk7XG4gICAgICAgICAgICB5ID0gWSArIChSICogTWF0aC5zaW4ocm90YXRlZEFuZ2xlKSk7XG4gICAgICAgICAgICBjb29yZCA9IFtOdW1iZXIoeSksIE51bWJlcih4KV07XG4gICAgICAgICAgICB4eS5wdXNoKGNvb3JkWzBdKTtcbiAgICAgICAgICAgIHh5LnB1c2goY29vcmRbMV0pO1xuICAgICAgICAgICAgcG9pbnRzLnB1c2goeHkpO1xuICAgICAgICB9XG4gICAgICAgIHBvaW50cy5wdXNoKHBvaW50c1swXSk7XG4gICAgICAgIHJldHVybiBwb2ludHM7XG4gICAgfVxuXG4gICAgaWYgKChfRW50aXR5U3BhdGlhbE9iaiAhPT0gdW5kZWZpbmVkKSAmJiAoX0VudGl0eVNwYXRpYWxPYmogIT09IG51bGwpKSB7XG5cbiAgICAgICAgdmFyIGNudHJzID0gW107XG5cbiAgICAgICAgc3dpdGNoIChvVHlwZSkge1xuICAgICAgICAgICAgY2FzZSAnUGFyY2VsJyA6XG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICAgY250cnMgPSBwcm9jZXNzU3BhdGlhbEVsZW1lbnQoX0VudGl0eVNwYXRpYWxPYmouU3BhdGlhbEVsZW1lbnQpO1xuICAgICAgICAgICAgICAgIC8vINCV0YHQu9C4INGN0YLQviDQtNC70Y8g0LzQvdC+0LPQvtC60L7QvdGC0YPRgNC90L7Qs9C+INC+0LHRitC10LrRgtCwLCDRgtC+INCy0L7Qt9Cy0YDQsNGJ0LXQvCDQvNCw0YHRgdC40LIg0LrQvtC90YLRg9GA0L7QslxuICAgICAgICAgICAgICAgIGlmIChwYXJ0T2ZNdWx0dSkge1xuICAgICAgICAgICAgICAgICAgICByZXR1cm4gY250cnM7XG4gICAgICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICAgICAgcmV0dXJuIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIHR5cGU6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgY29vcmRpbmF0ZXM6IGNudHJzXG4gICAgICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgY2FzZSAnQ29uc3RydWN0aW9uJzpcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgICByZXR1cm4gcHJvY2Vzc1JlYWx0eVNwYXRpYWxFbGVtZW50KF9FbnRpdHlTcGF0aWFsT2JqLlNwYXRpYWxFbGVtZW50KTtcbiAgICAgICAgICAgICAgICBicmVhaztcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIGNhc2UgJ0J1aWxkaW5nJzpcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgICByZXR1cm4gcHJvY2Vzc1JlYWx0eVNwYXRpYWxFbGVtZW50KF9FbnRpdHlTcGF0aWFsT2JqLlNwYXRpYWxFbGVtZW50KTtcbiAgICAgICAgICAgICAgICBicmVhaztcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIGNhc2UgJ1VuY29tcGxldGVkJzpcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgICByZXR1cm4gcHJvY2Vzc1JlYWx0eVNwYXRpYWxFbGVtZW50KF9FbnRpdHlTcGF0aWFsT2JqLlNwYXRpYWxFbGVtZW50KTtcbiAgICAgICAgICAgICAgICBicmVhaztcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIGNhc2UgJ1pvbmUnOlxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAgIGNudHJzID0gcHJvY2Vzc1NwYXRpYWxFbGVtZW50KF9FbnRpdHlTcGF0aWFsT2JqLlNwYXRpYWxFbGVtZW50KTtcbiAgICAgICAgICAgICAgICBpZiAocGFydE9mTXVsdHUpIHtcbiAgICAgICAgICAgICAgICAgICAgcmV0dXJuIGNudHJzO1xuICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgIHJldHVybiB7XG4gICAgICAgICAgICAgICAgICAgICAgICB0eXBlOiBcIlBvbHlnb25cIixcbiAgICAgICAgICAgICAgICAgICAgICAgIGNvb3JkaW5hdGVzOiBjbnRyc1xuICAgICAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICBicmVhaztcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIGNhc2UgJ1F1YXJ0YWwnOlxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAgIGNudHJzID0gcHJvY2Vzc1NwYXRpYWxFbGVtZW50KF9FbnRpdHlTcGF0aWFsT2JqLlNwYXRpYWxFbGVtZW50KTtcbiAgICAgICAgICAgICAgICBpZiAocGFydE9mTXVsdHUpIHtcbiAgICAgICAgICAgICAgICAgICAgcmV0dXJuIGNudHJzO1xuICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgIHJldHVybiB7XG4gICAgICAgICAgICAgICAgICAgICAgICB0eXBlOiBcIlBvbHlnb25cIixcbiAgICAgICAgICAgICAgICAgICAgICAgIGNvb3JkaW5hdGVzOiBjbnRyc1xuICAgICAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICBicmVhaztcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIGNhc2UgJ0JvdW5kJzpcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgICBjbnRycyA9IHByb2Nlc3NTcGF0aWFsRWxlbWVudChfRW50aXR5U3BhdGlhbE9iai5TcGF0aWFsRWxlbWVudCk7XG4gICAgICAgICAgICAgICAgaWYgKHBhcnRPZk11bHR1KSB7XG4gICAgICAgICAgICAgICAgICAgIHJldHVybiBjbnRycztcbiAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICByZXR1cm4ge1xuICAgICAgICAgICAgICAgICAgICAgICAgdHlwZTogXCJQb2x5Z29uXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBjb29yZGluYXRlczogY250cnNcbiAgICAgICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgYnJlYWs7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBkZWZhdWx0IDpcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0KLQuNC/INC+0LHRitC10LrRgtCwINC90LUg0YDQsNGB0L/QvtC30L3QsNC9Jyk7XG4gICAgICAgICAgICAgICAgcmV0dXJuIG51bGw7XG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cbn1cbjtcbiIsIi8qIFxuICogVGhlIE1JVCBMaWNlbnNlXG4gKlxuICogQ29weXJpZ2h0IDIwMTUgZmlsaXBwb3YuXG4gKlxuICogUGVybWlzc2lvbiBpcyBoZXJlYnkgZ3JhbnRlZCwgZnJlZSBvZiBjaGFyZ2UsIHRvIGFueSBwZXJzb24gb2J0YWluaW5nIGEgY29weVxuICogb2YgdGhpcyBzb2Z0d2FyZSBhbmQgYXNzb2NpYXRlZCBkb2N1bWVudGF0aW9uIGZpbGVzICh0aGUgXCJTb2Z0d2FyZVwiKSwgdG8gZGVhbFxuICogaW4gdGhlIFNvZnR3YXJlIHdpdGhvdXQgcmVzdHJpY3Rpb24sIGluY2x1ZGluZyB3aXRob3V0IGxpbWl0YXRpb24gdGhlIHJpZ2h0c1xuICogdG8gdXNlLCBjb3B5LCBtb2RpZnksIG1lcmdlLCBwdWJsaXNoLCBkaXN0cmlidXRlLCBzdWJsaWNlbnNlLCBhbmQvb3Igc2VsbFxuICogY29waWVzIG9mIHRoZSBTb2Z0d2FyZSwgYW5kIHRvIHBlcm1pdCBwZXJzb25zIHRvIHdob20gdGhlIFNvZnR3YXJlIGlzXG4gKiBmdXJuaXNoZWQgdG8gZG8gc28sIHN1YmplY3QgdG8gdGhlIGZvbGxvd2luZyBjb25kaXRpb25zOlxuICpcbiAqIFRoZSBhYm92ZSBjb3B5cmlnaHQgbm90aWNlIGFuZCB0aGlzIHBlcm1pc3Npb24gbm90aWNlIHNoYWxsIGJlIGluY2x1ZGVkIGluXG4gKiBhbGwgY29waWVzIG9yIHN1YnN0YW50aWFsIHBvcnRpb25zIG9mIHRoZSBTb2Z0d2FyZS5cbiAqXG4gKiBUSEUgU09GVFdBUkUgSVMgUFJPVklERUQgXCJBUyBJU1wiLCBXSVRIT1VUIFdBUlJBTlRZIE9GIEFOWSBLSU5ELCBFWFBSRVNTIE9SXG4gKiBJTVBMSUVELCBJTkNMVURJTkcgQlVUIE5PVCBMSU1JVEVEIFRPIFRIRSBXQVJSQU5USUVTIE9GIE1FUkNIQU5UQUJJTElUWSxcbiAqIEZJVE5FU1MgRk9SIEEgUEFSVElDVUxBUiBQVVJQT1NFIEFORCBOT05JTkZSSU5HRU1FTlQuIElOIE5PIEVWRU5UIFNIQUxMIFRIRVxuICogQVVUSE9SUyBPUiBDT1BZUklHSFQgSE9MREVSUyBCRSBMSUFCTEUgRk9SIEFOWSBDTEFJTSwgREFNQUdFUyBPUiBPVEhFUlxuICogTElBQklMSVRZLCBXSEVUSEVSIElOIEFOIEFDVElPTiBPRiBDT05UUkFDVCwgVE9SVCBPUiBPVEhFUldJU0UsIEFSSVNJTkcgRlJPTSxcbiAqIE9VVCBPRiBPUiBJTiBDT05ORUNUSU9OIFdJVEggVEhFIFNPRlRXQVJFIE9SIFRIRSBVU0UgT1IgT1RIRVIgREVBTElOR1MgSU5cbiAqIFRIRSBTT0ZUV0FSRS5cbiAqL1xuXG4vKiAg0KHQuGPRgtC10LzRiyDQutC+0L7RgNC00LjQvdCw0YIg0LjQvNC10Y7RgiDRgdC80YvRgdC7INC00LvRjyDQstC40LfRg9Cw0LvQuNC30LDRhtC40Lgg0L/QvtC70YPRh9Cw0LXQvNGL0YUgR2VvSlNPTixcbiAgICDQtNC70Y8g0YHQvtGF0YDQsNC90LXQvdC40Y8g0LIg0YTQsNC50Lsg0L3QtdGCINC90LDQtNC+0LHQvdC+0YHRgtC4INCyINC/0YDQtdC+0LHRgNCw0LfQvtCy0LDQvdC40LguXG4gICAg0JjQvdGE0L7RgNC80LDRhtC40Y8g0L4g0YHQuNGB0YLQtdC80LDRhSDQutC+0L7RgNC00LjQvdCw0YIg0YXRgNCw0L3QuNGC0YHRjyDQsiDRgtC10LPQtSA8Q29vcmRTeXN0ZW1zPlxuICAgIDxDb29yZFN5c3RlbXM+XG4gICAgICAgIDxuczM6Q29vcmRTeXN0ZW0gTmFtZT1cItCc0KHQmiA3MCwg0LfQvtC90LAgM1wiIENzSWQ9XCJJRDNcIiAvPlxuICAgICAgICA8bnMzOkNvb3JkU3lzdGVtIE5hbWU9XCLQnNCh0JogNzAsINC30L7QvdCwIDRcIiBDc0lkPVwiSUQ0XCIgLz5cbiAgICA8L0Nvb3JkU3lzdGVtcz5cbiAgICDQuNGFINC80L7QttC10YIg0LHRi9GC0Ywg0L3QtdGB0LrQvtC70YzQutC+LlxuICAgINCjINC+0LHRitC10LrRgtC+0LIg0LIg0YLQtdCz0LUgPEVudGl0eVNwYXRpYWw+INGD0LrQsNC30LDQvdC+INCyINC60LDQutC+0Lkg0KHQmiDQvtC9INC40LzQtdC10YIg0LrQvtC+0YDQtNC40L3QsNGC0YssXG4gICAg0L3QsNC/0YDQuNC80LXRgDpcbiAgICA8RW50aXR5U3BhdGlhbCBFbnRTeXM9XCJJRDNcIj5cblxuICAgINC/0YDQvtCx0LvQtdC80Ysg0LrQvtC90LLQtdGA0YLQsNGG0LjQuCDRgyDRgtC10YUgeG1sINGDINC60L7RgtC+0YDRi9C5INGD0LrQsNC30LDQvdC+IDxuczM6Q29vcmRTeXN0ZW0gTmFtZT1cItCh0Jog0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INC+0LrRgNGD0LPQsFwiIENzSWQ9XCJJRDFcIiAvPlxuKi8gXG5cblxubW9kdWxlLmV4cG9ydHMuU3BhdGlhbFN5c3RlbXMgPSB7XG4gICAgLy8g0KLQvtC80YHQutCw0Y8g0L7QsdC70LDRgdGC0YxcbiAgICAn0JzQodCaIDcwLCDQt9C+0L3QsCA0JzogJytwcm9qPXRtZXJjICtsYXRfMD0wICtsb25fMD04My43MzMzMzMzMzMzMyAraz0xICt4XzA9NDI1MDAwMCAreV8wPS01OTEyOTAwLjU2NiArZWxscHM9a3Jhc3MgK3Rvd2dzODQ9MjMuNTcsLTE0MC45NSwtNzkuOCwwLDAuMzUsMC43OSwtMC4yMiArdW5pdHM9bSArbm9fZGVmcycsXG4gICAgJ9Cc0KHQmiA3MCwg0LfQvtC90LAgMic6ICcrcHJvaj10bWVyYyArbGF0XzA9MCArbG9uXzA9NzcuNzMzMzMzMzMzMzMgK2s9MSAreF8wPTIyNTAwMDAgK3lfMD0tNTkxMjkwMC41NjYgK2VsbHBzPWtyYXNzICt0b3dnczg0PTIzLjU3LC0xNDAuOTUsLTc5LjgsMCwwLjM1LDAuNzksLTAuMjIgK3VuaXRzPW0gK25vX2RlZnMnLFxuICAgICfQnNCh0JogNzAsINC30L7QvdCwIDMnOiAnK3Byb2o9dG1lcmMgK2xhdF8wPTAgK2xvbl8wPTgwLjczMzMzMzMzMzMzICtrPTEgK3hfMD0zMjUwMDAwICt5XzA9LTU5MTI5MDAuNTY2ICtlbGxwcz1rcmFzcyArdG93Z3M4ND0yMy41NywtMTQwLjk1LC03OS44LDAsMC4zNSwwLjc5LC0wLjIyICt1bml0cz1tICtub19kZWZzJ1xufTsiXX0=
