(function e(t,n,r){function s(o,u){if(!n[o]){if(!t[o]){var a=typeof require=="function"&&require;if(!u&&a)return a(o,!0);if(i)return i(o,!0);var f=new Error("Cannot find module '"+o+"'");throw f.code="MODULE_NOT_FOUND",f}var l=n[o]={exports:{}};t[o][0].call(l.exports,function(e){var n=t[o][1][e];return s(n?n:e)},l,l.exports,e,t,n,r)}return n[o].exports}var i=typeof require=="function"&&require;for(var o=0;o<r.length;o++)s(r[o]);return s})({1:[function(require,module,exports){
/* 
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */

(function () {
    var Converter = require('./cadXML2GeoJSON.js');

    var parcelStyle = {
        fillColor: "#b8e50e",
        color: "#000",
        weight: 1,
        opacity: 1,
        fillOpacity: 0.8
    };
    var oksStyle = {
        fillColor: "#ff7800",
        color: "#000",
        weight: 1,
        opacity: 1,
        fillOpacity: 1
    };
    var quartallStyle = {
        fillColor: "#e4dea4",
        color: "#000",
        weight: 1,
        opacity: 1,
        fillOpacity: 0.3
    };
    var zoneStyle = {
        fillColor: "#f91414",
        color: "#000",
        weight: 1,
        opacity: 1,
        fillOpacity: 0.8
    };
    var boundlStyle = {
        fillColor: "#4b5c70",
        color: "#000",
        weight: 1,
        opacity: 1,
        fillOpacity: 0.8
    };

    function layerFActory(geoJSON, layerStyle) {
        geoJSON.crs = {
            "type": "name",
            "properties": {
                "name": "urn:ogc:def:crs:EPSG::3857"
            }
        };
        return L.Proj.geoJson(
                geoJSON, {
                    style: layerStyle,
                    onEachFeature: function (feature, layer)
                    {
                        //layer.bindPopup(feature.properties);
                    }
                }
        );
    }

    var data = {

        init: function (map, reproject) {
            data._map = map;
            data.reproject = reproject;
            data._groups = {

            };

            data._exportCont = document.getElementById('exportCont');
            data._fileProgress = document.getElementById('fileProgress');
            var exportIcon = null;
            if (navigator.msSaveBlob) { // IE 10+
                exportIcon = L.DomUtil.create('button', 'button', data._exportCont);
            } else {
                exportIcon = L.DomUtil.create('a', 'button', data._exportCont);
                exportIcon.setAttribute('target', '_blank');
                exportIcon.setAttribute('href', '');
            }
            exportIcon.innerHTML = 'Экспорт в GeoJSON';
//      var convertCoord = L.DomUtil.get('convertMSK');
//      L.DomUtil.removeClass(convertCoord, 'hidden');
            data._countSpan = L.DomUtil.create('span', '', data._exportCont);
            exportIcon.addEventListener('click', function () {
                var obj = data.getBlob();
                if (navigator.msSaveOrOpenBlob) { // IE 10+
                    navigator.msSaveOrOpenBlob(obj.blob, obj.file);
                } else {
                    exportIcon.setAttribute('download', obj.file);
                    exportIcon.setAttribute('href', window.URL.createObjectURL(obj.blob));
                }
                data._countSpan.innerHTML = '(геометрий: <b>' + obj.count + '</b>)';
            }, false);
            L.DomUtil.addClass(data._exportCont, 'hidden');
            data._kptInfo = document.getElementById('kptInfo');

        },

        getBlob: function () {
            var fc = null,
                    items = data._groups;
            for (var g in items) {
                var geojson = items[g];
                if (fc) {
                    Array.prototype.push.apply(fc.features, geojson.features);
                } else {
                    fc = geojson;
                }
            }
            return {
                file: 'data_' + Date.now() + '.geojson',
                blob: new Blob([JSON.stringify(fc, null, '\t')], {type: 'text/json;charset=utf-8;'}),
                count: fc ? fc.features.length : 0
            };
        },

        selectFile: function (el) {
            data._kptInfo.innerHTML = '';
            data._fileProgress.innerHTML = '';
            L.DomUtil.addClass(data._exportCont, 'hidden');
            var reader = new FileReader(),
                    file = el.files[0];

            reader.onload = function () {
                data._fileProgress.innerHTML = 'загружено: <b>' + file.size + '</b> байт';
//        Object.keys(data._groups).forEach(function (type) {
//          var group = data._groups[type];
//          group.clearLayers();
//          data._map.removeLayer(group);
//        });
//        data._groups = {};
//        Object.keys(data._groupsMsk).forEach(function (type) {
//          var group = data._groupsMsk[type];
//          group.clearLayers();
//        });
//        data._groupsMsk = {};
                if (data._map.layers) {
                    for (var i = 0; i < data._map.layers.length; i++) {
                        data._map.removeLayer(data._map.layers[i]);
                    }
                }
                var oldLayerControl = document.getElementsByClassName('leaflet-control-layers');
                if (oldLayerControl.length>0) {
                    L.DomUtil.remove(oldLayerControl[0]);
                }
                data._groups = {};
                data.parseFile(reader);
            };
            reader.onprogress = function (data) {
                if (data.lengthComputable) {
                    L.DomUtil.removeClass(data._resCont, 'hidden');
                    var cnt = data.loaded / data.total;
                    data._fileProgress.innerHTML = 'загружено: <b>' + data.loaded + '</b> байт' + (cnt === 1 ? '' : '(' + parseInt(cnt * 100, 10) + '%)');
                }
            };
            if (el.files.length) {
                reader.readAsText(file);
            }
        },

        parseFile: function (reader) {
            // https://bitbucket.org/surenrao/xml2json
            // http://www.chrome-allow-file-access-from-file.com/
            var parsedData = Converter.GeoJSON(reader.result);
            var parcels = parsedData.geoJSONParcels;
            var oks = parsedData.geoJSONRealty;
            var zones = parsedData.geoJSONZones;
            var quartal = parsedData.geoJSONQuartal;
            var bounds = parsedData.geoJSONBounds;
            console.log(zones);
            console.log(bounds);
            data._groups = {
                parcels: parcels,
                oks: oks,
                zones: zones,
                quartal: quartal,
                bounds: bounds
            };

            var oksLayer = layerFActory(oks, oksStyle);
            var parcelLayer = layerFActory(parcels, parcelStyle);
            var zoneLayer = layerFActory(zones, zoneStyle);
            var boundLayer = layerFActory(bounds, boundlStyle);
            var quartalLayer = layerFActory(quartal, quartallStyle);

            var layerControl = L.control.layers({}, {
                'Квартал': quartalLayer,
                'Границы': boundLayer,
                'Зоны': zoneLayer,
                'Участки': parcelLayer,
                'ОКС': oksLayer
            }).addTo(data._map);

            data._map.fitBounds(parcelLayer.getBounds());
            L.DomUtil.removeClass(data._exportCont, 'hidden');
        }
    };
    window.convertedData = data;
})();

},{"./cadXML2GeoJSON.js":3}],2:[function(require,module,exports){
/* 
 * The MIT License
 *
 * Copyright 2015 filippov.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */
'use strict';
// Dicts

// Статус объекта недвижимости
var dStates = {
    '01': 'Ранее учтенный',
    '05': 'Временный',
    '06': 'Учтенный',
    '07': 'Снят с учета',
    '08': 'Аннулированный'
};
// Тип  объекта недвижимости
var dParcels = {
    '01': 'Землепользование',
    '02': 'Единое землепользование',
    '03': 'Обособленный участок',
    '04': 'Условный участок',
    '05': 'Многоконтурный участок',
    '06': 'Значение отсутствует'
};
// Категория земель
var dCategories = {
    '003001000000': 'Земли сельскохозяйственного назначения',
    '003002000000': 'Земли населённых пунктов',
    '003003000000': 'Земли промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, земли для обеспечения космической деятельности, земли обороны, безопасности и земли иного специального назначения',
    '003004000000': 'Земли особо охраняемых территорий и объектов',
    '003005000000': 'Земли лесного фонда',
    '003006000000': 'Земли водного фонда',
    '003007000000': 'Земли запаса',
    '003008000000': 'Категория не установлена'
};
// Ограничения (обременения) прав
var dEncumbrances = {
    '022001000000': 'Сервитут',
    '022001001000': 'Публичный сервитут',
    '022001002000': 'Частный сервитут',
    '022002000000': 'Арест',
    '022003000000': 'Запрещение',
    '022004000000': 'Ограничения прав на земельный участок, предусмотренные статьями 56, 56.1 Земельного кодекса Российской Федерации',
    '022005000000': 'Решение об изъятии земельного участка, жилого помещения',
    '022006000000': 'Аренда (в том числе, субаренда)',
    '022007000000': 'Ипотека',
    '022008000000': 'Ипотека в силу закона',
    '022009000000': 'Безвозмездное (срочное) пользование земельным/лесным участком',
    '022010000000': 'Доверительное управление',
    '022011000000': 'Рента',
    '022012000000': 'Запрет на совершение действий в сфере ГКУ в отношении ОН',
    '022099000000': 'Иные ограничения (обременения) прав'
};
// Единицы измерений
var dUnits = {
    '003': 'Миллиметр',
    '004': 'Сантиметр',
    '005': 'Дециметр',
    '006': 'Метр',
    '008': 'Километр',
    '009': 'Мегаметр',
    '047': 'Морская миля',
    '050': 'Квадратный миллиметр',
    '051': 'Квадратный сантиметр',
    '053': 'Квадратный дециметр',
    '055': 'Квадратный метр',
    '058': 'Тысяча квадратных метров',
    '059': 'Гектар',
    '061': 'Квадратный километр',
    '109': 'Ар (100 м2)',
    '359': 'Сутки',
    '360': 'Неделя',
    '361': 'Декада',
    '362': 'Месяц',
    '364': 'Квартал',
    '365': 'Полугодие',
    '356': 'Час',
    '355': 'Минута ',
    '366': 'Год',
    '383': 'Рубль',
    '384': 'Тысяча рублей',
    '385': 'Миллион рублей',
    '386': 'Миллиард рублей',
    '1000': 'Неопределено',
    '1001': 'Значение отсутствует',
    '1002': 'Рублей за кв. метр',
    '1003': 'Рублей за ар',
    '1004': 'Рублей  за гектар',
    '1005': 'Иные',
    '1006': 'Рублей за кв. км',
    '1007': 'Рабочий день'
};
// Все документы (Сборник классификаторов, коды 8.1, 8.2, 555, 558.1, 558.2, 558.3, 558.4, 558.5, 558.6)
var dAllDocuments = {
    '008001000000': 'Документы, удостоверяющие личность физического лица',
    '008001001000': 'Паспорт гражданина Российской Федерации',
    '008001002000': 'Паспорт гражданина СССР',
    '008001003000': 'Паспорт гражданина иностранного государства',
    '008001004000': 'Общегражданский заграничный паспорт',
    '008001005000': 'Заграничный паспорт Министерства морского флота',
    '008001006000': 'Дипломатический паспорт',
    '008001007000': 'Паспорт моряка (удостоверение личности моряка)',
    '008001008000': 'Военный билет военнослужащего',
    '008001009000': 'Временное удостоверение, выданное взамен военного билета',
    '008001010000': 'Удостоверение личности офицера Министерства обороны Российской Федерации, Министерства внутренних дел Российской Федерации и других воинских формирований с приложением справки о прописке (регистрации) Ф-33',
    '008001011000': 'Свидетельство о рождении',
    '008001012000': 'Свидетельство о рассмотрении ходатайства о признании беженцем на территории Российской Федерации по существу',
    '008001013000': 'Вид на жительство иностранного гражданина или лица без гражданства',
    '008001014000': 'Справка об освобождении из мест лишения свободы',
    '008001015000': 'Временное удостоверение личности гражданина Российской Федерации',
    '008001016000': 'Удостоверение вынужденного переселенца',
    '008001017000': 'Разрешение на временное проживание в Российской Федерации',
    '008001018000': 'Удостоверение беженца в Российской Федерации',
    '008001019000': 'Свидетельство о рассмотрении ходатайства о признании лица вынужденным переселенцем',
    '008001020000': 'Свидетельство о предоставлении временного убежища на территории Российской Федерации',
    '008001099000': 'Иные документы, предусмотренные законодательством Российской Федерации или признаваемые в соответствии с международным договором Российской Федерации в качестве документов, удостоверяющих личность',
    '008002000000': 'Документы, идентифицирующие юридическое лицо',
    '008002001000': 'Свидетельство о государственной регистрации юридического лица',
    '008002002000': 'Свидетельство о внесении записей в ЕГРЮЛ',
    '008002004000': 'Устав',
    '008002005000': 'Учредительный договор',
    '008002006000': 'Положение (общее положение об организации)',
    '008002007000': 'Свидетельство (или уведомление) о постановке на учёт в налоговом органе с указанием ИНН',
    '008002008000': 'Выписка из ЕГРЮЛ',
    '008002099000': 'Иной документ',
    '555001000000': 'Квитанция',
    '555002000000': 'Платёжное поручение',
    '555003000000': 'Чек',
    '555004000000': 'Подтверждение электронного платежа',
    '555005000000': 'Документ, подтверждающий право заявителя на безвозмездное получение сведений',
    '558100000000': 'ЗАЯВЛЕНИЯ',
    '558101000000': 'Заявления и запросы, связанные с государственным кадастровым учётом',
    '558101010000': 'Запрос о предоставлении сведений, внесённых в государственный кадастр недвижимости, в виде кадастровой выписки об объекте недвижимости, кадастрового паспорта объекта недвижимости и кадастрового плана территории, кадастровой справки о кадастровой стоимости объекта недвижимости',
    '558101020000': 'Заявление о постановке на государственный кадастровый учёт объекта недвижимости',
    '558101030000': 'Заявление о государственном кадастровом учёте изменений объекта недвижимости',
    '558101040000': 'Заявление о внесении в Единый государственный реестр объектов капитального строительства (ЕГРОКС) сведений об объекте капитального строительства (ОКС)',
    '558101050000': 'Запрос о предоставлении сведений об ОКС',
    '558101060000': 'Заявление о снятии с государственного кадастрового учёта объекта недвижимости',
    '558101070000': 'Заявление о внесении в государственный кадастр недвижимости сведений о ранее учтённом объекте недвижимости',
    '558101080000': 'Заявление об исправлении кадастровой ошибки',
    '558101090000': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости',
    '558101090100': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости об объекте недвижимости',
    '558101090200': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости о прохождении участка Государственной границы Российской Федерации; о границах между субъектами Российской Федерации; о границах муниципальных образований; о границах населённых пунктов; о территориальных зонах и зонах с особыми условиями использования территорий; о картографической и геодезической основах государственного кадастра недвижимости',
    '558101100000': 'Заявление о представлении дополнительных документов на государственный кадастровый учёт',
    '558101110000': 'Внутриведомственный запрос информации государственного кадастра недвижимости',
    '558101120000': 'Запрос о предоставлении копии документа, на основании которого сведения об объекте недвижимости внесены в государственный кадастр недвижимости',
    '558101130000': 'Запрос о предоставлении сведений, внесённых в государственный кадастр недвижимости, посредством обеспечения доступа к информационному ресурсу, содержащему сведения государственного кадастра недвижимости',
    '558101140000': 'Запрос о предоставлении перечня объектов недвижимости, подлежащих государственной кадастровой оценке',
    '558101150000': 'Заявление о прекращении осуществления кадастрового учёта',
    '558101160000': 'Межведомственный запрос документов в органах государственной власти и органах местного самоуправления',
    '558101170000': 'Запрос документов о ранее учтённом объекте недвижимости в органах государственной власти, органах местного самоуправления или органах и организациях по государственному техническому учёту и (или) технической инвентаризации',
    '558102000000': 'Заявления и запросы, связанные с регистрацией прав',
    '558102010000': 'Заявление о государственной регистрации права на недвижимое имущество, сделки с ним, ограничения (обременения), перехода, прекращения права на недвижимое имущество',
    '558102020000': 'Заявление о государственной регистрации прекращения права (ограничения (обременения) права)',
    '558102030000': 'Заявление о внесении изменений в ЕГРП',
    '558102040000': 'Заявление об исправлении технической ошибки',
    '558102050000': 'Заявление о представлении дополнительных документов для государственной регистрации прав',
    '558102060000': 'Заявление о приостановлении государственной регистрации прав на недвижимое имущество и сделок с ним',
    '558102070000': 'Заявление о возобновлении государственной регистрации',
    '558102080000': 'Заявление о прекращении государственной регистрации',
    '558102090000': 'Заявление о повторной выдаче свидетельства о государственной регистрации права',
    '558102100000': 'Запрос о предоставлении сведений, содержащихся в Едином государственном реестре прав на недвижимое имущество и сделок с ним',
    '558102110000': 'Заявление о постановке на учёт бесхозяйных недвижимых вещей',
    '558102120000': 'Заявление о выдаче закладной (новой закладной, дубликата закладной, аннулированной закладной)',
    '558102130000': 'Запрос о выдаче копий договоров и иных документов, выражающих содержание односторонних сделок, совершенных в простой письменной форме',
    '558102140000': 'Заявление о приостановлении государственной регистрации, возврате документов без проведения государственной регистрации, представлении дополнительных документов, о возобновлении государственной регистрации, ранее приостановленной по заявлению правообладателя, стороны (сторон) сделки, лица, чьё право ограничивается (обременяется), лица, в пользу которого право ограничивается (обременяется), законного владельца закладной (их представителя)',
    '558102150000': 'Заявление о повторной выдаче нового свидетельства о государственной регистрации права, выдаче закладной, внесении изменений в запись Единого государственного реестра прав на недвижимое имущество и сделок с ним, погашении регистрационной записи об ипотеке',
    '558102160000': 'Заявление о принятии объекта недвижимого имущества вновь во владение, пользование и распоряжение (в собственность)',
    '558102170000': 'Заявление о внесении в Единый государственный реестр прав на недвижимое имущество и сделок с ним отметки о наличии судебного спора в отношении зарегистрированного права',
    '558102180000': 'Заявление об исправлении технической ошибки в записях Единого государственного реестра прав на недвижимое имущество и сделок с ним, о наличии возражения в отношении зарегистрированного права на объект недвижимости, о погашении записи в Едином государственном реестре прав на недвижимое имущество и сделок с ним о наличии возражения в отношении зарегистрированного права на объект недвижимости, о невозможности государственной регистрации перехода, ограничения (обременения), прекращения права на объект недвижимости без личного участия собственника (его законного представителя), об отзыве ранее представленного заявления о невозможности государственной регистрации перехода, ограничения (обременения), прекращения права на объект недвижимости без личного участия собственника (его законного представителя)',
    '558102190000': 'Заявление о скреплении добавочного листа (добавочных листов) с закладной',
    '558102200000': 'Запрос о предоставлении сведений, содержащихся в Едином государственном реестре прав на недвижимое имущество и сделок с ним, посредством обеспечения доступа к информационному ресурсу, содержащему сведения Единого государственного реестра прав на недвижимое имущество и сделок с ним',
    '558102210000': 'Заявление о государственной регистрации законного владельца закладной',
    '558102220000': 'Заявление о внесении изменений в запись Единого государственного реестра прав на недвижимое имущество и сделок с ним, погашении регистрационной записи об ипотеке',
    '558103000000': 'Заявления о государственном учёте зданий, сооружений, помещений, объектов незавершённого строительства (объектов учёта) и запросы о предоставлении сведений, внесённых в Единый государственный реестр',
    '558103010000': 'Заявление о постановке на государственный учёт объекта учёта',
    '558103020000': 'Заявление о внесении в ЕГРОКС сведений о ранее учтённом объекте капитального строительства',
    '558103030000': 'Заявление о государственном учёте изменений объекта учёта',
    '558103040000': 'Заявление о снятии с государственного учёта объекта учёта',
    '558103050000': 'Заявление об исправлении технической ошибки',
    '558103060000': 'Заявление об исключении сведений из ЕГРОКС, носящих временный характер',
    '558103070000': 'Запрос о предоставлении копии документа, на основании которого сведения об объекте внесены в Единый государственный реестр',
    '558103080000': 'Запрос о предоставлении сведений, внесенных в Единый государственный реестр',
    '558103090000': 'Заявление о представлении дополнительных документов на государственный учёт',
    '558104000000': 'Заявление о возврате платежа',
    '558199000000': 'Иное заявление',
    '558200000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ ОПИСАНИЕ ОБЪЕКТА',
    '558201000000': 'Описание земельных участков',
    '558202000000': 'Землеустроительное дело',
    '558203000000': 'Межевой план',
    '558204000000': 'Документ (копия), на основании которого сведения об объекте недвижимости внесены в ГКН',
    '558205000000': 'Технический паспорт объекта учёта',
    '558205010000': 'Технический паспорт домовладения',
    '558205020000': 'Технический паспорт здания (строения)',
    '558205030000': 'Технический паспорт жилого помещения (квартиры)',
    '558205040000': 'Технический паспорт объекта индивидуального жилищного строительства',
    '558205050000': 'Технический паспорт сооружения',
    '558205060000': 'Технический паспорт объекта незавершённого строительства',
    '558206000000': 'Выписка из технического паспорта',
    '558206010000': 'Выписка из технического паспорта на здание (строение)',
    '558206020000': 'Выписка из технического паспорта БТИ',
    '558207000000': 'Документ (копия), подтверждающий разрешение земельного спора о согласовании местоположения границ земельного участка',
    '558208000000': 'Документ (копия), подтверждающий принадлежность земельного участка к определенной категории земель',
    '558209000000': 'Документ (копия), подтверждающий установленное разрешенное использование земельного участка',
    '558210000000': 'Кадастровый план земельного участка (выписка из государственного земельного кадастра)',
    '558211000000': 'Планы иных объектов недвижимости',
    '558211010000': 'Технический план здания, сооружения, помещения либо объекта незавершённого строительства',
    '558211020000': 'План участка лесного фонда',
    '558211030000': 'План объекта недвижимости',
    '558211040000': 'Экспликация к поэтажному плану',
    '558212000000': 'Декларация об объекте недвижимости',
    '558213000000': 'Кадастровый паспорт объекта недвижимости',
    '558213010000': 'Кадастровый паспорт земельного участка',
    '558213020000': 'Кадастровый паспорт помещения (выписка из ГКН)',
    '558213030000': 'Кадастровый паспорт здания, сооружения, объекта незавершённого строительства',
    '558214000000': 'Кадастровая выписка об объекте недвижимости',
    '558214010000': 'Кадастровая выписка о земельном участке',
    '558214020000': 'Кадастровая выписка о здании, сооружении, объекте незавершённого строительства',
    '558216000000': 'Документ, подтверждающий изменение назначения здания, помещения или сооружения, наименования сооружения',
    '558217000000': 'Кадастровый план территории',
    '558218000000': 'Кадастровая справка о кадастровой стоимости объекта недвижимости',
    '558219000000': 'Акт обследования, подтверждающий прекращение существования объекта учёта',
    '558220000000': 'Документы, в виде которых предоставляются сведения Единого государственного реестра',
    '558220010000': 'Выписка из Реестра, содержащая относящиеся к информации ограниченного доступа сведения об объекте учета',
    '558220020000': 'Справка, содержащая, внесённые в Единый государственный реестр сведения о прекращении существования объекта учёта',
    '558220030000': 'Выписка из Реестра, подтверждающая факт отсутствия в Реестре сведений об объекте учета',
    '558221000000': 'ПРОЧИЕ',
    '558221010000': 'Решение о необходимости устранения кадастровой ошибки',
    '558221020000': 'Международный договор Российской Федерации, в соответствии с которым установлено или изменено прохождение государственной границы Российской Федерации',
    '558221030000': 'Документ, содержащий необходимые для внесения в государственный кадастр недвижимости сведения о границах между субъектами Российской Федерации, границах муниципального образования, границах населённого пункта',
    '558221040000': 'Документ, содержащий необходимые для внесения в государственный кадастр недвижимости сведения об установлении или изменении территориальной зоны или зоны с особыми условиями использования территорий, либо об отмене установления такой зоны',
    '558221050000': 'Решение о присвоении, изменении адреса',
    '558221060000': 'Документы органов, осуществляющих ведение лесного и водного кадастра, содержащие сведения о природных объектах',
    '558221070000': 'Документ, содержащий сведения об адресе объекта недвижимости',
    '558221080000': 'Акт об утверждении результатов определения кадастровой стоимости',
    '558221990000': 'Иной документ, содержащий описание объекта',
    '558222000000': 'Документ, воспроизводящий сведения, содержащиеся в международном договоре Российской Федерации, в соответствии с которым установлено или изменено прохождение государственной границы Российской Федерации, а также сведения о федеральном законе, которым ратифицирован международный договор Российской Федерации, и об официальном опубликовании такого федерального закона',
    '558223000000': 'Соглашение об изменении границ между субъектами Российской Федерации',
    '558224000000': 'Закон субъекта Российской Федерации об установлении или изменении границ муниципальных образований либо о преобразовании муниципальных образований',
    '558225000000': 'Акт уполномоченного органа об установлении или изменении границ населённых пунктов',
    '558226000000': 'Документ, воспроизводящий необходимые для внесения в государственный кадастр недвижимости сведения о границах между субъектами Российской Федерации, границах муниципального образования, границах населённого пункта, содержащиеся в утверждённых органами власти документах',
    '558227000000': 'Решение об установлении или изменении границ зон с особыми условиями использования территорий',
    '558228000000': 'Правовой акт, которым утверждены или изменены правила землепользования и застройки',
    '558229000000': 'Документ, подтверждающий изменение назначения помещения',
    '558230000000': 'Решение о переводе жилого помещения в нежилое помещение, нежилого помещения в жилое помещение',
    '558231000000': 'Акт приемочной комиссии, подтверждающий завершение переустройства и (или) перепланировки и (или) иных работ',
    '558232000000': 'Документы, воспроизводящие сведения об изменении назначения помещения',
    '558233000000': 'Документ, воспроизводящий сведения, содержащиеся в решении о переводе жилого помещения в нежилое помещение, нежилого помещения в жилое помещение',
    '558234000000': 'Документ, воспроизводящий сведения, содержащиеся в акте приемочной комиссии, подтверждающем завершение переустройства и (или) перепланировки и (или) иных работ',
    '558235000000': 'Документ, подтверждающий изменение назначения здания',
    '558236000000': 'Документ, подтверждающий изменение назначения сооружения',
    '558237000000': 'Решение о предоставлении разрешения на условно разрешенный вид использования',
    '558238000000': 'Решение об определении (изменении) вида разрешенного использования',
    '558239000000': 'Документ (копия), воспроизводящий сведения о предоставлении разрешения на условно разрешенный вид использования, об определении (изменении) вида разрешенного использования',
    '558240000000': 'Документ, воспроизводящий сведения, содержащиеся в решении о присвоении, изменении адреса',
    '558241000000': 'Документ, воспроизводящий содержащиеся в разрешении на ввод объекта капитального строительства в эксплуатацию сведения',
    '558242000000': 'Документ, воспроизводящий сведения, содержащиеся в реестре объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
    '558243000000': 'Документ, воспроизводящий сведения, содержащиеся в акте Правительства Российской Федерации об исключении объекта недвижимости из единого государственного реестра объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
    '558244000000': 'Документ, содержащий сведения о дате поступления документов, предусмотренных статьей 17 Федерального закона "Об объектах культурного наследия (памятниках истории и культуры) народов Российской Федерации", в отношении объекта недвижимости',
    '558245000000': 'Решение (копия решения) соответствующего органа государственной власти об отказе включить объект недвижимости в единый государственный реестр объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
    '558246000000': 'Акт Правительства Российской Федерации об исключении объекта недвижимости из единого государственного реестра объектов культурного наследия',
    '558247000000': 'Документ, воспроизводящий сведения о наименовании водного объекта и установленных параметрах водоохранных зон и прибрежных защитных полос, зон затопления, подтопления и других зон с особыми условиями их использования',
    '558248000000': 'Документ, воспроизводящий содержащиеся в государственном лесном реестре сведения в отношении лесного участка',
    '558249000000': 'Документ, воспроизводящий сведения, содержащиеся во вступившем в силу акте об утверждении результатов определения кадастровой стоимости',
    '558250000000': 'Документ, воспроизводящий сведения, содержащиеся в решении об установлении или изменении границ зон с особыми условиями использования территорий',
    '558251000000': 'Документ, воспроизводящий сведения, содержащиеся в правовом акте, которым утверждены или изменены правила землепользования и застройки, включая сведения о территориальных зонах',
    '558252000000': 'Карта (план) объекта землеустройства',
    '558253000000': 'Декларация заинтересованного лица о выбранном виде разрешенного использования земельного участка',
    '558254000000': 'Документы, определяющие (определявшие) в соответствии с законодательством Российской Федерации местоположение границ земельного участка (земельных участков)',
    '558254010000': 'Землеустроительная документация',
    '558254020000': 'Лесоустроительная документация',
    '558254030000': 'Документы градостроительного зонирования (Правила землепользования и застройки)',
    '558254040000': 'Документация по планировке территории (проекты межевания территорий), в т.ч. документ по планировке территории в планируемых границах искусственного земельного участка',
    '558254050000': 'Копия проекта межевания земельных участков',
    '558254060000': 'Акт отвода земельных участков в натуре',
    '558254070000': 'Проект границ земельных участков',
    '558254080000': 'Проект (копии отдельных составных частей) организации и застройки территорий садоводческих, огороднических или дачных некоммерческих объединений граждан',
    '558254090000': 'Проект (копии отдельных составных частей) перераспределения сельскохозяйственных угодий и иных земель сельскохозяйственного назначения',
    '558254100000': 'Решение о предварительном согласовании мест размещения объектов',
    '558254110000': 'Копия решения общего собрания участников долевой собственности на земельный участок из земель сельскохозяйственного назначения об утверждении проекта межевания земельных участков',
    '558254120000': 'Копия документа, подтверждающего согласование проекта межевания земельного участка',
    '558254130000': 'Возражения заинтересованных лиц по поводу местоположения границ земельного участка',
    '558254140000': 'Документ, свидетельствующий о снятии возражений заинтересованных лиц по поводу местоположения границ земельного участка',
    '558254150000': 'Схема расположения земельных участков на кадастровых планах или кадастровых картах соответствующих территорий',
    '558254990000': 'Прочие документы, определяющие (определявшие) в соответствии с законодательством Российской Федерации местоположение границ земельного участка (земельных участков)',
    '558255000000': 'Картографические материалы',
    '558256000000': 'Материалы картографо-геодезического фонда',
    '558257000000': 'Документы, устанавливающие предельные минимальные и максимальные размеры, соответствующие виду разрешенного использования земельного участка',
    '558257010000': 'Федеральный закон',
    '558257020000': 'Закон субъекта Российской Федерации',
    '558257030000': 'Нормативный правовой акт органа местного самоуправления',
    '558258000000': 'Документ, содержащий информацию о ранее присвоенных государственных учетных номерах объекта недвижимости',
    '558259000000': 'Протокол образования земельных участков',
    '558260000000': 'Чертеж (абрис) помещения',
    '558261000000': 'Проектная документация здания',
    '558262000000': 'Проектная документация сооружения',
    '558263000000': 'Решение комиссии по рассмотрению споров о результатах определения кадастровой стоимости',
    '558264000000': 'Решение суда',
    '558299000000': 'Иной документ, содержащий описание объекта',
    '558300000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ ОПИСАНИЕ ЗАЯВИТЕЛЯ ИЛИ ЕГО ПРЕДСТАВИТЕЛЯ',
    '558301000000': 'Документы, подтверждающие полномочия представителя',
    '558301010000': 'Доверенность',
    '558301020000': 'Свидетельство о рождении',
    '558301030000': 'Свидетельство об усыновлении',
    '558301040000': 'Решение суда',
    '558301050000': 'Определение суда',
    '558301060000': 'Протокол об избрании (единоличного исполнительного органа юридического лица)',
    '558301070000': 'Выписка из протокола об избрании (единоличного исполнительного органа юридического лица)',
    '558301080000': 'Приказ о назначении (руководителя или иного уполномоченного лица)',
    '558301090000': 'Решение органов опеки и попечительства',
    '558301100000': 'Договор коммерческого представительства',
    '558301110000': 'Договор доверительного управления',
    '558301120000': 'Постановление судебного пристава-исполнителя',
    '558301130000': 'Протокол общего собрания',
    '558301140000': 'Акт органа государственной власти или органа местного самоуправления, подтверждающий полномочия представителя заявителя',
    '558301990000': 'Иной документ',
    '558400000000': 'ДОКУМЕНТЫ О ПРАВАХ, СДЕЛКАХ, ОГРАНИЧЕНИЯХ (ОБРЕМЕНЕНИЯХ)',
    '558401000000': 'Правоустанавливающие и правоудостоверяющие документы',
    '558401010000': 'Договоры / соглашения',
    '558401010100': 'Сделки об отчуждении',
    '558401010101': 'Договор купли-продажи',
    '558401010102': 'Договор мены',
    '558401010103': 'Договор дарения',
    '558401010104': 'Договор ренты',
    '558401010105': 'Договор пожизненного содержания с иждивением',
    '558401010106': 'Договор приватизации (договор передачи объекта недвижимости в собственность)',
    '558401010200': 'Другие сделки',
    '558401010201': 'Договор участия в долевом строительстве',
    '558401010202': 'Соглашение об определении (перераспределении) долей в праве общей долевой собственности',
    '558401010203': 'Брачный договор',
    '558401010204': 'Соглашение об отступном',
    '558401010205': 'Соглашение о разделе имущества',
    '558401010206': 'Соглашение о выделе доли',
    '558401010207': 'Инвестиционный договор (договор об инвестировании)',
    '558401010208': 'Мировое соглашение',
    '558401010209': 'Договор аренды (субаренды)',
    '558401010210': 'Договор об ипотеке',
    '558401010211': 'Договор безвозмездного срочного пользования земельным участком',
    '558401010212': 'Кредитный договор',
    '558401010213': 'Договор займа',
    '558401010214': 'Соглашение об установлении сервитута',
    '558401010215': 'Соглашение об изменении содержания закладной',
    '558401010216': 'Дополнительное соглашение (соглашение об изменении условий договора) к договору',
    '558401010217': 'Соглашение о расторжении договора',
    '558401010218': 'Соглашение об уступке прав требования по договору (договор о передаче прав и обязанностей)',
    '558401010219': 'Договор простого товарищества (договор о совместной деятельности)',
    '558401010220': 'Государственный контракт',
    '558401010299': 'Иная сделка',
    '558401020000': 'Акты органов государственной власти или органов местного самоуправления',
    '558401020100': 'Федеральный закон',
    '558401020200': 'Указ Президента Российской Федерации',
    '558401020300': 'Постановление Правительства Российской Федерации',
    '558401020400': 'Закон (законы Российской Федерации, субъекта Российской Федерации)',
    '558401020500': 'Документ о предоставлении земельных участков',
    '558401020600': 'Решение об образовании земельных участков',
    '558401020700': 'Акт об установлении сервитута',
    '558401020800': 'Акт об установлении ограничения (обременения)',
    '558401029900': 'Иные акты органов государственной власти или органов местного самоуправления',
    '558401030000': 'Свидетельство о праве на наследство',
    '558401030100': 'Свидетельство о праве на наследство по закону',
    '558401030200': 'Свидетельство о праве на наследство по завещанию',
    '558401040000': 'Вступившие в силу судебные акты',
    '558401040100': 'Судебный акт, устанавливающий запрет на совершение действий в сфере государственного кадастрового учета в отношении объекта недвижимости',
    '558401040200': 'Судебный акт о восстановлении аннулированных и исключенных из государственного кадастра недвижимости сведений об объекте недвижимости',
    '558401040300': 'Судебный акт об установлении обременения (ограничении) в использовании объекта недвижимости  (части объекта недвижимости)',
    '558401049900': 'Иные предусмотренные законодательством судебные акты',
    '558401050000': 'Акты (свидетельства) о правах на объекты недвижимости',
    '558401050100': 'Регистрационное удостоверение',
    '558401050200': 'Свидетельство о праве на землю',
    '558401050300': 'Государственный акт о праве на землю',
    '558401050400': 'Свидетельство о праве собственности',
    '558401059900': 'Иные акты, свидетельства о правах на объекты недвижимости',
    '558401060000': 'Документы на вновь возведенный (реконструированный) объект',
    '558401060100': 'Разрешение на ввод объекта в эксплуатацию',
    '558401060200': 'Разрешение на строительство',
    '558401060300': 'Акт ввода в эксплуатацию',
    '558401060400': 'Копия решения о создании искусственного земельного участка',
    '558401070000': 'Документы при упрощенном порядке оформления прав граждан на отдельные объекты недвижимого имущества',
    '558401070100': 'Выписка из похозяйственной книги о наличии у гражданина права на земельный участок',
    '558401070200': 'Кадастровый паспорт объекта недвижимости',
    '558401070300': 'Декларация об объекте недвижимого имущества',
    '558401080000': 'Прочие правоустанавливающие документы',
    '558401080100': 'Передаточный акт',
    '558401080200': 'Разделительный баланс',
    '558401080300': 'План приватизации',
    '558401080400': 'Правила доверительного управления',
    '558401080500': 'Акт описи и ареста имущества',
    '558401080600': 'Протокол о выделе земельного участка в счет земельной доли',
    '558401080700': 'Протокол общего собрания собственников помещений в многоквартирном доме',
    '558401080800': 'Отказ одаряемого принять дар (отказ от дара)',
    '558401080900': 'Соглашение о новации',
    '558401081000': 'Соглашение о разделе наследственного имущества',
    '558401081100': 'Соглашение об уплате алиментов',
    '558401081200': 'Документ, подтверждающий наличие, возникновение, переход ограничения (обременения) вещного права на объект недвижимости в пользу заявителя',
    '558401089900': 'Иной документ',
    '558402000000': 'СОПУТСТВУЮЩИЕ И ДОПОЛНИТЕЛЬНЫЕ ДОКУМЕНТЫ',
    '558402010000': 'Согласие супруга на совершение сделки',
    '558402020000': 'Согласие органов опеки и попечительства',
    '558402030000': 'Свидетельство о заключении брака',
    '558402040000': 'Свидетельство о расторжении брака',
    '558402050000': 'Решение об одобрении (о совершении) сделки',
    '558402060000': 'Справка о стоимости (справка о соотношении стоимости отчуждаемого объекта и балансовой стоимости имущества или активов хозяйственного общества)',
    '558402070000': 'Справка о заинтересованных лицах в сделке',
    '558402080000': 'Выписка из домовой книги (сведения о лицах, сохраняющих право проживания в жилом помещении после перехода права на него)',
    '558402090000': 'Выписка из лицевого счета (сведения о лицах, сохраняющих право проживания в жилом помещении после перехода права на него)',
    '558402100000': 'Протокол о результатах торгов',
    '558402110000': 'Лицензия (лицензия на осуществление определенных видов деятельности)',
    '558402120000': 'Проектная декларация',
    '558402130000': 'Отказ от преимущественного права покупки (для участников долевой собственности, для субъекта Российской Федерации при продаже земельного участка из состава земель сельскохозяйственного назначения)',
    '558402140000': 'Решение о создании юридического лица',
    '558402150000': 'Решение о реорганизации юридического лица',
    '558402160000': 'Решение о ликвидации юридического лица',
    '558402170000': 'Решение об утверждении оценки имущества (решение об утверждении оценки неденежных вкладов в уставный капитал общества)',
    '558402180000': 'Исполнительный лист',
    '558402190000': 'Договор поручения',
    '558402200000': 'Бухгалтерский баланс',
    '558402210000': 'Закладная',
    '558402220000': 'Добавочный лист к закладной',
    '558402230000': 'Выписка из реестра муниципальной собственности',
    '558402240000': 'Выписка из реестра собственности субъекта Российской Федерации',
    '558402250000': 'Выписка из реестра федерального имущества',
    '558402260000': 'Жилищный сертификат',
    '558402270000': 'Аудиторское заключение',
    '558402280000': 'Отчет о проведении независимой оценки (акт оценки)',
    '558402390000': 'Акт инвентаризации',
    '558402400000': 'Охранное обязательство собственника объекта культурного наследия',
    '558402990000': 'Иной документ',
    '558403000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ СВЕДЕНИЯ ЕГРП',
    '558403010000': 'Свидетельство о государственной регистрации права',
    '558403020000': 'Выписка о правах на объект недвижимого имущества',
    '558403030000': 'Выписка о переходе прав на объект недвижимого имущества',
    '558403040000': 'Выписка о правах отдельного лица на имеющиеся у него объекты недвижимого имущества',
    '558403050000': 'Выписка о признании правообладателя недееспособным или ограниченно дееспособным',
    '558403060000': 'Справка о содержании правоустанавливающих документов на объект недвижимого имущества',
    '558403070000': 'Справка о лицах, получивших сведения об объекте недвижимого имущества',
    '558403080000': 'Копии договоров и иных документов, выражающих содержание односторонних сделок, совершенных в простой письменной форме',
    '558403090000': 'Выписка из ЕГРП о принятии на учёт бесхозяйного объекта недвижимого имущества',
    '558403100000': 'Выписка из ЕГРП о принятии на учёт бесхозяйного объекта недвижимого имущества, от права собственности на который собственник отказался',
    '558403110000': 'Выписка из ЕГРП о бесхозяйном объекте недвижимого имущества, принятом на учёт',
    '558403120000': 'Выписка из единого государственного реестра прав на недвижимое имущество и сделок с ним, удостоверяющая проведение государственной регистрации возникновения и (или) перехода прав на недвижимое имущество',
    '558403990000': 'Иной документ',
    '558404000000': 'Соглашения и согласия об образовании земельных участков',
    '558404010000': 'Соглашение о разделе, об объединении, о перераспределении земельных участков или о выделе из земельных участков',
    '558404020000': 'Согласие на образование земельных участков',
    '558404030000': 'Соглашение об образовании общей долевой собственности на земельный участок, образуемый при выделе его в счет земельной доли или земельных долей',
    '558404040000': 'Соглашение об образовании общей совместной собственности на земельный участок, образуемый при выделе его в счет земельной доли или земельных долей',
    '558405000000': 'Документы, подтверждающие возникновение права собственности в отношении земельного участка в силу федерального закона вне зависимости от момента государственной регистрации этого права в ЕГРП',
    '558405010000': 'Копия решения о безвозмездной передаче военного недвижимого имущества из федеральной собственности в собственность субъекта Российской Федерации - города федерального значения Москвы или Санкт-Петербурга либо муниципальную собственность',
    '558405020000': 'Подлинник или копия письма органа исполнительной власти субъекта Российской Федерации - города федерального значения Москвы или Санкт-Петербурга либо органа местного самоуправления муниципального образования о согласовании границ образуемого земельного участка с приложением согласованного проекта границ земельного участка в случае, если акт согласования границ земельного участка не заверен подписью уполномоченного должностного лица соответствующего органа',
    '558405030000': 'Решение об изъятии земельных участков и (или) расположенных на них иных объектов недвижимого имущества в целях размещения олимпийских объектов',
    '558405040000': 'Копия акта приема-передачи объектов недвижимого имущества, в отношении которых принято решение об изъятии в целях размещения олимпийских объектов',
    '558405990000': 'Иные документы, подтверждающие возникновение права собственности в отношении земельного участка в силу федерального закона вне зависимости от момента государственной регистрации этого права в ЕГРП',
    '558500000000': 'Решения, уведомления, расписки',
    '558501000000': 'Документы о результатах государственного кадастрового учёта',
    '558501010000': 'РЕШЕНИЯ',
    '558501010100': 'Решение об отказе в предоставлении запрашиваемых сведений',
    '558501010200': 'Решение об отказе в исправлении кадастровой ошибки',
    '558501010300': 'Решение об отказе в исправлении технической ошибки',
    '558501010400': 'Решение об исправлении технической и кадастровой ошибок',
    '558501010500': 'Решение об отказе в осуществлении кадастровой процедуры',
    '558501010600': 'Решение о приостановлении осуществления кадастровой процедуры',
    '558501010700': 'Решение об отказе в снятии приостановления',
    '558501010800': 'Решение о снятии с кадастрового учёта земельных участков со статусом «временные» по заявлению заинтересованного лица',
    '558501010900': 'Решение об отказе в выдаче кадастрового паспорта',
    '558501011000': 'Решение об осуществлении кадастровой процедуры',
    '558501011100': 'Решение об аннулировании кадастровых сведений',
    '558501011200': 'Решение об отклонении заявления об исправлении технической ошибки',
    '558501011300': 'Решение о внесении записи о наличии возражения',
    '558501011400': 'Решение о погашении записи о наличии возражения',
    '558501011500': 'Решение о внесении записи о заявлении о невозможности государственной регистрации',
    '558501011600': 'Решение о погашении записи о заявлении о невозможности государственной регистрации',
    '558501020000': 'УВЕДОМЛЕНИЯ',
    '558501020100': 'Уведомление об отсутствии в ГКН запрашиваемых сведений',
    '558501020200': 'Уведомление об осуществлённом кадастровом учёте',
    '558501020300': 'Уведомление об отказе в приеме документов для внесения в Единый государственный реестр объектов капитального строительства (далее - Единый государственный реестр) сведений об ОКС',
    '558501020400': 'Уведомление об отказе в приеме документов для предоставления из Единого государственного реестра сведений об ОКС',
    '558501020500': 'Уведомление об устранении технической ошибки в сведениях ГКН',
    '558501020600': 'Уведомление об отказе в выдаче сведений об ОКС',
    '558501020700': 'Уведомление о приостановлении осуществления кадастровой процедуры',
    '558501020800': 'Уведомление об отказе в осуществлении кадастровой процедуры',
    '558501020900': 'Уведомление о регистрации права',
    '558501021000': 'Уведомление о приостановлении принятия на учёт имущества в качестве бесхозяйного',
    '558501021100': 'Сообщение об отказе в принятии на учёт имущества в качестве бесхозяйного',
    '558501021200': 'Уведомление о снятии с учёта имущества в качестве бесхозяйного',
    '558501021300': 'Уведомление о возврате заявления о наличии возражения в отношении зарегистрированного права на объект недвижимости без рассмотрения',
    '558501030000': 'ПРОЧИЕ',
    '558501030100': 'Расписка в получении соответствующих документов для проведения государственного кадастрового учёта',
    '558501030200': 'Протокол проверки документов',
    '558501030300': 'Акт определения кадастровой стоимости земельных участков',
    '558501030400': 'Протокол выявления технической ошибки',
    '558501030500': 'Акт определения кадастровой стоимости объектов недвижимости',
    '558501039900': 'Иные документы',
    '558502000000': 'ДОКУМЕНТЫ О РЕЗУЛЬТАТАХ РЕГИСТРАЦИИ ПРАВ',
    '558502010000': 'УВЕДОМЛЕНИЯ, СООБЩЕНИЯ',
    '558502010100': 'Уведомление о приостановлении государственной регистрации прав',
    '558502010200': 'Уведомление о прекращении государственной регистрации прав',
    '558502010300': 'Уведомление о зарегистрированных ограничениях (обременениях) прав',
    '558502010400': 'Уведомление о внесении изменений в ЕГРП',
    '558502010500': 'Уведомление об исправлении технической ошибки в записях единого государственного реестра прав на недвижимое имущество и сделок с ним',
    '558502010600': 'Сообщение об отказе в государственной регистрации прав',
    '558502010700': 'Сообщение об отказе в предоставлении сведений из ЕГРП',
    '558502010800': 'Уведомление об отсутствии в ЕГРП запрашиваемых сведений',
    '558502010900': 'Сообщение о приёме заявления о государственной регистрации права, ограничения (обременения) права на предприятие, сделки с ним',
    '558502011000': 'Сообщение о поступлении документов на государственную регистрацию договоров мены и (или) перехода права',
    '558502011100': 'Уведомление о возврате приложенных к заявлению документов без рассмотрения',
    '558502011200': 'Уведомление о государственной регистрации прекращения ограничения (обременения)',
    '558502011300': 'Уведомление об отсутствии сведений о лицах, получивших сведения об объектах недвижимого имущества',
    '558502011400': 'Уведомление о государственной регистрации права собственности субъекта Российской Федерации или муниципального образования на земельный участок или земельную долю вследствие отказа от соответствующего права правообладателем',
    '558502011500': 'Уведомление о поступлении решения суда, вступившего в законную силу, с указанием срока окончания осуществления государственной регистрации прав, в случае если отказ в государственной регистрации прав признан судом необоснованным',
    '558502011600': 'Уведомление о внесении изменений в единый государственный реестр прав на недвижимое имущество и сделок с ним в связи с изменением содержащихся в базовых государственных информационных ресурсах сведений о правообладателе (правообладателях)',
    '558502011700': 'Уведомление о возврате документов без рассмотрения при отказе в осуществлении государственного кадастрового учета',
    '558502020000': 'ПРОЧИЕ',
    '558502020100': 'Расписка в получении документов на государственную регистрацию прав',
    '558502029900': 'Иной документ',
    '558601000000': 'Расписка в получении извещений о проведении собрания о согласовании местоположения границ',
    '558602000000': 'Уведомление о вручении извещения о проведении собрания о согласовании местоположения границ',
    '558603000000': 'Копия страницы печатного издания, содержащей извещение о проведении собрания о согласовании местоположения границ земельного участка, включая первый лист, содержащего реквизиты такого печатного издания',
    '558699000000': 'Иные документы, свидетельствующие о соблюдении установленного порядка извещения заинтересованных лиц о проведении собрания о согласовании местоположения границ земельного участка'
};
//Территориальные зоны и зоны с особыми условиями использования территорий
var dZone = {
    '218010000000': 'Территориальные зоны',
    '218010010000': 'Жилая зона',
    '218010020000': 'Общественно-деловая зона',
    '218010030000': 'Производственная зона, зона инженерной и транспортной инфраструктур',
    '218010040000': 'Зона сельскохозяйственного использования',
    '218010050000': 'Зона рекреационного назначения',
    '218010060000': 'Зона особо охраняемых территорий',
    '218010070000': 'Зона специального назначения',
    '218010080000': 'Зона размещения военных объектов',
    '218010090000': 'Иная зона',
    '218020000000': 'Зоны с особыми условиями использования территории',
    '218020010000': 'Зоны охраны природных объектов',
    '218020010001': 'Территория особо охраняемого природного объекта',
    '218020010002': 'Охранная зона особо охраняемого природного объекта',
    '218020010003': 'Водоохранная зона',
    '218020010004': 'Прибрежная защитная полоса',
    '218020010005': 'Зона санитарной охраны источников водоснабжения и водопроводов питьевого назначения',
    '218020010006': 'Особо ценные земли',
    '218020020000': 'Зоны охраны искусственных объектов',
    '218020020001': 'Территория объекта культурного наследия',
    '218020020002': 'Зона охраны объекта культурного наследия',
    '218020020003': 'Охранная зона геодезического пункта',
    '218020020004': 'Охранная зона стационарного пункта наблюдений за состоянием окружающей природной среды',
    '218020020005': 'Охранная зона транспорта',
    '218020020006': 'Охранная зона инженерных коммуникаций',
    '218020020007': 'Охранная зона линий и сооружений связи и линий и сооружений радиофикации',
    '218020020008': 'Придорожная полоса',
    '218020030000': 'Зоны защиты населения',
    '218020030001': 'Запретная зона при военном складе',
    '218020030002': 'Запретный район при военном складе',
    '218020030003': 'Загрязненные земли',
    '218020030004': 'Охранная зона загрязненных земель',
    '218020030005': 'Санитарно-защитная зона предприятий, сооружений и иных объектов',
    '218020030006': 'Санитарный разрыв (санитарная полоса отчуждения)',
    '218020030007': 'Зона ограничения от передающего радиотехнического объекта',
    '218020030008': 'Район падения отделяющихся частей ракет',
    '218020040000': 'Прочие зоны с особыми условиями использования территории',
    '218020040001': 'Зона публичного сервитута',
    '218020040002': 'Зона резервирования земель',
    '218020040003': 'Горный отвод',
    '218020040004': 'Пригородная зона',
    '218020040005': 'Зеленая зона',
    '218020040006': 'Особая экономическая зона',
    '218020040007': 'Пограничная зона',
    '218020040008': 'Территория традиционного природопользования',
    '218020050000': 'Иные зоны с особыми условиями использования территории',
    '218020050001': 'Иная зона с особыми условиями использования территории'
};
// Классификатор видов использования земель
var dUtilizations = {
    '141000000000': 'Для размещения объектов сельскохозяйственного назначения и сельскохозяйственных угодий',
    '141001000000': 'Для сельскохозяйственного производства',
    '141001010000': 'Для использования в качестве сельскохозяйственных угодий',
    '141001020000': 'Для размещения зданий, строений, сооружений, используемых для производства, хранения и первичной переработки сельскохозяйственной продукции',
    '141001030000': 'Для размещения внутрихозяйственных дорог и коммуникаций',
    '141001040000': 'Для размещения водных объектов',
    '141002000000': 'Для ведения крестьянского (фермерского) хозяйства',
    '141003000000': 'Для ведения личного подсобного хозяйства',
    '141004000000': 'Для ведения гражданами садоводства и огородничества',
    '141005000000': 'Для ведения гражданами животноводства',
    '141006000000': 'Для дачного строительства',
    '141007000000': 'Для размещения древесно-кустарниковой растительности, предназначенной для защиты земель от воздействия негативных (вредных) природных, антропогенных и техногенных явлений',
    '141008000000': 'Для научно-исследовательских целей',
    '141009000000': 'Для учебных целей',
    '141010000000': 'Для сенокошения и выпаса скота гражданами',
    '141011000000': 'Фонд перераспределения',
    '141012000000': 'Для размещения объектов охотничьего хозяйства',
    '141013000000': 'Для размещения объектов рыбного хозяйства',
    '141014000000': 'Для иных видов сельскохозяйственного использования',
    '142000000000': 'Для размещения объектов, характерных для населённых пунктов',
    '142001000000': 'Для объектов жилой застройки',
    '142001010000': 'Для индивидуальной жилой застройки',
    '142001020000': 'Для многоквартирной застройки',
    '142001020100': 'Для малоэтажной застройки',
    '142001020200': 'Для среднеэтажной застройки',
    '142001020300': 'Для многоэтажной застройки',
    '142001020400': 'Для иных видов жилой застройки',
    '142001030000': 'Для размещения объектов дошкольного, начального, общего и среднего (полного) общего образования',
    '142001040000': 'Для размещения иных объектов, допустимых в жилых зонах и не перечисленных в классификаторе',
    '142002000000': 'Для объектов общественно-делового значения',
    '142002010000': 'Для размещения объектов социального и коммунально-бытового назначения',
    '142002020000': 'Для размещения объектов здравоохранения',
    '142002030000': 'Для размещения объектов культуры',
    '142002040000': 'Для размещения объектов торговли',
    '142002040100': 'Для размещения объектов розничной торговли',
    '142002040200': 'Для размещения объектов оптовой торговли',
    '142002050000': 'Для размещения объектов общественного питания',
    '142002060000': 'Для размещения объектов предпринимательской деятельности',
    '142002070000': 'Для размещения объектов среднего профессионального и высшего профессионального образования',
    '142002080000': 'Для размещения административных зданий',
    '142002090000': 'Для размещения научно-исследовательских учреждений',
    '142002100000': 'Для размещения культовых зданий',
    '142002110000': 'Для стоянок автомобильного транспорта',
    '142002120000': 'Для размещения объектов делового назначения, в том числе офисных центров',
    '142002130000': 'Для размещения объектов финансового назначения',
    '142002140000': 'Для размещения гостиниц',
    '142002150000': 'Для размещения подземных или многоэтажных гаражей',
    '142002160000': 'Для размещения индивидуальных гаражей',
    '142002170000': 'Для размещения иных объектов общественно-делового значения, обеспечивающих жизнь граждан',
    '142003000000': 'Для общего пользования (уличная сеть)',
    '142004000000': 'Для размещения объектов специального назначения',
    '142004010000': 'Для размещения кладбищ',
    '142004020000': 'Для размещения крематориев',
    '142004030000': 'Для размещения скотомогильников',
    '142004040000': 'Под объектами размещения отходов потребления',
    '142004050000': 'Под иными объектами специального назначения',
    '142005000000': 'Для размещения коммунальных, складских объектов',
    '142006000000': 'Для размещения объектов жилищно-коммунального хозяйства',
    '142007000000': 'Для иных видов использования, характерных для населённых пунктов',
    '143000000000': 'Для размещения объектов промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, обеспечения космической деятельности, обороны, безопасности и иного специального назначения',
    '143001000000': 'Для размещения промышленных объектов',
    '143001010000': 'Для размещения производственных и административных зданий, строений, сооружений и обслуживающих их объектов',
    '143001010100': 'Для размещения производственных зданий',
    '143001010200': 'Для размещения коммуникаций',
    '143001010300': 'Для размещения подъездных путей',
    '143001010400': 'Для размещения складских помещений',
    '143001010500': 'Для размещения административных зданий',
    '143001010600': 'Для размещения культурно-бытовых зданий',
    '143001010700': 'Для размещения иных сооружений промышленности',
    '143001020000': 'Для добычи и разработки полезных ископаемых',
    '143001030000': 'Для размещения иных объектов промышленности',
    '143002000000': 'Для размещения объектов энергетики',
    '143002010000': 'Для размещения электростанций и обслуживающих сооружений и объектов',
    '143002010100': 'Для размещения гидроэлектростанций',
    '143002010200': 'Для размещения атомных станций',
    '143002010300': 'Для размещения ядерных установок',
    '143002010400': 'Для размещения пунктов хранения ядерных материалов и радиоактивных веществ энергетики',
    '143002010500': 'Для размещения хранилищ радиоактивных отходов',
    '143002010600': 'Для размещения тепловых станций',
    '143002010700': 'Для размещения иных типов электростанций',
    '143002010800': 'Для размещения иных обслуживающих сооружений и объектов',
    '143002020000': 'Для размещения объектов электросетевого хозяйства',
    '143002020100': 'Для размещения воздушных линий электропередачи',
    '143002020200': 'Для размещения наземных сооружений кабельных линий электропередачи',
    '143002020300': 'Для размещения подстанций',
    '143002020400': 'Для размещения распределительных пунктов',
    '143002020500': 'Для размещения других сооружений и объектов электросетевого хозяйства',
    '143002030000': 'Для размещения иных объектов энергетики',
    '143003000000': 'Для размещения объектов транспорта',
    '143003010000': 'Для размещения и эксплуатации объектов железнодорожного транспорта',
    '143003010100': 'Для размещения железнодорожных путей и их конструктивных элементов',
    '143003010200': 'Для размещения полос отвода железнодорожных путей',
    '143003010300': 'Для размещения, эксплуатации, расширения и реконструкции строений, зданий, сооружений, в том числе железнодорожных вокзалов, железнодорожных станций, а также устройств и других объектов, необходимых для эксплуатации, содержания, строительства, реконструкции, ремонта, развития наземных и подземных зданий, строений, сооружений, устройств и других объектов железнодорожного транспорта',
    '143003010301': 'Для размещения железнодорожных вокзалов',
    '143003010302': 'Для размещения железнодорожных станций',
    '143003010303': 'Для размещения устройств и других объектов, необходимых для эксплуатации, содержания, строительства, реконструкции, ремонта, развития наземных и подземных зданий, строений, сооружений, устройств и других объектов железнодорожного транспорта',
    '143003020000': 'Для размещения и эксплуатации объектов автомобильного транспорта и объектов дорожного хозяйства',
    '143003020100': 'Для размещения автомобильных дорог и их конструктивных элементов',
    '143003020200': 'Для размещения полос отвода',
    '143003020300': 'Для размещения объектов дорожного сервиса в полосах отвода автомобильных дорог',
    '143003020400': 'Для размещения дорожных сооружений',
    '143003020500': 'Для размещения автовокзалов и автостанций',
    '143003020600': 'Для размещения иных объектов автомобильного транспорта и дорожного хозяйства',
    '143003030000': 'Для размещения и эксплуатации объектов морского, внутреннего водного транспорта',
    '143003030100': 'Для размещения искусственно созданных внутренних водных путей',
    '143003030200': 'Для размещения морских и речных портов, причалов, пристаней',
    '143003030300': 'Для размещения иных объектов морского, внутреннего водного транспорта',
    '143003030400': 'Для выделения береговой полосы',
    '143003040000': 'Для размещения и эксплуатации объектов воздушного транспорта',
    '143003040100': 'Для размещения аэропортов и аэродромов',
    '143003040200': 'Для размещения аэровокзалов',
    '143003040300': 'Для размещения взлетно-посадочных полос',
    '143003040400': 'Для размещения иных наземных объектов воздушного транспорта',
    '143003050000': 'Для размещения и эксплуатации объектов трубопроводного транспорта',
    '143003050100': 'Для размещения нефтепроводов',
    '143003050200': 'Для размещения газопроводов',
    '143003050300': 'Для размещения иных трубопроводов',
    '143003050400': 'Для размещения иных объектов трубопроводного транспорта',
    '143003060000': 'Для размещения и эксплуатации иных объектов транспорта',
    '143004000000': 'Для размещения объектов связи, радиовещания, телевидения, информатики',
    '143004010000': 'Для размещения эксплуатационных предприятий связи и обслуживания линий связи',
    '143004020000': 'Для размещения кабельных, радиорелейных и воздушных линий связи и линий радиофикации на трассах кабельных и воздушных линий связи и радиофикации и их охранные зоны',
    '143004030000': 'Для размещения подземных кабельных и воздушных линий связи и радиофикации и их охранные зоны',
    '143004040000': 'Для размещения наземных и подземных необслуживаемых усилительных пунктов на кабельных линиях связи и их охранные зоны',
    '143004050000': 'Для размещения наземных сооружений и инфраструктур спутниковой связи',
    '143004060000': 'Для размещения иных объектов связи, радиовещания, телевидения, информатики',
    '143005000000': 'Для размещения объектов, предназначенных для обеспечения космической деятельности',
    '143005010000': 'Для размещения космодромов, стартовых комплексов и пусковых установок',
    '143005020000': 'Для размещения командно-измерительных комплексов, центров и пунктов управления полетами космических объектов, приема, хранения и переработки информации',
    '143005030000': 'Для размещения баз хранения космической техники',
    '143005040000': 'Для размещения полигонов приземления космических объектов и взлетно-посадочных полос',
    '143005050000': 'Для размещения объектов экспериментальной базы для отработки космической техники',
    '143005060000': 'Для размещения центров и оборудования для подготовки космонавтов',
    '143005070000': 'Для размещения других наземных сооружений и техники, используемых при осуществлении космической деятельности',
    '143006000000': 'Для размещения объектов, предназначенных для обеспечения обороны и безопасности',
    '143006010000': 'Для обеспечения задач обороны',
    '143006010100': 'Для размещения военных организаций, учреждений и других объектов',
    '143006010200': 'Для дислокации войск и сил флота',
    '143006010300': 'Для проведения учений и иных мероприятий',
    '143006010400': 'Для испытательных полигонов',
    '143006010500': 'Для мест уничтожения оружия и захоронения отходов',
    '143006010600': 'Для создания запасов материальных ценностей в государственном и мобилизационном резервах (хранилища, склады и другие)',
    '143006010700': 'Для размещения иных объектов обороны',
    '143006020000': 'Для размещения объектов (территорий), обеспечивающих защиту и охрану Государственной границы Российской Федерации',
    '143006020100': 'Для обустройства и содержания инженерно-технических сооружений и заграждений',
    '143006020200': 'Для обустройства и содержания пограничных знаков',
    '143006020300': 'Для обустройства и содержания пограничных просек',
    '143006020400': 'Для обустройства и содержания коммуникаций',
    '143006020500': 'Для обустройства и содержания пунктов пропуска через Государственную границу Российской Федерации',
    '143006020600': 'Для размещения иных объектов для защиты и охраны Государственной границы Российской Федерации',
    '143006030000': 'Для размещения иных объектов обороны и безопасности',
    '143007000000': 'Для размещения иных объектов промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, обеспечения космической деятельности, обороны, безопасности и иного специального назначения',
    '144000000000': 'Для размещения особо охраняемых историко-культурных и природных объектов (территорий)',
    '144001000000': 'Для размещения особо охраняемых природных объектов (территорий)',
    '144001010000': 'Для размещения государственных природных заповедников (в том числе биосферных)',
    '144001020000': 'Для размещения государственных природных заказников',
    '144001030000': 'Для размещения национальных парков',
    '144001040000': 'Для размещения природных парков',
    '144001050000': 'Для размещения дендрологических парков',
    '144001060000': 'Для размещения ботанических садов',
    '144001070000': 'Для размещения объектов санаторного и курортного назначения',
    '144001080000': 'Территории месторождений минеральных вод, лечебных грязей, рапы лиманов и озер',
    '144001090000': 'Для традиционного природопользования',
    '144001100000': 'Для размещения иных особо охраняемых природных территорий (объектов)',
    '144002000000': 'Для размещения объектов (территорий) природоохранного назначения',
    '144003000000': 'Для размещения объектов (территорий) рекреационного назначения',
    '144003010000': 'Для размещения домов отдыха, пансионатов, кемпингов',
    '144003020000': 'Для размещения объектов физической культуры и спорта',
    '144003030000': 'Для размещения туристических баз, стационарных и палаточных туристско-оздоровительных лагерей, домов рыболова и охотника, детских туристических станций',
    '144003040000': 'Для размещения туристических парков',
    '144003050000': 'Для размещения лесопарков',
    '144003060000': 'Для размещения учебно-туристических троп и трасс',
    '144003070000': 'Для размещения детских и спортивных лагерей',
    '144003080000': 'Для размещения скверов, парков, городских садов',
    '144003090000': 'Для размещения пляжей',
    '144003100000': 'Для размещения иных объектов (территорий) рекреационного назначения',
    '144004000000': 'Для размещения объектов историко-культурного назначения',
    '144004010000': 'Для размещения объектов культурного наследия народов Российской Федерации (памятников истории и культуры), в том числе объектов археологического наследия',
    '144004020000': 'Для размещения военных и гражданских захоронений',
    '144005000000': 'Для размещения иных особо охраняемых историко-культурных и природных объектов (территорий)',
    '145000000000': 'Для размещения объектов лесного фонда',
    '145001000000': 'Для размещения лесной растительности',
    '145002000000': 'Для восстановления лесной растительности',
    '145003000000': 'Для прочих объектов лесного хозяйства',
    '146000000000': 'Для размещения объектов водного фонда',
    '146001000000': 'Под водными объектами',
    '146002000000': 'Для размещения гидротехнических сооружений',
    '146003000000': 'Для размещения иных сооружений, расположенных на водных объектах',
    '147000000000': 'Земли запаса (неиспользуемые)'
};
// Назначение зданий
var dAssBuilding = {
    '204001000000': 'Нежилое здание',
    '204002000000': 'Жилой дом',
    '204003000000': 'Многоквартирный дом'
};

var ParcelProperties;
var ConstructionProperties;
var UncompletedProperties;
var BuildingProperties;
var ZoneProperties;
var BoundProperties;

function getValueFromDict(Key, Dic) {
    for (var k in Dic) {
        if (k === Key) {
            return Dic[k];
        }
    }
}

module.exports.getProperties = function (Feature, FeatureType) {
    switch (FeatureType) {
        case 'Parcel' :
        {
            ParcelProperties = {
                objectType: 'ЗУ',
                "Кадастровый номер": '', // require
                "Статус": '01', // dStates require
                "Дата создания": '',
                "Тип объекта": '', //dParcels require
                "Категория земель": '', // dCategories // require
                "Площадь": {// requre
                    "Значение": 0, // require
                    "ед.изм": '', //dUnit require
                    "Точность": '' // d20_2
                },
                "Разрешённое использование": {// require
                    "по документу": '',
                    "по справочнику": '' // dUtilization require
                }
            };
            ParcelProperties["Кадастровый номер"] = Feature.CadastralNumber;
            ParcelProperties["Статус"] = getValueFromDict(Feature.State, dStates);
            ParcelProperties["Тип объекта"] = getValueFromDict(Feature.Name, dParcels);
            ParcelProperties["Категория земель"] = getValueFromDict(Feature.Category, dCategories);
            ParcelProperties["Дата создания"] = Feature.DateCreated;
            ParcelProperties["Разрешённое использование"]["по справочнику"] =
                    getValueFromDict(Feature.Utilization.Utilization, dUtilizations);
            ParcelProperties["Разрешённое использование"]["по документу"] = Feature.Utilization.ByDoc;
            break;
        }
        case 'Construction':
        {
            ConstructionProperties = {
                objectType: 'ОКС сооружение',
                cadastreNumber: '', // 
                AssignationName: '',
                Address: {
                    Note: ''
                }
            };
            if (Feature.CadastralNumber) {
                ConstructionProperties.cadastreNumber = Feature.CadastralNumber;
            } else {
                ConstructionProperties.cadastreNumber = '';
            }

            ConstructionProperties.AssignationName = Feature.AssignationName;
            ConstructionProperties.ObjectType = getValueFromDict(Feature.ObjectType, dZone);
            ConstructionProperties["Address"]["Note"] = Feature.Address.Note;
            break;
        }
        case 'Building':
        {
            BuildingProperties = {
                objectType: 'ОКС',
                cadastreNumber: '', // 
                AssignationName: '',
                Address: {
                    Note: ''
                }
            };
            if (Feature.CadastralNumber) {
                BuildingProperties.cadastreNumber = Feature.CadastralNumber;
            } else {
                BuildingProperties.cadastreNumber = '';
            }

            BuildingProperties.AssignationName = Feature.AssignationName;
            //BuildingProperties.objectType = getValueFromDict(Feature.ObjectType, dZone);
            BuildingProperties["Address"]["Note"] = Feature.Address.Note;
            break;
        }
        case 'Uncompleted':
        {
            UncompletedProperties = {
                objectType: 'ОКС незавершённый',
                cadastreNumber: '', // 
                AssignationName: '',
                Address: {
                    Note: ''
                }
            };
            if (Feature.CadastralNumber) {
                UncompletedProperties.cadastreNumber = Feature.CadastralNumber;
            } else {
                UncompletedProperties.cadastreNumber = '';
            }

            UncompletedProperties.AssignationName = Feature.AssignationName;
            //UncompletedProperties.objectType = getValueFromDict(Feature.ObjectType, dZone);
            UncompletedProperties["Address"]["Note"] = Feature.Address.Note;
            break;
        }
        case 'Zone' :
        {
            ZoneProperties = {
                objectType: 'Зона',
                accountNumber: '', // 
                description: '',
                territorialZone: {
                   
                },
                specialZone: {
                    contentRestrictions: ''
                }
            };
            ZoneProperties.accountNumber = Feature.AccountNumber;
            ZoneProperties.description = Feature.Description;
        }
        case 'Bound' :
        {
            BoundProperties = {
                objectType: 'Граница',
                accountNumber: '', // 
                description: ''
            };
            BoundProperties.accountNumber = Feature.AccountNumber;
            BoundProperties.description = Feature.Description;
        }
        default :
        {
            console.log('Тип объекта не распознан');
        }
    }
    return {
        parcelProperties: ParcelProperties,
        constructionProperties: ConstructionProperties,
        uncompletedProperties: UncompletedProperties,
        buildingProperties: BuildingProperties,
        zoneProperties: ZoneProperties,
        boundProperties: BoundProperties
    };
};
},{}],3:[function(require,module,exports){
var ES = require('./spatial/EntitySpatial.js');
var Props = require('./cadProps');

module.exports.GeoJSON = function (xmlData, reproject) {

    var geoJSONQuartal = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONBounds = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONZones = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONParcels = {
        'type': 'FeatureCollection',
        'features': []
    };
    var geoJSONRealty = {
        type: "FeatureCollection",
        features: []
    };
    // Отдельное хранилище для GeometryCollection
//    var geoJSONRealtyCollection = {
//        type: "FeatureCollection",
//        features: []
//    };
    var geoJSONOSMPoints = {
        type: "FeatureCollection",
        features: []
    };

    var _reproject = reproject || null;

    var AllData = $.xml2json(xmlData).CadastralBlocks.CadastralBlock;
    //console.log(AllData);

    // Может быть несколько СК
    var projMSK;
    if (_reproject !== null) {
        projMSK = AllData.CoordSystems;
    }

    // Обработка квартала. Не может быть многоконтурным           
    if (AllData.SpatialData !== null) {
        var spObj = ES.getEntitySpatial(AllData.SpatialData.EntitySpatial, projMSK, 'Quartal', false);
        if ((spObj === undefined) || (spObj.length === 0)) {
            console.log('Объект квартала с пустой геометрией! Объект будет пропущен.');
        }
        // Квартал
        var feature = {
            'type': 'Feature'
        };
        feature.geometry = spObj;
        // Остальные свойства....

        geoJSONQuartal.features.push(feature);
    } else {
        console.log('Нет описания пространственной составляющей квартала');
    }

    // Обработка границ. Не могут быть многоконтурными
    if (AllData.Bounds) {

        if (AllData.Bounds.Bound.splice) {
            for (var i = 0; i < AllData.Bounds.Bound.length; i++) {
                if (AllData.Bounds.Bound[i].Boundaries.Boundary.splice) {
                    for (var k = 0; k < AllData.Bounds.Bound[i].Boundaries.Boundary.length; k++) {
                        // Граница
                        var feature = {
                            'type': 'Feature'
                        };
                        if (AllData.Bounds.Bound[i].Boundaries.Boundary[k].EntitySpatial !== null) {
                            var spObj = ES.getEntitySpatial(AllData.Bounds.Bound[i].Boundaries.Boundary[k].EntitySpatial, projMSK, 'Bound', false);
                            if ((spObj === undefined) || (spObj.length === 0)) {
                                console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
                                continue;
                            }
                            feature.geometry = spObj;
                            // Остальные свойства....

                            geoJSONBounds.features.push(feature);
                        } else {
                            //console.log('Нет описания пространственной составляющей границы');
                        }
                    }
                } else {
                    // Граница
                    var feature = {
                        'type': 'Feature'
                    };
                    var spObj = ES.getEntitySpatial(AllData.Bounds.Bound[i].Boundaries.Boundary.EntitySpatial, projMSK, 'Bound', false);
                    if ((spObj === undefined) || (spObj.length === 0)) {
                        console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
                        continue;
                    }
                    //feature.geometry = spObj;
                    // Остальные свойства....
                    if (spObj) {
                        feature.geometry = spObj;
                        // Остальные свойства....
                        var props = Props.getProperties(AllData.Bounds.Bound[i], 'Bound');
                        if (props) {
                            feature.properties = props.boundProperties;
                        }
                        //console.log('Объект создан. КН:' + feature.properties.cadastreNumber);
                        geoJSONBounds.features.push(feature);
                    }
                    //geoJSONBounds.features.push(feature);
                }
            }
        } else {
            var spObj = ES.getEntitySpatial(AllData.Bounds.Bound.Boundaries.Boundary.EntitySpatial, projMSK, 'Bound', false);
            if ((spObj === undefined) || (spObj.length === 0)) {
                console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
            }
            //feature.geometry = spObj;
                    // Остальные свойства....
                    if (spObj) {
                        feature.geometry = spObj;
                        // Остальные свойства....
                        var props = Props.getProperties(AllData.Bounds.Bound, 'Bound');
                        if (props) {
                            feature.properties = props.boundProperties;
                        }
                        //console.log('Объект создан. КН:' + feature.properties.cadastreNumber);
                        geoJSONBounds.features.push(feature);
                    }
                    //geoJSONBounds.features.push(feature);
        }
    }
    // Обработка зон. Не могут быть многоконтурными
    if (AllData.Zones) {

        if (AllData.Zones.Zone.splice) {
            for (var i = 0; i < AllData.Zones.Zone.length; i++) {
                // Зона
                var feature = {
                    'type': 'Feature'
                };
                if (AllData.Zones.Zone[i].EntitySpatial !== null) {
                    var spObj = ES.getEntitySpatial(AllData.Zones.Zone[i].EntitySpatial, projMSK, 'Zone', false);
                    if ((spObj === undefined) || (spObj.length === 0)) {
                        console.log('Объект Зоны с пустой геометрией! Объект будет пропущен.');
                        continue;
                    }
                    //feature.geometry = spObj;
                    if (spObj) {
                        feature.geometry = spObj;
                        // Остальные свойства....
                        var props = Props.getProperties(AllData.Zones.Zone[i], 'Zone');
                        if (props) {
                            feature.properties = props.zoneProperties;
                        }
                        //console.log('Объект создан. КН:' + feature.properties.cadastreNumber);
                        geoJSONZones.features.push(feature);
                    }
                    //geoJSONZones.features.push(feature);
                } else {
                    console.log('Нет описания пространственной составляющей зоны');
                }
            }
        } else {
            if (AllData.Zones.Zone.EntitySpatial !== null) {
                // Зона
                var feature = {
                    'type': 'Feature'
                };
                var spObj = ES.getEntitySpatial(AllData.Zones.Zone.EntitySpatial, projMSK, 'Zone', false);
                if ((spObj === undefined) || (spObj.length === 0)) {
                    console.log('Объект Зоны с пустой геометрией! Объект будет пропущен.');
                }
                //feature.geometry = spObj;
                if (spObj) {
                    feature.geometry = spObj;
                    // Остальные свойства....
                    var props = Props.getProperties(AllData.Zones.Zone, 'Zone');
                    if (props) {
                        feature.properties = props.zoneProperties;
                    }
                    //console.log('Объект создан. КН:' + feature.properties.cadastreNumber);
                    geoJSONZones.features.push(feature);
                }
                //geoJSONZones.features.push(feature);
            } else {
                console.log('Нет описания пространственной составляющей зоны');
            }
        }
    }
    // Обработка всех земельных участков
    for (var e = 0; e < AllData.Parcels.Parcel.length; e++) {
        var spObj = null;
        // Земельный участок
        var feature = {
            'type': 'Feature'
        };
        if (AllData.Parcels.Parcel[e].EntitySpatial !== undefined) {
            spObj = ES.getEntitySpatial(AllData.Parcels.Parcel[e].EntitySpatial, projMSK, 'Parcel', false);
            if ((spObj === undefined) || (spObj.length === 0)) {
                continue;
            }

        }
        // Многоконтурный
        else if (AllData.Parcels.Parcel[e].Contours) {
            var Contours = AllData.Parcels.Parcel[e].Contours.Contour;
            var multiPolygon = [];
            for (var c = 0; c < Contours.length; c++) {
                var es = Contours[c].EntitySpatial;
                var p = ES.getEntitySpatial(es, projMSK, 'Parcel', true);
                if (p) {
                    multiPolygon.push(p);
                }
            }
            spObj = {
                type: "MultiPolygon",
                coordinates: multiPolygon
            };
        } else {
            //console.log('Нет описания пространственной составляющей');
        }

        // Если нет геометрии, то объект не нужен
        if (spObj) {
            feature.geometry = spObj;
            // Остальные свойства....
            var props = Props.getProperties(AllData.Parcels.Parcel[e], 'Parcel');
            if (props) {
                feature.properties = props.parcelProperties;
            }
            //console.log('Объект создан. КН:' + feature.properties.cadastreNumber);
            geoJSONParcels.features.push(feature);
        }

    }
    // Обработка строений. могут быть составные из разных геометрий
    if (AllData.ObjectsRealty.ObjectRealty) {
        if (AllData.ObjectsRealty.ObjectRealty.splice) {

            function processES(EntitySpatial, oType) {
                var spObj = ES.getEntitySpatial(EntitySpatial, projMSK, oType, false);
                if (spObj) {
                    if (spObj.type === 'GeometryCollection') {
                        // GeoJSON с коллекцией трудно открывать на десктопе
                        // ogr2ogr -f GeoJSON -explodecollections explode doc2139433_xml_RealtyGC.geojson
                        // поэтому лучше создать фич по количеству объектов в коллекции
                        for (var k = 0; k < spObj.geometries.length - 1; k++) {
                            feature.geometry = spObj.geometries[k];
                            geoJSONRealty.features.push(feature);
                        }
                        //geoJSONRealtyCollection.features.push(feature);
                        //console.log('Добавлен geoJSONRealtyGeometryCollection');
                        //console.log(spObj.geometries);
                    } else {
                        feature.geometry = spObj;
                        geoJSONRealty.features.push(feature);
                    }

                } else {
                    console.log('ОКС с пустой геометрией! Объект будет пропущен.');
                }
            }

            for (var i = 0; i < AllData.ObjectsRealty.ObjectRealty.length; i++) {
                var spObj = null;
                // ОКС
                var feature = {
                    'type': 'Feature'
                };
                // строения
                if (AllData.ObjectsRealty.ObjectRealty[i].Building) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Building.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Building, 'Building');
                        if (props) {
                            feature.properties = props.buildingProperties;
                            //console.log(props.buildingProperties);
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Building.EntitySpatial, 'Building');
                    }
                }
                // объекты незавершённого строительства
                else if (AllData.ObjectsRealty.ObjectRealty[i].Uncompleted) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Uncompleted.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Uncompleted, 'Uncompleted');
                        if (props) {
                            feature.properties = props.uncompletedProperties;
                            //console.log(props.uncompletedProperties);
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Uncompleted.EntitySpatial, 'Uncompleted');
                    }
                }
                // сооружения
                else if (AllData.ObjectsRealty.ObjectRealty[i].Construction) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Construction.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Construction, 'Construction');
                        if (props) {
                            feature.properties = props.constructionProperties;
                            //console.log(props.constructionProperties);
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Construction.EntitySpatial, 'Construction');
                    }
                }
            }
        }
    }
    // Обработка пунктов ОМС

    return {
        geoJSONQuartal: geoJSONQuartal,
        geoJSONBounds: geoJSONBounds,
        geoJSONZones: geoJSONZones,
        geoJSONParcels: geoJSONParcels,
        geoJSONRealty: geoJSONRealty
                //geoJSONRealtyGeometryCollection: geoJSONRealtyCollection
    };
};

},{"./cadProps":2,"./spatial/EntitySpatial.js":4}],4:[function(require,module,exports){
/**
 * Модуль обработки геометрии типа полигон.
 * Один внешний контур и 0 или более внутренних контуров-"дырок"
 * 
 * GeoJSON geometry типа tEntitySpatialLandOut
 */

//"geometry": {
//    "type": "Polygon",
//    "coordinates": [
//      [ [100.0, 0.0], [101.0, 0.0], [101.0, 1.0],
//        [100.0, 1.0], [100.0, 0.0] ]
//      ]
//  }

var projections = require('./SpatialSystems');

module.exports.getEntitySpatial = function (EntitySpatialObj, proj, oType, partOfMultu) {

//	this.geometry = {
//        type: '',
//		coordinates: []
//	};

    var _EntitySpatialObj = EntitySpatialObj;
    var _proj = proj || null;
    var Area = 0.0;
    var spatialSysName = null;
    var LineString = false;

    // Вычисление площади замкнутого контура
    function polygonArea(Xs, Ys, numPoints) {
        var area = 0;
        var j = numPoints - 1;
        for (var i = 0; i < numPoints; i++)
        {
            area = area + ((Xs[j]) + (Xs[i])) * ((Ys[j]) - (Ys[i]));
            j = i;  //j is previous vertex to i
        }
        return Math.abs(area / 2);
    }

    function convertCoord(coord) {
        // global
        if ((_proj === null) || (spatialSysName === null)) {
            return coord;
        } else {
            return proj4(projections.SpatialSystems[spatialSysName], 'EPSG:3857', coord);
        }
    }

    function getSpatialSysName() {
        var id = _EntitySpatialObj.EntSys;
        for (var i = 0; _proj.CoordSystem.length; i++) {
            if (_proj.CoordSystem[i].CsId === id) {
                return _proj.CoordSystem[i].Name;
            }
        }
        return null;
    }

    // Создание одного замкнутого контура или линии или окружности
    function createContour(SpatialElement) {
        var xs = [];
        var ys = [];
        var contour = [];
        var coord;
        var re_projected = [];
        // проверка на окружность
        if ((SpatialElement.SpelementUnit.TypeUnit === "Окружность" || "Точка") &&
                (SpatialElement.SpelementUnit.R !== undefined)) {
            coord = [Number(SpatialElement.SpelementUnit.Ordinate.Y), Number(SpatialElement.SpelementUnit.Ordinate.X)];
            re_projected = convertCoord(coord);
            return {
                'R': Number(SpatialElement.SpelementUnit.R),
                'Y': Number(re_projected[0]),
                'X': Number(re_projected[1])
            };
        } else {
            if (SpatialElement.SpelementUnit.length === 1)
                return null;
            var firstPoint = SpatialElement.SpelementUnit[0];
            var lastPoint = SpatialElement.SpelementUnit[SpatialElement.SpelementUnit.length - 1];
            if (firstPoint.SuNmb === lastPoint.SuNmb) {
                LineString = false;
                //console.log(LineString, firstPoint.SuNmb, lastPoint.SuNmb);
                for (var j = 0; j < SpatialElement.SpelementUnit.length - 1; j++) {
                    var point = SpatialElement.SpelementUnit[j];
                    var xy = [];
                    coord = [Number(point.Ordinate.Y), Number(point.Ordinate.X)];
                    re_projected = convertCoord(coord);
                    xy.push(Number(re_projected[0]));
                    xy.push(Number(re_projected[1]));
                    contour.push(xy);
                }
                contour.push(contour[0]);
                Area = polygonArea(xs, ys, xs.length);
            } else {
                LineString = true;
                //console.log(LineString, firstPoint.SuNmb, lastPoint.SuNmb);
                for (var j = 0; j < SpatialElement.SpelementUnit.length; j++) {
                    var point = SpatialElement.SpelementUnit[j];
                    var xy = [];
                    coord = [Number(point.Ordinate.Y), Number(point.Ordinate.X)];
                    re_projected = convertCoord(coord);
                    xy.push(Number(re_projected[0]));
                    xy.push(Number(re_projected[1]));
                    contour.push(xy);
                }
                // бывае что LineString имеет одинаковые первую и последнюю точки
                // но SuNmb разные.
//                if ((contour[0][0][0] === contour[0][contour[0].length-1][0]) &&
//                        (contour[0][0][1] === contour[0][contour[0].length-1][1])){
//                    delete(contour[0][contour.length-1]);
//                    console.log(contour[0][0][0], contour[0][contour[0].length-1][0],LineString);
//                }
            }
            //console.log(Area);
            return contour;
        }
    }

    function processSpatialElement(SpatialElement) {
        var cntrs = [];
        if (_proj !== null) {
            spatialSysName = getSpatialSysName();
        }
        // Утинная типизация для проверки наличия дырок в полигоне
        // В Росреестре не следят за порядком контуров полигона
        if (SpatialElement.splice) {
            var MaxArea;
            var MaxAreaIdx = 0;
            for (var k = 0; k < SpatialElement.length; k++) {
                var contour = SpatialElement[k];
                var cnt = createContour(contour);
                if (cnt)
                    cntrs.push(cnt);
                if (Area > MaxArea) {
                    MaxArea = Area;
                    MaxAreaIdx = k;
                }
            }
            // Перемещаем основной (наружний) контур в начало массива
            if (MaxAreaIdx > 0) {
                var mainCnt = cntrs.splice(MaxAreaIdx, 1);
                cntrs.splice(0, 0, mainCnt);
                //console.log('Номер основного контура был ' + MaxAreaIdx);
            }
            if ((cntrs !== null) || (cntrs !== undefined)) {
                return cntrs;
            } else {
                return null;
            }
        } else {
            cntrs.push(createContour(SpatialElement));
            if ((cntrs !== null) || (cntrs !== undefined)) {
                return cntrs;
            } else {
                return null;
            }
        }
    }

    // у сооружений может быть смешаная геометрия (LineString, LineString, Circle, LineString)
    // в этом случае контуры cntrs будут хранить коллекцию
    function processRealtySpatialElement(SpatialElement) {
        var cntrs = [];
        if (_proj !== null) {
            spatialSysName = getSpatialSysName();
        }
        if (SpatialElement.splice) {
            var MaxArea;
            var MaxAreaIdx = 0;
            for (var k = 0; k < SpatialElement.length; k++) {
                var contour = SpatialElement[k];
                var cnt = createContour(contour);
                if (cnt)
                    cntrs.push(cnt);
                if (Area > MaxArea) {
                    MaxArea = Area;
                    MaxAreaIdx = k;
                }
            }
            // Перемещаем основной (наружний) контур в начало массива
            if ((!LineString) && (MaxAreaIdx > 0)) {
                var mainCnt = cntrs.splice(MaxAreaIdx, 1);
                cntrs.splice(0, 0, mainCnt);
                //console.log('Номер основного контура был ' + MaxAreaIdx);
            }
        } else {
            cntrs.push(createContour(SpatialElement));
        }
        if (cntrs.length > 1) {
            collection = [];

            for (var i = 0; i < cntrs.length - 1; i++) {
                // Окружность
                if (cntrs[i].R) {
                    var points = approximateCircle(cntrs[i].X, cntrs[i].Y, cntrs[i].R);
                    collection.push({
                        "type": "Polygon",
                        "coordinates": [points]
                    });
                }
                // Полигон
                else if (!LineString) {
                    collection.push({
                        "type": "Polygon",
                        "coordinates": [cntrs[i]]
                    });
                } else {
                    collection.push({
                        "type": "LineString",
                        "coordinates": cntrs[i]
                    });
                }
            }
            return  {
                "type": "GeometryCollection",
                "geometries": collection
            };

        } else {
            // Окружность
            if (cntrs[0].R) {
                var points = approximateCircle(cntrs[0].X, cntrs[0].Y, cntrs[0].R);
                return {
                    "type": "Polygon",
                    "coordinates": [points]
                };
            }
            // Полигон
            else if (!LineString) {
                return{
                    "type": "Polygon",
                    "coordinates": [cntrs[0]]
                };
            } else {
                return{
                    "type": "LineString",
                    "coordinates": cntrs[0]
                };
            }
        }
    }

    function approximateCircle(X, Y, R) {
        var rotatedAngle, x, y;
        var sides = 32;
        var points = [];
        x = X + R; // сдвиг на окружность
        //console.log('approximateCircle');
        for (var d = 0; d < sides - 1; d++) {
            var xy = [];
            rotatedAngle = (d * 2 * Math.PI / sides);//angle + (d * 2 * Math.PI / sides);
            x = X + (R * Math.cos(rotatedAngle));
            y = Y + (R * Math.sin(rotatedAngle));
            coord = [Number(y), Number(x)];
            xy.push(coord[0]);
            xy.push(coord[1]);
            points.push(xy);
        }
        points.push(points[0]);
        return points;
    }

    if ((_EntitySpatialObj !== undefined) && (_EntitySpatialObj !== null)) {

        var cntrs = [];

        switch (oType) {
            case 'Parcel' :
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                // Если это для многоконтурного объекта, то возвращем массив контуров
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            case 'Construction':
            {
                return processRealtySpatialElement(_EntitySpatialObj.SpatialElement);
                break;
            }
            case 'Building':
            {
                return processRealtySpatialElement(_EntitySpatialObj.SpatialElement);
                break;
            }
            case 'Uncompleted':
            {
                return processRealtySpatialElement(_EntitySpatialObj.SpatialElement);
                break;
            }
            case 'Zone':
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            case 'Quartal':
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            case 'Bound':
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            default :
            {
                console.log('Тип объекта не распознан');
                return null;
            }
        }
    }

}
;

},{"./SpatialSystems":5}],5:[function(require,module,exports){
/* 
 * The MIT License
 *
 * Copyright 2015 filippov.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

/*  Сиcтемы координат имеют смысл для визуализации получаемых GeoJSON,
    для сохранения в файл нет надобности в преобразовании.
    Информация о системах координат хранится в теге <CoordSystems>
    <CoordSystems>
        <ns3:CoordSystem Name="МСК 70, зона 3" CsId="ID3" />
        <ns3:CoordSystem Name="МСК 70, зона 4" CsId="ID4" />
    </CoordSystems>
    их может быть несколько.
    У объектов в теге <EntitySpatial> указано в какой СК он имеет координаты,
    например:
    <EntitySpatial EntSys="ID3">

    проблемы конвертации у тех xml у который указано <ns3:CoordSystem Name="СК кадастрового округа" CsId="ID1" />
*/ 


module.exports.SpatialSystems = {
    // Томская область
    'МСК 70, зона 4': '+proj=tmerc +lat_0=0 +lon_0=83.73333333333 +k=1 +x_0=4250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs',
    'МСК 70, зона 2': '+proj=tmerc +lat_0=0 +lon_0=77.73333333333 +k=1 +x_0=2250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs',
    'МСК 70, зона 3': '+proj=tmerc +lat_0=0 +lon_0=80.73333333333 +k=1 +x_0=3250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs'
};
},{}]},{},[1])
//# sourceMappingURL=data:application/json;charset=utf-8;base64,eyJ2ZXJzaW9uIjozLCJzb3VyY2VzIjpbIm5vZGVfbW9kdWxlcy9ncnVudC1icm93c2VyaWZ5L25vZGVfbW9kdWxlcy9icm93c2VyaWZ5L25vZGVfbW9kdWxlcy9icm93c2VyLXBhY2svX3ByZWx1ZGUuanMiLCJzcmMvYXBwLmpzIiwic3JjL2NhZFByb3BzLmpzIiwic3JjL2NhZFhNTDJHZW9KU09OLmpzIiwic3JjL3NwYXRpYWwvRW50aXR5U3BhdGlhbC5qcyIsInNyYy9zcGF0aWFsL1NwYXRpYWxTeXN0ZW1zLmpzIl0sIm5hbWVzIjpbXSwibWFwcGluZ3MiOiJBQUFBO0FDQUE7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTs7QUMxTUE7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBOztBQ3Y2QkE7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTs7QUMvVEE7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTs7QUM3VkE7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0EiLCJmaWxlIjoiZ2VuZXJhdGVkLmpzIiwic291cmNlUm9vdCI6IiIsInNvdXJjZXNDb250ZW50IjpbIihmdW5jdGlvbiBlKHQsbixyKXtmdW5jdGlvbiBzKG8sdSl7aWYoIW5bb10pe2lmKCF0W29dKXt2YXIgYT10eXBlb2YgcmVxdWlyZT09XCJmdW5jdGlvblwiJiZyZXF1aXJlO2lmKCF1JiZhKXJldHVybiBhKG8sITApO2lmKGkpcmV0dXJuIGkobywhMCk7dmFyIGY9bmV3IEVycm9yKFwiQ2Fubm90IGZpbmQgbW9kdWxlICdcIitvK1wiJ1wiKTt0aHJvdyBmLmNvZGU9XCJNT0RVTEVfTk9UX0ZPVU5EXCIsZn12YXIgbD1uW29dPXtleHBvcnRzOnt9fTt0W29dWzBdLmNhbGwobC5leHBvcnRzLGZ1bmN0aW9uKGUpe3ZhciBuPXRbb11bMV1bZV07cmV0dXJuIHMobj9uOmUpfSxsLGwuZXhwb3J0cyxlLHQsbixyKX1yZXR1cm4gbltvXS5leHBvcnRzfXZhciBpPXR5cGVvZiByZXF1aXJlPT1cImZ1bmN0aW9uXCImJnJlcXVpcmU7Zm9yKHZhciBvPTA7bzxyLmxlbmd0aDtvKyspcyhyW29dKTtyZXR1cm4gc30pIiwiLyogXG4gKiBUbyBjaGFuZ2UgdGhpcyBsaWNlbnNlIGhlYWRlciwgY2hvb3NlIExpY2Vuc2UgSGVhZGVycyBpbiBQcm9qZWN0IFByb3BlcnRpZXMuXG4gKiBUbyBjaGFuZ2UgdGhpcyB0ZW1wbGF0ZSBmaWxlLCBjaG9vc2UgVG9vbHMgfCBUZW1wbGF0ZXNcbiAqIGFuZCBvcGVuIHRoZSB0ZW1wbGF0ZSBpbiB0aGUgZWRpdG9yLlxuICovXG5cbihmdW5jdGlvbiAoKSB7XG4gICAgdmFyIENvbnZlcnRlciA9IHJlcXVpcmUoJy4vY2FkWE1MMkdlb0pTT04uanMnKTtcblxuICAgIHZhciBwYXJjZWxTdHlsZSA9IHtcbiAgICAgICAgZmlsbENvbG9yOiBcIiNiOGU1MGVcIixcbiAgICAgICAgY29sb3I6IFwiIzAwMFwiLFxuICAgICAgICB3ZWlnaHQ6IDEsXG4gICAgICAgIG9wYWNpdHk6IDEsXG4gICAgICAgIGZpbGxPcGFjaXR5OiAwLjhcbiAgICB9O1xuICAgIHZhciBva3NTdHlsZSA9IHtcbiAgICAgICAgZmlsbENvbG9yOiBcIiNmZjc4MDBcIixcbiAgICAgICAgY29sb3I6IFwiIzAwMFwiLFxuICAgICAgICB3ZWlnaHQ6IDEsXG4gICAgICAgIG9wYWNpdHk6IDEsXG4gICAgICAgIGZpbGxPcGFjaXR5OiAxXG4gICAgfTtcbiAgICB2YXIgcXVhcnRhbGxTdHlsZSA9IHtcbiAgICAgICAgZmlsbENvbG9yOiBcIiNlNGRlYTRcIixcbiAgICAgICAgY29sb3I6IFwiIzAwMFwiLFxuICAgICAgICB3ZWlnaHQ6IDEsXG4gICAgICAgIG9wYWNpdHk6IDEsXG4gICAgICAgIGZpbGxPcGFjaXR5OiAwLjNcbiAgICB9O1xuICAgIHZhciB6b25lU3R5bGUgPSB7XG4gICAgICAgIGZpbGxDb2xvcjogXCIjZjkxNDE0XCIsXG4gICAgICAgIGNvbG9yOiBcIiMwMDBcIixcbiAgICAgICAgd2VpZ2h0OiAxLFxuICAgICAgICBvcGFjaXR5OiAxLFxuICAgICAgICBmaWxsT3BhY2l0eTogMC44XG4gICAgfTtcbiAgICB2YXIgYm91bmRsU3R5bGUgPSB7XG4gICAgICAgIGZpbGxDb2xvcjogXCIjNGI1YzcwXCIsXG4gICAgICAgIGNvbG9yOiBcIiMwMDBcIixcbiAgICAgICAgd2VpZ2h0OiAxLFxuICAgICAgICBvcGFjaXR5OiAxLFxuICAgICAgICBmaWxsT3BhY2l0eTogMC44XG4gICAgfTtcblxuICAgIGZ1bmN0aW9uIGxheWVyRkFjdG9yeShnZW9KU09OLCBsYXllclN0eWxlKSB7XG4gICAgICAgIGdlb0pTT04uY3JzID0ge1xuICAgICAgICAgICAgXCJ0eXBlXCI6IFwibmFtZVwiLFxuICAgICAgICAgICAgXCJwcm9wZXJ0aWVzXCI6IHtcbiAgICAgICAgICAgICAgICBcIm5hbWVcIjogXCJ1cm46b2djOmRlZjpjcnM6RVBTRzo6Mzg1N1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIH07XG4gICAgICAgIHJldHVybiBMLlByb2ouZ2VvSnNvbihcbiAgICAgICAgICAgICAgICBnZW9KU09OLCB7XG4gICAgICAgICAgICAgICAgICAgIHN0eWxlOiBsYXllclN0eWxlLFxuICAgICAgICAgICAgICAgICAgICBvbkVhY2hGZWF0dXJlOiBmdW5jdGlvbiAoZmVhdHVyZSwgbGF5ZXIpXG4gICAgICAgICAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIC8vbGF5ZXIuYmluZFBvcHVwKGZlYXR1cmUucHJvcGVydGllcyk7XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICk7XG4gICAgfVxuXG4gICAgdmFyIGRhdGEgPSB7XG5cbiAgICAgICAgaW5pdDogZnVuY3Rpb24gKG1hcCwgcmVwcm9qZWN0KSB7XG4gICAgICAgICAgICBkYXRhLl9tYXAgPSBtYXA7XG4gICAgICAgICAgICBkYXRhLnJlcHJvamVjdCA9IHJlcHJvamVjdDtcbiAgICAgICAgICAgIGRhdGEuX2dyb3VwcyA9IHtcblxuICAgICAgICAgICAgfTtcblxuICAgICAgICAgICAgZGF0YS5fZXhwb3J0Q29udCA9IGRvY3VtZW50LmdldEVsZW1lbnRCeUlkKCdleHBvcnRDb250Jyk7XG4gICAgICAgICAgICBkYXRhLl9maWxlUHJvZ3Jlc3MgPSBkb2N1bWVudC5nZXRFbGVtZW50QnlJZCgnZmlsZVByb2dyZXNzJyk7XG4gICAgICAgICAgICB2YXIgZXhwb3J0SWNvbiA9IG51bGw7XG4gICAgICAgICAgICBpZiAobmF2aWdhdG9yLm1zU2F2ZUJsb2IpIHsgLy8gSUUgMTArXG4gICAgICAgICAgICAgICAgZXhwb3J0SWNvbiA9IEwuRG9tVXRpbC5jcmVhdGUoJ2J1dHRvbicsICdidXR0b24nLCBkYXRhLl9leHBvcnRDb250KTtcbiAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgZXhwb3J0SWNvbiA9IEwuRG9tVXRpbC5jcmVhdGUoJ2EnLCAnYnV0dG9uJywgZGF0YS5fZXhwb3J0Q29udCk7XG4gICAgICAgICAgICAgICAgZXhwb3J0SWNvbi5zZXRBdHRyaWJ1dGUoJ3RhcmdldCcsICdfYmxhbmsnKTtcbiAgICAgICAgICAgICAgICBleHBvcnRJY29uLnNldEF0dHJpYnV0ZSgnaHJlZicsICcnKTtcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIGV4cG9ydEljb24uaW5uZXJIVE1MID0gJ9Ct0LrRgdC/0L7RgNGCINCyIEdlb0pTT04nO1xuLy8gICAgICB2YXIgY29udmVydENvb3JkID0gTC5Eb21VdGlsLmdldCgnY29udmVydE1TSycpO1xuLy8gICAgICBMLkRvbVV0aWwucmVtb3ZlQ2xhc3MoY29udmVydENvb3JkLCAnaGlkZGVuJyk7XG4gICAgICAgICAgICBkYXRhLl9jb3VudFNwYW4gPSBMLkRvbVV0aWwuY3JlYXRlKCdzcGFuJywgJycsIGRhdGEuX2V4cG9ydENvbnQpO1xuICAgICAgICAgICAgZXhwb3J0SWNvbi5hZGRFdmVudExpc3RlbmVyKCdjbGljaycsIGZ1bmN0aW9uICgpIHtcbiAgICAgICAgICAgICAgICB2YXIgb2JqID0gZGF0YS5nZXRCbG9iKCk7XG4gICAgICAgICAgICAgICAgaWYgKG5hdmlnYXRvci5tc1NhdmVPck9wZW5CbG9iKSB7IC8vIElFIDEwK1xuICAgICAgICAgICAgICAgICAgICBuYXZpZ2F0b3IubXNTYXZlT3JPcGVuQmxvYihvYmouYmxvYiwgb2JqLmZpbGUpO1xuICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgIGV4cG9ydEljb24uc2V0QXR0cmlidXRlKCdkb3dubG9hZCcsIG9iai5maWxlKTtcbiAgICAgICAgICAgICAgICAgICAgZXhwb3J0SWNvbi5zZXRBdHRyaWJ1dGUoJ2hyZWYnLCB3aW5kb3cuVVJMLmNyZWF0ZU9iamVjdFVSTChvYmouYmxvYikpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICBkYXRhLl9jb3VudFNwYW4uaW5uZXJIVE1MID0gJyjQs9C10L7QvNC10YLRgNC40Lk6IDxiPicgKyBvYmouY291bnQgKyAnPC9iPiknO1xuICAgICAgICAgICAgfSwgZmFsc2UpO1xuICAgICAgICAgICAgTC5Eb21VdGlsLmFkZENsYXNzKGRhdGEuX2V4cG9ydENvbnQsICdoaWRkZW4nKTtcbiAgICAgICAgICAgIGRhdGEuX2twdEluZm8gPSBkb2N1bWVudC5nZXRFbGVtZW50QnlJZCgna3B0SW5mbycpO1xuXG4gICAgICAgIH0sXG5cbiAgICAgICAgZ2V0QmxvYjogZnVuY3Rpb24gKCkge1xuICAgICAgICAgICAgdmFyIGZjID0gbnVsbCxcbiAgICAgICAgICAgICAgICAgICAgaXRlbXMgPSBkYXRhLl9ncm91cHM7XG4gICAgICAgICAgICBmb3IgKHZhciBnIGluIGl0ZW1zKSB7XG4gICAgICAgICAgICAgICAgdmFyIGdlb2pzb24gPSBpdGVtc1tnXTtcbiAgICAgICAgICAgICAgICBpZiAoZmMpIHtcbiAgICAgICAgICAgICAgICAgICAgQXJyYXkucHJvdG90eXBlLnB1c2guYXBwbHkoZmMuZmVhdHVyZXMsIGdlb2pzb24uZmVhdHVyZXMpO1xuICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgIGZjID0gZ2VvanNvbjtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICByZXR1cm4ge1xuICAgICAgICAgICAgICAgIGZpbGU6ICdkYXRhXycgKyBEYXRlLm5vdygpICsgJy5nZW9qc29uJyxcbiAgICAgICAgICAgICAgICBibG9iOiBuZXcgQmxvYihbSlNPTi5zdHJpbmdpZnkoZmMsIG51bGwsICdcXHQnKV0sIHt0eXBlOiAndGV4dC9qc29uO2NoYXJzZXQ9dXRmLTg7J30pLFxuICAgICAgICAgICAgICAgIGNvdW50OiBmYyA/IGZjLmZlYXR1cmVzLmxlbmd0aCA6IDBcbiAgICAgICAgICAgIH07XG4gICAgICAgIH0sXG5cbiAgICAgICAgc2VsZWN0RmlsZTogZnVuY3Rpb24gKGVsKSB7XG4gICAgICAgICAgICBkYXRhLl9rcHRJbmZvLmlubmVySFRNTCA9ICcnO1xuICAgICAgICAgICAgZGF0YS5fZmlsZVByb2dyZXNzLmlubmVySFRNTCA9ICcnO1xuICAgICAgICAgICAgTC5Eb21VdGlsLmFkZENsYXNzKGRhdGEuX2V4cG9ydENvbnQsICdoaWRkZW4nKTtcbiAgICAgICAgICAgIHZhciByZWFkZXIgPSBuZXcgRmlsZVJlYWRlcigpLFxuICAgICAgICAgICAgICAgICAgICBmaWxlID0gZWwuZmlsZXNbMF07XG5cbiAgICAgICAgICAgIHJlYWRlci5vbmxvYWQgPSBmdW5jdGlvbiAoKSB7XG4gICAgICAgICAgICAgICAgZGF0YS5fZmlsZVByb2dyZXNzLmlubmVySFRNTCA9ICfQt9Cw0LPRgNGD0LbQtdC90L46IDxiPicgKyBmaWxlLnNpemUgKyAnPC9iPiDQsdCw0LnRgic7XG4vLyAgICAgICAgT2JqZWN0LmtleXMoZGF0YS5fZ3JvdXBzKS5mb3JFYWNoKGZ1bmN0aW9uICh0eXBlKSB7XG4vLyAgICAgICAgICB2YXIgZ3JvdXAgPSBkYXRhLl9ncm91cHNbdHlwZV07XG4vLyAgICAgICAgICBncm91cC5jbGVhckxheWVycygpO1xuLy8gICAgICAgICAgZGF0YS5fbWFwLnJlbW92ZUxheWVyKGdyb3VwKTtcbi8vICAgICAgICB9KTtcbi8vICAgICAgICBkYXRhLl9ncm91cHMgPSB7fTtcbi8vICAgICAgICBPYmplY3Qua2V5cyhkYXRhLl9ncm91cHNNc2spLmZvckVhY2goZnVuY3Rpb24gKHR5cGUpIHtcbi8vICAgICAgICAgIHZhciBncm91cCA9IGRhdGEuX2dyb3Vwc01za1t0eXBlXTtcbi8vICAgICAgICAgIGdyb3VwLmNsZWFyTGF5ZXJzKCk7XG4vLyAgICAgICAgfSk7XG4vLyAgICAgICAgZGF0YS5fZ3JvdXBzTXNrID0ge307XG4gICAgICAgICAgICAgICAgaWYgKGRhdGEuX21hcC5sYXllcnMpIHtcbiAgICAgICAgICAgICAgICAgICAgZm9yICh2YXIgaSA9IDA7IGkgPCBkYXRhLl9tYXAubGF5ZXJzLmxlbmd0aDsgaSsrKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICBkYXRhLl9tYXAucmVtb3ZlTGF5ZXIoZGF0YS5fbWFwLmxheWVyc1tpXSk7XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgdmFyIG9sZExheWVyQ29udHJvbCA9IGRvY3VtZW50LmdldEVsZW1lbnRzQnlDbGFzc05hbWUoJ2xlYWZsZXQtY29udHJvbC1sYXllcnMnKTtcbiAgICAgICAgICAgICAgICBpZiAob2xkTGF5ZXJDb250cm9sLmxlbmd0aD4wKSB7XG4gICAgICAgICAgICAgICAgICAgIEwuRG9tVXRpbC5yZW1vdmUob2xkTGF5ZXJDb250cm9sWzBdKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgZGF0YS5fZ3JvdXBzID0ge307XG4gICAgICAgICAgICAgICAgZGF0YS5wYXJzZUZpbGUocmVhZGVyKTtcbiAgICAgICAgICAgIH07XG4gICAgICAgICAgICByZWFkZXIub25wcm9ncmVzcyA9IGZ1bmN0aW9uIChkYXRhKSB7XG4gICAgICAgICAgICAgICAgaWYgKGRhdGEubGVuZ3RoQ29tcHV0YWJsZSkge1xuICAgICAgICAgICAgICAgICAgICBMLkRvbVV0aWwucmVtb3ZlQ2xhc3MoZGF0YS5fcmVzQ29udCwgJ2hpZGRlbicpO1xuICAgICAgICAgICAgICAgICAgICB2YXIgY250ID0gZGF0YS5sb2FkZWQgLyBkYXRhLnRvdGFsO1xuICAgICAgICAgICAgICAgICAgICBkYXRhLl9maWxlUHJvZ3Jlc3MuaW5uZXJIVE1MID0gJ9C30LDQs9GA0YPQttC10L3QvjogPGI+JyArIGRhdGEubG9hZGVkICsgJzwvYj4g0LHQsNC50YInICsgKGNudCA9PT0gMSA/ICcnIDogJygnICsgcGFyc2VJbnQoY250ICogMTAwLCAxMCkgKyAnJSknKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9O1xuICAgICAgICAgICAgaWYgKGVsLmZpbGVzLmxlbmd0aCkge1xuICAgICAgICAgICAgICAgIHJlYWRlci5yZWFkQXNUZXh0KGZpbGUpO1xuICAgICAgICAgICAgfVxuICAgICAgICB9LFxuXG4gICAgICAgIHBhcnNlRmlsZTogZnVuY3Rpb24gKHJlYWRlcikge1xuICAgICAgICAgICAgLy8gaHR0cHM6Ly9iaXRidWNrZXQub3JnL3N1cmVucmFvL3htbDJqc29uXG4gICAgICAgICAgICAvLyBodHRwOi8vd3d3LmNocm9tZS1hbGxvdy1maWxlLWFjY2Vzcy1mcm9tLWZpbGUuY29tL1xuICAgICAgICAgICAgdmFyIHBhcnNlZERhdGEgPSBDb252ZXJ0ZXIuR2VvSlNPTihyZWFkZXIucmVzdWx0KTtcbiAgICAgICAgICAgIHZhciBwYXJjZWxzID0gcGFyc2VkRGF0YS5nZW9KU09OUGFyY2VscztcbiAgICAgICAgICAgIHZhciBva3MgPSBwYXJzZWREYXRhLmdlb0pTT05SZWFsdHk7XG4gICAgICAgICAgICB2YXIgem9uZXMgPSBwYXJzZWREYXRhLmdlb0pTT05ab25lcztcbiAgICAgICAgICAgIHZhciBxdWFydGFsID0gcGFyc2VkRGF0YS5nZW9KU09OUXVhcnRhbDtcbiAgICAgICAgICAgIHZhciBib3VuZHMgPSBwYXJzZWREYXRhLmdlb0pTT05Cb3VuZHM7XG4gICAgICAgICAgICBjb25zb2xlLmxvZyh6b25lcyk7XG4gICAgICAgICAgICBjb25zb2xlLmxvZyhib3VuZHMpO1xuICAgICAgICAgICAgZGF0YS5fZ3JvdXBzID0ge1xuICAgICAgICAgICAgICAgIHBhcmNlbHM6IHBhcmNlbHMsXG4gICAgICAgICAgICAgICAgb2tzOiBva3MsXG4gICAgICAgICAgICAgICAgem9uZXM6IHpvbmVzLFxuICAgICAgICAgICAgICAgIHF1YXJ0YWw6IHF1YXJ0YWwsXG4gICAgICAgICAgICAgICAgYm91bmRzOiBib3VuZHNcbiAgICAgICAgICAgIH07XG5cbiAgICAgICAgICAgIHZhciBva3NMYXllciA9IGxheWVyRkFjdG9yeShva3MsIG9rc1N0eWxlKTtcbiAgICAgICAgICAgIHZhciBwYXJjZWxMYXllciA9IGxheWVyRkFjdG9yeShwYXJjZWxzLCBwYXJjZWxTdHlsZSk7XG4gICAgICAgICAgICB2YXIgem9uZUxheWVyID0gbGF5ZXJGQWN0b3J5KHpvbmVzLCB6b25lU3R5bGUpO1xuICAgICAgICAgICAgdmFyIGJvdW5kTGF5ZXIgPSBsYXllckZBY3RvcnkoYm91bmRzLCBib3VuZGxTdHlsZSk7XG4gICAgICAgICAgICB2YXIgcXVhcnRhbExheWVyID0gbGF5ZXJGQWN0b3J5KHF1YXJ0YWwsIHF1YXJ0YWxsU3R5bGUpO1xuXG4gICAgICAgICAgICB2YXIgbGF5ZXJDb250cm9sID0gTC5jb250cm9sLmxheWVycyh7fSwge1xuICAgICAgICAgICAgICAgICfQmtCy0LDRgNGC0LDQuyc6IHF1YXJ0YWxMYXllcixcbiAgICAgICAgICAgICAgICAn0JPRgNCw0L3QuNGG0YsnOiBib3VuZExheWVyLFxuICAgICAgICAgICAgICAgICfQl9C+0L3Riyc6IHpvbmVMYXllcixcbiAgICAgICAgICAgICAgICAn0KPRh9Cw0YHRgtC60LgnOiBwYXJjZWxMYXllcixcbiAgICAgICAgICAgICAgICAn0J7QmtChJzogb2tzTGF5ZXJcbiAgICAgICAgICAgIH0pLmFkZFRvKGRhdGEuX21hcCk7XG5cbiAgICAgICAgICAgIGRhdGEuX21hcC5maXRCb3VuZHMocGFyY2VsTGF5ZXIuZ2V0Qm91bmRzKCkpO1xuICAgICAgICAgICAgTC5Eb21VdGlsLnJlbW92ZUNsYXNzKGRhdGEuX2V4cG9ydENvbnQsICdoaWRkZW4nKTtcbiAgICAgICAgfVxuICAgIH07XG4gICAgd2luZG93LmNvbnZlcnRlZERhdGEgPSBkYXRhO1xufSkoKTtcbiIsIi8qIFxuICogVGhlIE1JVCBMaWNlbnNlXG4gKlxuICogQ29weXJpZ2h0IDIwMTUgZmlsaXBwb3YuXG4gKlxuICogUGVybWlzc2lvbiBpcyBoZXJlYnkgZ3JhbnRlZCwgZnJlZSBvZiBjaGFyZ2UsIHRvIGFueSBwZXJzb24gb2J0YWluaW5nIGEgY29weVxuICogb2YgdGhpcyBzb2Z0d2FyZSBhbmQgYXNzb2NpYXRlZCBkb2N1bWVudGF0aW9uIGZpbGVzICh0aGUgXCJTb2Z0d2FyZVwiKSwgdG8gZGVhbFxuICogaW4gdGhlIFNvZnR3YXJlIHdpdGhvdXQgcmVzdHJpY3Rpb24sIGluY2x1ZGluZyB3aXRob3V0IGxpbWl0YXRpb24gdGhlIHJpZ2h0c1xuICogdG8gdXNlLCBjb3B5LCBtb2RpZnksIG1lcmdlLCBwdWJsaXNoLCBkaXN0cmlidXRlLCBzdWJsaWNlbnNlLCBhbmQvb3Igc2VsbFxuICogY29waWVzIG9mIHRoZSBTb2Z0d2FyZSwgYW5kIHRvIHBlcm1pdCBwZXJzb25zIHRvIHdob20gdGhlIFNvZnR3YXJlIGlzXG4gKiBmdXJuaXNoZWQgdG8gZG8gc28sIHN1YmplY3QgdG8gdGhlIGZvbGxvd2luZyBjb25kaXRpb25zOlxuICpcbiAqIFRoZSBhYm92ZSBjb3B5cmlnaHQgbm90aWNlIGFuZCB0aGlzIHBlcm1pc3Npb24gbm90aWNlIHNoYWxsIGJlIGluY2x1ZGVkIGluXG4gKiBhbGwgY29waWVzIG9yIHN1YnN0YW50aWFsIHBvcnRpb25zIG9mIHRoZSBTb2Z0d2FyZS5cbiAqXG4gKiBUSEUgU09GVFdBUkUgSVMgUFJPVklERUQgXCJBUyBJU1wiLCBXSVRIT1VUIFdBUlJBTlRZIE9GIEFOWSBLSU5ELCBFWFBSRVNTIE9SXG4gKiBJTVBMSUVELCBJTkNMVURJTkcgQlVUIE5PVCBMSU1JVEVEIFRPIFRIRSBXQVJSQU5USUVTIE9GIE1FUkNIQU5UQUJJTElUWSxcbiAqIEZJVE5FU1MgRk9SIEEgUEFSVElDVUxBUiBQVVJQT1NFIEFORCBOT05JTkZSSU5HRU1FTlQuIElOIE5PIEVWRU5UIFNIQUxMIFRIRVxuICogQVVUSE9SUyBPUiBDT1BZUklHSFQgSE9MREVSUyBCRSBMSUFCTEUgRk9SIEFOWSBDTEFJTSwgREFNQUdFUyBPUiBPVEhFUlxuICogTElBQklMSVRZLCBXSEVUSEVSIElOIEFOIEFDVElPTiBPRiBDT05UUkFDVCwgVE9SVCBPUiBPVEhFUldJU0UsIEFSSVNJTkcgRlJPTSxcbiAqIE9VVCBPRiBPUiBJTiBDT05ORUNUSU9OIFdJVEggVEhFIFNPRlRXQVJFIE9SIFRIRSBVU0UgT1IgT1RIRVIgREVBTElOR1MgSU5cbiAqIFRIRSBTT0ZUV0FSRS5cbiAqL1xuJ3VzZSBzdHJpY3QnO1xuLy8gRGljdHNcblxuLy8g0KHRgtCw0YLRg9GBINC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuFxudmFyIGRTdGF0ZXMgPSB7XG4gICAgJzAxJzogJ9Cg0LDQvdC10LUg0YPRh9GC0LXQvdC90YvQuScsXG4gICAgJzA1JzogJ9CS0YDQtdC80LXQvdC90YvQuScsXG4gICAgJzA2JzogJ9Cj0YfRgtC10L3QvdGL0LknLFxuICAgICcwNyc6ICfQodC90Y/RgiDRgSDRg9GH0LXRgtCwJyxcbiAgICAnMDgnOiAn0JDQvdC90YPQu9C40YDQvtCy0LDQvdC90YvQuSdcbn07XG4vLyDQotC40L8gINC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuFxudmFyIGRQYXJjZWxzID0ge1xuICAgICcwMSc6ICfQl9C10LzQu9C10L/QvtC70YzQt9C+0LLQsNC90LjQtScsXG4gICAgJzAyJzogJ9CV0LTQuNC90L7QtSDQt9C10LzQu9C10L/QvtC70YzQt9C+0LLQsNC90LjQtScsXG4gICAgJzAzJzogJ9Ce0LHQvtGB0L7QsdC70LXQvdC90YvQuSDRg9GH0LDRgdGC0L7QuicsXG4gICAgJzA0JzogJ9Cj0YHQu9C+0LLQvdGL0Lkg0YPRh9Cw0YHRgtC+0LonLFxuICAgICcwNSc6ICfQnNC90L7Qs9C+0LrQvtC90YLRg9GA0L3Ri9C5INGD0YfQsNGB0YLQvtC6JyxcbiAgICAnMDYnOiAn0JfQvdCw0YfQtdC90LjQtSDQvtGC0YHRg9GC0YHRgtCy0YPQtdGCJ1xufTtcbi8vINCa0LDRgtC10LPQvtGA0LjRjyDQt9C10LzQtdC70YxcbnZhciBkQ2F0ZWdvcmllcyA9IHtcbiAgICAnMDAzMDAxMDAwMDAwJzogJ9CX0LXQvNC70Lgg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcbiAgICAnMDAzMDAyMDAwMDAwJzogJ9CX0LXQvNC70Lgg0L3QsNGB0LXQu9GR0L3QvdGL0YUg0L/Rg9C90LrRgtC+0LInLFxuICAgICcwMDMwMDMwMDAwMDAnOiAn0JfQtdC80LvQuCDQv9GA0L7QvNGL0YjQu9C10L3QvdC+0YHRgtC4LCDRjdC90LXRgNCz0LXRgtC40LrQuCwg0YLRgNCw0L3RgdC/0L7RgNGC0LAsINGB0LLRj9C30LgsINGA0LDQtNC40L7QstC10YnQsNC90LjRjywg0YLQtdC70LXQstC40LTQtdC90LjRjywg0LjQvdGE0L7RgNC80LDRgtC40LrQuCwg0LfQtdC80LvQuCDQtNC70Y8g0L7QsdC10YHQv9C10YfQtdC90LjRjyDQutC+0YHQvNC40YfQtdGB0LrQvtC5INC00LXRj9GC0LXQu9GM0L3QvtGB0YLQuCwg0LfQtdC80LvQuCDQvtCx0L7RgNC+0L3Riywg0LHQtdC30L7Qv9Cw0YHQvdC+0YHRgtC4INC4INC30LXQvNC70Lgg0LjQvdC+0LPQviDRgdC/0LXRhtC40LDQu9GM0L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcwMDMwMDQwMDAwMDAnOiAn0JfQtdC80LvQuCDQvtGB0L7QsdC+INC+0YXRgNCw0L3Rj9C10LzRi9GFINGC0LXRgNGA0LjRgtC+0YDQuNC5INC4INC+0LHRitC10LrRgtC+0LInLFxuICAgICcwMDMwMDUwMDAwMDAnOiAn0JfQtdC80LvQuCDQu9C10YHQvdC+0LPQviDRhNC+0L3QtNCwJyxcbiAgICAnMDAzMDA2MDAwMDAwJzogJ9CX0LXQvNC70Lgg0LLQvtC00L3QvtCz0L4g0YTQvtC90LTQsCcsXG4gICAgJzAwMzAwNzAwMDAwMCc6ICfQl9C10LzQu9C4INC30LDQv9Cw0YHQsCcsXG4gICAgJzAwMzAwODAwMDAwMCc6ICfQmtCw0YLQtdCz0L7RgNC40Y8g0L3QtSDRg9GB0YLQsNC90L7QstC70LXQvdCwJ1xufTtcbi8vINCe0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pINC/0YDQsNCyXG52YXIgZEVuY3VtYnJhbmNlcyA9IHtcbiAgICAnMDIyMDAxMDAwMDAwJzogJ9Ch0LXRgNCy0LjRgtGD0YInLFxuICAgICcwMjIwMDEwMDEwMDAnOiAn0J/Rg9Cx0LvQuNGH0L3Ri9C5INGB0LXRgNCy0LjRgtGD0YInLFxuICAgICcwMjIwMDEwMDIwMDAnOiAn0KfQsNGB0YLQvdGL0Lkg0YHQtdGA0LLQuNGC0YPRgicsXG4gICAgJzAyMjAwMjAwMDAwMCc6ICfQkNGA0LXRgdGCJyxcbiAgICAnMDIyMDAzMDAwMDAwJzogJ9CX0LDQv9GA0LXRidC10L3QuNC1JyxcbiAgICAnMDIyMDA0MDAwMDAwJzogJ9Ce0LPRgNCw0L3QuNGH0LXQvdC40Y8g0L/RgNCw0LIg0L3QsCDQt9C10LzQtdC70YzQvdGL0Lkg0YPRh9Cw0YHRgtC+0LosINC/0YDQtdC00YPRgdC80L7RgtGA0LXQvdC90YvQtSDRgdGC0LDRgtGM0Y/QvNC4IDU2LCA1Ni4xINCX0LXQvNC10LvRjNC90L7Qs9C+INC60L7QtNC10LrRgdCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG4gICAgJzAyMjAwNTAwMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC40LfRitGP0YLQuNC4INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwLCDQttC40LvQvtCz0L4g0L/QvtC80LXRidC10L3QuNGPJyxcbiAgICAnMDIyMDA2MDAwMDAwJzogJ9CQ0YDQtdC90LTQsCAo0LIg0YLQvtC8INGH0LjRgdC70LUsINGB0YPQsdCw0YDQtdC90LTQsCknLFxuICAgICcwMjIwMDcwMDAwMDAnOiAn0JjQv9C+0YLQtdC60LAnLFxuICAgICcwMjIwMDgwMDAwMDAnOiAn0JjQv9C+0YLQtdC60LAg0LIg0YHQuNC70YMg0LfQsNC60L7QvdCwJyxcbiAgICAnMDIyMDA5MDAwMDAwJzogJ9CR0LXQt9Cy0L7Qt9C80LXQt9C00L3QvtC1ICjRgdGA0L7Rh9C90L7QtSkg0L/QvtC70YzQt9C+0LLQsNC90LjQtSDQt9C10LzQtdC70YzQvdGL0Lwv0LvQtdGB0L3Ri9C8INGD0YfQsNGB0YLQutC+0LwnLFxuICAgICcwMjIwMTAwMDAwMDAnOiAn0JTQvtCy0LXRgNC40YLQtdC70YzQvdC+0LUg0YPQv9GA0LDQstC70LXQvdC40LUnLFxuICAgICcwMjIwMTEwMDAwMDAnOiAn0KDQtdC90YLQsCcsXG4gICAgJzAyMjAxMjAwMDAwMCc6ICfQl9Cw0L/RgNC10YIg0L3QsCDRgdC+0LLQtdGA0YjQtdC90LjQtSDQtNC10LnRgdGC0LLQuNC5INCyINGB0YTQtdGA0LUg0JPQmtCjINCyINC+0YLQvdC+0YjQtdC90LjQuCDQntCdJyxcbiAgICAnMDIyMDk5MDAwMDAwJzogJ9CY0L3Ri9C1INC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pINC/0YDQsNCyJ1xufTtcbi8vINCV0LTQuNC90LjRhtGLINC40LfQvNC10YDQtdC90LjQuVxudmFyIGRVbml0cyA9IHtcbiAgICAnMDAzJzogJ9Cc0LjQu9C70LjQvNC10YLRgCcsXG4gICAgJzAwNCc6ICfQodCw0L3RgtC40LzQtdGC0YAnLFxuICAgICcwMDUnOiAn0JTQtdGG0LjQvNC10YLRgCcsXG4gICAgJzAwNic6ICfQnNC10YLRgCcsXG4gICAgJzAwOCc6ICfQmtC40LvQvtC80LXRgtGAJyxcbiAgICAnMDA5JzogJ9Cc0LXQs9Cw0LzQtdGC0YAnLFxuICAgICcwNDcnOiAn0JzQvtGA0YHQutCw0Y8g0LzQuNC70Y8nLFxuICAgICcwNTAnOiAn0JrQstCw0LTRgNCw0YLQvdGL0Lkg0LzQuNC70LvQuNC80LXRgtGAJyxcbiAgICAnMDUxJzogJ9Ca0LLQsNC00YDQsNGC0L3Ri9C5INGB0LDQvdGC0LjQvNC10YLRgCcsXG4gICAgJzA1Myc6ICfQmtCy0LDQtNGA0LDRgtC90YvQuSDQtNC10YbQuNC80LXRgtGAJyxcbiAgICAnMDU1JzogJ9Ca0LLQsNC00YDQsNGC0L3Ri9C5INC80LXRgtGAJyxcbiAgICAnMDU4JzogJ9Ci0YvRgdGP0YfQsCDQutCy0LDQtNGA0LDRgtC90YvRhSDQvNC10YLRgNC+0LInLFxuICAgICcwNTknOiAn0JPQtdC60YLQsNGAJyxcbiAgICAnMDYxJzogJ9Ca0LLQsNC00YDQsNGC0L3Ri9C5INC60LjQu9C+0LzQtdGC0YAnLFxuICAgICcxMDknOiAn0JDRgCAoMTAwINC8MiknLFxuICAgICczNTknOiAn0KHRg9GC0LrQuCcsXG4gICAgJzM2MCc6ICfQndC10LTQtdC70Y8nLFxuICAgICczNjEnOiAn0JTQtdC60LDQtNCwJyxcbiAgICAnMzYyJzogJ9Cc0LXRgdGP0YYnLFxuICAgICczNjQnOiAn0JrQstCw0YDRgtCw0LsnLFxuICAgICczNjUnOiAn0J/QvtC70YPQs9C+0LTQuNC1JyxcbiAgICAnMzU2JzogJ9Cn0LDRgScsXG4gICAgJzM1NSc6ICfQnNC40L3Rg9GC0LAgJyxcbiAgICAnMzY2JzogJ9CT0L7QtCcsXG4gICAgJzM4Myc6ICfQoNGD0LHQu9GMJyxcbiAgICAnMzg0JzogJ9Ci0YvRgdGP0YfQsCDRgNGD0LHQu9C10LknLFxuICAgICczODUnOiAn0JzQuNC70LvQuNC+0L0g0YDRg9Cx0LvQtdC5JyxcbiAgICAnMzg2JzogJ9Cc0LjQu9C70LjQsNGA0LQg0YDRg9Cx0LvQtdC5JyxcbiAgICAnMTAwMCc6ICfQndC10L7Qv9GA0LXQtNC10LvQtdC90L4nLFxuICAgICcxMDAxJzogJ9CX0L3QsNGH0LXQvdC40LUg0L7RgtGB0YPRgtGB0YLQstGD0LXRgicsXG4gICAgJzEwMDInOiAn0KDRg9Cx0LvQtdC5INC30LAg0LrQsi4g0LzQtdGC0YAnLFxuICAgICcxMDAzJzogJ9Cg0YPQsdC70LXQuSDQt9CwINCw0YAnLFxuICAgICcxMDA0JzogJ9Cg0YPQsdC70LXQuSAg0LfQsCDQs9C10LrRgtCw0YAnLFxuICAgICcxMDA1JzogJ9CY0L3Ri9C1JyxcbiAgICAnMTAwNic6ICfQoNGD0LHQu9C10Lkg0LfQsCDQutCyLiDQutC8JyxcbiAgICAnMTAwNyc6ICfQoNCw0LHQvtGH0LjQuSDQtNC10L3RjCdcbn07XG4vLyDQktGB0LUg0LTQvtC60YPQvNC10L3RgtGLICjQodCx0L7RgNC90LjQuiDQutC70LDRgdGB0LjRhNC40LrQsNGC0L7RgNC+0LIsINC60L7QtNGLIDguMSwgOC4yLCA1NTUsIDU1OC4xLCA1NTguMiwgNTU4LjMsIDU1OC40LCA1NTguNSwgNTU4LjYpXG52YXIgZEFsbERvY3VtZW50cyA9IHtcbiAgICAnMDA4MDAxMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0YPQtNC+0YHRgtC+0LLQtdGA0Y/RjtGJ0LjQtSDQu9C40YfQvdC+0YHRgtGMINGE0LjQt9C40YfQtdGB0LrQvtCz0L4g0LvQuNGG0LAnLFxuICAgICcwMDgwMDEwMDEwMDAnOiAn0J/QsNGB0L/QvtGA0YIg0LPRgNCw0LbQtNCw0L3QuNC90LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4JyxcbiAgICAnMDA4MDAxMDAyMDAwJzogJ9Cf0LDRgdC/0L7RgNGCINCz0YDQsNC20LTQsNC90LjQvdCwINCh0KHQodCgJyxcbiAgICAnMDA4MDAxMDAzMDAwJzogJ9Cf0LDRgdC/0L7RgNGCINCz0YDQsNC20LTQsNC90LjQvdCwINC40L3QvtGB0YLRgNCw0L3QvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstCwJyxcbiAgICAnMDA4MDAxMDA0MDAwJzogJ9Ce0LHRidC10LPRgNCw0LbQtNCw0L3RgdC60LjQuSDQt9Cw0LPRgNCw0L3QuNGH0L3Ri9C5INC/0LDRgdC/0L7RgNGCJyxcbiAgICAnMDA4MDAxMDA1MDAwJzogJ9CX0LDQs9GA0LDQvdC40YfQvdGL0Lkg0L/QsNGB0L/QvtGA0YIg0JzQuNC90LjRgdGC0LXRgNGB0YLQstCwINC80L7RgNGB0LrQvtCz0L4g0YTQu9C+0YLQsCcsXG4gICAgJzAwODAwMTAwNjAwMCc6ICfQlNC40L/Qu9C+0LzQsNGC0LjRh9C10YHQutC40Lkg0L/QsNGB0L/QvtGA0YInLFxuICAgICcwMDgwMDEwMDcwMDAnOiAn0J/QsNGB0L/QvtGA0YIg0LzQvtGA0Y/QutCwICjRg9C00L7RgdGC0L7QstC10YDQtdC90LjQtSDQu9C40YfQvdC+0YHRgtC4INC80L7RgNGP0LrQsCknLFxuICAgICcwMDgwMDEwMDgwMDAnOiAn0JLQvtC10L3QvdGL0Lkg0LHQuNC70LXRgiDQstC+0LXQvdC90L7RgdC70YPQttCw0YnQtdCz0L4nLFxuICAgICcwMDgwMDEwMDkwMDAnOiAn0JLRgNC10LzQtdC90L3QvtC1INGD0LTQvtGB0YLQvtCy0LXRgNC10L3QuNC1LCDQstGL0LTQsNC90L3QvtC1INCy0LfQsNC80LXQvSDQstC+0LXQvdC90L7Qs9C+INCx0LjQu9C10YLQsCcsXG4gICAgJzAwODAwMTAxMDAwMCc6ICfQo9C00L7RgdGC0L7QstC10YDQtdC90LjQtSDQu9C40YfQvdC+0YHRgtC4INC+0YTQuNGG0LXRgNCwINCc0LjQvdC40YHRgtC10YDRgdGC0LLQsCDQvtCx0L7RgNC+0L3RiyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgsINCc0LjQvdC40YHRgtC10YDRgdGC0LLQsCDQstC90YPRgtGA0LXQvdC90LjRhSDQtNC10Lsg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC4INC00YDRg9Cz0LjRhSDQstC+0LjQvdGB0LrQuNGFINGE0L7RgNC80LjRgNC+0LLQsNC90LjQuSDRgSDQv9GA0LjQu9C+0LbQtdC90LjQtdC8INGB0L/RgNCw0LLQutC4INC+INC/0YDQvtC/0LjRgdC60LUgKNGA0LXQs9C40YHRgtGA0LDRhtC40LgpINCkLTMzJyxcbiAgICAnMDA4MDAxMDExMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INGA0L7QttC00LXQvdC40LgnLFxuICAgICcwMDgwMDEwMTIwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0YDQsNGB0YHQvNC+0YLRgNC10L3QuNC4INGF0L7QtNCw0YLQsNC50YHRgtCy0LAg0L4g0L/RgNC40LfQvdCw0L3QuNC4INCx0LXQttC10L3RhtC10Lwg0L3QsCDRgtC10YDRgNC40YLQvtGA0LjQuCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0L/QviDRgdGD0YnQtdGB0YLQstGDJyxcbiAgICAnMDA4MDAxMDEzMDAwJzogJ9CS0LjQtCDQvdCwINC20LjRgtC10LvRjNGB0YLQstC+INC40L3QvtGB0YLRgNCw0L3QvdC+0LPQviDQs9GA0LDQttC00LDQvdC40L3QsCDQuNC70Lgg0LvQuNGG0LAg0LHQtdC3INCz0YDQsNC20LTQsNC90YHRgtCy0LAnLFxuICAgICcwMDgwMDEwMTQwMDAnOiAn0KHQv9GA0LDQstC60LAg0L7QsSDQvtGB0LLQvtCx0L7QttC00LXQvdC40Lgg0LjQtyDQvNC10YHRgiDQu9C40YjQtdC90LjRjyDRgdCy0L7QsdC+0LTRiycsXG4gICAgJzAwODAwMTAxNTAwMCc6ICfQktGA0LXQvNC10L3QvdC+0LUg0YPQtNC+0YHRgtC+0LLQtdGA0LXQvdC40LUg0LvQuNGH0L3QvtGB0YLQuCDQs9GA0LDQttC00LDQvdC40L3QsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuICAgICcwMDgwMDEwMTYwMDAnOiAn0KPQtNC+0YHRgtC+0LLQtdGA0LXQvdC40LUg0LLRi9C90YPQttC00LXQvdC90L7Qs9C+INC/0LXRgNC10YHQtdC70LXQvdGG0LAnLFxuICAgICcwMDgwMDEwMTcwMDAnOiAn0KDQsNC30YDQtdGI0LXQvdC40LUg0L3QsCDQstGA0LXQvNC10L3QvdC+0LUg0L/RgNC+0LbQuNCy0LDQvdC40LUg0LIg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4JyxcbiAgICAnMDA4MDAxMDE4MDAwJzogJ9Cj0LTQvtGB0YLQvtCy0LXRgNC10L3QuNC1INCx0LXQttC10L3RhtCwINCyINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG4gICAgJzAwODAwMTAxOTAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDRgNCw0YHRgdC80L7RgtGA0LXQvdC40Lgg0YXQvtC00LDRgtCw0LnRgdGC0LLQsCDQviDQv9GA0LjQt9C90LDQvdC40Lgg0LvQuNGG0LAg0LLRi9C90YPQttC00LXQvdC90YvQvCDQv9C10YDQtdGB0LXQu9C10L3RhtC10LwnLFxuICAgICcwMDgwMDEwMjAwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDQstGA0LXQvNC10L3QvdC+0LPQviDRg9Cx0LXQttC40YnQsCDQvdCwINGC0LXRgNGA0LjRgtC+0YDQuNC4INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG4gICAgJzAwODAwMTA5OTAwMCc6ICfQmNC90YvQtSDQtNC+0LrRg9C80LXQvdGC0YssINC/0YDQtdC00YPRgdC80L7RgtGA0LXQvdC90YvQtSDQt9Cw0LrQvtC90L7QtNCw0YLQtdC70YzRgdGC0LLQvtC8INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQuNC70Lgg0L/RgNC40LfQvdCw0LLQsNC10LzRi9C1INCyINGB0L7QvtGC0LLQtdGC0YHRgtCy0LjQuCDRgSDQvNC10LbQtNGD0L3QsNGA0L7QtNC90YvQvCDQtNC+0LPQvtCy0L7RgNC+0Lwg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INCyINC60LDRh9C10YHRgtCy0LUg0LTQvtC60YPQvNC10L3RgtC+0LIsINGD0LTQvtGB0YLQvtCy0LXRgNGP0Y7RidC40YUg0LvQuNGH0L3QvtGB0YLRjCcsXG4gICAgJzAwODAwMjAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0YssINC40LTQtdC90YLQuNGE0LjRhtC40YDRg9GO0YnQuNC1INGO0YDQuNC00LjRh9C10YHQutC+0LUg0LvQuNGG0L4nLFxuICAgICcwMDgwMDIwMDEwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0Y7RgNC40LTQuNGH0LXRgdC60L7Qs9C+INC70LjRhtCwJyxcbiAgICAnMDA4MDAyMDAyMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INCy0L3QtdGB0LXQvdC40Lgg0LfQsNC/0LjRgdC10Lkg0LIg0JXQk9Cg0K7QmycsXG4gICAgJzAwODAwMjAwNDAwMCc6ICfQo9GB0YLQsNCyJyxcbiAgICAnMDA4MDAyMDA1MDAwJzogJ9Cj0YfRgNC10LTQuNGC0LXQu9GM0L3Ri9C5INC00L7Qs9C+0LLQvtGAJyxcbiAgICAnMDA4MDAyMDA2MDAwJzogJ9Cf0L7Qu9C+0LbQtdC90LjQtSAo0L7QsdGJ0LXQtSDQv9C+0LvQvtC20LXQvdC40LUg0L7QsSDQvtGA0LPQsNC90LjQt9Cw0YbQuNC4KScsXG4gICAgJzAwODAwMjAwNzAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviAo0LjQu9C4INGD0LLQtdC00L7QvNC70LXQvdC40LUpINC+INC/0L7RgdGC0LDQvdC+0LLQutC1INC90LAg0YPRh9GR0YIg0LIg0L3QsNC70L7Qs9C+0LLQvtC8INC+0YDQs9Cw0L3QtSDRgSDRg9C60LDQt9Cw0L3QuNC10Lwg0JjQndCdJyxcbiAgICAnMDA4MDAyMDA4MDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0JXQk9Cg0K7QmycsXG4gICAgJzAwODAwMjA5OTAwMCc6ICfQmNC90L7QuSDQtNC+0LrRg9C80LXQvdGCJyxcbiAgICAnNTU1MDAxMDAwMDAwJzogJ9Ca0LLQuNGC0LDQvdGG0LjRjycsXG4gICAgJzU1NTAwMjAwMDAwMCc6ICfQn9C70LDRgtGR0LbQvdC+0LUg0L/QvtGA0YPRh9C10L3QuNC1JyxcbiAgICAnNTU1MDAzMDAwMDAwJzogJ9Cn0LXQuicsXG4gICAgJzU1NTAwNDAwMDAwMCc6ICfQn9C+0LTRgtCy0LXRgNC20LTQtdC90LjQtSDRjdC70LXQutGC0YDQvtC90L3QvtCz0L4g0L/Qu9Cw0YLQtdC20LAnLFxuICAgICc1NTUwMDUwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQv9GA0LDQstC+INC30LDRj9Cy0LjRgtC10LvRjyDQvdCwINCx0LXQt9Cy0L7Qt9C80LXQt9C00L3QvtC1INC/0L7Qu9GD0YfQtdC90LjQtSDRgdCy0LXQtNC10L3QuNC5JyxcbiAgICAnNTU4MTAwMDAwMDAwJzogJ9CX0JDQr9CS0JvQldCd0JjQrycsXG4gICAgJzU1ODEwMTAwMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40Y8g0Lgg0LfQsNC/0YDQvtGB0YssINGB0LLRj9C30LDQvdC90YvQtSDRgSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lwg0LrQsNC00LDRgdGC0YDQvtCy0YvQvCDRg9GH0ZHRgtC+0LwnLFxuICAgICc1NTgxMDEwMTAwMDAnOiAn0JfQsNC/0YDQvtGBINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0YHQstC10LTQtdC90LjQuSwg0LLQvdC10YHRkdC90L3Ri9GFINCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgsINCyINCy0LjQtNC1INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0LLRi9C/0LjRgdC60Lgg0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0LgsINC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDQv9Cw0YHQv9C+0YDRgtCwINC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQuCDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0L/Qu9Cw0L3QsCDRgtC10YDRgNC40YLQvtGA0LjQuCwg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDRgdC/0YDQsNCy0LrQuCDQviDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INGB0YLQvtC40LzQvtGB0YLQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTgxMDEwMjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0L7RgdGC0LDQvdC+0LLQutC1INC90LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGA0L7QstGL0Lkg0YPRh9GR0YIg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MTAxMDMwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lwg0LrQsNC00LDRgdGC0YDQvtCy0L7QvCDRg9GH0ZHRgtC1INC40LfQvNC10L3QtdC90LjQuSDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTgxMDEwNDAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LIg0JXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAg0L7QsdGK0LXQutGC0L7QsiDQutCw0L/QuNGC0LDQu9GM0L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAgKNCV0JPQoNCe0JrQoSkg0YHQstC10LTQtdC90LjQuSDQvtCxINC+0LHRitC10LrRgtC1INC60LDQv9C40YLQsNC70YzQvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCAo0J7QmtChKScsXG4gICAgJzU1ODEwMTA1MDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5INC+0LEg0J7QmtChJyxcbiAgICAnNTU4MTAxMDYwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDRgdC90Y/RgtC40Lgg0YEg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INGD0YfRkdGC0LAg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MTAxMDcwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0YHQstC10LTQtdC90LjQuSDQviDRgNCw0L3QtdC1INGD0YfRgtGR0L3QvdC+0Lwg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MTAxMDgwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQvtCxINC40YHQv9GA0LDQstC70LXQvdC40Lgg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQvtGI0LjQsdC60LgnLFxuICAgICc1NTgxMDEwOTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCDQsiDRgdCy0LXQtNC10L3QuNGP0YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTgxMDEwOTAxMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCDQsiDRgdCy0LXQtNC10L3QuNGP0YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTgxMDEwOTAyMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCDQsiDRgdCy0LXQtNC10L3QuNGP0YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0L4g0L/RgNC+0YXQvtC20LTQtdC90LjQuCDRg9GH0LDRgdGC0LrQsCDQk9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LPRgNCw0L3QuNGG0Ysg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4OyDQviDQs9GA0LDQvdC40YbQsNGFINC80LXQttC00YMg0YHRg9Cx0YrQtdC60YLQsNC80Lgg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4OyDQviDQs9GA0LDQvdC40YbQsNGFINC80YPQvdC40YbQuNC/0LDQu9GM0L3Ri9GFINC+0LHRgNCw0LfQvtCy0LDQvdC40Lk7INC+INCz0YDQsNC90LjRhtCw0YUg0L3QsNGB0LXQu9GR0L3QvdGL0YUg0L/Rg9C90LrRgtC+0LI7INC+INGC0LXRgNGA0LjRgtC+0YDQuNCw0LvRjNC90YvRhSDQt9C+0L3QsNGFINC4INC30L7QvdCw0YUg0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC5OyDQviDQutCw0YDRgtC+0LPRgNCw0YTQuNGH0LXRgdC60L7QuSDQuCDQs9C10L7QtNC10LfQuNGH0LXRgdC60L7QuSDQvtGB0L3QvtCy0LDRhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODEwMTEwMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/RgNC10LTRgdGC0LDQstC70LXQvdC40Lgg0LTQvtC/0L7Qu9C90LjRgtC10LvRjNC90YvRhSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgNC+0LLRi9C5INGD0YfRkdGCJyxcbiAgICAnNTU4MTAxMTEwMDAwJzogJ9CS0L3Rg9GC0YDQuNCy0LXQtNC+0LzRgdGC0LLQtdC90L3Ri9C5INC30LDQv9GA0L7RgSDQuNC90YTQvtGA0LzQsNGG0LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODEwMTEyMDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDQutC+0L/QuNC4INC00L7QutGD0LzQtdC90YLQsCwg0L3QsCDQvtGB0L3QvtCy0LDQvdC40Lgg0LrQvtGC0L7RgNC+0LPQviDRgdCy0LXQtNC10L3QuNGPINC+0LEg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCy0L3QtdGB0LXQvdGLINCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTgxMDExMzAwMDAnOiAn0JfQsNC/0YDQvtGBINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0YHQstC10LTQtdC90LjQuSwg0LLQvdC10YHRkdC90L3Ri9GFINCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgsINC/0L7RgdGA0LXQtNGB0YLQstC+0Lwg0L7QsdC10YHQv9C10YfQtdC90LjRjyDQtNC+0YHRgtGD0L/QsCDQuiDQuNC90YTQvtGA0LzQsNGG0LjQvtC90L3QvtC80YMg0YDQtdGB0YPRgNGB0YMsINGB0L7QtNC10YDQttCw0YnQtdC80YMg0YHQstC10LTQtdC90LjRjyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODEwMTE0MDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDQv9C10YDQtdGH0L3RjyDQvtCx0YrQtdC60YLQvtCyINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCwg0L/QvtC00LvQtdC20LDRidC40YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L7RhtC10L3QutC1JyxcbiAgICAnNTU4MTAxMTUwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9GA0LXQutGA0LDRidC10L3QuNC4INC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDRg9GH0ZHRgtCwJyxcbiAgICAnNTU4MTAxMTYwMDAwJzogJ9Cc0LXQttCy0LXQtNC+0LzRgdGC0LLQtdC90L3Ri9C5INC30LDQv9GA0L7RgSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQsiDQvtGA0LPQsNC90LDRhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LLQu9Cw0YHRgtC4INC4INC+0YDQs9Cw0L3QsNGFINC80LXRgdGC0L3QvtCz0L4g0YHQsNC80L7Rg9C/0YDQsNCy0LvQtdC90LjRjycsXG4gICAgJzU1ODEwMTE3MDAwMCc6ICfQl9Cw0L/RgNC+0YEg0LTQvtC60YPQvNC10L3RgtC+0LIg0L4g0YDQsNC90LXQtSDRg9GH0YLRkdC90L3QvtC8INC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQsiDQvtGA0LPQsNC90LDRhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LLQu9Cw0YHRgtC4LCDQvtGA0LPQsNC90LDRhSDQvNC10YHRgtC90L7Qs9C+INGB0LDQvNC+0YPQv9GA0LDQstC70LXQvdC40Y8g0LjQu9C4INC+0YDQs9Cw0L3QsNGFINC4INC+0YDQs9Cw0L3QuNC30LDRhtC40Y/RhSDQv9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvNGDINGC0LXRhdC90LjRh9C10YHQutC+0LzRgyDRg9GH0ZHRgtGDINC4ICjQuNC70LgpINGC0LXRhdC90LjRh9C10YHQutC+0Lkg0LjQvdCy0LXQvdGC0LDRgNC40LfQsNGG0LjQuCcsXG4gICAgJzU1ODEwMjAwMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40Y8g0Lgg0LfQsNC/0YDQvtGB0YssINGB0LLRj9C30LDQvdC90YvQtSDRgSDRgNC10LPQuNGB0YLRgNCw0YbQuNC10Lkg0L/RgNCw0LInLFxuICAgICc1NTgxMDIwMTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCy0LAg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4sINGB0LTQtdC70LrQuCDRgSDQvdC40LwsINC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pLCDQv9C10YDQtdGF0L7QtNCwLCDQv9GA0LXQutGA0LDRidC10L3QuNGPINC/0YDQsNCy0LAg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4nLFxuICAgICc1NTgxMDIwMjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQtdC60YDQsNGJ0LXQvdC40Y8g0L/RgNCw0LLQsCAo0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjykg0L/RgNCw0LLQsCknLFxuICAgICc1NTgxMDIwMzAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LjQt9C80LXQvdC10L3QuNC5INCyINCV0JPQoNCfJyxcbiAgICAnNTU4MTAyMDQwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQvtCxINC40YHQv9GA0LDQstC70LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60LgnLFxuICAgICc1NTgxMDIwNTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0YDQtdC00YHRgtCw0LLQu9C10L3QuNC4INC00L7Qv9C+0LvQvdC40YLQtdC70YzQvdGL0YUg0LTQvtC60YPQvNC10L3RgtC+0LIg0LTQu9GPINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCyJyxcbiAgICAnNTU4MTAyMDYwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9GA0LjQvtGB0YLQsNC90L7QstC70LXQvdC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCcsXG4gICAgJzU1ODEwMjA3MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLQvtC30L7QsdC90L7QstC70LXQvdC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40LgnLFxuICAgICc1NTgxMDIwODAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0YDQtdC60YDQsNGJ0LXQvdC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40LgnLFxuICAgICc1NTgxMDIwOTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0L7QstGC0L7RgNC90L7QuSDQstGL0LTQsNGH0LUg0YHQstC40LTQtdGC0LXQu9GM0YHRgtCy0LAg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LLQsCcsXG4gICAgJzU1ODEwMjEwMDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5LCDRgdC+0LTQtdGA0LbQsNGJ0LjRhdGB0Y8g0LIg0JXQtNC40L3QvtC8INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDRgNC10LXRgdGC0YDQtSDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8JyxcbiAgICAnNTU4MTAyMTEwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9C+0YHRgtCw0L3QvtCy0LrQtSDQvdCwINGD0YfRkdGCINCx0LXRgdGF0L7Qt9GP0LnQvdGL0YUg0L3QtdC00LLQuNC20LjQvNGL0YUg0LLQtdGJ0LXQuScsXG4gICAgJzU1ODEwMjEyMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLRi9C00LDRh9C1INC30LDQutC70LDQtNC90L7QuSAo0L3QvtCy0L7QuSDQt9Cw0LrQu9Cw0LTQvdC+0LksINC00YPQsdC70LjQutCw0YLQsCDQt9Cw0LrQu9Cw0LTQvdC+0LksINCw0L3QvdGD0LvQuNGA0L7QstCw0L3QvdC+0Lkg0LfQsNC60LvQsNC00L3QvtC5KScsXG4gICAgJzU1ODEwMjEzMDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0LLRi9C00LDRh9C1INC60L7Qv9C40Lkg0LTQvtCz0L7QstC+0YDQvtCyINC4INC40L3Ri9GFINC00L7QutGD0LzQtdC90YLQvtCyLCDQstGL0YDQsNC20LDRjtGJ0LjRhSDRgdC+0LTQtdGA0LbQsNC90LjQtSDQvtC00L3QvtGB0YLQvtGA0L7QvdC90LjRhSDRgdC00LXQu9C+0LosINGB0L7QstC10YDRiNC10L3QvdGL0YUg0LIg0L/RgNC+0YHRgtC+0Lkg0L/QuNGB0YzQvNC10L3QvdC+0Lkg0YTQvtGA0LzQtScsXG4gICAgJzU1ODEwMjE0MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QuNC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4LCDQstC+0LfQstGA0LDRgtC1INC00L7QutGD0LzQtdC90YLQvtCyINCx0LXQtyDQv9GA0L7QstC10LTQtdC90LjRjyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCwg0L/RgNC10LTRgdGC0LDQstC70LXQvdC40Lgg0LTQvtC/0L7Qu9C90LjRgtC10LvRjNC90YvRhSDQtNC+0LrRg9C80LXQvdGC0L7Qsiwg0L4g0LLQvtC30L7QsdC90L7QstC70LXQvdC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40LgsINGA0LDQvdC10LUg0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QvdC+0Lkg0L/QviDQt9Cw0Y/QstC70LXQvdC40Y4g0L/RgNCw0LLQvtC+0LHQu9Cw0LTQsNGC0LXQu9GPLCDRgdGC0L7RgNC+0L3RiyAo0YHRgtC+0YDQvtC9KSDRgdC00LXQu9C60LgsINC70LjRhtCwLCDRh9GM0ZEg0L/RgNCw0LLQviDQvtCz0YDQsNC90LjRh9C40LLQsNC10YLRgdGPICjQvtCx0YDQtdC80LXQvdGP0LXRgtGB0Y8pLCDQu9C40YbQsCwg0LIg0L/QvtC70YzQt9GDINC60L7RgtC+0YDQvtCz0L4g0L/RgNCw0LLQviDQvtCz0YDQsNC90LjRh9C40LLQsNC10YLRgdGPICjQvtCx0YDQtdC80LXQvdGP0LXRgtGB0Y8pLCDQt9Cw0LrQvtC90L3QvtCz0L4g0LLQu9Cw0LTQtdC70YzRhtCwINC30LDQutC70LDQtNC90L7QuSAo0LjRhSDQv9GA0LXQtNGB0YLQsNCy0LjRgtC10LvRjyknLFxuICAgICc1NTgxMDIxNTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0L7QstGC0L7RgNC90L7QuSDQstGL0LTQsNGH0LUg0L3QvtCy0L7Qs9C+INGB0LLQuNC00LXRgtC10LvRjNGB0YLQstCwINC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCy0LAsINCy0YvQtNCw0YfQtSDQt9Cw0LrQu9Cw0LTQvdC+0LksINCy0L3QtdGB0LXQvdC40Lgg0LjQt9C80LXQvdC10L3QuNC5INCyINC30LDQv9C40YHRjCDQldC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8LCDQv9C+0LPQsNGI0LXQvdC40Lgg0YDQtdCz0LjRgdGC0YDQsNGG0LjQvtC90L3QvtC5INC30LDQv9C40YHQuCDQvtCxINC40L/QvtGC0LXQutC1JyxcbiAgICAnNTU4MTAyMTYwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9GA0LjQvdGP0YLQuNC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwINCy0L3QvtCy0Ywg0LLQviDQstC70LDQtNC10L3QuNC1LCDQv9C+0LvRjNC30L7QstCw0L3QuNC1INC4INGA0LDRgdC/0L7RgNGP0LbQtdC90LjQtSAo0LIg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0YwpJyxcbiAgICAnNTU4MTAyMTcwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INCyINCV0LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40Lwg0L7RgtC80LXRgtC60Lgg0L4g0L3QsNC70LjRh9C40Lgg0YHRg9C00LXQsdC90L7Qs9C+INGB0L/QvtGA0LAg0LIg0L7RgtC90L7RiNC10L3QuNC4INC30LDRgNC10LPQuNGB0YLRgNC40YDQvtCy0LDQvdC90L7Qs9C+INC/0YDQsNCy0LAnLFxuICAgICc1NTgxMDIxODAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCDQsiDQt9Cw0L/QuNGB0Y/RhSDQldC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8LCDQviDQvdCw0LvQuNGH0LjQuCDQstC+0LfRgNCw0LbQtdC90LjRjyDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LfQsNGA0LXQs9C40YHRgtGA0LjRgNC+0LLQsNC90L3QvtCz0L4g0L/RgNCw0LLQsCDQvdCwINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7RgdGC0LgsINC+INC/0L7Qs9Cw0YjQtdC90LjQuCDQt9Cw0L/QuNGB0Lgg0LIg0JXQtNC40L3QvtC8INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDRgNC10LXRgdGC0YDQtSDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8INC+INC90LDQu9C40YfQuNC4INCy0L7Qt9GA0LDQttC10L3QuNGPINCyINC+0YLQvdC+0YjQtdC90LjQuCDQt9Cw0YDQtdCz0LjRgdGC0YDQuNGA0L7QstCw0L3QvdC+0LPQviDQv9GA0LDQstCwINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCwg0L4g0L3QtdCy0L7Qt9C80L7QttC90L7RgdGC0Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/QtdGA0LXRhdC+0LTQsCwg0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjyksINC/0YDQtdC60YDQsNGJ0LXQvdC40Y8g0L/RgNCw0LLQsCDQvdCwINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LHQtdC3INC70LjRh9C90L7Qs9C+INGD0YfQsNGB0YLQuNGPINGB0L7QsdGB0YLQstC10L3QvdC40LrQsCAo0LXQs9C+INC30LDQutC+0L3QvdC+0LPQviDQv9GA0LXQtNGB0YLQsNCy0LjRgtC10LvRjyksINC+0LEg0L7RgtC30YvQstC1INGA0LDQvdC10LUg0L/RgNC10LTRgdGC0LDQstC70LXQvdC90L7Qs9C+INC30LDRj9Cy0LvQtdC90LjRjyDQviDQvdC10LLQvtC30LzQvtC20L3QvtGB0YLQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9C10YDQtdGF0L7QtNCwLCDQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKSwg0L/RgNC10LrRgNCw0YnQtdC90LjRjyDQv9GA0LDQstCwINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQsdC10Lcg0LvQuNGH0L3QvtCz0L4g0YPRh9Cw0YHRgtC40Y8g0YHQvtCx0YHRgtCy0LXQvdC90LjQutCwICjQtdCz0L4g0LfQsNC60L7QvdC90L7Qs9C+INC/0YDQtdC00YHRgtCw0LLQuNGC0LXQu9GPKScsXG4gICAgJzU1ODEwMjE5MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0YHQutGA0LXQv9C70LXQvdC40Lgg0LTQvtCx0LDQstC+0YfQvdC+0LPQviDQu9C40YHRgtCwICjQtNC+0LHQsNCy0L7Rh9C90YvRhSDQu9C40YHRgtC+0LIpINGBINC30LDQutC70LDQtNC90L7QuScsXG4gICAgJzU1ODEwMjIwMDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5LCDRgdC+0LTQtdGA0LbQsNGJ0LjRhdGB0Y8g0LIg0JXQtNC40L3QvtC8INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDRgNC10LXRgdGC0YDQtSDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8LCDQv9C+0YHRgNC10LTRgdGC0LLQvtC8INC+0LHQtdGB0L/QtdGH0LXQvdC40Y8g0LTQvtGB0YLRg9C/0LAg0Log0LjQvdGE0L7RgNC80LDRhtC40L7QvdC90L7QvNGDINGA0LXRgdGD0YDRgdGDLCDRgdC+0LTQtdGA0LbQsNGJ0LXQvNGDINGB0LLQtdC00LXQvdC40Y8g0JXQtNC40L3QvtCz0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YDQtdC10YHRgtGA0LAg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCcsXG4gICAgJzU1ODEwMjIxMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0LfQsNC60L7QvdC90L7Qs9C+INCy0LvQsNC00LXQu9GM0YbQsCDQt9Cw0LrQu9Cw0LTQvdC+0LknLFxuICAgICc1NTgxMDIyMjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LjQt9C80LXQvdC10L3QuNC5INCyINC30LDQv9C40YHRjCDQldC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8LCDQv9C+0LPQsNGI0LXQvdC40Lgg0YDQtdCz0LjRgdGC0YDQsNGG0LjQvtC90L3QvtC5INC30LDQv9C40YHQuCDQvtCxINC40L/QvtGC0LXQutC1JyxcbiAgICAnNTU4MTAzMDAwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjRjyDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lwg0YPRh9GR0YLQtSDQt9C00LDQvdC40LksINGB0L7QvtGA0YPQttC10L3QuNC5LCDQv9C+0LzQtdGJ0LXQvdC40LksINC+0LHRitC10LrRgtC+0LIg0L3QtdC30LDQstC10YDRiNGR0L3QvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCAo0L7QsdGK0LXQutGC0L7QsiDRg9GH0ZHRgtCwKSDQuCDQt9Cw0L/RgNC+0YHRiyDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGB0LLQtdC00LXQvdC40LksINCy0L3QtdGB0ZHQvdC90YvRhSDQsiDQldC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCcsXG4gICAgJzU1ODEwMzAxMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/QvtGB0YLQsNC90L7QstC60LUg0L3QsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YPRh9GR0YIg0L7QsdGK0LXQutGC0LAg0YPRh9GR0YLQsCcsXG4gICAgJzU1ODEwMzAyMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQsiDQldCT0KDQntCa0KEg0YHQstC10LTQtdC90LjQuSDQviDRgNCw0L3QtdC1INGD0YfRgtGR0L3QvdC+0Lwg0L7QsdGK0LXQutGC0LUg0LrQsNC/0LjRgtCw0LvRjNC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwJyxcbiAgICAnNTU4MTAzMDMwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lwg0YPRh9GR0YLQtSDQuNC30LzQtdC90LXQvdC40Lkg0L7QsdGK0LXQutGC0LAg0YPRh9GR0YLQsCcsXG4gICAgJzU1ODEwMzA0MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0YHQvdGP0YLQuNC4INGBINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGD0YfRkdGC0LAg0L7QsdGK0LXQutGC0LAg0YPRh9GR0YLQsCcsXG4gICAgJzU1ODEwMzA1MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4JyxcbiAgICAnNTU4MTAzMDYwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQvtCxINC40YHQutC70Y7Rh9C10L3QuNC4INGB0LLQtdC00LXQvdC40Lkg0LjQtyDQldCT0KDQntCa0KEsINC90L7RgdGP0YnQuNGFINCy0YDQtdC80LXQvdC90YvQuSDRhdCw0YDQsNC60YLQtdGAJyxcbiAgICAnNTU4MTAzMDcwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INC60L7Qv9C40Lgg0LTQvtC60YPQvNC10L3RgtCwLCDQvdCwINC+0YHQvdC+0LLQsNC90LjQuCDQutC+0YLQvtGA0L7Qs9C+INGB0LLQtdC00LXQvdC40Y8g0L7QsSDQvtCx0YrQtdC60YLQtSDQstC90LXRgdC10L3RiyDQsiDQldC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCcsXG4gICAgJzU1ODEwMzA4MDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5LCDQstC90LXRgdC10L3QvdGL0YUg0LIg0JXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAnLFxuICAgICc1NTgxMDMwOTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0YDQtdC00YHRgtCw0LLQu9C10L3QuNC4INC00L7Qv9C+0LvQvdC40YLQtdC70YzQvdGL0YUg0LTQvtC60YPQvNC10L3RgtC+0LIg0L3QsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YPRh9GR0YInLFxuICAgICc1NTgxMDQwMDAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0L7Qt9Cy0YDQsNGC0LUg0L/Qu9Cw0YLQtdC20LAnLFxuICAgICc1NTgxOTkwMDAwMDAnOiAn0JjQvdC+0LUg0LfQsNGP0LLQu9C10L3QuNC1JyxcbiAgICAnNTU4MjAwMDAwMDAwJzogJ9CU0J7QmtCj0JzQldCd0KLQqywg0KHQntCU0JXQoNCW0JDQqdCY0JUg0J7Qn9CY0KHQkNCd0JjQlSDQntCR0KrQldCa0KLQkCcsXG4gICAgJzU1ODIwMTAwMDAwMCc6ICfQntC/0LjRgdCw0L3QuNC1INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcbiAgICAnNTU4MjAyMDAwMDAwJzogJ9CX0LXQvNC70LXRg9GB0YLRgNC+0LjRgtC10LvRjNC90L7QtSDQtNC10LvQvicsXG4gICAgJzU1ODIwMzAwMDAwMCc6ICfQnNC10LbQtdCy0L7QuSDQv9C70LDQvScsXG4gICAgJzU1ODIwNDAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCICjQutC+0L/QuNGPKSwg0L3QsCDQvtGB0L3QvtCy0LDQvdC40Lgg0LrQvtGC0L7RgNC+0LPQviDRgdCy0LXQtNC10L3QuNGPINC+0LEg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCy0L3QtdGB0LXQvdGLINCyINCT0JrQnScsXG4gICAgJzU1ODIwNTAwMDAwMCc6ICfQotC10YXQvdC40YfQtdGB0LrQuNC5INC/0LDRgdC/0L7RgNGCINC+0LHRitC10LrRgtCwINGD0YfRkdGC0LAnLFxuICAgICc1NTgyMDUwMTAwMDAnOiAn0KLQtdGF0L3QuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgiDQtNC+0LzQvtCy0LvQsNC00LXQvdC40Y8nLFxuICAgICc1NTgyMDUwMjAwMDAnOiAn0KLQtdGF0L3QuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgiDQt9C00LDQvdC40Y8gKNGB0YLRgNC+0LXQvdC40Y8pJyxcbiAgICAnNTU4MjA1MDMwMDAwJzogJ9Ci0LXRhdC90LjRh9C10YHQutC40Lkg0L/QsNGB0L/QvtGA0YIg0LbQuNC70L7Qs9C+INC/0L7QvNC10YnQtdC90LjRjyAo0LrQstCw0YDRgtC40YDRiyknLFxuICAgICc1NTgyMDUwNDAwMDAnOiAn0KLQtdGF0L3QuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgiDQvtCx0YrQtdC60YLQsCDQuNC90LTQuNCy0LjQtNGD0LDQu9GM0L3QvtCz0L4g0LbQuNC70LjRidC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwJyxcbiAgICAnNTU4MjA1MDUwMDAwJzogJ9Ci0LXRhdC90LjRh9C10YHQutC40Lkg0L/QsNGB0L/QvtGA0YIg0YHQvtC+0YDRg9C20LXQvdC40Y8nLFxuICAgICc1NTgyMDUwNjAwMDAnOiAn0KLQtdGF0L3QuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgiDQvtCx0YrQtdC60YLQsCDQvdC10LfQsNCy0LXRgNGI0ZHQvdC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwJyxcbiAgICAnNTU4MjA2MDAwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0YLQtdGF0L3QuNGH0LXRgdC60L7Qs9C+INC/0LDRgdC/0L7RgNGC0LAnLFxuICAgICc1NTgyMDYwMTAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDRgtC10YXQvdC40YfQtdGB0LrQvtCz0L4g0L/QsNGB0L/QvtGA0YLQsCDQvdCwINC30LTQsNC90LjQtSAo0YHRgtGA0L7QtdC90LjQtSknLFxuICAgICc1NTgyMDYwMjAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDRgtC10YXQvdC40YfQtdGB0LrQvtCz0L4g0L/QsNGB0L/QvtGA0YLQsCDQkdCi0JgnLFxuICAgICc1NTgyMDcwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgiAo0LrQvtC/0LjRjyksINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0YDQsNC30YDQtdGI0LXQvdC40LUg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YHQv9C+0YDQsCDQviDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40Lgg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjRjyDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuICAgICc1NTgyMDgwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgiAo0LrQvtC/0LjRjyksINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0L/RgNC40L3QsNC00LvQtdC20L3QvtGB0YLRjCDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDQuiDQvtC/0YDQtdC00LXQu9C10L3QvdC+0Lkg0LrQsNGC0LXQs9C+0YDQuNC4INC30LXQvNC10LvRjCcsXG4gICAgJzU1ODIwOTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCICjQutC+0L/QuNGPKSwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDRg9GB0YLQsNC90L7QstC70LXQvdC90L7QtSDRgNCw0LfRgNC10YjQtdC90L3QvtC1INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNC1INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcbiAgICAnNTU4MjEwMDAwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L/Qu9Cw0L0g0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAgKNCy0YvQv9C40YHQutCwINC40Lcg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LfQtdC80LXQu9GM0L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQsCknLFxuICAgICc1NTgyMTEwMDAwMDAnOiAn0J/Qu9Cw0L3RiyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODIxMTAxMDAwMCc6ICfQotC10YXQvdC40YfQtdGB0LrQuNC5INC/0LvQsNC9INC30LTQsNC90LjRjywg0YHQvtC+0YDRg9C20LXQvdC40Y8sINC/0L7QvNC10YnQtdC90LjRjyDQu9C40LHQviDQvtCx0YrQtdC60YLQsCDQvdC10LfQsNCy0LXRgNGI0ZHQvdC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwJyxcbiAgICAnNTU4MjExMDIwMDAwJzogJ9Cf0LvQsNC9INGD0YfQsNGB0YLQutCwINC70LXRgdC90L7Qs9C+INGE0L7QvdC00LAnLFxuICAgICc1NTgyMTEwMzAwMDAnOiAn0J/Qu9Cw0L0g0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MjExMDQwMDAwJzogJ9Ct0LrRgdC/0LvQuNC60LDRhtC40Y8g0Log0L/QvtGN0YLQsNC20L3QvtC80YMg0L/Qu9Cw0L3RgycsXG4gICAgJzU1ODIxMjAwMDAwMCc6ICfQlNC10LrQu9Cw0YDQsNGG0LjRjyDQvtCxINC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODIxMzAwMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC/0LDRgdC/0L7RgNGCINC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODIxMzAxMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC/0LDRgdC/0L7RgNGCINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcbiAgICAnNTU4MjEzMDIwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L/QsNGB0L/QvtGA0YIg0L/QvtC80LXRidC10L3QuNGPICjQstGL0L/QuNGB0LrQsCDQuNC3INCT0JrQnSknLFxuICAgICc1NTgyMTMwMzAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQv9Cw0YHQv9C+0YDRgiDQt9C00LDQvdC40Y8sINGB0L7QvtGA0YPQttC10L3QuNGPLCDQvtCx0YrQtdC60YLQsCDQvdC10LfQsNCy0LXRgNGI0ZHQvdC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwJyxcbiAgICAnNTU4MjE0MDAwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstCw0Y8g0LLRi9C/0LjRgdC60LAg0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTgyMTQwMTAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0LDRjyDQstGL0L/QuNGB0LrQsCDQviDQt9C10LzQtdC70YzQvdC+0Lwg0YPRh9Cw0YHRgtC60LUnLFxuICAgICc1NTgyMTQwMjAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0LDRjyDQstGL0L/QuNGB0LrQsCDQviDQt9C00LDQvdC40LgsINGB0L7QvtGA0YPQttC10L3QuNC4LCDQvtCx0YrQtdC60YLQtSDQvdC10LfQsNCy0LXRgNGI0ZHQvdC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwJyxcbiAgICAnNTU4MjE2MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0LjQt9C80LXQvdC10L3QuNC1INC90LDQt9C90LDRh9C10L3QuNGPINC30LTQsNC90LjRjywg0L/QvtC80LXRidC10L3QuNGPINC40LvQuCDRgdC+0L7RgNGD0LbQtdC90LjRjywg0L3QsNC40LzQtdC90L7QstCw0L3QuNGPINGB0L7QvtGA0YPQttC10L3QuNGPJyxcbiAgICAnNTU4MjE3MDAwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L/Qu9Cw0L0g0YLQtdGA0YDQuNGC0L7RgNC40LgnLFxuICAgICc1NTgyMTgwMDAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0LDRjyDRgdC/0YDQsNCy0LrQsCDQviDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INGB0YLQvtC40LzQvtGB0YLQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTgyMTkwMDAwMDAnOiAn0JDQutGCINC+0LHRgdC70LXQtNC+0LLQsNC90LjRjywg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQv9GA0LXQutGA0LDRidC10L3QuNC1INGB0YPRidC10YHRgtCy0L7QstCw0L3QuNGPINC+0LHRitC10LrRgtCwINGD0YfRkdGC0LAnLFxuICAgICc1NTgyMjAwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLLCDQsiDQstC40LTQtSDQutC+0YLQvtGA0YvRhSDQv9GA0LXQtNC+0YHRgtCw0LLQu9GP0Y7RgtGB0Y8g0YHQstC10LTQtdC90LjRjyDQldC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCcsXG4gICAgJzU1ODIyMDAxMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INCg0LXQtdGB0YLRgNCwLCDRgdC+0LTQtdGA0LbQsNGJ0LDRjyDQvtGC0L3QvtGB0Y/RidC40LXRgdGPINC6INC40L3RhNC+0YDQvNCw0YbQuNC4INC+0LPRgNCw0L3QuNGH0LXQvdC90L7Qs9C+INC00L7RgdGC0YPQv9CwINGB0LLQtdC00LXQvdC40Y8g0L7QsSDQvtCx0YrQtdC60YLQtSDRg9GH0LXRgtCwJyxcbiAgICAnNTU4MjIwMDIwMDAwJzogJ9Ch0L/RgNCw0LLQutCwLCDRgdC+0LTQtdGA0LbQsNGJ0LDRjywg0LLQvdC10YHRkdC90L3Ri9C1INCyINCV0LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAINGB0LLQtdC00LXQvdC40Y8g0L4g0L/RgNC10LrRgNCw0YnQtdC90LjQuCDRgdGD0YnQtdGB0YLQstC+0LLQsNC90LjRjyDQvtCx0YrQtdC60YLQsCDRg9GH0ZHRgtCwJyxcbiAgICAnNTU4MjIwMDMwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0KDQtdC10YHRgtGA0LAsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidCw0Y8g0YTQsNC60YIg0L7RgtGB0YPRgtGB0YLQstC40Y8g0LIg0KDQtdC10YHRgtGA0LUg0YHQstC10LTQtdC90LjQuSDQvtCxINC+0LHRitC10LrRgtC1INGD0YfQtdGC0LAnLFxuICAgICc1NTgyMjEwMDAwMDAnOiAn0J/QoNCe0KfQmNCVJyxcbiAgICAnNTU4MjIxMDEwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC90LXQvtCx0YXQvtC00LjQvNC+0YHRgtC4INGD0YHRgtGA0LDQvdC10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L7RiNC40LHQutC4JyxcbiAgICAnNTU4MjIxMDIwMDAwJzogJ9Cc0LXQttC00YPQvdCw0YDQvtC00L3Ri9C5INC00L7Qs9C+0LLQvtGAINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCwg0LIg0YHQvtC+0YLQstC10YLRgdGC0LLQuNC4INGBINC60L7RgtC+0YDRi9C8INGD0YHRgtCw0L3QvtCy0LvQtdC90L4g0LjQu9C4INC40LfQvNC10L3QtdC90L4g0L/RgNC+0YXQvtC20LTQtdC90LjQtSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LPRgNCw0L3QuNGG0Ysg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4JyxcbiAgICAnNTU4MjIxMDMwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINGB0L7QtNC10YDQttCw0YnQuNC5INC90LXQvtCx0YXQvtC00LjQvNGL0LUg0LTQu9GPINCy0L3QtdGB0LXQvdC40Y8g0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGAINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDRgdCy0LXQtNC10L3QuNGPINC+INCz0YDQsNC90LjRhtCw0YUg0LzQtdC20LTRgyDRgdGD0LHRitC10LrRgtCw0LzQuCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgsINCz0YDQsNC90LjRhtCw0YUg0LzRg9C90LjRhtC40L/QsNC70YzQvdC+0LPQviDQvtCx0YDQsNC30L7QstCw0L3QuNGPLCDQs9GA0LDQvdC40YbQsNGFINC90LDRgdC10LvRkdC90L3QvtCz0L4g0L/Rg9C90LrRgtCwJyxcbiAgICAnNTU4MjIxMDQwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINGB0L7QtNC10YDQttCw0YnQuNC5INC90LXQvtCx0YXQvtC00LjQvNGL0LUg0LTQu9GPINCy0L3QtdGB0LXQvdC40Y8g0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGAINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDRgdCy0LXQtNC10L3QuNGPINC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INC40LvQuCDQuNC30LzQtdC90LXQvdC40Lgg0YLQtdGA0YDQuNGC0L7RgNC40LDQu9GM0L3QvtC5INC30L7QvdGLINC40LvQuCDQt9C+0L3RiyDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LksINC70LjQsdC+INC+0LEg0L7RgtC80LXQvdC1INGD0YHRgtCw0L3QvtCy0LvQtdC90LjRjyDRgtCw0LrQvtC5INC30L7QvdGLJyxcbiAgICAnNTU4MjIxMDUwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC/0YDQuNGB0LLQvtC10L3QuNC4LCDQuNC30LzQtdC90LXQvdC40Lgg0LDQtNGA0LXRgdCwJyxcbiAgICAnNTU4MjIxMDYwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiyDQvtGA0LPQsNC90L7Qsiwg0L7RgdGD0YnQtdGB0YLQstC70Y/RjtGJ0LjRhSDQstC10LTQtdC90LjQtSDQu9C10YHQvdC+0LPQviDQuCDQstC+0LTQvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtSDRgdCy0LXQtNC10L3QuNGPINC+INC/0YDQuNGA0L7QtNC90YvRhSDQvtCx0YrQtdC60YLQsNGFJyxcbiAgICAnNTU4MjIxMDcwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINGB0L7QtNC10YDQttCw0YnQuNC5INGB0LLQtdC00LXQvdC40Y8g0L7QsSDQsNC00YDQtdGB0LUg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MjIxMDgwMDAwJzogJ9CQ0LrRgiDQvtCxINGD0YLQstC10YDQttC00LXQvdC40Lgg0YDQtdC30YPQu9GM0YLQsNGC0L7QsiDQvtC/0YDQtdC00LXQu9C10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0YHRgtC+0LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MjIxOTkwMDAwJzogJ9CY0L3QvtC5INC00L7QutGD0LzQtdC90YIsINGB0L7QtNC10YDQttCw0YnQuNC5INC+0L/QuNGB0LDQvdC40LUg0L7QsdGK0LXQutGC0LAnLFxuICAgICc1NTgyMjIwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDQvNC10LbQtNGD0L3QsNGA0L7QtNC90L7QvCDQtNC+0LPQvtCy0L7RgNC1INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCwg0LIg0YHQvtC+0YLQstC10YLRgdGC0LLQuNC4INGBINC60L7RgtC+0YDRi9C8INGD0YHRgtCw0L3QvtCy0LvQtdC90L4g0LjQu9C4INC40LfQvNC10L3QtdC90L4g0L/RgNC+0YXQvtC20LTQtdC90LjQtSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LPRgNCw0L3QuNGG0Ysg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4LCDQsCDRgtCw0LrQttC1INGB0LLQtdC00LXQvdC40Y8g0L4g0YTQtdC00LXRgNCw0LvRjNC90L7QvCDQt9Cw0LrQvtC90LUsINC60L7RgtC+0YDRi9C8INGA0LDRgtC40YTQuNGG0LjRgNC+0LLQsNC9INC80LXQttC00YPQvdCw0YDQvtC00L3Ri9C5INC00L7Qs9C+0LLQvtGAINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCwg0Lgg0L7QsSDQvtGE0LjRhtC40LDQu9GM0L3QvtC8INC+0L/Rg9Cx0LvQuNC60L7QstCw0L3QuNC4INGC0LDQutC+0LPQviDRhNC10LTQtdGA0LDQu9GM0L3QvtCz0L4g0LfQsNC60L7QvdCwJyxcbiAgICAnNTU4MjIzMDAwMDAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0LjQt9C80LXQvdC10L3QuNC4INCz0YDQsNC90LjRhiDQvNC10LbQtNGDINGB0YPQsdGK0LXQutGC0LDQvNC4INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG4gICAgJzU1ODIyNDAwMDAwMCc6ICfQl9Cw0LrQvtC9INGB0YPQsdGK0LXQutGC0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INC40LvQuCDQuNC30LzQtdC90LXQvdC40Lgg0LPRgNCw0L3QuNGGINC80YPQvdC40YbQuNC/0LDQu9GM0L3Ri9GFINC+0LHRgNCw0LfQvtCy0LDQvdC40Lkg0LvQuNCx0L4g0L4g0L/RgNC10L7QsdGA0LDQt9C+0LLQsNC90LjQuCDQvNGD0L3QuNGG0LjQv9Cw0LvRjNC90YvRhSDQvtCx0YDQsNC30L7QstCw0L3QuNC5JyxcbiAgICAnNTU4MjI1MDAwMDAwJzogJ9CQ0LrRgiDRg9C/0L7Qu9C90L7QvNC+0YfQtdC90L3QvtCz0L4g0L7RgNCz0LDQvdCwINC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INC40LvQuCDQuNC30LzQtdC90LXQvdC40Lgg0LPRgNCw0L3QuNGGINC90LDRgdC10LvRkdC90L3Ri9GFINC/0YPQvdC60YLQvtCyJyxcbiAgICAnNTU4MjI2MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDQvdC10L7QsdGF0L7QtNC40LzRi9C1INC00LvRjyDQstC90LXRgdC10L3QuNGPINCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0YHQstC10LTQtdC90LjRjyDQviDQs9GA0LDQvdC40YbQsNGFINC80LXQttC00YMg0YHRg9Cx0YrQtdC60YLQsNC80Lgg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4LCDQs9GA0LDQvdC40YbQsNGFINC80YPQvdC40YbQuNC/0LDQu9GM0L3QvtCz0L4g0L7QsdGA0LDQt9C+0LLQsNC90LjRjywg0LPRgNCw0L3QuNGG0LDRhSDQvdCw0YHQtdC70ZHQvdC90L7Qs9C+INC/0YPQvdC60YLQsCwg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINGD0YLQstC10YDQttC00ZHQvdC90YvRhSDQvtGA0LPQsNC90LDQvNC4INCy0LvQsNGB0YLQuCDQtNC+0LrRg9C80LXQvdGC0LDRhScsXG4gICAgJzU1ODIyNzAwMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINGD0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQuNC70Lgg0LjQt9C80LXQvdC10L3QuNC4INCz0YDQsNC90LjRhiDQt9C+0L0g0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC5JyxcbiAgICAnNTU4MjI4MDAwMDAwJzogJ9Cf0YDQsNCy0L7QstC+0Lkg0LDQutGCLCDQutC+0YLQvtGA0YvQvCDRg9GC0LLQtdGA0LbQtNC10L3RiyDQuNC70Lgg0LjQt9C80LXQvdC10L3RiyDQv9GA0LDQstC40LvQsCDQt9C10LzQu9C10L/QvtC70YzQt9C+0LLQsNC90LjRjyDQuCDQt9Cw0YHRgtGA0L7QudC60LgnLFxuICAgICc1NTgyMjkwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQuNC30LzQtdC90LXQvdC40LUg0L3QsNC30L3QsNGH0LXQvdC40Y8g0L/QvtC80LXRidC10L3QuNGPJyxcbiAgICAnNTU4MjMwMDAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC/0LXRgNC10LLQvtC00LUg0LbQuNC70L7Qs9C+INC/0L7QvNC10YnQtdC90LjRjyDQsiDQvdC10LbQuNC70L7QtSDQv9C+0LzQtdGJ0LXQvdC40LUsINC90LXQttC40LvQvtCz0L4g0L/QvtC80LXRidC10L3QuNGPINCyINC20LjQu9C+0LUg0L/QvtC80LXRidC10L3QuNC1JyxcbiAgICAnNTU4MjMxMDAwMDAwJzogJ9CQ0LrRgiDQv9GA0LjQtdC80L7Rh9C90L7QuSDQutC+0LzQuNGB0YHQuNC4LCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC30LDQstC10YDRiNC10L3QuNC1INC/0LXRgNC10YPRgdGC0YDQvtC50YHRgtCy0LAg0LggKNC40LvQuCkg0L/QtdGA0LXQv9C70LDQvdC40YDQvtCy0LrQuCDQuCAo0LjQu9C4KSDQuNC90YvRhSDRgNCw0LHQvtGCJyxcbiAgICAnNTU4MjMyMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC1INGB0LLQtdC00LXQvdC40Y8g0L7QsSDQuNC30LzQtdC90LXQvdC40Lgg0L3QsNC30L3QsNGH0LXQvdC40Y8g0L/QvtC80LXRidC10L3QuNGPJyxcbiAgICAnNTU4MjMzMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0YDQtdGI0LXQvdC40Lgg0L4g0L/QtdGA0LXQstC+0LTQtSDQttC40LvQvtCz0L4g0L/QvtC80LXRidC10L3QuNGPINCyINC90LXQttC40LvQvtC1INC/0L7QvNC10YnQtdC90LjQtSwg0L3QtdC20LjQu9C+0LPQviDQv9C+0LzQtdGJ0LXQvdC40Y8g0LIg0LbQuNC70L7QtSDQv9C+0LzQtdGJ0LXQvdC40LUnLFxuICAgICc1NTgyMzQwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDQsNC60YLQtSDQv9GA0LjQtdC80L7Rh9C90L7QuSDQutC+0LzQuNGB0YHQuNC4LCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQtdC8INC30LDQstC10YDRiNC10L3QuNC1INC/0LXRgNC10YPRgdGC0YDQvtC50YHRgtCy0LAg0LggKNC40LvQuCkg0L/QtdGA0LXQv9C70LDQvdC40YDQvtCy0LrQuCDQuCAo0LjQu9C4KSDQuNC90YvRhSDRgNCw0LHQvtGCJyxcbiAgICAnNTU4MjM1MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0LjQt9C80LXQvdC10L3QuNC1INC90LDQt9C90LDRh9C10L3QuNGPINC30LTQsNC90LjRjycsXG4gICAgJzU1ODIzNjAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC40LfQvNC10L3QtdC90LjQtSDQvdCw0LfQvdCw0YfQtdC90LjRjyDRgdC+0L7RgNGD0LbQtdC90LjRjycsXG4gICAgJzU1ODIzNzAwMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGA0LDQt9GA0LXRiNC10L3QuNGPINC90LAg0YPRgdC70L7QstC90L4g0YDQsNC30YDQtdGI0LXQvdC90YvQuSDQstC40LQg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8nLFxuICAgICc1NTgyMzgwMDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtC/0YDQtdC00LXQu9C10L3QuNC4ICjQuNC30LzQtdC90LXQvdC40LgpINCy0LjQtNCwINGA0LDQt9GA0LXRiNC10L3QvdC+0LPQviDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjycsXG4gICAgJzU1ODIzOTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCICjQutC+0L/QuNGPKSwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8g0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgNCw0LfRgNC10YjQtdC90LjRjyDQvdCwINGD0YHQu9C+0LLQvdC+INGA0LDQt9GA0LXRiNC10L3QvdGL0Lkg0LLQuNC0INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPLCDQvtCxINC+0L/RgNC10LTQtdC70LXQvdC40LggKNC40LfQvNC10L3QtdC90LjQuCkg0LLQuNC00LAg0YDQsNC30YDQtdGI0LXQvdC90L7Qs9C+INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPJyxcbiAgICAnNTU4MjQwMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0YDQtdGI0LXQvdC40Lgg0L4g0L/RgNC40YHQstC+0LXQvdC40LgsINC40LfQvNC10L3QtdC90LjQuCDQsNC00YDQtdGB0LAnLFxuICAgICc1NTgyNDEwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDRgNCw0LfRgNC10YjQtdC90LjQuCDQvdCwINCy0LLQvtC0INC+0LHRitC10LrRgtCwINC60LDQv9C40YLQsNC70YzQvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCDQsiDRjdC60YHQv9C70YPQsNGC0LDRhtC40Y4g0YHQstC10LTQtdC90LjRjycsXG4gICAgJzU1ODI0MjAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjywg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINGA0LXQtdGB0YLRgNC1INC+0LHRitC10LrRgtC+0LIg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPICjQv9Cw0LzRj9GC0L3QuNC60L7QsiDQuNGB0YLQvtGA0LjQuCDQuCDQutGD0LvRjNGC0YPRgNGLKSDQvdCw0YDQvtC00L7QsiDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuICAgICc1NTgyNDMwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDQsNC60YLQtSDQn9GA0LDQstC40YLQtdC70YzRgdGC0LLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0L7QsSDQuNGB0LrQu9GO0YfQtdC90LjQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LjQtyDQtdC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQvtCx0YrQtdC60YLQvtCyINC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNGB0LvQtdC00LjRjyAo0L/QsNC80Y/RgtC90LjQutC+0LIg0LjRgdGC0L7RgNC40Lgg0Lgg0LrRg9C70YzRgtGD0YDRiykg0L3QsNGA0L7QtNC+0LIg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4JyxcbiAgICAnNTU4MjQ0MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINGB0L7QtNC10YDQttCw0YnQuNC5INGB0LLQtdC00LXQvdC40Y8g0L4g0LTQsNGC0LUg0L/QvtGB0YLRg9C/0LvQtdC90LjRjyDQtNC+0LrRg9C80LXQvdGC0L7Qsiwg0L/RgNC10LTRg9GB0LzQvtGC0YDQtdC90L3Ri9GFINGB0YLQsNGC0YzQtdC5IDE3INCk0LXQtNC10YDQsNC70YzQvdC+0LPQviDQt9Cw0LrQvtC90LAgXCLQntCxINC+0LHRitC10LrRgtCw0YUg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPICjQv9Cw0LzRj9GC0L3QuNC60LDRhSDQuNGB0YLQvtGA0LjQuCDQuCDQutGD0LvRjNGC0YPRgNGLKSDQvdCw0YDQvtC00L7QsiDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LhcIiwg0LIg0L7RgtC90L7RiNC10L3QuNC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODI0NTAwMDAwMCc6ICfQoNC10YjQtdC90LjQtSAo0LrQvtC/0LjRjyDRgNC10YjQtdC90LjRjykg0YHQvtC+0YLQstC10YLRgdGC0LLRg9GO0YnQtdCz0L4g0L7RgNCz0LDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQstC70LDRgdGC0Lgg0L7QsSDQvtGC0LrQsNC30LUg0LLQutC70Y7Rh9C40YLRjCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCyINC10LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAINC+0LHRitC10LrRgtC+0LIg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPICjQv9Cw0LzRj9GC0L3QuNC60L7QsiDQuNGB0YLQvtGA0LjQuCDQuCDQutGD0LvRjNGC0YPRgNGLKSDQvdCw0YDQvtC00L7QsiDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuICAgICc1NTgyNDYwMDAwMDAnOiAn0JDQutGCINCf0YDQsNCy0LjRgtC10LvRjNGB0YLQstCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQvtCxINC40YHQutC70Y7Rh9C10L3QuNC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQuNC3INC10LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC+0LHRitC10LrRgtC+0LIg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPJyxcbiAgICAnNTU4MjQ3MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPINC+INC90LDQuNC80LXQvdC+0LLQsNC90LjQuCDQstC+0LTQvdC+0LPQviDQvtCx0YrQtdC60YLQsCDQuCDRg9GB0YLQsNC90L7QstC70LXQvdC90YvRhSDQv9Cw0YDQsNC80LXRgtGA0LDRhSDQstC+0LTQvtC+0YXRgNCw0L3QvdGL0YUg0LfQvtC9INC4INC/0YDQuNCx0YDQtdC20L3Ri9GFINC30LDRidC40YLQvdGL0YUg0L/QvtC70L7RgSwg0LfQvtC9INC30LDRgtC+0L/Qu9C10L3QuNGPLCDQv9C+0LTRgtC+0L/Qu9C10L3QuNGPINC4INC00YDRg9Cz0LjRhSDQt9C+0L0g0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YUg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8nLFxuICAgICc1NTgyNDgwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lwg0LvQtdGB0L3QvtC8INGA0LXQtdGB0YLRgNC1INGB0LLQtdC00LXQvdC40Y8g0LIg0L7RgtC90L7RiNC10L3QuNC4INC70LXRgdC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcbiAgICAnNTU4MjQ5MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LLQviDQstGB0YLRg9C/0LjQstGI0LXQvCDQsiDRgdC40LvRgyDQsNC60YLQtSDQvtCxINGD0YLQstC10YDQttC00LXQvdC40Lgg0YDQtdC30YPQu9GM0YLQsNGC0L7QsiDQvtC/0YDQtdC00LXQu9C10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0YHRgtC+0LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MjUwMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0YDQtdGI0LXQvdC40Lgg0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0LjQu9C4INC40LfQvNC10L3QtdC90LjQuCDQs9GA0LDQvdC40YYg0LfQvtC9INGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuScsXG4gICAgJzU1ODI1MTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjywg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINC/0YDQsNCy0L7QstC+0Lwg0LDQutGC0LUsINC60L7RgtC+0YDRi9C8INGD0YLQstC10YDQttC00LXQvdGLINC40LvQuCDQuNC30LzQtdC90LXQvdGLINC/0YDQsNCy0LjQu9CwINC30LXQvNC70LXQv9C+0LvRjNC30L7QstCw0L3QuNGPINC4INC30LDRgdGC0YDQvtC50LrQuCwg0LLQutC70Y7Rh9Cw0Y8g0YHQstC10LTQtdC90LjRjyDQviDRgtC10YDRgNC40YLQvtGA0LjQsNC70YzQvdGL0YUg0LfQvtC90LDRhScsXG4gICAgJzU1ODI1MjAwMDAwMCc6ICfQmtCw0YDRgtCwICjQv9C70LDQvSkg0L7QsdGK0LXQutGC0LAg0LfQtdC80LvQtdGD0YHRgtGA0L7QudGB0YLQstCwJyxcbiAgICAnNTU4MjUzMDAwMDAwJzogJ9CU0LXQutC70LDRgNCw0YbQuNGPINC30LDQuNC90YLQtdGA0LXRgdC+0LLQsNC90L3QvtCz0L4g0LvQuNGG0LAg0L4g0LLRi9Cx0YDQsNC90L3QvtC8INCy0LjQtNC1INGA0LDQt9GA0LXRiNC10L3QvdC+0LPQviDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG4gICAgJzU1ODI1NDAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0YssINC+0L/RgNC10LTQtdC70Y/RjtGJ0LjQtSAo0L7Qv9GA0LXQtNC10LvRj9Cy0YjQuNC1KSDQsiDRgdC+0L7RgtCy0LXRgtGB0YLQstC40Lgg0YEg0LfQsNC60L7QvdC+0LTQsNGC0LXQu9GM0YHRgtCy0L7QvCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjQtSDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAgKNC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyKScsXG4gICAgJzU1ODI1NDAxMDAwMCc6ICfQl9C10LzQu9C10YPRgdGC0YDQvtC40YLQtdC70YzQvdCw0Y8g0LTQvtC60YPQvNC10L3RgtCw0YbQuNGPJyxcbiAgICAnNTU4MjU0MDIwMDAwJzogJ9Cb0LXRgdC+0YPRgdGC0YDQvtC40YLQtdC70YzQvdCw0Y8g0LTQvtC60YPQvNC10L3RgtCw0YbQuNGPJyxcbiAgICAnNTU4MjU0MDMwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiyDQs9GA0LDQtNC+0YHRgtGA0L7QuNGC0LXQu9GM0L3QvtCz0L4g0LfQvtC90LjRgNC+0LLQsNC90LjRjyAo0J/RgNCw0LLQuNC70LAg0LfQtdC80LvQtdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0Lgg0LfQsNGB0YLRgNC+0LnQutC4KScsXG4gICAgJzU1ODI1NDA0MDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0LDRhtC40Y8g0L/QviDQv9C70LDQvdC40YDQvtCy0LrQtSDRgtC10YDRgNC40YLQvtGA0LjQuCAo0L/RgNC+0LXQutGC0Ysg0LzQtdC20LXQstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC5KSwg0LIg0YIu0YcuINC00L7QutGD0LzQtdC90YIg0L/QviDQv9C70LDQvdC40YDQvtCy0LrQtSDRgtC10YDRgNC40YLQvtGA0LjQuCDQsiDQv9C70LDQvdC40YDRg9C10LzRi9GFINCz0YDQsNC90LjRhtCw0YUg0LjRgdC60YPRgdGB0YLQstC10L3QvdC+0LPQviDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG4gICAgJzU1ODI1NDA1MDAwMCc6ICfQmtC+0L/QuNGPINC/0YDQvtC10LrRgtCwINC80LXQttC10LLQsNC90LjRjyDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG4gICAgJzU1ODI1NDA2MDAwMCc6ICfQkNC60YIg0L7RgtCy0L7QtNCwINC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyINCyINC90LDRgtGD0YDQtScsXG4gICAgJzU1ODI1NDA3MDAwMCc6ICfQn9GA0L7QtdC60YIg0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcbiAgICAnNTU4MjU0MDgwMDAwJzogJ9Cf0YDQvtC10LrRgiAo0LrQvtC/0LjQuCDQvtGC0LTQtdC70YzQvdGL0YUg0YHQvtGB0YLQsNCy0L3Ri9GFINGH0LDRgdGC0LXQuSkg0L7RgNCz0LDQvdC40LfQsNGG0LjQuCDQuCDQt9Cw0YHRgtGA0L7QudC60Lgg0YLQtdGA0YDQuNGC0L7RgNC40Lkg0YHQsNC00L7QstC+0LTRh9C10YHQutC40YUsINC+0LPQvtGA0L7QtNC90LjRh9C10YHQutC40YUg0LjQu9C4INC00LDRh9C90YvRhSDQvdC10LrQvtC80LzQtdGA0YfQtdGB0LrQuNGFINC+0LHRitC10LTQuNC90LXQvdC40Lkg0LPRgNCw0LbQtNCw0L0nLFxuICAgICc1NTgyNTQwOTAwMDAnOiAn0J/RgNC+0LXQutGCICjQutC+0L/QuNC4INC+0YLQtNC10LvRjNC90YvRhSDRgdC+0YHRgtCw0LLQvdGL0YUg0YfQsNGB0YLQtdC5KSDQv9C10YDQtdGA0LDRgdC/0YDQtdC00LXQu9C10L3QuNGPINGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdGL0YUg0YPQs9C+0LTQuNC5INC4INC40L3Ri9GFINC30LXQvNC10LvRjCDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICc1NTgyNTQxMDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0L/RgNC10LTQstCw0YDQuNGC0LXQu9GM0L3QvtC8INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQuCDQvNC10YHRgiDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyJyxcbiAgICAnNTU4MjU0MTEwMDAwJzogJ9Ca0L7Qv9C40Y8g0YDQtdGI0LXQvdC40Y8g0L7QsdGJ0LXQs9C+INGB0L7QsdGA0LDQvdC40Y8g0YPRh9Cw0YHRgtC90LjQutC+0LIg0LTQvtC70LXQstC+0Lkg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Lgg0L3QsCDQt9C10LzQtdC70YzQvdGL0Lkg0YPRh9Cw0YHRgtC+0Log0LjQtyDQt9C10LzQtdC70Ywg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPINC+0LEg0YPRgtCy0LXRgNC20LTQtdC90LjQuCDQv9GA0L7QtdC60YLQsCDQvNC10LbQtdCy0LDQvdC40Y8g0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuICAgICc1NTgyNTQxMjAwMDAnOiAn0JrQvtC/0LjRjyDQtNC+0LrRg9C80LXQvdGC0LAsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC10LPQviDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40LUg0L/RgNC+0LXQutGC0LAg0LzQtdC20LXQstCw0L3QuNGPINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcbiAgICAnNTU4MjU0MTMwMDAwJzogJ9CS0L7Qt9GA0LDQttC10L3QuNGPINC30LDQuNC90YLQtdGA0LXRgdC+0LLQsNC90L3Ri9GFINC70LjRhiDQv9C+INC/0L7QstC+0LTRgyDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNGPINCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG4gICAgJzU1ODI1NDE0MDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDRgdCy0LjQtNC10YLQtdC70YzRgdGC0LLRg9GO0YnQuNC5INC+INGB0L3Rj9GC0LjQuCDQstC+0LfRgNCw0LbQtdC90LjQuSDQt9Cw0LjQvdGC0LXRgNC10YHQvtCy0LDQvdC90YvRhSDQu9C40YYg0L/QviDQv9C+0LLQvtC00YMg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjRjyDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuICAgICc1NTgyNTQxNTAwMDAnOiAn0KHRhdC10LzQsCDRgNCw0YHQv9C+0LvQvtC20LXQvdC40Y8g0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LIg0L3QsCDQutCw0LTQsNGB0YLRgNC+0LLRi9GFINC/0LvQsNC90LDRhSDQuNC70Lgg0LrQsNC00LDRgdGC0YDQvtCy0YvRhSDQutCw0YDRgtCw0YUg0YHQvtC+0YLQstC10YLRgdGC0LLRg9GO0YnQuNGFINGC0LXRgNGA0LjRgtC+0YDQuNC5JyxcbiAgICAnNTU4MjU0OTkwMDAwJzogJ9Cf0YDQvtGH0LjQtSDQtNC+0LrRg9C80LXQvdGC0YssINC+0L/RgNC10LTQtdC70Y/RjtGJ0LjQtSAo0L7Qv9GA0LXQtNC10LvRj9Cy0YjQuNC1KSDQsiDRgdC+0L7RgtCy0LXRgtGB0YLQstC40Lgg0YEg0LfQsNC60L7QvdC+0LTQsNGC0LXQu9GM0YHRgtCy0L7QvCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjQtSDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAgKNC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyKScsXG4gICAgJzU1ODI1NTAwMDAwMCc6ICfQmtCw0YDRgtC+0LPRgNCw0YTQuNGH0LXRgdC60LjQtSDQvNCw0YLQtdGA0LjQsNC70YsnLFxuICAgICc1NTgyNTYwMDAwMDAnOiAn0JzQsNGC0LXRgNC40LDQu9GLINC60LDRgNGC0L7Qs9GA0LDRhNC+LdCz0LXQvtC00LXQt9C40YfQtdGB0LrQvtCz0L4g0YTQvtC90LTQsCcsXG4gICAgJzU1ODI1NzAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0YssINGD0YHRgtCw0L3QsNCy0LvQuNCy0LDRjtGJ0LjQtSDQv9GA0LXQtNC10LvRjNC90YvQtSDQvNC40L3QuNC80LDQu9GM0L3Ri9C1INC4INC80LDQutGB0LjQvNCw0LvRjNC90YvQtSDRgNCw0LfQvNC10YDRiywg0YHQvtC+0YLQstC10YLRgdGC0LLRg9GO0YnQuNC1INCy0LjQtNGDINGA0LDQt9GA0LXRiNC10L3QvdC+0LPQviDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG4gICAgJzU1ODI1NzAxMDAwMCc6ICfQpNC10LTQtdGA0LDQu9GM0L3Ri9C5INC30LDQutC+0L0nLFxuICAgICc1NTgyNTcwMjAwMDAnOiAn0JfQsNC60L7QvSDRgdGD0LHRitC10LrRgtCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG4gICAgJzU1ODI1NzAzMDAwMCc6ICfQndC+0YDQvNCw0YLQuNCy0L3Ri9C5INC/0YDQsNCy0L7QstC+0Lkg0LDQutGCINC+0YDQs9Cw0L3QsCDQvNC10YHRgtC90L7Qs9C+INGB0LDQvNC+0YPQv9GA0LDQstC70LXQvdC40Y8nLFxuICAgICc1NTgyNTgwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0YHQvtC00LXRgNC20LDRidC40Lkg0LjQvdGE0L7RgNC80LDRhtC40Y4g0L4g0YDQsNC90LXQtSDQv9GA0LjRgdCy0L7QtdC90L3Ri9GFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvRhSDRg9GH0LXRgtC90YvRhSDQvdC+0LzQtdGA0LDRhSDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTgyNTkwMDAwMDAnOiAn0J/RgNC+0YLQvtC60L7QuyDQvtCx0YDQsNC30L7QstCw0L3QuNGPINC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcbiAgICAnNTU4MjYwMDAwMDAwJzogJ9Cn0LXRgNGC0LXQtiAo0LDQsdGA0LjRgSkg0L/QvtC80LXRidC10L3QuNGPJyxcbiAgICAnNTU4MjYxMDAwMDAwJzogJ9Cf0YDQvtC10LrRgtC90LDRjyDQtNC+0LrRg9C80LXQvdGC0LDRhtC40Y8g0LfQtNCw0L3QuNGPJyxcbiAgICAnNTU4MjYyMDAwMDAwJzogJ9Cf0YDQvtC10LrRgtC90LDRjyDQtNC+0LrRg9C80LXQvdGC0LDRhtC40Y8g0YHQvtC+0YDRg9C20LXQvdC40Y8nLFxuICAgICc1NTgyNjMwMDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0LrQvtC80LjRgdGB0LjQuCDQv9C+INGA0LDRgdGB0LzQvtGC0YDQtdC90LjRjiDRgdC/0L7RgNC+0LIg0L4g0YDQtdC30YPQu9GM0YLQsNGC0LDRhSDQvtC/0YDQtdC00LXQu9C10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0YHRgtC+0LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4MjY0MDAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INGB0YPQtNCwJyxcbiAgICAnNTU4Mjk5MDAwMDAwJzogJ9CY0L3QvtC5INC00L7QutGD0LzQtdC90YIsINGB0L7QtNC10YDQttCw0YnQuNC5INC+0L/QuNGB0LDQvdC40LUg0L7QsdGK0LXQutGC0LAnLFxuICAgICc1NTgzMDAwMDAwMDAnOiAn0JTQntCa0KPQnNCV0J3QotCrLCDQodCe0JTQldCg0JbQkNCp0JjQlSDQntCf0JjQodCQ0J3QmNCVINCX0JDQr9CS0JjQotCV0JvQryDQmNCb0Jgg0JXQk9CeINCf0KDQldCU0KHQotCQ0JLQmNCi0JXQm9CvJyxcbiAgICAnNTU4MzAxMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQtSDQv9C+0LvQvdC+0LzQvtGH0LjRjyDQv9GA0LXQtNGB0YLQsNCy0LjRgtC10LvRjycsXG4gICAgJzU1ODMwMTAxMDAwMCc6ICfQlNC+0LLQtdGA0LXQvdC90L7RgdGC0YwnLFxuICAgICc1NTgzMDEwMjAwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0YDQvtC20LTQtdC90LjQuCcsXG4gICAgJzU1ODMwMTAzMDAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQvtCxINGD0YHRi9C90L7QstC70LXQvdC40LgnLFxuICAgICc1NTgzMDEwNDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0YHRg9C00LAnLFxuICAgICc1NTgzMDEwNTAwMDAnOiAn0J7Qv9GA0LXQtNC10LvQtdC90LjQtSDRgdGD0LTQsCcsXG4gICAgJzU1ODMwMTA2MDAwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INC+0LEg0LjQt9Cx0YDQsNC90LjQuCAo0LXQtNC40L3QvtC70LjRh9C90L7Qs9C+INC40YHQv9C+0LvQvdC40YLQtdC70YzQvdC+0LPQviDQvtGA0LPQsNC90LAg0Y7RgNC40LTQuNGH0LXRgdC60L7Qs9C+INC70LjRhtCwKScsXG4gICAgJzU1ODMwMTA3MDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INC/0YDQvtGC0L7QutC+0LvQsCDQvtCxINC40LfQsdGA0LDQvdC40LggKNC10LTQuNC90L7Qu9C40YfQvdC+0LPQviDQuNGB0L/QvtC70L3QuNGC0LXQu9GM0L3QvtCz0L4g0L7RgNCz0LDQvdCwINGO0YDQuNC00LjRh9C10YHQutC+0LPQviDQu9C40YbQsCknLFxuICAgICc1NTgzMDEwODAwMDAnOiAn0J/RgNC40LrQsNC3INC+INC90LDQt9C90LDRh9C10L3QuNC4ICjRgNGD0LrQvtCy0L7QtNC40YLQtdC70Y8g0LjQu9C4INC40L3QvtCz0L4g0YPQv9C+0LvQvdC+0LzQvtGH0LXQvdC90L7Qs9C+INC70LjRhtCwKScsXG4gICAgJzU1ODMwMTA5MDAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtGA0LPQsNC90L7QsiDQvtC/0LXQutC4INC4INC/0L7Qv9C10YfQuNGC0LXQu9GM0YHRgtCy0LAnLFxuICAgICc1NTgzMDExMDAwMDAnOiAn0JTQvtCz0L7QstC+0YAg0LrQvtC80LzQtdGA0YfQtdGB0LrQvtCz0L4g0L/RgNC10LTRgdGC0LDQstC40YLQtdC70YzRgdGC0LLQsCcsXG4gICAgJzU1ODMwMTExMDAwMCc6ICfQlNC+0LPQvtCy0L7RgCDQtNC+0LLQtdGA0LjRgtC10LvRjNC90L7Qs9C+INGD0L/RgNCw0LLQu9C10L3QuNGPJyxcbiAgICAnNTU4MzAxMTIwMDAwJzogJ9Cf0L7RgdGC0LDQvdC+0LLQu9C10L3QuNC1INGB0YPQtNC10LHQvdC+0LPQviDQv9GA0LjRgdGC0LDQstCwLdC40YHQv9C+0LvQvdC40YLQtdC70Y8nLFxuICAgICc1NTgzMDExMzAwMDAnOiAn0J/RgNC+0YLQvtC60L7QuyDQvtCx0YnQtdCz0L4g0YHQvtCx0YDQsNC90LjRjycsXG4gICAgJzU1ODMwMTE0MDAwMCc6ICfQkNC60YIg0L7RgNCz0LDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQstC70LDRgdGC0Lgg0LjQu9C4INC+0YDQs9Cw0L3QsCDQvNC10YHRgtC90L7Qs9C+INGB0LDQvNC+0YPQv9GA0LDQstC70LXQvdC40Y8sINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0L/QvtC70L3QvtC80L7Rh9C40Y8g0L/RgNC10LTRgdGC0LDQstC40YLQtdC70Y8g0LfQsNGP0LLQuNGC0LXQu9GPJyxcbiAgICAnNTU4MzAxOTkwMDAwJzogJ9CY0L3QvtC5INC00L7QutGD0LzQtdC90YInLFxuICAgICc1NTg0MDAwMDAwMDAnOiAn0JTQntCa0KPQnNCV0J3QotCrINCeINCf0KDQkNCS0JDQpSwg0KHQlNCV0JvQmtCQ0KUsINCe0JPQoNCQ0J3QmNCn0JXQndCY0K/QpSAo0J7QkdCg0JXQnNCV0J3QldCd0JjQr9ClKScsXG4gICAgJzU1ODQwMTAwMDAwMCc6ICfQn9GA0LDQstC+0YPRgdGC0LDQvdCw0LLQu9C40LLQsNGO0YnQuNC1INC4INC/0YDQsNCy0L7Rg9C00L7RgdGC0L7QstC10YDRj9GO0YnQuNC1INC00L7QutGD0LzQtdC90YLRiycsXG4gICAgJzU1ODQwMTAxMDAwMCc6ICfQlNC+0LPQvtCy0L7RgNGLIC8g0YHQvtCz0LvQsNGI0LXQvdC40Y8nLFxuICAgICc1NTg0MDEwMTAxMDAnOiAn0KHQtNC10LvQutC4INC+0LEg0L7RgtGH0YPQttC00LXQvdC40LgnLFxuICAgICc1NTg0MDEwMTAxMDEnOiAn0JTQvtCz0L7QstC+0YAg0LrRg9C/0LvQuC3Qv9GA0L7QtNCw0LbQuCcsXG4gICAgJzU1ODQwMTAxMDEwMic6ICfQlNC+0LPQvtCy0L7RgCDQvNC10L3RiycsXG4gICAgJzU1ODQwMTAxMDEwMyc6ICfQlNC+0LPQvtCy0L7RgCDQtNCw0YDQtdC90LjRjycsXG4gICAgJzU1ODQwMTAxMDEwNCc6ICfQlNC+0LPQvtCy0L7RgCDRgNC10L3RgtGLJyxcbiAgICAnNTU4NDAxMDEwMTA1JzogJ9CU0L7Qs9C+0LLQvtGAINC/0L7QttC40LfQvdC10L3QvdC+0LPQviDRgdC+0LTQtdGA0LbQsNC90LjRjyDRgSDQuNC20LTQuNCy0LXQvdC40LXQvCcsXG4gICAgJzU1ODQwMTAxMDEwNic6ICfQlNC+0LPQvtCy0L7RgCDQv9GA0LjQstCw0YLQuNC30LDRhtC40LggKNC00L7Qs9C+0LLQvtGAINC/0LXRgNC10LTQsNGH0Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCyINGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtGMKScsXG4gICAgJzU1ODQwMTAxMDIwMCc6ICfQlNGA0YPQs9C40LUg0YHQtNC10LvQutC4JyxcbiAgICAnNTU4NDAxMDEwMjAxJzogJ9CU0L7Qs9C+0LLQvtGAINGD0YfQsNGB0YLQuNGPINCyINC00L7Qu9C10LLQvtC8INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstC1JyxcbiAgICAnNTU4NDAxMDEwMjAyJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0L7Qv9GA0LXQtNC10LvQtdC90LjQuCAo0L/QtdGA0LXRgNCw0YHQv9GA0LXQtNC10LvQtdC90LjQuCkg0LTQvtC70LXQuSDQsiDQv9GA0LDQstC1INC+0LHRidC10Lkg0LTQvtC70LXQstC+0Lkg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0LgnLFxuICAgICc1NTg0MDEwMTAyMDMnOiAn0JHRgNCw0YfQvdGL0Lkg0LTQvtCz0L7QstC+0YAnLFxuICAgICc1NTg0MDEwMTAyMDQnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDQvtGC0YHRgtGD0L/QvdC+0LwnLFxuICAgICc1NTg0MDEwMTAyMDUnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L4g0YDQsNC30LTQtdC70LUg0LjQvNGD0YnQtdGB0YLQstCwJyxcbiAgICAnNTU4NDAxMDEwMjA2JzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+INCy0YvQtNC10LvQtSDQtNC+0LvQuCcsXG4gICAgJzU1ODQwMTAxMDIwNyc6ICfQmNC90LLQtdGB0YLQuNGG0LjQvtC90L3Ri9C5INC00L7Qs9C+0LLQvtGAICjQtNC+0LPQvtCy0L7RgCDQvtCxINC40L3QstC10YHRgtC40YDQvtCy0LDQvdC40LgpJyxcbiAgICAnNTU4NDAxMDEwMjA4JzogJ9Cc0LjRgNC+0LLQvtC1INGB0L7Qs9C70LDRiNC10L3QuNC1JyxcbiAgICAnNTU4NDAxMDEwMjA5JzogJ9CU0L7Qs9C+0LLQvtGAINCw0YDQtdC90LTRiyAo0YHRg9Cx0LDRgNC10L3QtNGLKScsXG4gICAgJzU1ODQwMTAxMDIxMCc6ICfQlNC+0LPQvtCy0L7RgCDQvtCxINC40L/QvtGC0LXQutC1JyxcbiAgICAnNTU4NDAxMDEwMjExJzogJ9CU0L7Qs9C+0LLQvtGAINCx0LXQt9Cy0L7Qt9C80LXQt9C00L3QvtCz0L4g0YHRgNC+0YfQvdC+0LPQviDQv9C+0LvRjNC30L7QstCw0L3QuNGPINC30LXQvNC10LvRjNC90YvQvCDRg9GH0LDRgdGC0LrQvtC8JyxcbiAgICAnNTU4NDAxMDEwMjEyJzogJ9Ca0YDQtdC00LjRgtC90YvQuSDQtNC+0LPQvtCy0L7RgCcsXG4gICAgJzU1ODQwMTAxMDIxMyc6ICfQlNC+0LPQvtCy0L7RgCDQt9Cw0LnQvNCwJyxcbiAgICAnNTU4NDAxMDEwMjE0JzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INGB0LXRgNCy0LjRgtGD0YLQsCcsXG4gICAgJzU1ODQwMTAxMDIxNSc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINC40LfQvNC10L3QtdC90LjQuCDRgdC+0LTQtdGA0LbQsNC90LjRjyDQt9Cw0LrQu9Cw0LTQvdC+0LknLFxuICAgICc1NTg0MDEwMTAyMTYnOiAn0JTQvtC/0L7Qu9C90LjRgtC10LvRjNC90L7QtSDRgdC+0LPQu9Cw0YjQtdC90LjQtSAo0YHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDQuNC30LzQtdC90LXQvdC40Lgg0YPRgdC70L7QstC40Lkg0LTQvtCz0L7QstC+0YDQsCkg0Log0LTQvtCz0L7QstC+0YDRgycsXG4gICAgJzU1ODQwMTAxMDIxNyc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQviDRgNCw0YHRgtC+0YDQttC10L3QuNC4INC00L7Qs9C+0LLQvtGA0LAnLFxuICAgICc1NTg0MDEwMTAyMTgnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDRg9GB0YLRg9C/0LrQtSDQv9GA0LDQsiDRgtGA0LXQsdC+0LLQsNC90LjRjyDQv9C+INC00L7Qs9C+0LLQvtGA0YMgKNC00L7Qs9C+0LLQvtGAINC+INC/0LXRgNC10LTQsNGH0LUg0L/RgNCw0LIg0Lgg0L7QsdGP0LfQsNC90L3QvtGB0YLQtdC5KScsXG4gICAgJzU1ODQwMTAxMDIxOSc6ICfQlNC+0LPQvtCy0L7RgCDQv9GA0L7RgdGC0L7Qs9C+INGC0L7QstCw0YDQuNGJ0LXRgdGC0LLQsCAo0LTQvtCz0L7QstC+0YAg0L4g0YHQvtCy0LzQtdGB0YLQvdC+0Lkg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4KScsXG4gICAgJzU1ODQwMTAxMDIyMCc6ICfQk9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LrQvtC90YLRgNCw0LrRgicsXG4gICAgJzU1ODQwMTAxMDI5OSc6ICfQmNC90LDRjyDRgdC00LXQu9C60LAnLFxuICAgICc1NTg0MDEwMjAwMDAnOiAn0JDQutGC0Ysg0L7RgNCz0LDQvdC+0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCy0LvQsNGB0YLQuCDQuNC70Lgg0L7RgNCz0LDQvdC+0LIg0LzQtdGB0YLQvdC+0LPQviDRgdCw0LzQvtGD0L/RgNCw0LLQu9C10L3QuNGPJyxcbiAgICAnNTU4NDAxMDIwMTAwJzogJ9Ck0LXQtNC10YDQsNC70YzQvdGL0Lkg0LfQsNC60L7QvScsXG4gICAgJzU1ODQwMTAyMDIwMCc6ICfQo9C60LDQtyDQn9GA0LXQt9C40LTQtdC90YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuICAgICc1NTg0MDEwMjAzMDAnOiAn0J/QvtGB0YLQsNC90L7QstC70LXQvdC40LUg0J/RgNCw0LLQuNGC0LXQu9GM0YHRgtCy0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4JyxcbiAgICAnNTU4NDAxMDIwNDAwJzogJ9CX0LDQutC+0L0gKNC30LDQutC+0L3RiyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgsINGB0YPQsdGK0LXQutGC0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4KScsXG4gICAgJzU1ODQwMTAyMDUwMCc6ICfQlNC+0LrRg9C80LXQvdGCINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuICAgICc1NTg0MDEwMjA2MDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtCx0YDQsNC30L7QstCw0L3QuNC4INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcbiAgICAnNTU4NDAxMDIwNzAwJzogJ9CQ0LrRgiDQvtCxINGD0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDRgdC10YDQstC40YLRg9GC0LAnLFxuICAgICc1NTg0MDEwMjA4MDAnOiAn0JDQutGCINC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pJyxcbiAgICAnNTU4NDAxMDI5OTAwJzogJ9CY0L3Ri9C1INCw0LrRgtGLINC+0YDQs9Cw0L3QvtCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQstC70LDRgdGC0Lgg0LjQu9C4INC+0YDQs9Cw0L3QvtCyINC80LXRgdGC0L3QvtCz0L4g0YHQsNC80L7Rg9C/0YDQsNCy0LvQtdC90LjRjycsXG4gICAgJzU1ODQwMTAzMDAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQv9GA0LDQstC1INC90LAg0L3QsNGB0LvQtdC00YHRgtCy0L4nLFxuICAgICc1NTg0MDEwMzAxMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0L/RgNCw0LLQtSDQvdCwINC90LDRgdC70LXQtNGB0YLQstC+INC/0L4g0LfQsNC60L7QvdGDJyxcbiAgICAnNTU4NDAxMDMwMjAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INC/0YDQsNCy0LUg0L3QsCDQvdCw0YHQu9C10LTRgdGC0LLQviDQv9C+INC30LDQstC10YnQsNC90LjRjicsXG4gICAgJzU1ODQwMTA0MDAwMCc6ICfQktGB0YLRg9C/0LjQstGI0LjQtSDQsiDRgdC40LvRgyDRgdGD0LTQtdCx0L3Ri9C1INCw0LrRgtGLJyxcbiAgICAnNTU4NDAxMDQwMTAwJzogJ9Ch0YPQtNC10LHQvdGL0Lkg0LDQutGCLCDRg9GB0YLQsNC90LDQstC70LjQstCw0Y7RidC40Lkg0LfQsNC/0YDQtdGCINC90LAg0YHQvtCy0LXRgNGI0LXQvdC40LUg0LTQtdC50YHRgtCy0LjQuSDQsiDRgdGE0LXRgNC1INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDRg9GH0LXRgtCwINCyINC+0YLQvdC+0YjQtdC90LjQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTg0MDEwNDAyMDAnOiAn0KHRg9C00LXQsdC90YvQuSDQsNC60YIg0L4g0LLQvtGB0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQsNC90L3Rg9C70LjRgNC+0LLQsNC90L3Ri9GFINC4INC40YHQutC70Y7Rh9C10L3QvdGL0YUg0LjQtyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDRgdCy0LXQtNC10L3QuNC5INC+0LEg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4NDAxMDQwMzAwJzogJ9Ch0YPQtNC10LHQvdGL0Lkg0LDQutGCINC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INC+0LHRgNC10LzQtdC90LXQvdC40Y8gKNC+0LPRgNCw0L3QuNGH0LXQvdC40LgpINCyINC40YHQv9C+0LvRjNC30L7QstCw0L3QuNC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCAgKNGH0LDRgdGC0Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4KScsXG4gICAgJzU1ODQwMTA0OTkwMCc6ICfQmNC90YvQtSDQv9GA0LXQtNGD0YHQvNC+0YLRgNC10L3QvdGL0LUg0LfQsNC60L7QvdC+0LTQsNGC0LXQu9GM0YHRgtCy0L7QvCDRgdGD0LTQtdCx0L3Ri9C1INCw0LrRgtGLJyxcbiAgICAnNTU4NDAxMDUwMDAwJzogJ9CQ0LrRgtGLICjRgdCy0LjQtNC10YLQtdC70YzRgdGC0LLQsCkg0L4g0L/RgNCw0LLQsNGFINC90LAg0L7QsdGK0LXQutGC0Ysg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4NDAxMDUwMTAwJzogJ9Cg0LXQs9C40YHRgtGA0LDRhtC40L7QvdC90L7QtSDRg9C00L7RgdGC0L7QstC10YDQtdC90LjQtScsXG4gICAgJzU1ODQwMTA1MDIwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQv9GA0LDQstC1INC90LAg0LfQtdC80LvRjicsXG4gICAgJzU1ODQwMTA1MDMwMCc6ICfQk9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LDQutGCINC+INC/0YDQsNCy0LUg0L3QsCDQt9C10LzQu9GOJyxcbiAgICAnNTU4NDAxMDUwNDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INC/0YDQsNCy0LUg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0LgnLFxuICAgICc1NTg0MDEwNTk5MDAnOiAn0JjQvdGL0LUg0LDQutGC0YssINGB0LLQuNC00LXRgtC10LvRjNGB0YLQstCwINC+INC/0YDQsNCy0LDRhSDQvdCwINC+0LHRitC10LrRgtGLINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG4gICAgJzU1ODQwMTA2MDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0Ysg0L3QsCDQstC90L7QstGMINCy0L7Qt9Cy0LXQtNC10L3QvdGL0LkgKNGA0LXQutC+0L3RgdGC0YDRg9C40YDQvtCy0LDQvdC90YvQuSkg0L7QsdGK0LXQutGCJyxcbiAgICAnNTU4NDAxMDYwMTAwJzogJ9Cg0LDQt9GA0LXRiNC10L3QuNC1INC90LAg0LLQstC+0LQg0L7QsdGK0LXQutGC0LAg0LIg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNGOJyxcbiAgICAnNTU4NDAxMDYwMjAwJzogJ9Cg0LDQt9GA0LXRiNC10L3QuNC1INC90LAg0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0L4nLFxuICAgICc1NTg0MDEwNjAzMDAnOiAn0JDQutGCINCy0LLQvtC00LAg0LIg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNGOJyxcbiAgICAnNTU4NDAxMDYwNDAwJzogJ9Ca0L7Qv9C40Y8g0YDQtdGI0LXQvdC40Y8g0L4g0YHQvtC30LTQsNC90LjQuCDQuNGB0LrRg9GB0YHRgtCy0LXQvdC90L7Qs9C+INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcbiAgICAnNTU4NDAxMDcwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiyDQv9GA0Lgg0YPQv9GA0L7RidC10L3QvdC+0Lwg0L/QvtGA0Y/QtNC60LUg0L7RhNC+0YDQvNC70LXQvdC40Y8g0L/RgNCw0LIg0LPRgNCw0LbQtNCw0L0g0L3QsCDQvtGC0LTQtdC70YzQvdGL0LUg0L7QsdGK0LXQutGC0Ysg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuICAgICc1NTg0MDEwNzAxMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQv9C+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0Lkg0LrQvdC40LPQuCDQviDQvdCw0LvQuNGH0LjQuCDRgyDQs9GA0LDQttC00LDQvdC40L3QsCDQv9GA0LDQstCwINC90LAg0LfQtdC80LXQu9GM0L3Ri9C5INGD0YfQsNGB0YLQvtC6JyxcbiAgICAnNTU4NDAxMDcwMjAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L/QsNGB0L/QvtGA0YIg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4JyxcbiAgICAnNTU4NDAxMDcwMzAwJzogJ9CU0LXQutC70LDRgNCw0YbQuNGPINC+0LEg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuICAgICc1NTg0MDEwODAwMDAnOiAn0J/RgNC+0YfQuNC1INC/0YDQsNCy0L7Rg9GB0YLQsNC90LDQstC70LjQstCw0Y7RidC40LUg0LTQvtC60YPQvNC10L3RgtGLJyxcbiAgICAnNTU4NDAxMDgwMTAwJzogJ9Cf0LXRgNC10LTQsNGC0L7Rh9C90YvQuSDQsNC60YInLFxuICAgICc1NTg0MDEwODAyMDAnOiAn0KDQsNC30LTQtdC70LjRgtC10LvRjNC90YvQuSDQsdCw0LvQsNC90YEnLFxuICAgICc1NTg0MDEwODAzMDAnOiAn0J/Qu9Cw0L0g0L/RgNC40LLQsNGC0LjQt9Cw0YbQuNC4JyxcbiAgICAnNTU4NDAxMDgwNDAwJzogJ9Cf0YDQsNCy0LjQu9CwINC00L7QstC10YDQuNGC0LXQu9GM0L3QvtCz0L4g0YPQv9GA0LDQstC70LXQvdC40Y8nLFxuICAgICc1NTg0MDEwODA1MDAnOiAn0JDQutGCINC+0L/QuNGB0Lgg0Lgg0LDRgNC10YHRgtCwINC40LzRg9GJ0LXRgdGC0LLQsCcsXG4gICAgJzU1ODQwMTA4MDYwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INC+INCy0YvQtNC10LvQtSDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDQsiDRgdGH0LXRgiDQt9C10LzQtdC70YzQvdC+0Lkg0LTQvtC70LgnLFxuICAgICc1NTg0MDEwODA3MDAnOiAn0J/RgNC+0YLQvtC60L7QuyDQvtCx0YnQtdCz0L4g0YHQvtCx0YDQsNC90LjRjyDRgdC+0LHRgdGC0LLQtdC90L3QuNC60L7QsiDQv9C+0LzQtdGJ0LXQvdC40Lkg0LIg0LzQvdC+0LPQvtC60LLQsNGA0YLQuNGA0L3QvtC8INC00L7QvNC1JyxcbiAgICAnNTU4NDAxMDgwODAwJzogJ9Ce0YLQutCw0Lcg0L7QtNCw0YDRj9C10LzQvtCz0L4g0L/RgNC40L3Rj9GC0Ywg0LTQsNGAICjQvtGC0LrQsNC3INC+0YIg0LTQsNGA0LApJyxcbiAgICAnNTU4NDAxMDgwOTAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+INC90L7QstCw0YbQuNC4JyxcbiAgICAnNTU4NDAxMDgxMDAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+INGA0LDQt9C00LXQu9C1INC90LDRgdC70LXQtNGB0YLQstC10L3QvdC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuICAgICc1NTg0MDEwODExMDAnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDRg9C/0LvQsNGC0LUg0LDQu9C40LzQtdC90YLQvtCyJyxcbiAgICAnNTU4NDAxMDgxMjAwJzogJ9CU0L7QutGD0LzQtdC90YIsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0L3QsNC70LjRh9C40LUsINCy0L7Qt9C90LjQutC90L7QstC10L3QuNC1LCDQv9C10YDQtdGF0L7QtCDQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKSDQstC10YnQvdC+0LPQviDQv9GA0LDQstCwINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQsiDQv9C+0LvRjNC30YMg0LfQsNGP0LLQuNGC0LXQu9GPJyxcbiAgICAnNTU4NDAxMDg5OTAwJzogJ9CY0L3QvtC5INC00L7QutGD0LzQtdC90YInLFxuICAgICc1NTg0MDIwMDAwMDAnOiAn0KHQntCf0KPQotCh0KLQktCj0K7QqdCY0JUg0Jgg0JTQntCf0J7Qm9Cd0JjQotCV0JvQrNCd0KvQlSDQlNCe0JrQo9Cc0JXQndCi0KsnLFxuICAgICc1NTg0MDIwMTAwMDAnOiAn0KHQvtCz0LvQsNGB0LjQtSDRgdGD0L/RgNGD0LPQsCDQvdCwINGB0L7QstC10YDRiNC10L3QuNC1INGB0LTQtdC70LrQuCcsXG4gICAgJzU1ODQwMjAyMDAwMCc6ICfQodC+0LPQu9Cw0YHQuNC1INC+0YDQs9Cw0L3QvtCyINC+0L/QtdC60Lgg0Lgg0L/QvtC/0LXRh9C40YLQtdC70YzRgdGC0LLQsCcsXG4gICAgJzU1ODQwMjAzMDAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQt9Cw0LrQu9GO0YfQtdC90LjQuCDQsdGA0LDQutCwJyxcbiAgICAnNTU4NDAyMDQwMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INGA0LDRgdGC0L7RgNC20LXQvdC40Lgg0LHRgNCw0LrQsCcsXG4gICAgJzU1ODQwMjA1MDAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0LTQvtCx0YDQtdC90LjQuCAo0L4g0YHQvtCy0LXRgNGI0LXQvdC40LgpINGB0LTQtdC70LrQuCcsXG4gICAgJzU1ODQwMjA2MDAwMCc6ICfQodC/0YDQsNCy0LrQsCDQviDRgdGC0L7QuNC80L7RgdGC0LggKNGB0L/RgNCw0LLQutCwINC+INGB0L7QvtGC0L3QvtGI0LXQvdC40Lgg0YHRgtC+0LjQvNC+0YHRgtC4INC+0YLRh9GD0LbQtNCw0LXQvNC+0LPQviDQvtCx0YrQtdC60YLQsCDQuCDQsdCw0LvQsNC90YHQvtCy0L7QuSDRgdGC0L7QuNC80L7RgdGC0Lgg0LjQvNGD0YnQtdGB0YLQstCwINC40LvQuCDQsNC60YLQuNCy0L7QsiDRhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC+0LHRidC10YHRgtCy0LApJyxcbiAgICAnNTU4NDAyMDcwMDAwJzogJ9Ch0L/RgNCw0LLQutCwINC+INC30LDQuNC90YLQtdGA0LXRgdC+0LLQsNC90L3Ri9GFINC70LjRhtCw0YUg0LIg0YHQtNC10LvQutC1JyxcbiAgICAnNTU4NDAyMDgwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0LTQvtC80L7QstC+0Lkg0LrQvdC40LPQuCAo0YHQstC10LTQtdC90LjRjyDQviDQu9C40YbQsNGFLCDRgdC+0YXRgNCw0L3Rj9GO0YnQuNGFINC/0YDQsNCy0L4g0L/RgNC+0LbQuNCy0LDQvdC40Y8g0LIg0LbQuNC70L7QvCDQv9C+0LzQtdGJ0LXQvdC40Lgg0L/QvtGB0LvQtSDQv9C10YDQtdGF0L7QtNCwINC/0YDQsNCy0LAg0L3QsCDQvdC10LPQviknLFxuICAgICc1NTg0MDIwOTAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQu9C40YbQtdCy0L7Qs9C+INGB0YfQtdGC0LAgKNGB0LLQtdC00LXQvdC40Y8g0L4g0LvQuNGG0LDRhSwg0YHQvtGF0YDQsNC90Y/RjtGJ0LjRhSDQv9GA0LDQstC+INC/0YDQvtC20LjQstCw0L3QuNGPINCyINC20LjQu9C+0Lwg0L/QvtC80LXRidC10L3QuNC4INC/0L7RgdC70LUg0L/QtdGA0LXRhdC+0LTQsCDQv9GA0LDQstCwINC90LAg0L3QtdCz0L4pJyxcbiAgICAnNTU4NDAyMTAwMDAwJzogJ9Cf0YDQvtGC0L7QutC+0Lsg0L4g0YDQtdC30YPQu9GM0YLQsNGC0LDRhSDRgtC+0YDQs9C+0LInLFxuICAgICc1NTg0MDIxMTAwMDAnOiAn0JvQuNGG0LXQvdC30LjRjyAo0LvQuNGG0LXQvdC30LjRjyDQvdCwINC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNC1INC+0L/RgNC10LTQtdC70LXQvdC90YvRhSDQstC40LTQvtCyINC00LXRj9GC0LXQu9GM0L3QvtGB0YLQuCknLFxuICAgICc1NTg0MDIxMjAwMDAnOiAn0J/RgNC+0LXQutGC0L3QsNGPINC00LXQutC70LDRgNCw0YbQuNGPJyxcbiAgICAnNTU4NDAyMTMwMDAwJzogJ9Ce0YLQutCw0Lcg0L7RgiDQv9GA0LXQuNC80YPRidC10YHRgtCy0LXQvdC90L7Qs9C+INC/0YDQsNCy0LAg0L/QvtC60YPQv9C60LggKNC00LvRjyDRg9GH0LDRgdGC0L3QuNC60L7QsiDQtNC+0LvQtdCy0L7QuSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCwg0LTQu9GPINGB0YPQsdGK0LXQutGC0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC/0YDQuCDQv9GA0L7QtNCw0LbQtSDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDQuNC3INGB0L7RgdGC0LDQstCwINC30LXQvNC10LvRjCDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8pJyxcbiAgICAnNTU4NDAyMTQwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INGB0L7Qt9C00LDQvdC40Lgg0Y7RgNC40LTQuNGH0LXRgdC60L7Qs9C+INC70LjRhtCwJyxcbiAgICAnNTU4NDAyMTUwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INGA0LXQvtGA0LPQsNC90LjQt9Cw0YbQuNC4INGO0YDQuNC00LjRh9C10YHQutC+0LPQviDQu9C40YbQsCcsXG4gICAgJzU1ODQwMjE2MDAwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQu9C40LrQstC40LTQsNGG0LjQuCDRjtGA0LjQtNC40YfQtdGB0LrQvtCz0L4g0LvQuNGG0LAnLFxuICAgICc1NTg0MDIxNzAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDRg9GC0LLQtdGA0LbQtNC10L3QuNC4INC+0YbQtdC90LrQuCDQuNC80YPRidC10YHRgtCy0LAgKNGA0LXRiNC10L3QuNC1INC+0LEg0YPRgtCy0LXRgNC20LTQtdC90LjQuCDQvtGG0LXQvdC60Lgg0L3QtdC00LXQvdC10LbQvdGL0YUg0LLQutC70LDQtNC+0LIg0LIg0YPRgdGC0LDQstC90YvQuSDQutCw0L/QuNGC0LDQuyDQvtCx0YnQtdGB0YLQstCwKScsXG4gICAgJzU1ODQwMjE4MDAwMCc6ICfQmNGB0L/QvtC70L3QuNGC0LXQu9GM0L3Ri9C5INC70LjRgdGCJyxcbiAgICAnNTU4NDAyMTkwMDAwJzogJ9CU0L7Qs9C+0LLQvtGAINC/0L7RgNGD0YfQtdC90LjRjycsXG4gICAgJzU1ODQwMjIwMDAwMCc6ICfQkdGD0YXQs9Cw0LvRgtC10YDRgdC60LjQuSDQsdCw0LvQsNC90YEnLFxuICAgICc1NTg0MDIyMTAwMDAnOiAn0JfQsNC60LvQsNC00L3QsNGPJyxcbiAgICAnNTU4NDAyMjIwMDAwJzogJ9CU0L7QsdCw0LLQvtGH0L3Ri9C5INC70LjRgdGCINC6INC30LDQutC70LDQtNC90L7QuScsXG4gICAgJzU1ODQwMjIzMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INGA0LXQtdGB0YLRgNCwINC80YPQvdC40YbQuNC/0LDQu9GM0L3QvtC5INGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4JyxcbiAgICAnNTU4NDAyMjQwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0YDQtdC10YHRgtGA0LAg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Lgg0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuICAgICc1NTg0MDIyNTAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDRgNC10LXRgdGC0YDQsCDRhNC10LTQtdGA0LDQu9GM0L3QvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcbiAgICAnNTU4NDAyMjYwMDAwJzogJ9CW0LjQu9C40YnQvdGL0Lkg0YHQtdGA0YLQuNGE0LjQutCw0YInLFxuICAgICc1NTg0MDIyNzAwMDAnOiAn0JDRg9C00LjRgtC+0YDRgdC60L7QtSDQt9Cw0LrQu9GO0YfQtdC90LjQtScsXG4gICAgJzU1ODQwMjI4MDAwMCc6ICfQntGC0YfQtdGCINC+INC/0YDQvtCy0LXQtNC10L3QuNC4INC90LXQt9Cw0LLQuNGB0LjQvNC+0Lkg0L7RhtC10L3QutC4ICjQsNC60YIg0L7RhtC10L3QutC4KScsXG4gICAgJzU1ODQwMjM5MDAwMCc6ICfQkNC60YIg0LjQvdCy0LXQvdGC0LDRgNC40LfQsNGG0LjQuCcsXG4gICAgJzU1ODQwMjQwMDAwMCc6ICfQntGF0YDQsNC90L3QvtC1INC+0LHRj9C30LDRgtC10LvRjNGB0YLQstC+INGB0L7QsdGB0YLQstC10L3QvdC40LrQsCDQvtCx0YrQtdC60YLQsCDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8nLFxuICAgICc1NTg0MDI5OTAwMDAnOiAn0JjQvdC+0Lkg0LTQvtC60YPQvNC10L3RgicsXG4gICAgJzU1ODQwMzAwMDAwMCc6ICfQlNCe0JrQo9Cc0JXQndCi0KssINCh0J7QlNCV0KDQltCQ0KnQmNCVINCh0JLQldCU0JXQndCY0K8g0JXQk9Cg0J8nLFxuICAgICc1NTg0MDMwMTAwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LLQsCcsXG4gICAgJzU1ODQwMzAyMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQviDQv9GA0LDQstCw0YUg0L3QsCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuICAgICc1NTg0MDMwMzAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0L4g0L/QtdGA0LXRhdC+0LTQtSDQv9GA0LDQsiDQvdCwINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG4gICAgJzU1ODQwMzA0MDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQviDQv9GA0LDQstCw0YUg0L7RgtC00LXQu9GM0L3QvtCz0L4g0LvQuNGG0LAg0L3QsCDQuNC80LXRjtGJ0LjQtdGB0Y8g0YMg0L3QtdCz0L4g0L7QsdGK0LXQutGC0Ysg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuICAgICc1NTg0MDMwNTAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0L4g0L/RgNC40LfQvdCw0L3QuNC4INC/0YDQsNCy0L7QvtCx0LvQsNC00LDRgtC10LvRjyDQvdC10LTQtdC10YHQv9C+0YHQvtCx0L3Ri9C8INC40LvQuCDQvtCz0YDQsNC90LjRh9C10L3QvdC+INC00LXQtdGB0L/QvtGB0L7QsdC90YvQvCcsXG4gICAgJzU1ODQwMzA2MDAwMCc6ICfQodC/0YDQsNCy0LrQsCDQviDRgdC+0LTQtdGA0LbQsNC90LjQuCDQv9GA0LDQstC+0YPRgdGC0LDQvdCw0LLQu9C40LLQsNGO0YnQuNGFINC00L7QutGD0LzQtdC90YLQvtCyINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcbiAgICAnNTU4NDAzMDcwMDAwJzogJ9Ch0L/RgNCw0LLQutCwINC+INC70LjRhtCw0YUsINC/0L7Qu9GD0YfQuNCy0YjQuNGFINGB0LLQtdC00LXQvdC40Y8g0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG4gICAgJzU1ODQwMzA4MDAwMCc6ICfQmtC+0L/QuNC4INC00L7Qs9C+0LLQvtGA0L7QsiDQuCDQuNC90YvRhSDQtNC+0LrRg9C80LXQvdGC0L7Qsiwg0LLRi9GA0LDQttCw0Y7RidC40YUg0YHQvtC00LXRgNC20LDQvdC40LUg0L7QtNC90L7RgdGC0L7RgNC+0L3QvdC40YUg0YHQtNC10LvQvtC6LCDRgdC+0LLQtdGA0YjQtdC90L3Ri9GFINCyINC/0YDQvtGB0YLQvtC5INC/0LjRgdGM0LzQtdC90L3QvtC5INGE0L7RgNC80LUnLFxuICAgICc1NTg0MDMwOTAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQldCT0KDQnyDQviDQv9GA0LjQvdGP0YLQuNC4INC90LAg0YPRh9GR0YIg0LHQtdGB0YXQvtC30Y/QudC90L7Qs9C+INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcbiAgICAnNTU4NDAzMTAwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0JXQk9Cg0J8g0L4g0L/RgNC40L3Rj9GC0LjQuCDQvdCwINGD0YfRkdGCINCx0LXRgdGF0L7Qt9GP0LnQvdC+0LPQviDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCwg0L7RgiDQv9GA0LDQstCwINGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4INC90LAg0LrQvtGC0L7RgNGL0Lkg0YHQvtCx0YHRgtCy0LXQvdC90LjQuiDQvtGC0LrQsNC30LDQu9GB0Y8nLFxuICAgICc1NTg0MDMxMTAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQldCT0KDQnyDQviDQsdC10YHRhdC+0LfRj9C50L3QvtC8INC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwLCDQv9GA0LjQvdGP0YLQvtC8INC90LAg0YPRh9GR0YInLFxuICAgICc1NTg0MDMxMjAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQtdC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8LCDRg9C00L7RgdGC0L7QstC10YDRj9GO0YnQsNGPINC/0YDQvtCy0LXQtNC10L3QuNC1INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INCy0L7Qt9C90LjQutC90L7QstC10L3QuNGPINC4ICjQuNC70LgpINC/0LXRgNC10YXQvtC00LAg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4nLFxuICAgICc1NTg0MDM5OTAwMDAnOiAn0JjQvdC+0Lkg0LTQvtC60YPQvNC10L3RgicsXG4gICAgJzU1ODQwNDAwMDAwMCc6ICfQodC+0LPQu9Cw0YjQtdC90LjRjyDQuCDRgdC+0LPQu9Cw0YHQuNGPINC+0LEg0L7QsdGA0LDQt9C+0LLQsNC90LjQuCDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG4gICAgJzU1ODQwNDAxMDAwMCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQviDRgNCw0LfQtNC10LvQtSwg0L7QsSDQvtCx0YrQtdC00LjQvdC10L3QuNC4LCDQviDQv9C10YDQtdGA0LDRgdC/0YDQtdC00LXQu9C10L3QuNC4INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyINC40LvQuCDQviDQstGL0LTQtdC70LUg0LjQtyDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG4gICAgJzU1ODQwNDAyMDAwMCc6ICfQodC+0LPQu9Cw0YHQuNC1INC90LAg0L7QsdGA0LDQt9C+0LLQsNC90LjQtSDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG4gICAgJzU1ODQwNDAzMDAwMCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINC+0LHRgNCw0LfQvtCy0LDQvdC40Lgg0L7QsdGJ0LXQuSDQtNC+0LvQtdCy0L7QuSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDQvdCwINC30LXQvNC10LvRjNC90YvQuSDRg9GH0LDRgdGC0L7Quiwg0L7QsdGA0LDQt9GD0LXQvNGL0Lkg0L/RgNC4INCy0YvQtNC10LvQtSDQtdCz0L4g0LIg0YHRh9C10YIg0LfQtdC80LXQu9GM0L3QvtC5INC00L7Qu9C4INC40LvQuCDQt9C10LzQtdC70YzQvdGL0YUg0LTQvtC70LXQuScsXG4gICAgJzU1ODQwNDA0MDAwMCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINC+0LHRgNCw0LfQvtCy0LDQvdC40Lgg0L7QsdGJ0LXQuSDRgdC+0LLQvNC10YHRgtC90L7QuSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDQvdCwINC30LXQvNC10LvRjNC90YvQuSDRg9GH0LDRgdGC0L7Quiwg0L7QsdGA0LDQt9GD0LXQvNGL0Lkg0L/RgNC4INCy0YvQtNC10LvQtSDQtdCz0L4g0LIg0YHRh9C10YIg0LfQtdC80LXQu9GM0L3QvtC5INC00L7Qu9C4INC40LvQuCDQt9C10LzQtdC70YzQvdGL0YUg0LTQvtC70LXQuScsXG4gICAgJzU1ODQwNTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0YssINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40LUg0LLQvtC30L3QuNC60L3QvtCy0LXQvdC40LUg0L/RgNCw0LLQsCDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAg0LIg0YHQuNC70YMg0YTQtdC00LXRgNCw0LvRjNC90L7Qs9C+INC30LDQutC+0L3QsCDQstC90LUg0LfQsNCy0LjRgdC40LzQvtGB0YLQuCDQvtGCINC80L7QvNC10L3RgtCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INGN0YLQvtCz0L4g0L/RgNCw0LLQsCDQsiDQldCT0KDQnycsXG4gICAgJzU1ODQwNTAxMDAwMCc6ICfQmtC+0L/QuNGPINGA0LXRiNC10L3QuNGPINC+INCx0LXQt9Cy0L7Qt9C80LXQt9C00L3QvtC5INC/0LXRgNC10LTQsNGH0LUg0LLQvtC10L3QvdC+0LPQviDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCDQuNC3INGE0LXQtNC10YDQsNC70YzQvdC+0Lkg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Lgg0LIg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Ywg0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LggLSDQs9C+0YDQvtC00LAg0YTQtdC00LXRgNCw0LvRjNC90L7Qs9C+INC30L3QsNGH0LXQvdC40Y8g0JzQvtGB0LrQstGLINC40LvQuCDQodCw0L3QutGCLdCf0LXRgtC10YDQsdGD0YDQs9CwINC70LjQsdC+INC80YPQvdC40YbQuNC/0LDQu9GM0L3Rg9GOINGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtGMJyxcbiAgICAnNTU4NDA1MDIwMDAwJzogJ9Cf0L7QtNC70LjQvdC90LjQuiDQuNC70Lgg0LrQvtC/0LjRjyDQv9C40YHRjNC80LAg0L7RgNCz0LDQvdCwINC40YHQv9C+0LvQvdC40YLQtdC70YzQvdC+0Lkg0LLQu9Cw0YHRgtC4INGB0YPQsdGK0LXQutGC0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4IC0g0LPQvtGA0L7QtNCwINGE0LXQtNC10YDQsNC70YzQvdC+0LPQviDQt9C90LDRh9C10L3QuNGPINCc0L7RgdC60LLRiyDQuNC70Lgg0KHQsNC90LrRgi3Qn9C10YLQtdGA0LHRg9GA0LPQsCDQu9C40LHQviDQvtGA0LPQsNC90LAg0LzQtdGB0YLQvdC+0LPQviDRgdCw0LzQvtGD0L/RgNCw0LLQu9C10L3QuNGPINC80YPQvdC40YbQuNC/0LDQu9GM0L3QvtCz0L4g0L7QsdGA0LDQt9C+0LLQsNC90LjRjyDQviDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40Lgg0LPRgNCw0L3QuNGGINC+0LHRgNCw0LfRg9C10LzQvtCz0L4g0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAg0YEg0L/RgNC40LvQvtC20LXQvdC40LXQvCDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC90L7Qs9C+INC/0YDQvtC10LrRgtCwINCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDQsiDRgdC70YPRh9Cw0LUsINC10YHQu9C4INCw0LrRgiDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40Y8g0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwINC90LUg0LfQsNCy0LXRgNC10L0g0L/QvtC00L/QuNGB0YzRjiDRg9C/0L7Qu9C90L7QvNC+0YfQtdC90L3QvtCz0L4g0LTQvtC70LbQvdC+0YHRgtC90L7Qs9C+INC70LjRhtCwINGB0L7QvtGC0LLQtdGC0YHRgtCy0YPRjtGJ0LXQs9C+INC+0YDQs9Cw0L3QsCcsXG4gICAgJzU1ODQwNTAzMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC40LfRitGP0YLQuNC4INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyINC4ICjQuNC70LgpINGA0LDRgdC/0L7Qu9C+0LbQtdC90L3Ri9GFINC90LAg0L3QuNGFINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAg0LIg0YbQtdC70Y/RhSDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtC70LjQvNC/0LjQudGB0LrQuNGFINC+0LHRitC10LrRgtC+0LInLFxuICAgICc1NTg0MDUwNDAwMDAnOiAn0JrQvtC/0LjRjyDQsNC60YLQsCDQv9GA0LjQtdC80LAt0L/QtdGA0LXQtNCw0YfQuCDQvtCx0YrQtdC60YLQvtCyINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwLCDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LrQvtGC0L7RgNGL0YUg0L/RgNC40L3Rj9GC0L4g0YDQtdGI0LXQvdC40LUg0L7QsSDQuNC30YrRj9GC0LjQuCDQsiDRhtC10LvRj9GFINGA0LDQt9C80LXRidC10L3QuNGPINC+0LvQuNC80L/QuNC50YHQutC40YUg0L7QsdGK0LXQutGC0L7QsicsXG4gICAgJzU1ODQwNTk5MDAwMCc6ICfQmNC90YvQtSDQtNC+0LrRg9C80LXQvdGC0YssINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40LUg0LLQvtC30L3QuNC60L3QvtCy0LXQvdC40LUg0L/RgNCw0LLQsCDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAg0LIg0YHQuNC70YMg0YTQtdC00LXRgNCw0LvRjNC90L7Qs9C+INC30LDQutC+0L3QsCDQstC90LUg0LfQsNCy0LjRgdC40LzQvtGB0YLQuCDQvtGCINC80L7QvNC10L3RgtCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INGN0YLQvtCz0L4g0L/RgNCw0LLQsCDQsiDQldCT0KDQnycsXG4gICAgJzU1ODUwMDAwMDAwMCc6ICfQoNC10YjQtdC90LjRjywg0YPQstC10LTQvtC80LvQtdC90LjRjywg0YDQsNGB0L/QuNGB0LrQuCcsXG4gICAgJzU1ODUwMTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0Ysg0L4g0YDQtdC30YPQu9GM0YLQsNGC0LDRhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0YPRh9GR0YLQsCcsXG4gICAgJzU1ODUwMTAxMDAwMCc6ICfQoNCV0KjQldCd0JjQrycsXG4gICAgJzU1ODUwMTAxMDEwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INC30LDQv9GA0LDRiNC40LLQsNC10LzRi9GFINGB0LLQtdC00LXQvdC40LknLFxuICAgICc1NTg1MDEwMTAyMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INC+0YjQuNCx0LrQuCcsXG4gICAgJzU1ODUwMTAxMDMwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4JyxcbiAgICAnNTU4NTAxMDEwNDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC4INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L7RiNC40LHQvtC6JyxcbiAgICAnNTU4NTAxMDEwNTAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNC4INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L/RgNC+0YbQtdC00YPRgNGLJyxcbiAgICAnNTU4NTAxMDEwNjAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC/0YDQuNC+0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQvtGB0YPRidC10YHRgtCy0LvQtdC90LjRjyDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INC/0YDQvtGG0LXQtNGD0YDRiycsXG4gICAgJzU1ODUwMTAxMDcwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDRgdC90Y/RgtC40Lgg0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QuNGPJyxcbiAgICAnNTU4NTAxMDEwODAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INGB0L3Rj9GC0LjQuCDRgSDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0YPRh9GR0YLQsCDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsiDRgdC+INGB0YLQsNGC0YPRgdC+0LwgwqvQstGA0LXQvNC10L3QvdGL0LXCuyDQv9C+INC30LDRj9Cy0LvQtdC90LjRjiDQt9Cw0LjQvdGC0LXRgNC10YHQvtCy0LDQvdC90L7Qs9C+INC70LjRhtCwJyxcbiAgICAnNTU4NTAxMDEwOTAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINCy0YvQtNCw0YfQtSDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0L/QsNGB0L/QvtGA0YLQsCcsXG4gICAgJzU1ODUwMTAxMTAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNC4INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L/RgNC+0YbQtdC00YPRgNGLJyxcbiAgICAnNTU4NTAxMDExMTAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0LDQvdC90YPQu9C40YDQvtCy0LDQvdC40Lgg0LrQsNC00LDRgdGC0YDQvtCy0YvRhSDRgdCy0LXQtNC10L3QuNC5JyxcbiAgICAnNTU4NTAxMDExMjAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgtC60LvQvtC90LXQvdC40Lgg0LfQsNGP0LLQu9C10L3QuNGPINC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCcsXG4gICAgJzU1ODUwMTAxMTMwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INC30LDQv9C40YHQuCDQviDQvdCw0LvQuNGH0LjQuCDQstC+0LfRgNCw0LbQtdC90LjRjycsXG4gICAgJzU1ODUwMTAxMTQwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQv9C+0LPQsNGI0LXQvdC40Lgg0LfQsNC/0LjRgdC4INC+INC90LDQu9C40YfQuNC4INCy0L7Qt9GA0LDQttC10L3QuNGPJyxcbiAgICAnNTU4NTAxMDExNTAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LfQsNC/0LjRgdC4INC+INC30LDRj9Cy0LvQtdC90LjQuCDQviDQvdC10LLQvtC30LzQvtC20L3QvtGB0YLQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCcsXG4gICAgJzU1ODUwMTAxMTYwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQv9C+0LPQsNGI0LXQvdC40Lgg0LfQsNC/0LjRgdC4INC+INC30LDRj9Cy0LvQtdC90LjQuCDQviDQvdC10LLQvtC30LzQvtC20L3QvtGB0YLQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCcsXG4gICAgJzU1ODUwMTAyMDAwMCc6ICfQo9CS0JXQlNCe0JzQm9CV0J3QmNCvJyxcbiAgICAnNTU4NTAxMDIwMTAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQvtGC0YHRg9GC0YHRgtCy0LjQuCDQsiDQk9Ca0J0g0LfQsNC/0YDQsNGI0LjQstCw0LXQvNGL0YUg0YHQstC10LTQtdC90LjQuScsXG4gICAgJzU1ODUwMTAyMDIwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgdGD0YnQtdGB0YLQstC70ZHQvdC90L7QvCDQutCw0LTQsNGB0YLRgNC+0LLQvtC8INGD0YfRkdGC0LUnLFxuICAgICc1NTg1MDEwMjAzMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQv9GA0LjQtdC80LUg0LTQvtC60YPQvNC10L3RgtC+0LIg0LTQu9GPINCy0L3QtdGB0LXQvdC40Y8g0LIg0JXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAg0L7QsdGK0LXQutGC0L7QsiDQutCw0L/QuNGC0LDQu9GM0L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAgKNC00LDQu9C10LUgLSDQldC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCkg0YHQstC10LTQtdC90LjQuSDQvtCxINCe0JrQoScsXG4gICAgJzU1ODUwMTAyMDQwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC/0YDQuNC10LzQtSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQtNC70Y8g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjRjyDQuNC3INCV0LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINGB0LLQtdC00LXQvdC40Lkg0L7QsSDQntCa0KEnLFxuICAgICc1NTg1MDEwMjA1MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINGD0YHRgtGA0LDQvdC10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4INCyINGB0LLQtdC00LXQvdC40Y/RhSDQk9Ca0J0nLFxuICAgICc1NTg1MDEwMjA2MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQstGL0LTQsNGH0LUg0YHQstC10LTQtdC90LjQuSDQvtCxINCe0JrQoScsXG4gICAgJzU1ODUwMTAyMDcwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INC/0YDQuNC+0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQvtGB0YPRidC10YHRgtCy0LvQtdC90LjRjyDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INC/0YDQvtGG0LXQtNGD0YDRiycsXG4gICAgJzU1ODUwMTAyMDgwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNC4INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L/RgNC+0YbQtdC00YPRgNGLJyxcbiAgICAnNTU4NTAxMDIwOTAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQstCwJyxcbiAgICAnNTU4NTAxMDIxMDAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QuNC4INC/0YDQuNC90Y/RgtC40Y8g0L3QsCDRg9GH0ZHRgiDQuNC80YPRidC10YHRgtCy0LAg0LIg0LrQsNGH0LXRgdGC0LLQtSDQsdC10YHRhdC+0LfRj9C50L3QvtCz0L4nLFxuICAgICc1NTg1MDEwMjExMDAnOiAn0KHQvtC+0LHRidC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC/0YDQuNC90Y/RgtC40Lgg0L3QsCDRg9GH0ZHRgiDQuNC80YPRidC10YHRgtCy0LAg0LIg0LrQsNGH0LXRgdGC0LLQtSDQsdC10YHRhdC+0LfRj9C50L3QvtCz0L4nLFxuICAgICc1NTg1MDEwMjEyMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDRgdC90Y/RgtC40Lgg0YEg0YPRh9GR0YLQsCDQuNC80YPRidC10YHRgtCy0LAg0LIg0LrQsNGH0LXRgdGC0LLQtSDQsdC10YHRhdC+0LfRj9C50L3QvtCz0L4nLFxuICAgICc1NTg1MDEwMjEzMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQstC+0LfQstGA0LDRgtC1INC30LDRj9Cy0LvQtdC90LjRjyDQviDQvdCw0LvQuNGH0LjQuCDQstC+0LfRgNCw0LbQtdC90LjRjyDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LfQsNGA0LXQs9C40YHRgtGA0LjRgNC+0LLQsNC90L3QvtCz0L4g0L/RgNCw0LLQsCDQvdCwINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LHQtdC3INGA0LDRgdGB0LzQvtGC0YDQtdC90LjRjycsXG4gICAgJzU1ODUwMTAzMDAwMCc6ICfQn9Cg0J7Qp9CY0JUnLFxuICAgICc1NTg1MDEwMzAxMDAnOiAn0KDQsNGB0L/QuNGB0LrQsCDQsiDQv9C+0LvRg9GH0LXQvdC40Lgg0YHQvtC+0YLQstC10YLRgdGC0LLRg9GO0YnQuNGFINC00L7QutGD0LzQtdC90YLQvtCyINC00LvRjyDQv9GA0L7QstC10LTQtdC90LjRjyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0YPRh9GR0YLQsCcsXG4gICAgJzU1ODUwMTAzMDIwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INC/0YDQvtCy0LXRgNC60Lgg0LTQvtC60YPQvNC10L3RgtC+0LInLFxuICAgICc1NTg1MDEwMzAzMDAnOiAn0JDQutGCINC+0L/RgNC10LTQtdC70LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDRgdGC0L7QuNC80L7RgdGC0Lgg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuICAgICc1NTg1MDEwMzA0MDAnOiAn0J/RgNC+0YLQvtC60L7QuyDQstGL0Y/QstC70LXQvdC40Y8g0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60LgnLFxuICAgICc1NTg1MDEwMzA1MDAnOiAn0JDQutGCINC+0L/RgNC10LTQtdC70LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDRgdGC0L7QuNC80L7RgdGC0Lgg0L7QsdGK0LXQutGC0L7QsiDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuICAgICc1NTg1MDEwMzk5MDAnOiAn0JjQvdGL0LUg0LTQvtC60YPQvNC10L3RgtGLJyxcbiAgICAnNTU4NTAyMDAwMDAwJzogJ9CU0J7QmtCj0JzQldCd0KLQqyDQniDQoNCV0JfQo9Cb0KzQotCQ0KLQkNClINCg0JXQk9CY0KHQotCg0JDQptCY0Jgg0J/QoNCQ0JInLFxuICAgICc1NTg1MDIwMTAwMDAnOiAn0KPQktCV0JTQntCc0JvQldCd0JjQrywg0KHQntCe0JHQqdCV0J3QmNCvJyxcbiAgICAnNTU4NTAyMDEwMTAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QuNC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCyJyxcbiAgICAnNTU4NTAyMDEwMjAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0L/RgNC10LrRgNCw0YnQtdC90LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQsicsXG4gICAgJzU1ODUwMjAxMDMwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INC30LDRgNC10LPQuNGB0YLRgNC40YDQvtCy0LDQvdC90YvRhSDQvtCz0YDQsNC90LjRh9C10L3QuNGP0YUgKNC+0LHRgNC10LzQtdC90LXQvdC40Y/RhSkg0L/RgNCw0LInLFxuICAgICc1NTg1MDIwMTA0MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INC40LfQvNC10L3QtdC90LjQuSDQsiDQldCT0KDQnycsXG4gICAgJzU1ODUwMjAxMDUwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCDQsiDQt9Cw0L/QuNGB0Y/RhSDQtdC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8JyxcbiAgICAnNTU4NTAyMDEwNjAwJzogJ9Ch0L7QvtCx0YnQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQsicsXG4gICAgJzU1ODUwMjAxMDcwMCc6ICfQodC+0L7QsdGJ0LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5INC40Lcg0JXQk9Cg0J8nLFxuICAgICc1NTg1MDIwMTA4MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINC+0YLRgdGD0YLRgdGC0LLQuNC4INCyINCV0JPQoNCfINC30LDQv9GA0LDRiNC40LLQsNC10LzRi9GFINGB0LLQtdC00LXQvdC40LknLFxuICAgICc1NTg1MDIwMTA5MDAnOiAn0KHQvtC+0LHRidC10L3QuNC1INC+INC/0YDQuNGR0LzQtSDQt9Cw0Y/QstC70LXQvdC40Y8g0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LLQsCwg0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjykg0L/RgNCw0LLQsCDQvdCwINC/0YDQtdC00L/RgNC40Y/RgtC40LUsINGB0LTQtdC70LrQuCDRgSDQvdC40LwnLFxuICAgICc1NTg1MDIwMTEwMDAnOiAn0KHQvtC+0LHRidC10L3QuNC1INC+INC/0L7RgdGC0YPQv9C70LXQvdC40Lgg0LTQvtC60YPQvNC10L3RgtC+0LIg0L3QsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGD0Y4g0YDQtdCz0LjRgdGC0YDQsNGG0LjRjiDQtNC+0LPQvtCy0L7RgNC+0LIg0LzQtdC90Ysg0LggKNC40LvQuCkg0L/QtdGA0LXRhdC+0LTQsCDQv9GA0LDQstCwJyxcbiAgICAnNTU4NTAyMDExMTAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LLQvtC30LLRgNCw0YLQtSDQv9GA0LjQu9C+0LbQtdC90L3Ri9GFINC6INC30LDRj9Cy0LvQtdC90LjRjiDQtNC+0LrRg9C80LXQvdGC0L7QsiDQsdC10Lcg0YDQsNGB0YHQvNC+0YLRgNC10L3QuNGPJyxcbiAgICAnNTU4NTAyMDExMjAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNC10LrRgNCw0YnQtdC90LjRjyDQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKScsXG4gICAgJzU1ODUwMjAxMTMwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgtGB0YPRgtGB0YLQstC40Lgg0YHQstC10LTQtdC90LjQuSDQviDQu9C40YbQsNGFLCDQv9C+0LvRg9GH0LjQstGI0LjRhSDRgdCy0LXQtNC10L3QuNGPINC+0LEg0L7QsdGK0LXQutGC0LDRhSDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG4gICAgJzU1ODUwMjAxMTQwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCy0LAg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Lgg0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0LjQu9C4INC80YPQvdC40YbQuNC/0LDQu9GM0L3QvtCz0L4g0L7QsdGA0LDQt9C+0LLQsNC90LjRjyDQvdCwINC30LXQvNC10LvRjNC90YvQuSDRg9GH0LDRgdGC0L7QuiDQuNC70Lgg0LfQtdC80LXQu9GM0L3Rg9GOINC00L7Qu9GOINCy0YHQu9C10LTRgdGC0LLQuNC1INC+0YLQutCw0LfQsCDQvtGCINGB0L7QvtGC0LLQtdGC0YHRgtCy0YPRjtGJ0LXQs9C+INC/0YDQsNCy0LAg0L/RgNCw0LLQvtC+0LHQu9Cw0LTQsNGC0LXQu9C10LwnLFxuICAgICc1NTg1MDIwMTE1MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQv9C+0YHRgtGD0L/Qu9C10L3QuNC4INGA0LXRiNC10L3QuNGPINGB0YPQtNCwLCDQstGB0YLRg9C/0LjQstGI0LXQs9C+INCyINC30LDQutC+0L3QvdGD0Y4g0YHQuNC70YMsINGBINGD0LrQsNC30LDQvdC40LXQvCDRgdGA0L7QutCwINC+0LrQvtC90YfQsNC90LjRjyDQvtGB0YPRidC10YHRgtCy0LvQtdC90LjRjyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQsiwg0LIg0YHQu9GD0YfQsNC1INC10YHQu9C4INC+0YLQutCw0Lcg0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LIg0L/RgNC40LfQvdCw0L0g0YHRg9C00L7QvCDQvdC10L7QsdC+0YHQvdC+0LLQsNC90L3Ri9C8JyxcbiAgICAnNTU4NTAyMDExNjAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQuNC30LzQtdC90LXQvdC40Lkg0LIg0LXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCDQsiDRgdCy0Y/Qt9C4INGBINC40LfQvNC10L3QtdC90LjQtdC8INGB0L7QtNC10YDQttCw0YnQuNGF0YHRjyDQsiDQsdCw0LfQvtCy0YvRhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0YUg0LjQvdGE0L7RgNC80LDRhtC40L7QvdC90YvRhSDRgNC10YHRg9GA0YHQsNGFINGB0LLQtdC00LXQvdC40Lkg0L4g0L/RgNCw0LLQvtC+0LHQu9Cw0LTQsNGC0LXQu9C1ICjQv9GA0LDQstC+0L7QsdC70LDQtNCw0YLQtdC70Y/RhSknLFxuICAgICc1NTg1MDIwMTE3MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQstC+0LfQstGA0LDRgtC1INC00L7QutGD0LzQtdC90YLQvtCyINCx0LXQtyDRgNCw0YHRgdC80L7RgtGA0LXQvdC40Y8g0L/RgNC4INC+0YLQutCw0LfQtSDQsiDQvtGB0YPRidC10YHRgtCy0LvQtdC90LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0YPRh9C10YLQsCcsXG4gICAgJzU1ODUwMjAyMDAwMCc6ICfQn9Cg0J7Qp9CY0JUnLFxuICAgICc1NTg1MDIwMjAxMDAnOiAn0KDQsNGB0L/QuNGB0LrQsCDQsiDQv9C+0LvRg9GH0LXQvdC40Lgg0LTQvtC60YPQvNC10L3RgtC+0LIg0L3QsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGD0Y4g0YDQtdCz0LjRgdGC0YDQsNGG0LjRjiDQv9GA0LDQsicsXG4gICAgJzU1ODUwMjAyOTkwMCc6ICfQmNC90L7QuSDQtNC+0LrRg9C80LXQvdGCJyxcbiAgICAnNTU4NjAxMDAwMDAwJzogJ9Cg0LDRgdC/0LjRgdC60LAg0LIg0L/QvtC70YPRh9C10L3QuNC4INC40LfQstC10YnQtdC90LjQuSDQviDQv9GA0L7QstC10LTQtdC90LjQuCDRgdC+0LHRgNCw0L3QuNGPINC+INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQuCDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNGPINCz0YDQsNC90LjRhicsXG4gICAgJzU1ODYwMjAwMDAwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INCy0YDRg9GH0LXQvdC40Lgg0LjQt9Cy0LXRidC10L3QuNGPINC+INC/0YDQvtCy0LXQtNC10L3QuNC4INGB0L7QsdGA0LDQvdC40Y8g0L4g0YHQvtCz0LvQsNGB0L7QstCw0L3QuNC4INC80LXRgdGC0L7Qv9C+0LvQvtC20LXQvdC40Y8g0LPRgNCw0L3QuNGGJyxcbiAgICAnNTU4NjAzMDAwMDAwJzogJ9Ca0L7Qv9C40Y8g0YHRgtGA0LDQvdC40YbRiyDQv9C10YfQsNGC0L3QvtCz0L4g0LjQt9C00LDQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQtdC5INC40LfQstC10YnQtdC90LjQtSDQviDQv9GA0L7QstC10LTQtdC90LjQuCDRgdC+0LHRgNCw0L3QuNGPINC+INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQuCDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNGPINCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCwg0LLQutC70Y7Rh9Cw0Y8g0L/QtdGA0LLRi9C5INC70LjRgdGCLCDRgdC+0LTQtdGA0LbQsNGJ0LXQs9C+INGA0LXQutCy0LjQt9C40YLRiyDRgtCw0LrQvtCz0L4g0L/QtdGH0LDRgtC90L7Qs9C+INC40LfQtNCw0L3QuNGPJyxcbiAgICAnNTU4Njk5MDAwMDAwJzogJ9CY0L3Ri9C1INC00L7QutGD0LzQtdC90YLRiywg0YHQstC40LTQtdGC0LXQu9GM0YHRgtCy0YPRjtGJ0LjQtSDQviDRgdC+0LHQu9GO0LTQtdC90LjQuCDRg9GB0YLQsNC90L7QstC70LXQvdC90L7Qs9C+INC/0L7RgNGP0LTQutCwINC40LfQstC10YnQtdC90LjRjyDQt9Cw0LjQvdGC0LXRgNC10YHQvtCy0LDQvdC90YvRhSDQu9C40YYg0L4g0L/RgNC+0LLQtdC00LXQvdC40Lgg0YHQvtCx0YDQsNC90LjRjyDQviDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40Lgg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjRjyDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnXG59O1xuLy/QotC10YDRgNC40YLQvtGA0LjQsNC70YzQvdGL0LUg0LfQvtC90Ysg0Lgg0LfQvtC90Ysg0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC5XG52YXIgZFpvbmUgPSB7XG4gICAgJzIxODAxMDAwMDAwMCc6ICfQotC10YDRgNC40YLQvtGA0LjQsNC70YzQvdGL0LUg0LfQvtC90YsnLFxuICAgICcyMTgwMTAwMTAwMDAnOiAn0JbQuNC70LDRjyDQt9C+0L3QsCcsXG4gICAgJzIxODAxMDAyMDAwMCc6ICfQntCx0YnQtdGB0YLQstC10L3QvdC+LdC00LXQu9C+0LLQsNGPINC30L7QvdCwJyxcbiAgICAnMjE4MDEwMDMwMDAwJzogJ9Cf0YDQvtC40LfQstC+0LTRgdGC0LLQtdC90L3QsNGPINC30L7QvdCwLCDQt9C+0L3QsCDQuNC90LbQtdC90LXRgNC90L7QuSDQuCDRgtGA0LDQvdGB0L/QvtGA0YLQvdC+0Lkg0LjQvdGE0YDQsNGB0YLRgNGD0LrRgtGD0YAnLFxuICAgICcyMTgwMTAwNDAwMDAnOiAn0JfQvtC90LAg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPJyxcbiAgICAnMjE4MDEwMDUwMDAwJzogJ9CX0L7QvdCwINGA0LXQutGA0LXQsNGG0LjQvtC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcyMTgwMTAwNjAwMDAnOiAn0JfQvtC90LAg0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80YvRhSDRgtC10YDRgNC40YLQvtGA0LjQuScsXG4gICAgJzIxODAxMDA3MDAwMCc6ICfQl9C+0L3QsCDRgdC/0LXRhtC40LDQu9GM0L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcyMTgwMTAwODAwMDAnOiAn0JfQvtC90LAg0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LLQvtC10L3QvdGL0YUg0L7QsdGK0LXQutGC0L7QsicsXG4gICAgJzIxODAxMDA5MDAwMCc6ICfQmNC90LDRjyDQt9C+0L3QsCcsXG4gICAgJzIxODAyMDAwMDAwMCc6ICfQl9C+0L3RiyDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LgnLFxuICAgICcyMTgwMjAwMTAwMDAnOiAn0JfQvtC90Ysg0L7RhdGA0LDQvdGLINC/0YDQuNGA0L7QtNC90YvRhSDQvtCx0YrQtdC60YLQvtCyJyxcbiAgICAnMjE4MDIwMDEwMDAxJzogJ9Ci0LXRgNGA0LjRgtC+0YDQuNGPINC+0YHQvtCx0L4g0L7RhdGA0LDQvdGP0LXQvNC+0LPQviDQv9GA0LjRgNC+0LTQvdC+0LPQviDQvtCx0YrQtdC60YLQsCcsXG4gICAgJzIxODAyMDAxMDAwMic6ICfQntGF0YDQsNC90L3QsNGPINC30L7QvdCwINC+0YHQvtCx0L4g0L7RhdGA0LDQvdGP0LXQvNC+0LPQviDQv9GA0LjRgNC+0LTQvdC+0LPQviDQvtCx0YrQtdC60YLQsCcsXG4gICAgJzIxODAyMDAxMDAwMyc6ICfQktC+0LTQvtC+0YXRgNCw0L3QvdCw0Y8g0LfQvtC90LAnLFxuICAgICcyMTgwMjAwMTAwMDQnOiAn0J/RgNC40LHRgNC10LbQvdCw0Y8g0LfQsNGJ0LjRgtC90LDRjyDQv9C+0LvQvtGB0LAnLFxuICAgICcyMTgwMjAwMTAwMDUnOiAn0JfQvtC90LAg0YHQsNC90LjRgtCw0YDQvdC+0Lkg0L7RhdGA0LDQvdGLINC40YHRgtC+0YfQvdC40LrQvtCyINCy0L7QtNC+0YHQvdCw0LHQttC10L3QuNGPINC4INCy0L7QtNC+0L/RgNC+0LLQvtC00L7QsiDQv9C40YLRjNC10LLQvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcyMTgwMjAwMTAwMDYnOiAn0J7RgdC+0LHQviDRhtC10L3QvdGL0LUg0LfQtdC80LvQuCcsXG4gICAgJzIxODAyMDAyMDAwMCc6ICfQl9C+0L3RiyDQvtGF0YDQsNC90Ysg0LjRgdC60YPRgdGB0YLQstC10L3QvdGL0YUg0L7QsdGK0LXQutGC0L7QsicsXG4gICAgJzIxODAyMDAyMDAwMSc6ICfQotC10YDRgNC40YLQvtGA0LjRjyDQvtCx0YrQtdC60YLQsCDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8nLFxuICAgICcyMTgwMjAwMjAwMDInOiAn0JfQvtC90LAg0L7RhdGA0LDQvdGLINC+0LHRitC10LrRgtCwINC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNGB0LvQtdC00LjRjycsXG4gICAgJzIxODAyMDAyMDAwMyc6ICfQntGF0YDQsNC90L3QsNGPINC30L7QvdCwINCz0LXQvtC00LXQt9C40YfQtdGB0LrQvtCz0L4g0L/Rg9C90LrRgtCwJyxcbiAgICAnMjE4MDIwMDIwMDA0JzogJ9Ce0YXRgNCw0L3QvdCw0Y8g0LfQvtC90LAg0YHRgtCw0YbQuNC+0L3QsNGA0L3QvtCz0L4g0L/Rg9C90LrRgtCwINC90LDQsdC70Y7QtNC10L3QuNC5INC30LAg0YHQvtGB0YLQvtGP0L3QuNC10Lwg0L7QutGA0YPQttCw0Y7RidC10Lkg0L/RgNC40YDQvtC00L3QvtC5INGB0YDQtdC00YsnLFxuICAgICcyMTgwMjAwMjAwMDUnOiAn0J7RhdGA0LDQvdC90LDRjyDQt9C+0L3QsCDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG4gICAgJzIxODAyMDAyMDAwNic6ICfQntGF0YDQsNC90L3QsNGPINC30L7QvdCwINC40L3QttC10L3QtdGA0L3Ri9GFINC60L7QvNC80YPQvdC40LrQsNGG0LjQuScsXG4gICAgJzIxODAyMDAyMDAwNyc6ICfQntGF0YDQsNC90L3QsNGPINC30L7QvdCwINC70LjQvdC40Lkg0Lgg0YHQvtC+0YDRg9C20LXQvdC40Lkg0YHQstGP0LfQuCDQuCDQu9C40L3QuNC5INC4INGB0L7QvtGA0YPQttC10L3QuNC5INGA0LDQtNC40L7RhNC40LrQsNGG0LjQuCcsXG4gICAgJzIxODAyMDAyMDAwOCc6ICfQn9GA0LjQtNC+0YDQvtC20L3QsNGPINC/0L7Qu9C+0YHQsCcsXG4gICAgJzIxODAyMDAzMDAwMCc6ICfQl9C+0L3RiyDQt9Cw0YnQuNGC0Ysg0L3QsNGB0LXQu9C10L3QuNGPJyxcbiAgICAnMjE4MDIwMDMwMDAxJzogJ9CX0LDQv9GA0LXRgtC90LDRjyDQt9C+0L3QsCDQv9GA0Lgg0LLQvtC10L3QvdC+0Lwg0YHQutC70LDQtNC1JyxcbiAgICAnMjE4MDIwMDMwMDAyJzogJ9CX0LDQv9GA0LXRgtC90YvQuSDRgNCw0LnQvtC9INC/0YDQuCDQstC+0LXQvdC90L7QvCDRgdC60LvQsNC00LUnLFxuICAgICcyMTgwMjAwMzAwMDMnOiAn0JfQsNCz0YDRj9C30L3QtdC90L3Ri9C1INC30LXQvNC70LgnLFxuICAgICcyMTgwMjAwMzAwMDQnOiAn0J7RhdGA0LDQvdC90LDRjyDQt9C+0L3QsCDQt9Cw0LPRgNGP0LfQvdC10L3QvdGL0YUg0LfQtdC80LXQu9GMJyxcbiAgICAnMjE4MDIwMDMwMDA1JzogJ9Ch0LDQvdC40YLQsNGA0L3Qvi3Qt9Cw0YnQuNGC0L3QsNGPINC30L7QvdCwINC/0YDQtdC00L/RgNC40Y/RgtC40LksINGB0L7QvtGA0YPQttC10L3QuNC5INC4INC40L3Ri9GFINC+0LHRitC10LrRgtC+0LInLFxuICAgICcyMTgwMjAwMzAwMDYnOiAn0KHQsNC90LjRgtCw0YDQvdGL0Lkg0YDQsNC30YDRi9CyICjRgdCw0L3QuNGC0LDRgNC90LDRjyDQv9C+0LvQvtGB0LAg0L7RgtGH0YPQttC00LXQvdC40Y8pJyxcbiAgICAnMjE4MDIwMDMwMDA3JzogJ9CX0L7QvdCwINC+0LPRgNCw0L3QuNGH0LXQvdC40Y8g0L7RgiDQv9C10YDQtdC00LDRjtGJ0LXQs9C+INGA0LDQtNC40L7RgtC10YXQvdC40YfQtdGB0LrQvtCz0L4g0L7QsdGK0LXQutGC0LAnLFxuICAgICcyMTgwMjAwMzAwMDgnOiAn0KDQsNC50L7QvSDQv9Cw0LTQtdC90LjRjyDQvtGC0LTQtdC70Y/RjtGJ0LjRhdGB0Y8g0YfQsNGB0YLQtdC5INGA0LDQutC10YInLFxuICAgICcyMTgwMjAwNDAwMDAnOiAn0J/RgNC+0YfQuNC1INC30L7QvdGLINGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuCcsXG4gICAgJzIxODAyMDA0MDAwMSc6ICfQl9C+0L3QsCDQv9GD0LHQu9C40YfQvdC+0LPQviDRgdC10YDQstC40YLRg9GC0LAnLFxuICAgICcyMTgwMjAwNDAwMDInOiAn0JfQvtC90LAg0YDQtdC30LXRgNCy0LjRgNC+0LLQsNC90LjRjyDQt9C10LzQtdC70YwnLFxuICAgICcyMTgwMjAwNDAwMDMnOiAn0JPQvtGA0L3Ri9C5INC+0YLQstC+0LQnLFxuICAgICcyMTgwMjAwNDAwMDQnOiAn0J/RgNC40LPQvtGA0L7QtNC90LDRjyDQt9C+0L3QsCcsXG4gICAgJzIxODAyMDA0MDAwNSc6ICfQl9C10LvQtdC90LDRjyDQt9C+0L3QsCcsXG4gICAgJzIxODAyMDA0MDAwNic6ICfQntGB0L7QsdCw0Y8g0Y3QutC+0L3QvtC80LjRh9C10YHQutCw0Y8g0LfQvtC90LAnLFxuICAgICcyMTgwMjAwNDAwMDcnOiAn0J/QvtCz0YDQsNC90LjRh9C90LDRjyDQt9C+0L3QsCcsXG4gICAgJzIxODAyMDA0MDAwOCc6ICfQotC10YDRgNC40YLQvtGA0LjRjyDRgtGA0LDQtNC40YbQuNC+0L3QvdC+0LPQviDQv9GA0LjRgNC+0LTQvtC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8nLFxuICAgICcyMTgwMjAwNTAwMDAnOiAn0JjQvdGL0LUg0LfQvtC90Ysg0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC4JyxcbiAgICAnMjE4MDIwMDUwMDAxJzogJ9CY0L3QsNGPINC30L7QvdCwINGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuCdcbn07XG4vLyDQmtC70LDRgdGB0LjRhNC40LrQsNGC0L7RgCDQstC40LTQvtCyINC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINC30LXQvNC10LvRjFxudmFyIGRVdGlsaXphdGlvbnMgPSB7XG4gICAgJzE0MTAwMDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8g0Lgg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90YvRhSDRg9Cz0L7QtNC40LknLFxuICAgICcxNDEwMDEwMDAwMDAnOiAn0JTQu9GPINGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0LPQviDQv9GA0L7QuNC30LLQvtC00YHRgtCy0LAnLFxuICAgICcxNDEwMDEwMTAwMDAnOiAn0JTQu9GPINC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINCyINC60LDRh9C10YHRgtCy0LUg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90YvRhSDRg9Cz0L7QtNC40LknLFxuICAgICcxNDEwMDEwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC30LTQsNC90LjQuSwg0YHRgtGA0L7QtdC90LjQuSwg0YHQvtC+0YDRg9C20LXQvdC40LksINC40YHQv9C+0LvRjNC30YPQtdC80YvRhSDQtNC70Y8g0L/RgNC+0LjQt9Cy0L7QtNGB0YLQstCwLCDRhdGA0LDQvdC10L3QuNGPINC4INC/0LXRgNCy0LjRh9C90L7QuSDQv9C10YDQtdGA0LDQsdC+0YLQutC4INGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0Lkg0L/RgNC+0LTRg9C60YbQuNC4JyxcbiAgICAnMTQxMDAxMDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQstC90YPRgtGA0LjRhdC+0LfRj9C50YHRgtCy0LXQvdC90YvRhSDQtNC+0YDQvtCzINC4INC60L7QvNC80YPQvdC40LrQsNGG0LjQuScsXG4gICAgJzE0MTAwMTA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LLQvtC00L3Ri9GFINC+0LHRitC10LrRgtC+0LInLFxuICAgICcxNDEwMDIwMDAwMDAnOiAn0JTQu9GPINCy0LXQtNC10L3QuNGPINC60YDQtdGB0YLRjNGP0L3RgdC60L7Qs9C+ICjRhNC10YDQvNC10YDRgdC60L7Qs9C+KSDRhdC+0LfRj9C50YHRgtCy0LAnLFxuICAgICcxNDEwMDMwMDAwMDAnOiAn0JTQu9GPINCy0LXQtNC10L3QuNGPINC70LjRh9C90L7Qs9C+INC/0L7QtNGB0L7QsdC90L7Qs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG4gICAgJzE0MTAwNDAwMDAwMCc6ICfQlNC70Y8g0LLQtdC00LXQvdC40Y8g0LPRgNCw0LbQtNCw0L3QsNC80Lgg0YHQsNC00L7QstC+0LTRgdGC0LLQsCDQuCDQvtCz0L7RgNC+0LTQvdC40YfQtdGB0YLQstCwJyxcbiAgICAnMTQxMDA1MDAwMDAwJzogJ9CU0LvRjyDQstC10LTQtdC90LjRjyDQs9GA0LDQttC00LDQvdCw0LzQuCDQttC40LLQvtGC0L3QvtCy0L7QtNGB0YLQstCwJyxcbiAgICAnMTQxMDA2MDAwMDAwJzogJ9CU0LvRjyDQtNCw0YfQvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCcsXG4gICAgJzE0MTAwNzAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LTRgNC10LLQtdGB0L3Qvi3QutGD0YHRgtCw0YDQvdC40LrQvtCy0L7QuSDRgNCw0YHRgtC40YLQtdC70YzQvdC+0YHRgtC4LCDQv9GA0LXQtNC90LDQt9C90LDRh9C10L3QvdC+0Lkg0LTQu9GPINC30LDRidC40YLRiyDQt9C10LzQtdC70Ywg0L7RgiDQstC+0LfQtNC10LnRgdGC0LLQuNGPINC90LXQs9Cw0YLQuNCy0L3Ri9GFICjQstGA0LXQtNC90YvRhSkg0L/RgNC40YDQvtC00L3Ri9GFLCDQsNC90YLRgNC+0L/QvtCz0LXQvdC90YvRhSDQuCDRgtC10YXQvdC+0LPQtdC90L3Ri9GFINGP0LLQu9C10L3QuNC5JyxcbiAgICAnMTQxMDA4MDAwMDAwJzogJ9CU0LvRjyDQvdCw0YPRh9C90L4t0LjRgdGB0LvQtdC00L7QstCw0YLQtdC70YzRgdC60LjRhSDRhtC10LvQtdC5JyxcbiAgICAnMTQxMDA5MDAwMDAwJzogJ9CU0LvRjyDRg9GH0LXQsdC90YvRhSDRhtC10LvQtdC5JyxcbiAgICAnMTQxMDEwMDAwMDAwJzogJ9CU0LvRjyDRgdC10L3QvtC60L7RiNC10L3QuNGPINC4INCy0YvQv9Cw0YHQsCDRgdC60L7RgtCwINCz0YDQsNC20LTQsNC90LDQvNC4JyxcbiAgICAnMTQxMDExMDAwMDAwJzogJ9Ck0L7QvdC0INC/0LXRgNC10YDQsNGB0L/RgNC10LTQtdC70LXQvdC40Y8nLFxuICAgICcxNDEwMTIwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0L7RhdC+0YLQvdC40YfRjNC10LPQviDRhdC+0LfRj9C50YHRgtCy0LAnLFxuICAgICcxNDEwMTMwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YDRi9Cx0L3QvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcbiAgICAnMTQxMDE0MDAwMDAwJzogJ9CU0LvRjyDQuNC90YvRhSDQstC40LTQvtCyINGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0LPQviDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjycsXG4gICAgJzE0MjAwMDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7Qsiwg0YXQsNGA0LDQutGC0LXRgNC90YvRhSDQtNC70Y8g0L3QsNGB0LXQu9GR0L3QvdGL0YUg0L/Rg9C90LrRgtC+0LInLFxuICAgICcxNDIwMDEwMDAwMDAnOiAn0JTQu9GPINC+0LHRitC10LrRgtC+0LIg0LbQuNC70L7QuSDQt9Cw0YHRgtGA0L7QudC60LgnLFxuICAgICcxNDIwMDEwMTAwMDAnOiAn0JTQu9GPINC40L3QtNC40LLQuNC00YPQsNC70YzQvdC+0Lkg0LbQuNC70L7QuSDQt9Cw0YHRgtGA0L7QudC60LgnLFxuICAgICcxNDIwMDEwMjAwMDAnOiAn0JTQu9GPINC80L3QvtCz0L7QutCy0LDRgNGC0LjRgNC90L7QuSDQt9Cw0YHRgtGA0L7QudC60LgnLFxuICAgICcxNDIwMDEwMjAxMDAnOiAn0JTQu9GPINC80LDQu9C+0Y3RgtCw0LbQvdC+0Lkg0LfQsNGB0YLRgNC+0LnQutC4JyxcbiAgICAnMTQyMDAxMDIwMjAwJzogJ9CU0LvRjyDRgdGA0LXQtNC90LXRjdGC0LDQttC90L7QuSDQt9Cw0YHRgtGA0L7QudC60LgnLFxuICAgICcxNDIwMDEwMjAzMDAnOiAn0JTQu9GPINC80L3QvtCz0L7RjdGC0LDQttC90L7QuSDQt9Cw0YHRgtGA0L7QudC60LgnLFxuICAgICcxNDIwMDEwMjA0MDAnOiAn0JTQu9GPINC40L3Ri9GFINCy0LjQtNC+0LIg0LbQuNC70L7QuSDQt9Cw0YHRgtGA0L7QudC60LgnLFxuICAgICcxNDIwMDEwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LTQvtGI0LrQvtC70YzQvdC+0LPQviwg0L3QsNGH0LDQu9GM0L3QvtCz0L4sINC+0LHRidC10LPQviDQuCDRgdGA0LXQtNC90LXQs9C+ICjQv9C+0LvQvdC+0LPQvikg0L7QsdGJ0LXQs9C+INC+0LHRgNCw0LfQvtCy0LDQvdC40Y8nLFxuICAgICcxNDIwMDEwNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIsINC00L7Qv9GD0YHRgtC40LzRi9GFINCyINC20LjQu9GL0YUg0LfQvtC90LDRhSDQuCDQvdC1INC/0LXRgNC10YfQuNGB0LvQtdC90L3Ri9GFINCyINC60LvQsNGB0YHQuNGE0LjQutCw0YLQvtGA0LUnLFxuICAgICcxNDIwMDIwMDAwMDAnOiAn0JTQu9GPINC+0LHRitC10LrRgtC+0LIg0L7QsdGJ0LXRgdGC0LLQtdC90L3Qvi3QtNC10LvQvtCy0L7Qs9C+INC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcxNDIwMDIwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YHQvtGG0LjQsNC70YzQvdC+0LPQviDQuCDQutC+0LzQvNGD0L3QsNC70YzQvdC+LdCx0YvRgtC+0LLQvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcxNDIwMDIwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LfQtNGA0LDQstC+0L7RhdGA0LDQvdC10L3QuNGPJyxcbiAgICAnMTQyMDAyMDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC60YPQu9GM0YLRg9GA0YsnLFxuICAgICcxNDIwMDIwNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YLQvtGA0LPQvtCy0LvQuCcsXG4gICAgJzE0MjAwMjA0MDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgNC+0LfQvdC40YfQvdC+0Lkg0YLQvtGA0LPQvtCy0LvQuCcsXG4gICAgJzE0MjAwMjA0MDIwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQvtC/0YLQvtCy0L7QuSDRgtC+0YDQs9C+0LLQu9C4JyxcbiAgICAnMTQyMDAyMDUwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC+0LHRidC10YHRgtCy0LXQvdC90L7Qs9C+INC/0LjRgtCw0L3QuNGPJyxcbiAgICAnMTQyMDAyMDYwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC/0YDQtdC00L/RgNC40L3QuNC80LDRgtC10LvRjNGB0LrQvtC5INC00LXRj9GC0LXQu9GM0L3QvtGB0YLQuCcsXG4gICAgJzE0MjAwMjA3MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgdGA0LXQtNC90LXQs9C+INC/0YDQvtGE0LXRgdGB0LjQvtC90LDQu9GM0L3QvtCz0L4g0Lgg0LLRi9GB0YjQtdCz0L4g0L/RgNC+0YTQtdGB0YHQuNC+0L3QsNC70YzQvdC+0LPQviDQvtCx0YDQsNC30L7QstCw0L3QuNGPJyxcbiAgICAnMTQyMDAyMDgwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsNC00LzQuNC90LjRgdGC0YDQsNGC0LjQstC90YvRhSDQt9C00LDQvdC40LknLFxuICAgICcxNDIwMDIwOTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC90LDRg9GH0L3Qvi3QuNGB0YHQu9C10LTQvtCy0LDRgtC10LvRjNGB0LrQuNGFINGD0YfRgNC10LbQtNC10L3QuNC5JyxcbiAgICAnMTQyMDAyMTAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutGD0LvRjNGC0L7QstGL0YUg0LfQtNCw0L3QuNC5JyxcbiAgICAnMTQyMDAyMTEwMDAwJzogJ9CU0LvRjyDRgdGC0L7Rj9C90L7QuiDQsNCy0YLQvtC80L7QsdC40LvRjNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcbiAgICAnMTQyMDAyMTIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC00LXQu9C+0LLQvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8sINCyINGC0L7QvCDRh9C40YHQu9C1INC+0YTQuNGB0L3Ri9GFINGG0LXQvdGC0YDQvtCyJyxcbiAgICAnMTQyMDAyMTMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGE0LjQvdCw0L3RgdC+0LLQvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcxNDIwMDIxNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCz0L7RgdGC0LjQvdC40YYnLFxuICAgICcxNDIwMDIxNTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0L7QtNC30LXQvNC90YvRhSDQuNC70Lgg0LzQvdC+0LPQvtGN0YLQsNC20L3Ri9GFINCz0LDRgNCw0LbQtdC5JyxcbiAgICAnMTQyMDAyMTYwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90LTQuNCy0LjQtNGD0LDQu9GM0L3Ri9GFINCz0LDRgNCw0LbQtdC5JyxcbiAgICAnMTQyMDAyMTcwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC+0LHRidC10YHRgtCy0LXQvdC90L4t0LTQtdC70L7QstC+0LPQviDQt9C90LDRh9C10L3QuNGPLCDQvtCx0LXRgdC/0LXRh9C40LLQsNGO0YnQuNGFINC20LjQt9C90Ywg0LPRgNCw0LbQtNCw0L0nLFxuICAgICcxNDIwMDMwMDAwMDAnOiAn0JTQu9GPINC+0LHRidC10LPQviDQv9C+0LvRjNC30L7QstCw0L3QuNGPICjRg9C70LjRh9C90LDRjyDRgdC10YLRjCknLFxuICAgICcxNDIwMDQwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YHQv9C10YbQuNCw0LvRjNC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcbiAgICAnMTQyMDA0MDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutC70LDQtNCx0LjRiScsXG4gICAgJzE0MjAwNDAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LrRgNC10LzQsNGC0L7RgNC40LXQsicsXG4gICAgJzE0MjAwNDAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YHQutC+0YLQvtC80L7Qs9C40LvRjNC90LjQutC+0LInLFxuICAgICcxNDIwMDQwNDAwMDAnOiAn0J/QvtC0INC+0LHRitC10LrRgtCw0LzQuCDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtGC0YXQvtC00L7QsiDQv9C+0YLRgNC10LHQu9C10L3QuNGPJyxcbiAgICAnMTQyMDA0MDUwMDAwJzogJ9Cf0L7QtCDQuNC90YvQvNC4INC+0LHRitC10LrRgtCw0LzQuCDRgdC/0LXRhtC40LDQu9GM0L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcxNDIwMDUwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60L7QvNC80YPQvdCw0LvRjNC90YvRhSwg0YHQutC70LDQtNGB0LrQuNGFINC+0LHRitC10LrRgtC+0LInLFxuICAgICcxNDIwMDYwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LbQuNC70LjRidC90L4t0LrQvtC80LzRg9C90LDQu9GM0L3QvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcbiAgICAnMTQyMDA3MDAwMDAwJzogJ9CU0LvRjyDQuNC90YvRhSDQstC40LTQvtCyINC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPLCDRhdCw0YDQsNC60YLQtdGA0L3Ri9GFINC00LvRjyDQvdCw0YHQtdC70ZHQvdC90YvRhSDQv9GD0L3QutGC0L7QsicsXG4gICAgJzE0MzAwMDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQv9GA0L7QvNGL0YjQu9C10L3QvdC+0YHRgtC4LCDRjdC90LXRgNCz0LXRgtC40LrQuCwg0YLRgNCw0L3RgdC/0L7RgNGC0LAsINGB0LLRj9C30LgsINGA0LDQtNC40L7QstC10YnQsNC90LjRjywg0YLQtdC70LXQstC40LTQtdC90LjRjywg0LjQvdGE0L7RgNC80LDRgtC40LrQuCwg0L7QsdC10YHQv9C10YfQtdC90LjRjyDQutC+0YHQvNC40YfQtdGB0LrQvtC5INC00LXRj9GC0LXQu9GM0L3QvtGB0YLQuCwg0L7QsdC+0YDQvtC90YssINCx0LXQt9C+0L/QsNGB0L3QvtGB0YLQuCDQuCDQuNC90L7Qs9C+INGB0L/QtdGG0LjQsNC70YzQvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzE0MzAwMTAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/RgNC+0LzRi9GI0LvQtdC90L3Ri9GFINC+0LHRitC10LrRgtC+0LInLFxuICAgICcxNDMwMDEwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0YDQvtC40LfQstC+0LTRgdGC0LLQtdC90L3Ri9GFINC4INCw0LTQvNC40L3QuNGB0YLRgNCw0YLQuNCy0L3Ri9GFINC30LTQsNC90LjQuSwg0YHRgtGA0L7QtdC90LjQuSwg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0L7QsdGB0LvRg9C20LjQstCw0Y7RidC40YUg0LjRhSDQvtCx0YrQtdC60YLQvtCyJyxcbiAgICAnMTQzMDAxMDEwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9GA0L7QuNC30LLQvtC00YHRgtCy0LXQvdC90YvRhSDQt9C00LDQvdC40LknLFxuICAgICcxNDMwMDEwMTAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60L7QvNC80YPQvdC40LrQsNGG0LjQuScsXG4gICAgJzE0MzAwMTAxMDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/QvtC00YrQtdC30LTQvdGL0YUg0L/Rg9GC0LXQuScsXG4gICAgJzE0MzAwMTAxMDQwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YHQutC70LDQtNGB0LrQuNGFINC/0L7QvNC10YnQtdC90LjQuScsXG4gICAgJzE0MzAwMTAxMDUwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LDQtNC80LjQvdC40YHRgtGA0LDRgtC40LLQvdGL0YUg0LfQtNCw0L3QuNC5JyxcbiAgICAnMTQzMDAxMDEwNjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutGD0LvRjNGC0YPRgNC90L4t0LHRi9GC0L7QstGL0YUg0LfQtNCw0L3QuNC5JyxcbiAgICAnMTQzMDAxMDEwNzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDRgdC+0L7RgNGD0LbQtdC90LjQuSDQv9GA0L7QvNGL0YjQu9C10L3QvdC+0YHRgtC4JyxcbiAgICAnMTQzMDAxMDIwMDAwJzogJ9CU0LvRjyDQtNC+0LHRi9GH0Lgg0Lgg0YDQsNC30YDQsNCx0L7RgtC60Lgg0L/QvtC70LXQt9C90YvRhSDQuNGB0LrQvtC/0LDQtdC80YvRhScsXG4gICAgJzE0MzAwMTAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQv9GA0L7QvNGL0YjQu9C10L3QvdC+0YHRgtC4JyxcbiAgICAnMTQzMDAyMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGN0L3QtdGA0LPQtdGC0LjQutC4JyxcbiAgICAnMTQzMDAyMDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRjdC70LXQutGC0YDQvtGB0YLQsNC90YbQuNC5INC4INC+0LHRgdC70YPQttC40LLQsNGO0YnQuNGFINGB0L7QvtGA0YPQttC10L3QuNC5INC4INC+0LHRitC10LrRgtC+0LInLFxuICAgICcxNDMwMDIwMTAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCz0LjQtNGA0L7RjdC70LXQutGC0YDQvtGB0YLQsNC90YbQuNC5JyxcbiAgICAnMTQzMDAyMDEwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsNGC0L7QvNC90YvRhSDRgdGC0LDQvdGG0LjQuScsXG4gICAgJzE0MzAwMjAxMDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0Y/QtNC10YDQvdGL0YUg0YPRgdGC0LDQvdC+0LLQvtC6JyxcbiAgICAnMTQzMDAyMDEwNDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9GD0L3QutGC0L7QsiDRhdGA0LDQvdC10L3QuNGPINGP0LTQtdGA0L3Ri9GFINC80LDRgtC10YDQuNCw0LvQvtCyINC4INGA0LDQtNC40L7QsNC60YLQuNCy0L3Ri9GFINCy0LXRidC10YHRgtCyINGN0L3QtdGA0LPQtdGC0LjQutC4JyxcbiAgICAnMTQzMDAyMDEwNTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRhdGA0LDQvdC40LvQuNGJINGA0LDQtNC40L7QsNC60YLQuNCy0L3Ri9GFINC+0YLRhdC+0LTQvtCyJyxcbiAgICAnMTQzMDAyMDEwNjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRgtC10L/Qu9C+0LLRi9GFINGB0YLQsNC90YbQuNC5JyxcbiAgICAnMTQzMDAyMDEwNzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDRgtC40L/QvtCyINGN0LvQtdC60YLRgNC+0YHRgtCw0L3RhtC40LknLFxuICAgICcxNDMwMDIwMTA4MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRgdC70YPQttC40LLQsNGO0YnQuNGFINGB0L7QvtGA0YPQttC10L3QuNC5INC4INC+0LHRitC10LrRgtC+0LInLFxuICAgICcxNDMwMDIwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0Y3Qu9C10LrRgtGA0L7RgdC10YLQtdCy0L7Qs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG4gICAgJzE0MzAwMjAyMDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LLQvtC30LTRg9GI0L3Ri9GFINC70LjQvdC40Lkg0Y3Qu9C10LrRgtGA0L7Qv9C10YDQtdC00LDRh9C4JyxcbiAgICAnMTQzMDAyMDIwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvdCw0LfQtdC80L3Ri9GFINGB0L7QvtGA0YPQttC10L3QuNC5INC60LDQsdC10LvRjNC90YvRhSDQu9C40L3QuNC5INGN0LvQtdC60YLRgNC+0L/QtdGA0LXQtNCw0YfQuCcsXG4gICAgJzE0MzAwMjAyMDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/QvtC00YHRgtCw0L3RhtC40LknLFxuICAgICcxNDMwMDIwMjA0MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGA0LDRgdC/0YDQtdC00LXQu9C40YLQtdC70YzQvdGL0YUg0L/Rg9C90LrRgtC+0LInLFxuICAgICcxNDMwMDIwMjA1MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC00YDRg9Cz0LjRhSDRgdC+0L7RgNGD0LbQtdC90LjQuSDQuCDQvtCx0YrQtdC60YLQvtCyINGN0LvQtdC60YLRgNC+0YHQtdGC0LXQstC+0LPQviDRhdC+0LfRj9C50YHRgtCy0LAnLFxuICAgICcxNDMwMDIwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0Y3QvdC10YDQs9C10YLQuNC60LgnLFxuICAgICcxNDMwMDMwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuICAgICcxNDMwMDMwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC4INGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCDQvtCx0YrQtdC60YLQvtCyINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcbiAgICAnMTQzMDAzMDEwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQttC10LvQtdC30L3QvtC00L7RgNC+0LbQvdGL0YUg0L/Rg9GC0LXQuSDQuCDQuNGFINC60L7QvdGB0YLRgNGD0LrRgtC40LLQvdGL0YUg0Y3Qu9C10LzQtdC90YLQvtCyJyxcbiAgICAnMTQzMDAzMDEwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9C+0LvQvtGBINC+0YLQstC+0LTQsCDQttC10LvQtdC30L3QvtC00L7RgNC+0LbQvdGL0YUg0L/Rg9GC0LXQuScsXG4gICAgJzE0MzAwMzAxMDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8sINGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCwg0YDQsNGB0YjQuNGA0LXQvdC40Y8g0Lgg0YDQtdC60L7QvdGB0YLRgNGD0LrRhtC40Lgg0YHRgtGA0L7QtdC90LjQuSwg0LfQtNCw0L3QuNC5LCDRgdC+0L7RgNGD0LbQtdC90LjQuSwg0LIg0YLQvtC8INGH0LjRgdC70LUg0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3Ri9GFINCy0L7QutC30LDQu9C+0LIsINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90YvRhSDRgdGC0LDQvdGG0LjQuSwg0LAg0YLQsNC60LbQtSDRg9GB0YLRgNC+0LnRgdGC0LIg0Lgg0LTRgNGD0LPQuNGFINC+0LHRitC10LrRgtC+0LIsINC90LXQvtCx0YXQvtC00LjQvNGL0YUg0LTQu9GPINGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCwg0YHQvtC00LXRgNC20LDQvdC40Y8sINGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwLCDRgNC10LrQvtC90YHRgtGA0YPQutGG0LjQuCwg0YDQtdC80L7QvdGC0LAsINGA0LDQt9Cy0LjRgtC40Y8g0L3QsNC30LXQvNC90YvRhSDQuCDQv9C+0LTQt9C10LzQvdGL0YUg0LfQtNCw0L3QuNC5LCDRgdGC0YDQvtC10L3QuNC5LCDRgdC+0L7RgNGD0LbQtdC90LjQuSwg0YPRgdGC0YDQvtC50YHRgtCyINC4INC00YDRg9Cz0LjRhSDQvtCx0YrQtdC60YLQvtCyINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcbiAgICAnMTQzMDAzMDEwMzAxJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQttC10LvQtdC30L3QvtC00L7RgNC+0LbQvdGL0YUg0LLQvtC60LfQsNC70L7QsicsXG4gICAgJzE0MzAwMzAxMDMwMic6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3Ri9GFINGB0YLQsNC90YbQuNC5JyxcbiAgICAnMTQzMDAzMDEwMzAzJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRg9GB0YLRgNC+0LnRgdGC0LIg0Lgg0LTRgNGD0LPQuNGFINC+0LHRitC10LrRgtC+0LIsINC90LXQvtCx0YXQvtC00LjQvNGL0YUg0LTQu9GPINGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCwg0YHQvtC00LXRgNC20LDQvdC40Y8sINGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwLCDRgNC10LrQvtC90YHRgtGA0YPQutGG0LjQuCwg0YDQtdC80L7QvdGC0LAsINGA0LDQt9Cy0LjRgtC40Y8g0L3QsNC30LXQvNC90YvRhSDQuCDQv9C+0LTQt9C10LzQvdGL0YUg0LfQtNCw0L3QuNC5LCDRgdGC0YDQvtC10L3QuNC5LCDRgdC+0L7RgNGD0LbQtdC90LjQuSwg0YPRgdGC0YDQvtC50YHRgtCyINC4INC00YDRg9Cz0LjRhSDQvtCx0YrQtdC60YLQvtCyINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcbiAgICAnMTQzMDAzMDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuCDRjdC60YHQv9C70YPQsNGC0LDRhtC40Lgg0L7QsdGK0LXQutGC0L7QsiDQsNCy0YLQvtC80L7QsdC40LvRjNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwINC4INC+0LHRitC10LrRgtC+0LIg0LTQvtGA0L7QttC90L7Qs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG4gICAgJzE0MzAwMzAyMDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LDQstGC0L7QvNC+0LHQuNC70YzQvdGL0YUg0LTQvtGA0L7QsyDQuCDQuNGFINC60L7QvdGB0YLRgNGD0LrRgtC40LLQvdGL0YUg0Y3Qu9C10LzQtdC90YLQvtCyJyxcbiAgICAnMTQzMDAzMDIwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9C+0LvQvtGBINC+0YLQstC+0LTQsCcsXG4gICAgJzE0MzAwMzAyMDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQtNC+0YDQvtC20L3QvtCz0L4g0YHQtdGA0LLQuNGB0LAg0LIg0L/QvtC70L7RgdCw0YUg0L7RgtCy0L7QtNCwINCw0LLRgtC+0LzQvtCx0LjQu9GM0L3Ri9GFINC00L7RgNC+0LMnLFxuICAgICcxNDMwMDMwMjA0MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC00L7RgNC+0LbQvdGL0YUg0YHQvtC+0YDRg9C20LXQvdC40LknLFxuICAgICcxNDMwMDMwMjA1MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCw0LLRgtC+0LLQvtC60LfQsNC70L7QsiDQuCDQsNCy0YLQvtGB0YLQsNC90YbQuNC5JyxcbiAgICAnMTQzMDAzMDIwNjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINCw0LLRgtC+0LzQvtCx0LjQu9GM0L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAg0Lgg0LTQvtGA0L7QttC90L7Qs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG4gICAgJzE0MzAwMzAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0Lgg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4INC+0LHRitC10LrRgtC+0LIg0LzQvtGA0YHQutC+0LPQviwg0LLQvdGD0YLRgNC10L3QvdC10LPQviDQstC+0LTQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG4gICAgJzE0MzAwMzAzMDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjRgdC60YPRgdGB0YLQstC10L3QvdC+INGB0L7Qt9C00LDQvdC90YvRhSDQstC90YPRgtGA0LXQvdC90LjRhSDQstC+0LTQvdGL0YUg0L/Rg9GC0LXQuScsXG4gICAgJzE0MzAwMzAzMDIwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LzQvtGA0YHQutC40YUg0Lgg0YDQtdGH0L3Ri9GFINC/0L7RgNGC0L7Qsiwg0L/RgNC40YfQsNC70L7Qsiwg0L/RgNC40YHRgtCw0L3QtdC5JyxcbiAgICAnMTQzMDAzMDMwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC80L7RgNGB0LrQvtCz0L4sINCy0L3Rg9GC0YDQtdC90L3QtdCz0L4g0LLQvtC00L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuICAgICcxNDMwMDMwMzA0MDAnOiAn0JTQu9GPINCy0YvQtNC10LvQtdC90LjRjyDQsdC10YDQtdCz0L7QstC+0Lkg0L/QvtC70L7RgdGLJyxcbiAgICAnMTQzMDAzMDQwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuCDRjdC60YHQv9C70YPQsNGC0LDRhtC40Lgg0L7QsdGK0LXQutGC0L7QsiDQstC+0LfQtNGD0YjQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG4gICAgJzE0MzAwMzA0MDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LDRjdGA0L7Qv9C+0YDRgtC+0LIg0Lgg0LDRjdGA0L7QtNGA0L7QvNC+0LInLFxuICAgICcxNDMwMDMwNDAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCw0Y3RgNC+0LLQvtC60LfQsNC70L7QsicsXG4gICAgJzE0MzAwMzA0MDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LLQt9C70LXRgtC90L4t0L/QvtGB0LDQtNC+0YfQvdGL0YUg0L/QvtC70L7RgScsXG4gICAgJzE0MzAwMzA0MDQwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L3QsNC30LXQvNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINCy0L7Qt9C00YPRiNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcbiAgICAnMTQzMDAzMDUwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuCDRjdC60YHQv9C70YPQsNGC0LDRhtC40Lgg0L7QsdGK0LXQutGC0L7QsiDRgtGA0YPQsdC+0L/RgNC+0LLQvtC00L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuICAgICcxNDMwMDMwNTAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC90LXRhNGC0LXQv9GA0L7QstC+0LTQvtCyJyxcbiAgICAnMTQzMDAzMDUwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQs9Cw0LfQvtC/0YDQvtCy0L7QtNC+0LInLFxuICAgICcxNDMwMDMwNTAzMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINGC0YDRg9Cx0L7Qv9GA0L7QstC+0LTQvtCyJyxcbiAgICAnMTQzMDAzMDUwNDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINGC0YDRg9Cx0L7Qv9GA0L7QstC+0LTQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG4gICAgJzE0MzAwMzA2MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0Lgg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4INC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuICAgICcxNDMwMDQwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YHQstGP0LfQuCwg0YDQsNC00LjQvtCy0LXRidCw0L3QuNGPLCDRgtC10LvQtdCy0LjQtNC10L3QuNGPLCDQuNC90YTQvtGA0LzQsNGC0LjQutC4JyxcbiAgICAnMTQzMDA0MDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRjdC60YHQv9C70YPQsNGC0LDRhtC40L7QvdC90YvRhSDQv9GA0LXQtNC/0YDQuNGP0YLQuNC5INGB0LLRj9C30Lgg0Lgg0L7QsdGB0LvRg9C20LjQstCw0L3QuNGPINC70LjQvdC40Lkg0YHQstGP0LfQuCcsXG4gICAgJzE0MzAwNDAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LrQsNCx0LXQu9GM0L3Ri9GFLCDRgNCw0LTQuNC+0YDQtdC70LXQudC90YvRhSDQuCDQstC+0LfQtNGD0YjQvdGL0YUg0LvQuNC90LjQuSDRgdCy0Y/Qt9C4INC4INC70LjQvdC40Lkg0YDQsNC00LjQvtGE0LjQutCw0YbQuNC4INC90LAg0YLRgNCw0YHRgdCw0YUg0LrQsNCx0LXQu9GM0L3Ri9GFINC4INCy0L7Qt9C00YPRiNC90YvRhSDQu9C40L3QuNC5INGB0LLRj9C30Lgg0Lgg0YDQsNC00LjQvtGE0LjQutCw0YbQuNC4INC4INC40YUg0L7RhdGA0LDQvdC90YvQtSDQt9C+0L3RiycsXG4gICAgJzE0MzAwNDAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/QvtC00LfQtdC80L3Ri9GFINC60LDQsdC10LvRjNC90YvRhSDQuCDQstC+0LfQtNGD0YjQvdGL0YUg0LvQuNC90LjQuSDRgdCy0Y/Qt9C4INC4INGA0LDQtNC40L7RhNC40LrQsNGG0LjQuCDQuCDQuNGFINC+0YXRgNCw0L3QvdGL0LUg0LfQvtC90YsnLFxuICAgICcxNDMwMDQwNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC90LDQt9C10LzQvdGL0YUg0Lgg0L/QvtC00LfQtdC80L3Ri9GFINC90LXQvtCx0YHQu9GD0LbQuNCy0LDQtdC80YvRhSDRg9GB0LjQu9C40YLQtdC70YzQvdGL0YUg0L/Rg9C90LrRgtC+0LIg0L3QsCDQutCw0LHQtdC70YzQvdGL0YUg0LvQuNC90LjRj9GFINGB0LLRj9C30Lgg0Lgg0LjRhSDQvtGF0YDQsNC90L3Ri9C1INC30L7QvdGLJyxcbiAgICAnMTQzMDA0MDUwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvdCw0LfQtdC80L3Ri9GFINGB0L7QvtGA0YPQttC10L3QuNC5INC4INC40L3RhNGA0LDRgdGC0YDRg9C60YLRg9GAINGB0L/Rg9GC0L3QuNC60L7QstC+0Lkg0YHQstGP0LfQuCcsXG4gICAgJzE0MzAwNDA2MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDRgdCy0Y/Qt9C4LCDRgNCw0LTQuNC+0LLQtdGJ0LDQvdC40Y8sINGC0LXQu9C10LLQuNC00LXQvdC40Y8sINC40L3RhNC+0YDQvNCw0YLQuNC60LgnLFxuICAgICcxNDMwMDUwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIsINC/0YDQtdC00L3QsNC30L3QsNGH0LXQvdC90YvRhSDQtNC70Y8g0L7QsdC10YHQv9C10YfQtdC90LjRjyDQutC+0YHQvNC40YfQtdGB0LrQvtC5INC00LXRj9GC0LXQu9GM0L3QvtGB0YLQuCcsXG4gICAgJzE0MzAwNTAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LrQvtGB0LzQvtC00YDQvtC80L7Qsiwg0YHRgtCw0YDRgtC+0LLRi9GFINC60L7QvNC/0LvQtdC60YHQvtCyINC4INC/0YPRgdC60L7QstGL0YUg0YPRgdGC0LDQvdC+0LLQvtC6JyxcbiAgICAnMTQzMDA1MDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutC+0LzQsNC90LTQvdC+LdC40LfQvNC10YDQuNGC0LXQu9GM0L3Ri9GFINC60L7QvNC/0LvQtdC60YHQvtCyLCDRhtC10L3RgtGA0L7QsiDQuCDQv9GD0L3QutGC0L7QsiDRg9C/0YDQsNCy0LvQtdC90LjRjyDQv9C+0LvQtdGC0LDQvNC4INC60L7RgdC80LjRh9C10YHQutC40YUg0L7QsdGK0LXQutGC0L7Qsiwg0L/RgNC40LXQvNCwLCDRhdGA0LDQvdC10L3QuNGPINC4INC/0LXRgNC10YDQsNCx0L7RgtC60Lgg0LjQvdGE0L7RgNC80LDRhtC40LgnLFxuICAgICcxNDMwMDUwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCx0LDQtyDRhdGA0LDQvdC10L3QuNGPINC60L7RgdC80LjRh9C10YHQutC+0Lkg0YLQtdGF0L3QuNC60LgnLFxuICAgICcxNDMwMDUwNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0L7Qu9C40LPQvtC90L7QsiDQv9GA0LjQt9C10LzQu9C10L3QuNGPINC60L7RgdC80LjRh9C10YHQutC40YUg0L7QsdGK0LXQutGC0L7QsiDQuCDQstC30LvQtdGC0L3Qvi3Qv9C+0YHQsNC00L7Rh9C90YvRhSDQv9C+0LvQvtGBJyxcbiAgICAnMTQzMDA1MDUwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGN0LrRgdC/0LXRgNC40LzQtdC90YLQsNC70YzQvdC+0Lkg0LHQsNC30Ysg0LTQu9GPINC+0YLRgNCw0LHQvtGC0LrQuCDQutC+0YHQvNC40YfQtdGB0LrQvtC5INGC0LXRhdC90LjQutC4JyxcbiAgICAnMTQzMDA1MDYwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRhtC10L3RgtGA0L7QsiDQuCDQvtCx0L7RgNGD0LTQvtCy0LDQvdC40Y8g0LTQu9GPINC/0L7QtNCz0L7RgtC+0LLQutC4INC60L7RgdC80L7QvdCw0LLRgtC+0LInLFxuICAgICcxNDMwMDUwNzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC00YDRg9Cz0LjRhSDQvdCw0LfQtdC80L3Ri9GFINGB0L7QvtGA0YPQttC10L3QuNC5INC4INGC0LXRhdC90LjQutC4LCDQuNGB0L/QvtC70YzQt9GD0LXQvNGL0YUg0L/RgNC4INC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNC4INC60L7RgdC80LjRh9C10YHQutC+0Lkg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4JyxcbiAgICAnMTQzMDA2MDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyLCDQv9GA0LXQtNC90LDQt9C90LDRh9C10L3QvdGL0YUg0LTQu9GPINC+0LHQtdGB0L/QtdGH0LXQvdC40Y8g0L7QsdC+0YDQvtC90Ysg0Lgg0LHQtdC30L7Qv9Cw0YHQvdC+0YHRgtC4JyxcbiAgICAnMTQzMDA2MDEwMDAwJzogJ9CU0LvRjyDQvtCx0LXRgdC/0LXRh9C10L3QuNGPINC30LDQtNCw0Ycg0L7QsdC+0YDQvtC90YsnLFxuICAgICcxNDMwMDYwMTAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCy0L7QtdC90L3Ri9GFINC+0YDQs9Cw0L3QuNC30LDRhtC40LksINGD0YfRgNC10LbQtNC10L3QuNC5INC4INC00YDRg9Cz0LjRhSDQvtCx0YrQtdC60YLQvtCyJyxcbiAgICAnMTQzMDA2MDEwMjAwJzogJ9CU0LvRjyDQtNC40YHQu9C+0LrQsNGG0LjQuCDQstC+0LnRgdC6INC4INGB0LjQuyDRhNC70L7RgtCwJyxcbiAgICAnMTQzMDA2MDEwMzAwJzogJ9CU0LvRjyDQv9GA0L7QstC10LTQtdC90LjRjyDRg9GH0LXQvdC40Lkg0Lgg0LjQvdGL0YUg0LzQtdGA0L7Qv9GA0LjRj9GC0LjQuScsXG4gICAgJzE0MzAwNjAxMDQwMCc6ICfQlNC70Y8g0LjRgdC/0YvRgtCw0YLQtdC70YzQvdGL0YUg0L/QvtC70LjQs9C+0L3QvtCyJyxcbiAgICAnMTQzMDA2MDEwNTAwJzogJ9CU0LvRjyDQvNC10YHRgiDRg9C90LjRh9GC0L7QttC10L3QuNGPINC+0YDRg9C20LjRjyDQuCDQt9Cw0YXQvtGA0L7QvdC10L3QuNGPINC+0YLRhdC+0LTQvtCyJyxcbiAgICAnMTQzMDA2MDEwNjAwJzogJ9CU0LvRjyDRgdC+0LfQtNCw0L3QuNGPINC30LDQv9Cw0YHQvtCyINC80LDRgtC10YDQuNCw0LvRjNC90YvRhSDRhtC10L3QvdC+0YHRgtC10Lkg0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC8INC4INC80L7QsdC40LvQuNC30LDRhtC40L7QvdC90L7QvCDRgNC10LfQtdGA0LLQsNGFICjRhdGA0LDQvdC40LvQuNGJ0LAsINGB0LrQu9Cw0LTRiyDQuCDQtNGA0YPQs9C40LUpJyxcbiAgICAnMTQzMDA2MDEwNzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC+0LHQvtGA0L7QvdGLJyxcbiAgICAnMTQzMDA2MDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyICjRgtC10YDRgNC40YLQvtGA0LjQuSksINC+0LHQtdGB0L/QtdGH0LjQstCw0Y7RidC40YUg0LfQsNGJ0LjRgtGDINC4INC+0YXRgNCw0L3RgyDQk9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LPRgNCw0L3QuNGG0Ysg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4JyxcbiAgICAnMTQzMDA2MDIwMTAwJzogJ9CU0LvRjyDQvtCx0YPRgdGC0YDQvtC50YHRgtCy0LAg0Lgg0YHQvtC00LXRgNC20LDQvdC40Y8g0LjQvdC20LXQvdC10YDQvdC+LdGC0LXRhdC90LjRh9C10YHQutC40YUg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0LfQsNCz0YDQsNC20LTQtdC90LjQuScsXG4gICAgJzE0MzAwNjAyMDIwMCc6ICfQlNC70Y8g0L7QsdGD0YHRgtGA0L7QudGB0YLQstCwINC4INGB0L7QtNC10YDQttCw0L3QuNGPINC/0L7Qs9GA0LDQvdC40YfQvdGL0YUg0LfQvdCw0LrQvtCyJyxcbiAgICAnMTQzMDA2MDIwMzAwJzogJ9CU0LvRjyDQvtCx0YPRgdGC0YDQvtC50YHRgtCy0LAg0Lgg0YHQvtC00LXRgNC20LDQvdC40Y8g0L/QvtCz0YDQsNC90LjRh9C90YvRhSDQv9GA0L7RgdC10LonLFxuICAgICcxNDMwMDYwMjA0MDAnOiAn0JTQu9GPINC+0LHRg9GB0YLRgNC+0LnRgdGC0LLQsCDQuCDRgdC+0LTQtdGA0LbQsNC90LjRjyDQutC+0LzQvNGD0L3QuNC60LDRhtC40LknLFxuICAgICcxNDMwMDYwMjA1MDAnOiAn0JTQu9GPINC+0LHRg9GB0YLRgNC+0LnRgdGC0LLQsCDQuCDRgdC+0LTQtdGA0LbQsNC90LjRjyDQv9GD0L3QutGC0L7QsiDQv9GA0L7Qv9GD0YHQutCwINGH0LXRgNC10Lcg0JPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Rg9GOINCz0YDQsNC90LjRhtGDINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG4gICAgJzE0MzAwNjAyMDYwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQtNC70Y8g0LfQsNGJ0LjRgtGLINC4INC+0YXRgNCw0L3RiyDQk9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LPRgNCw0L3QuNGG0Ysg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4JyxcbiAgICAnMTQzMDA2MDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC+0LHQvtGA0L7QvdGLINC4INCx0LXQt9C+0L/QsNGB0L3QvtGB0YLQuCcsXG4gICAgJzE0MzAwNzAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQv9GA0L7QvNGL0YjQu9C10L3QvdC+0YHRgtC4LCDRjdC90LXRgNCz0LXRgtC40LrQuCwg0YLRgNCw0L3RgdC/0L7RgNGC0LAsINGB0LLRj9C30LgsINGA0LDQtNC40L7QstC10YnQsNC90LjRjywg0YLQtdC70LXQstC40LTQtdC90LjRjywg0LjQvdGE0L7RgNC80LDRgtC40LrQuCwg0L7QsdC10YHQv9C10YfQtdC90LjRjyDQutC+0YHQvNC40YfQtdGB0LrQvtC5INC00LXRj9GC0LXQu9GM0L3QvtGB0YLQuCwg0L7QsdC+0YDQvtC90YssINCx0LXQt9C+0L/QsNGB0L3QvtGB0YLQuCDQuCDQuNC90L7Qs9C+INGB0L/QtdGG0LjQsNC70YzQvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzE0NDAwMDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80YvRhSDQuNGB0YLQvtGA0LjQutC+LdC60YPQu9GM0YLRg9GA0L3Ri9GFINC4INC/0YDQuNGA0L7QtNC90YvRhSDQvtCx0YrQtdC60YLQvtCyICjRgtC10YDRgNC40YLQvtGA0LjQuSknLFxuICAgICcxNDQwMDEwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0YHQvtCx0L4g0L7RhdGA0LDQvdGP0LXQvNGL0YUg0L/RgNC40YDQvtC00L3Ri9GFINC+0LHRitC10LrRgtC+0LIgKNGC0LXRgNGA0LjRgtC+0YDQuNC5KScsXG4gICAgJzE0NDAwMTAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9GFINC/0YDQuNGA0L7QtNC90YvRhSDQt9Cw0L/QvtCy0LXQtNC90LjQutC+0LIgKNCyINGC0L7QvCDRh9C40YHQu9C1INCx0LjQvtGB0YTQtdGA0L3Ri9GFKScsXG4gICAgJzE0NDAwMTAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9GFINC/0YDQuNGA0L7QtNC90YvRhSDQt9Cw0LrQsNC30L3QuNC60L7QsicsXG4gICAgJzE0NDAwMTAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L3QsNGG0LjQvtC90LDQu9GM0L3Ri9GFINC/0LDRgNC60L7QsicsXG4gICAgJzE0NDAwMTA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/RgNC40YDQvtC00L3Ri9GFINC/0LDRgNC60L7QsicsXG4gICAgJzE0NDAwMTA1MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LTQtdC90LTRgNC+0LvQvtCz0LjRh9C10YHQutC40YUg0L/QsNGA0LrQvtCyJyxcbiAgICAnMTQ0MDAxMDYwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsdC+0YLQsNC90LjRh9C10YHQutC40YUg0YHQsNC00L7QsicsXG4gICAgJzE0NDAwMTA3MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgdCw0L3QsNGC0L7RgNC90L7Qs9C+INC4INC60YPRgNC+0YDRgtC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcbiAgICAnMTQ0MDAxMDgwMDAwJzogJ9Ci0LXRgNGA0LjRgtC+0YDQuNC4INC80LXRgdGC0L7RgNC+0LbQtNC10L3QuNC5INC80LjQvdC10YDQsNC70YzQvdGL0YUg0LLQvtC0LCDQu9C10YfQtdCx0L3Ri9GFINCz0YDRj9C30LXQuSwg0YDQsNC/0Ysg0LvQuNC80LDQvdC+0LIg0Lgg0L7Qt9C10YAnLFxuICAgICcxNDQwMDEwOTAwMDAnOiAn0JTQu9GPINGC0YDQsNC00LjRhtC40L7QvdC90L7Qs9C+INC/0YDQuNGA0L7QtNC+0L/QvtC70YzQt9C+0LLQsNC90LjRjycsXG4gICAgJzE0NDAwMTEwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80YvRhSDQv9GA0LjRgNC+0LTQvdGL0YUg0YLQtdGA0YDQuNGC0L7RgNC40LkgKNC+0LHRitC10LrRgtC+0LIpJyxcbiAgICAnMTQ0MDAyMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyICjRgtC10YDRgNC40YLQvtGA0LjQuSkg0L/RgNC40YDQvtC00L7QvtGF0YDQsNC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcxNDQwMDMwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIgKNGC0LXRgNGA0LjRgtC+0YDQuNC5KSDRgNC10LrRgNC10LDRhtC40L7QvdC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcbiAgICAnMTQ0MDAzMDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQtNC+0LzQvtCyINC+0YLQtNGL0YXQsCwg0L/QsNC90YHQuNC+0L3QsNGC0L7Qsiwg0LrQtdC80L/QuNC90LPQvtCyJyxcbiAgICAnMTQ0MDAzMDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGE0LjQt9C40YfQtdGB0LrQvtC5INC60YPQu9GM0YLRg9GA0Ysg0Lgg0YHQv9C+0YDRgtCwJyxcbiAgICAnMTQ0MDAzMDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRgtGD0YDQuNGB0YLQuNGH0LXRgdC60LjRhSDQsdCw0LcsINGB0YLQsNGG0LjQvtC90LDRgNC90YvRhSDQuCDQv9Cw0LvQsNGC0L7Rh9C90YvRhSDRgtGD0YDQuNGB0YLRgdC60L4t0L7Qt9C00L7RgNC+0LLQuNGC0LXQu9GM0L3Ri9GFINC70LDQs9C10YDQtdC5LCDQtNC+0LzQvtCyINGA0YvQsdC+0LvQvtCy0LAg0Lgg0L7RhdC+0YLQvdC40LrQsCwg0LTQtdGC0YHQutC40YUg0YLRg9GA0LjRgdGC0LjRh9C10YHQutC40YUg0YHRgtCw0L3RhtC40LknLFxuICAgICcxNDQwMDMwNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGC0YPRgNC40YHRgtC40YfQtdGB0LrQuNGFINC/0LDRgNC60L7QsicsXG4gICAgJzE0NDAwMzA1MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LvQtdGB0L7Qv9Cw0YDQutC+0LInLFxuICAgICcxNDQwMDMwNjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGD0YfQtdCx0L3Qvi3RgtGD0YDQuNGB0YLQuNGH0LXRgdC60LjRhSDRgtGA0L7QvyDQuCDRgtGA0LDRgdGBJyxcbiAgICAnMTQ0MDAzMDcwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQtNC10YLRgdC60LjRhSDQuCDRgdC/0L7RgNGC0LjQstC90YvRhSDQu9Cw0LPQtdGA0LXQuScsXG4gICAgJzE0NDAwMzA4MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YHQutCy0LXRgNC+0LIsINC/0LDRgNC60L7Qsiwg0LPQvtGA0L7QtNGB0LrQuNGFINGB0LDQtNC+0LInLFxuICAgICcxNDQwMDMwOTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0LvRj9C20LXQuScsXG4gICAgJzE0NDAwMzEwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiAo0YLQtdGA0YDQuNGC0L7RgNC40LkpINGA0LXQutGA0LXQsNGG0LjQvtC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcxNDQwMDQwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LjRgdGC0L7RgNC40LrQvi3QutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcbiAgICAnMTQ0MDA0MDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNGB0LvQtdC00LjRjyDQvdCw0YDQvtC00L7QsiDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LggKNC/0LDQvNGP0YLQvdC40LrQvtCyINC40YHRgtC+0YDQuNC4INC4INC60YPQu9GM0YLRg9GA0YspLCDQsiDRgtC+0Lwg0YfQuNGB0LvQtSDQvtCx0YrQtdC60YLQvtCyINCw0YDRhdC10L7Qu9C+0LPQuNGH0LXRgdC60L7Qs9C+INC90LDRgdC70LXQtNC40Y8nLFxuICAgICcxNDQwMDQwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCy0L7QtdC90L3Ri9GFINC4INCz0YDQsNC20LTQsNC90YHQutC40YUg0LfQsNGF0L7RgNC+0L3QtdC90LjQuScsXG4gICAgJzE0NDAwNTAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80YvRhSDQuNGB0YLQvtGA0LjQutC+LdC60YPQu9GM0YLRg9GA0L3Ri9GFINC4INC/0YDQuNGA0L7QtNC90YvRhSDQvtCx0YrQtdC60YLQvtCyICjRgtC10YDRgNC40YLQvtGA0LjQuSknLFxuICAgICcxNDUwMDAwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LvQtdGB0L3QvtCz0L4g0YTQvtC90LTQsCcsXG4gICAgJzE0NTAwMTAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LvQtdGB0L3QvtC5INGA0LDRgdGC0LjRgtC10LvRjNC90L7RgdGC0LgnLFxuICAgICcxNDUwMDIwMDAwMDAnOiAn0JTQu9GPINCy0L7RgdGB0YLQsNC90L7QstC70LXQvdC40Y8g0LvQtdGB0L3QvtC5INGA0LDRgdGC0LjRgtC10LvRjNC90L7RgdGC0LgnLFxuICAgICcxNDUwMDMwMDAwMDAnOiAn0JTQu9GPINC/0YDQvtGH0LjRhSDQvtCx0YrQtdC60YLQvtCyINC70LXRgdC90L7Qs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG4gICAgJzE0NjAwMDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQstC+0LTQvdC+0LPQviDRhNC+0L3QtNCwJyxcbiAgICAnMTQ2MDAxMDAwMDAwJzogJ9Cf0L7QtCDQstC+0LTQvdGL0LzQuCDQvtCx0YrQtdC60YLQsNC80LgnLFxuICAgICcxNDYwMDIwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCz0LjQtNGA0L7RgtC10YXQvdC40YfQtdGB0LrQuNGFINGB0L7QvtGA0YPQttC10L3QuNC5JyxcbiAgICAnMTQ2MDAzMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDRgdC+0L7RgNGD0LbQtdC90LjQuSwg0YDQsNGB0L/QvtC70L7QttC10L3QvdGL0YUg0L3QsCDQstC+0LTQvdGL0YUg0L7QsdGK0LXQutGC0LDRhScsXG4gICAgJzE0NzAwMDAwMDAwMCc6ICfQl9C10LzQu9C4INC30LDQv9Cw0YHQsCAo0L3QtdC40YHQv9C+0LvRjNC30YPQtdC80YvQtSknXG59O1xuLy8g0J3QsNC30L3QsNGH0LXQvdC40LUg0LfQtNCw0L3QuNC5XG52YXIgZEFzc0J1aWxkaW5nID0ge1xuICAgICcyMDQwMDEwMDAwMDAnOiAn0J3QtdC20LjQu9C+0LUg0LfQtNCw0L3QuNC1JyxcbiAgICAnMjA0MDAyMDAwMDAwJzogJ9CW0LjQu9C+0Lkg0LTQvtC8JyxcbiAgICAnMjA0MDAzMDAwMDAwJzogJ9Cc0L3QvtCz0L7QutCy0LDRgNGC0LjRgNC90YvQuSDQtNC+0LwnXG59O1xuXG52YXIgUGFyY2VsUHJvcGVydGllcztcbnZhciBDb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzO1xudmFyIFVuY29tcGxldGVkUHJvcGVydGllcztcbnZhciBCdWlsZGluZ1Byb3BlcnRpZXM7XG52YXIgWm9uZVByb3BlcnRpZXM7XG52YXIgQm91bmRQcm9wZXJ0aWVzO1xuXG5mdW5jdGlvbiBnZXRWYWx1ZUZyb21EaWN0KEtleSwgRGljKSB7XG4gICAgZm9yICh2YXIgayBpbiBEaWMpIHtcbiAgICAgICAgaWYgKGsgPT09IEtleSkge1xuICAgICAgICAgICAgcmV0dXJuIERpY1trXTtcbiAgICAgICAgfVxuICAgIH1cbn1cblxubW9kdWxlLmV4cG9ydHMuZ2V0UHJvcGVydGllcyA9IGZ1bmN0aW9uIChGZWF0dXJlLCBGZWF0dXJlVHlwZSkge1xuICAgIHN3aXRjaCAoRmVhdHVyZVR5cGUpIHtcbiAgICAgICAgY2FzZSAnUGFyY2VsJyA6XG4gICAgICAgIHtcbiAgICAgICAgICAgIFBhcmNlbFByb3BlcnRpZXMgPSB7XG4gICAgICAgICAgICAgICAgb2JqZWN0VHlwZTogJ9CX0KMnLFxuICAgICAgICAgICAgICAgIFwi0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQvdC+0LzQtdGAXCI6ICcnLCAvLyByZXF1aXJlXG4gICAgICAgICAgICAgICAgXCLQodGC0LDRgtGD0YFcIjogJzAxJywgLy8gZFN0YXRlcyByZXF1aXJlXG4gICAgICAgICAgICAgICAgXCLQlNCw0YLQsCDRgdC+0LfQtNCw0L3QuNGPXCI6ICcnLFxuICAgICAgICAgICAgICAgIFwi0KLQuNC/INC+0LHRitC10LrRgtCwXCI6ICcnLCAvL2RQYXJjZWxzIHJlcXVpcmVcbiAgICAgICAgICAgICAgICBcItCa0LDRgtC10LPQvtGA0LjRjyDQt9C10LzQtdC70YxcIjogJycsIC8vIGRDYXRlZ29yaWVzIC8vIHJlcXVpcmVcbiAgICAgICAgICAgICAgICBcItCf0LvQvtGJ0LDQtNGMXCI6IHsvLyByZXF1cmVcbiAgICAgICAgICAgICAgICAgICAgXCLQl9C90LDRh9C10L3QuNC1XCI6IDAsIC8vIHJlcXVpcmVcbiAgICAgICAgICAgICAgICAgICAgXCLQtdC0LtC40LfQvFwiOiAnJywgLy9kVW5pdCByZXF1aXJlXG4gICAgICAgICAgICAgICAgICAgIFwi0KLQvtGH0L3QvtGB0YLRjFwiOiAnJyAvLyBkMjBfMlxuICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXCLQoNCw0LfRgNC10YjRkdC90L3QvtC1INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNC1XCI6IHsvLyByZXF1aXJlXG4gICAgICAgICAgICAgICAgICAgIFwi0L/QviDQtNC+0LrRg9C80LXQvdGC0YNcIjogJycsXG4gICAgICAgICAgICAgICAgICAgIFwi0L/QviDRgdC/0YDQsNCy0L7Rh9C90LjQutGDXCI6ICcnIC8vIGRVdGlsaXphdGlvbiByZXF1aXJlXG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfTtcbiAgICAgICAgICAgIFBhcmNlbFByb3BlcnRpZXNbXCLQmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC90L7QvNC10YBcIl0gPSBGZWF0dXJlLkNhZGFzdHJhbE51bWJlcjtcbiAgICAgICAgICAgIFBhcmNlbFByb3BlcnRpZXNbXCLQodGC0LDRgtGD0YFcIl0gPSBnZXRWYWx1ZUZyb21EaWN0KEZlYXR1cmUuU3RhdGUsIGRTdGF0ZXMpO1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllc1tcItCi0LjQvyDQvtCx0YrQtdC60YLQsFwiXSA9IGdldFZhbHVlRnJvbURpY3QoRmVhdHVyZS5OYW1lLCBkUGFyY2Vscyk7XG4gICAgICAgICAgICBQYXJjZWxQcm9wZXJ0aWVzW1wi0JrQsNGC0LXQs9C+0YDQuNGPINC30LXQvNC10LvRjFwiXSA9IGdldFZhbHVlRnJvbURpY3QoRmVhdHVyZS5DYXRlZ29yeSwgZENhdGVnb3JpZXMpO1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllc1tcItCU0LDRgtCwINGB0L7Qt9C00LDQvdC40Y9cIl0gPSBGZWF0dXJlLkRhdGVDcmVhdGVkO1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllc1tcItCg0LDQt9GA0LXRiNGR0L3QvdC+0LUg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40LVcIl1bXCLQv9C+INGB0L/RgNCw0LLQvtGH0L3QuNC60YNcIl0gPVxuICAgICAgICAgICAgICAgICAgICBnZXRWYWx1ZUZyb21EaWN0KEZlYXR1cmUuVXRpbGl6YXRpb24uVXRpbGl6YXRpb24sIGRVdGlsaXphdGlvbnMpO1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllc1tcItCg0LDQt9GA0LXRiNGR0L3QvdC+0LUg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40LVcIl1bXCLQv9C+INC00L7QutGD0LzQtdC90YLRg1wiXSA9IEZlYXR1cmUuVXRpbGl6YXRpb24uQnlEb2M7XG4gICAgICAgICAgICBicmVhaztcbiAgICAgICAgfVxuICAgICAgICBjYXNlICdDb25zdHJ1Y3Rpb24nOlxuICAgICAgICB7XG4gICAgICAgICAgICBDb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzID0ge1xuICAgICAgICAgICAgICAgIG9iamVjdFR5cGU6ICfQntCa0KEg0YHQvtC+0YDRg9C20LXQvdC40LUnLFxuICAgICAgICAgICAgICAgIGNhZGFzdHJlTnVtYmVyOiAnJywgLy8gXG4gICAgICAgICAgICAgICAgQXNzaWduYXRpb25OYW1lOiAnJyxcbiAgICAgICAgICAgICAgICBBZGRyZXNzOiB7XG4gICAgICAgICAgICAgICAgICAgIE5vdGU6ICcnXG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfTtcbiAgICAgICAgICAgIGlmIChGZWF0dXJlLkNhZGFzdHJhbE51bWJlcikge1xuICAgICAgICAgICAgICAgIENvbnN0cnVjdGlvblByb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIgPSBGZWF0dXJlLkNhZGFzdHJhbE51bWJlcjtcbiAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgQ29uc3RydWN0aW9uUHJvcGVydGllcy5jYWRhc3RyZU51bWJlciA9ICcnO1xuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgICBDb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzLkFzc2lnbmF0aW9uTmFtZSA9IEZlYXR1cmUuQXNzaWduYXRpb25OYW1lO1xuICAgICAgICAgICAgQ29uc3RydWN0aW9uUHJvcGVydGllcy5PYmplY3RUeXBlID0gZ2V0VmFsdWVGcm9tRGljdChGZWF0dXJlLk9iamVjdFR5cGUsIGRab25lKTtcbiAgICAgICAgICAgIENvbnN0cnVjdGlvblByb3BlcnRpZXNbXCJBZGRyZXNzXCJdW1wiTm90ZVwiXSA9IEZlYXR1cmUuQWRkcmVzcy5Ob3RlO1xuICAgICAgICAgICAgYnJlYWs7XG4gICAgICAgIH1cbiAgICAgICAgY2FzZSAnQnVpbGRpbmcnOlxuICAgICAgICB7XG4gICAgICAgICAgICBCdWlsZGluZ1Byb3BlcnRpZXMgPSB7XG4gICAgICAgICAgICAgICAgb2JqZWN0VHlwZTogJ9Ce0JrQoScsXG4gICAgICAgICAgICAgICAgY2FkYXN0cmVOdW1iZXI6ICcnLCAvLyBcbiAgICAgICAgICAgICAgICBBc3NpZ25hdGlvbk5hbWU6ICcnLFxuICAgICAgICAgICAgICAgIEFkZHJlc3M6IHtcbiAgICAgICAgICAgICAgICAgICAgTm90ZTogJydcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9O1xuICAgICAgICAgICAgaWYgKEZlYXR1cmUuQ2FkYXN0cmFsTnVtYmVyKSB7XG4gICAgICAgICAgICAgICAgQnVpbGRpbmdQcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyID0gRmVhdHVyZS5DYWRhc3RyYWxOdW1iZXI7XG4gICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgIEJ1aWxkaW5nUHJvcGVydGllcy5jYWRhc3RyZU51bWJlciA9ICcnO1xuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgICBCdWlsZGluZ1Byb3BlcnRpZXMuQXNzaWduYXRpb25OYW1lID0gRmVhdHVyZS5Bc3NpZ25hdGlvbk5hbWU7XG4gICAgICAgICAgICAvL0J1aWxkaW5nUHJvcGVydGllcy5vYmplY3RUeXBlID0gZ2V0VmFsdWVGcm9tRGljdChGZWF0dXJlLk9iamVjdFR5cGUsIGRab25lKTtcbiAgICAgICAgICAgIEJ1aWxkaW5nUHJvcGVydGllc1tcIkFkZHJlc3NcIl1bXCJOb3RlXCJdID0gRmVhdHVyZS5BZGRyZXNzLk5vdGU7XG4gICAgICAgICAgICBicmVhaztcbiAgICAgICAgfVxuICAgICAgICBjYXNlICdVbmNvbXBsZXRlZCc6XG4gICAgICAgIHtcbiAgICAgICAgICAgIFVuY29tcGxldGVkUHJvcGVydGllcyA9IHtcbiAgICAgICAgICAgICAgICBvYmplY3RUeXBlOiAn0J7QmtChINC90LXQt9Cw0LLQtdGA0YjRkdC90L3Ri9C5JyxcbiAgICAgICAgICAgICAgICBjYWRhc3RyZU51bWJlcjogJycsIC8vIFxuICAgICAgICAgICAgICAgIEFzc2lnbmF0aW9uTmFtZTogJycsXG4gICAgICAgICAgICAgICAgQWRkcmVzczoge1xuICAgICAgICAgICAgICAgICAgICBOb3RlOiAnJ1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH07XG4gICAgICAgICAgICBpZiAoRmVhdHVyZS5DYWRhc3RyYWxOdW1iZXIpIHtcbiAgICAgICAgICAgICAgICBVbmNvbXBsZXRlZFByb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIgPSBGZWF0dXJlLkNhZGFzdHJhbE51bWJlcjtcbiAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgVW5jb21wbGV0ZWRQcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyID0gJyc7XG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICAgIFVuY29tcGxldGVkUHJvcGVydGllcy5Bc3NpZ25hdGlvbk5hbWUgPSBGZWF0dXJlLkFzc2lnbmF0aW9uTmFtZTtcbiAgICAgICAgICAgIC8vVW5jb21wbGV0ZWRQcm9wZXJ0aWVzLm9iamVjdFR5cGUgPSBnZXRWYWx1ZUZyb21EaWN0KEZlYXR1cmUuT2JqZWN0VHlwZSwgZFpvbmUpO1xuICAgICAgICAgICAgVW5jb21wbGV0ZWRQcm9wZXJ0aWVzW1wiQWRkcmVzc1wiXVtcIk5vdGVcIl0gPSBGZWF0dXJlLkFkZHJlc3MuTm90ZTtcbiAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICB9XG4gICAgICAgIGNhc2UgJ1pvbmUnIDpcbiAgICAgICAge1xuICAgICAgICAgICAgWm9uZVByb3BlcnRpZXMgPSB7XG4gICAgICAgICAgICAgICAgb2JqZWN0VHlwZTogJ9CX0L7QvdCwJyxcbiAgICAgICAgICAgICAgICBhY2NvdW50TnVtYmVyOiAnJywgLy8gXG4gICAgICAgICAgICAgICAgZGVzY3JpcHRpb246ICcnLFxuICAgICAgICAgICAgICAgIHRlcnJpdG9yaWFsWm9uZToge1xuICAgICAgICAgICAgICAgICAgIFxuICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgc3BlY2lhbFpvbmU6IHtcbiAgICAgICAgICAgICAgICAgICAgY29udGVudFJlc3RyaWN0aW9uczogJydcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9O1xuICAgICAgICAgICAgWm9uZVByb3BlcnRpZXMuYWNjb3VudE51bWJlciA9IEZlYXR1cmUuQWNjb3VudE51bWJlcjtcbiAgICAgICAgICAgIFpvbmVQcm9wZXJ0aWVzLmRlc2NyaXB0aW9uID0gRmVhdHVyZS5EZXNjcmlwdGlvbjtcbiAgICAgICAgfVxuICAgICAgICBjYXNlICdCb3VuZCcgOlxuICAgICAgICB7XG4gICAgICAgICAgICBCb3VuZFByb3BlcnRpZXMgPSB7XG4gICAgICAgICAgICAgICAgb2JqZWN0VHlwZTogJ9CT0YDQsNC90LjRhtCwJyxcbiAgICAgICAgICAgICAgICBhY2NvdW50TnVtYmVyOiAnJywgLy8gXG4gICAgICAgICAgICAgICAgZGVzY3JpcHRpb246ICcnXG4gICAgICAgICAgICB9O1xuICAgICAgICAgICAgQm91bmRQcm9wZXJ0aWVzLmFjY291bnROdW1iZXIgPSBGZWF0dXJlLkFjY291bnROdW1iZXI7XG4gICAgICAgICAgICBCb3VuZFByb3BlcnRpZXMuZGVzY3JpcHRpb24gPSBGZWF0dXJlLkRlc2NyaXB0aW9uO1xuICAgICAgICB9XG4gICAgICAgIGRlZmF1bHQgOlxuICAgICAgICB7XG4gICAgICAgICAgICBjb25zb2xlLmxvZygn0KLQuNC/INC+0LHRitC10LrRgtCwINC90LUg0YDQsNGB0L/QvtC30L3QsNC9Jyk7XG4gICAgICAgIH1cbiAgICB9XG4gICAgcmV0dXJuIHtcbiAgICAgICAgcGFyY2VsUHJvcGVydGllczogUGFyY2VsUHJvcGVydGllcyxcbiAgICAgICAgY29uc3RydWN0aW9uUHJvcGVydGllczogQ29uc3RydWN0aW9uUHJvcGVydGllcyxcbiAgICAgICAgdW5jb21wbGV0ZWRQcm9wZXJ0aWVzOiBVbmNvbXBsZXRlZFByb3BlcnRpZXMsXG4gICAgICAgIGJ1aWxkaW5nUHJvcGVydGllczogQnVpbGRpbmdQcm9wZXJ0aWVzLFxuICAgICAgICB6b25lUHJvcGVydGllczogWm9uZVByb3BlcnRpZXMsXG4gICAgICAgIGJvdW5kUHJvcGVydGllczogQm91bmRQcm9wZXJ0aWVzXG4gICAgfTtcbn07IiwidmFyIEVTID0gcmVxdWlyZSgnLi9zcGF0aWFsL0VudGl0eVNwYXRpYWwuanMnKTtcbnZhciBQcm9wcyA9IHJlcXVpcmUoJy4vY2FkUHJvcHMnKTtcblxubW9kdWxlLmV4cG9ydHMuR2VvSlNPTiA9IGZ1bmN0aW9uICh4bWxEYXRhLCByZXByb2plY3QpIHtcblxuICAgIHZhciBnZW9KU09OUXVhcnRhbCA9IHtcbiAgICAgICAgdHlwZTogXCJGZWF0dXJlQ29sbGVjdGlvblwiLFxuICAgICAgICBmZWF0dXJlczogW11cbiAgICB9O1xuICAgIHZhciBnZW9KU09OQm91bmRzID0ge1xuICAgICAgICB0eXBlOiBcIkZlYXR1cmVDb2xsZWN0aW9uXCIsXG4gICAgICAgIGZlYXR1cmVzOiBbXVxuICAgIH07XG4gICAgdmFyIGdlb0pTT05ab25lcyA9IHtcbiAgICAgICAgdHlwZTogXCJGZWF0dXJlQ29sbGVjdGlvblwiLFxuICAgICAgICBmZWF0dXJlczogW11cbiAgICB9O1xuICAgIHZhciBnZW9KU09OUGFyY2VscyA9IHtcbiAgICAgICAgJ3R5cGUnOiAnRmVhdHVyZUNvbGxlY3Rpb24nLFxuICAgICAgICAnZmVhdHVyZXMnOiBbXVxuICAgIH07XG4gICAgdmFyIGdlb0pTT05SZWFsdHkgPSB7XG4gICAgICAgIHR5cGU6IFwiRmVhdHVyZUNvbGxlY3Rpb25cIixcbiAgICAgICAgZmVhdHVyZXM6IFtdXG4gICAgfTtcbiAgICAvLyDQntGC0LTQtdC70YzQvdC+0LUg0YXRgNCw0L3QuNC70LjRidC1INC00LvRjyBHZW9tZXRyeUNvbGxlY3Rpb25cbi8vICAgIHZhciBnZW9KU09OUmVhbHR5Q29sbGVjdGlvbiA9IHtcbi8vICAgICAgICB0eXBlOiBcIkZlYXR1cmVDb2xsZWN0aW9uXCIsXG4vLyAgICAgICAgZmVhdHVyZXM6IFtdXG4vLyAgICB9O1xuICAgIHZhciBnZW9KU09OT1NNUG9pbnRzID0ge1xuICAgICAgICB0eXBlOiBcIkZlYXR1cmVDb2xsZWN0aW9uXCIsXG4gICAgICAgIGZlYXR1cmVzOiBbXVxuICAgIH07XG5cbiAgICB2YXIgX3JlcHJvamVjdCA9IHJlcHJvamVjdCB8fCBudWxsO1xuXG4gICAgdmFyIEFsbERhdGEgPSAkLnhtbDJqc29uKHhtbERhdGEpLkNhZGFzdHJhbEJsb2Nrcy5DYWRhc3RyYWxCbG9jaztcbiAgICAvL2NvbnNvbGUubG9nKEFsbERhdGEpO1xuXG4gICAgLy8g0JzQvtC20LXRgiDQsdGL0YLRjCDQvdC10YHQutC+0LvRjNC60L4g0KHQmlxuICAgIHZhciBwcm9qTVNLO1xuICAgIGlmIChfcmVwcm9qZWN0ICE9PSBudWxsKSB7XG4gICAgICAgIHByb2pNU0sgPSBBbGxEYXRhLkNvb3JkU3lzdGVtcztcbiAgICB9XG5cbiAgICAvLyDQntCx0YDQsNCx0L7RgtC60LAg0LrQstCw0YDRgtCw0LvQsC4g0J3QtSDQvNC+0LbQtdGCINCx0YvRgtGMINC80L3QvtCz0L7QutC+0L3RgtGD0YDQvdGL0LwgICAgICAgICAgIFxuICAgIGlmIChBbGxEYXRhLlNwYXRpYWxEYXRhICE9PSBudWxsKSB7XG4gICAgICAgIHZhciBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoQWxsRGF0YS5TcGF0aWFsRGF0YS5FbnRpdHlTcGF0aWFsLCBwcm9qTVNLLCAnUXVhcnRhbCcsIGZhbHNlKTtcbiAgICAgICAgaWYgKChzcE9iaiA9PT0gdW5kZWZpbmVkKSB8fCAoc3BPYmoubGVuZ3RoID09PSAwKSkge1xuICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDQutCy0LDRgNGC0LDQu9CwINGBINC/0YPRgdGC0L7QuSDQs9C10L7QvNC10YLRgNC40LXQuSEg0J7QsdGK0LXQutGCINCx0YPQtNC10YIg0L/RgNC+0L/Rg9GJ0LXQvS4nKTtcbiAgICAgICAgfVxuICAgICAgICAvLyDQmtCy0LDRgNGC0LDQu1xuICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICd0eXBlJzogJ0ZlYXR1cmUnXG4gICAgICAgIH07XG4gICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgLy8g0J7RgdGC0LDQu9GM0L3Ri9C1INGB0LLQvtC50YHRgtCy0LAuLi4uXG5cbiAgICAgICAgZ2VvSlNPTlF1YXJ0YWwuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICB9IGVsc2Uge1xuICAgICAgICBjb25zb2xlLmxvZygn0J3QtdGCINC+0L/QuNGB0LDQvdC40Y8g0L/RgNC+0YHRgtGA0LDQvdGB0YLQstC10L3QvdC+0Lkg0YHQvtGB0YLQsNCy0LvRj9GO0YnQtdC5INC60LLQsNGA0YLQsNC70LAnKTtcbiAgICB9XG5cbiAgICAvLyDQntCx0YDQsNCx0L7RgtC60LAg0LPRgNCw0L3QuNGGLiDQndC1INC80L7Qs9GD0YIg0LHRi9GC0Ywg0LzQvdC+0LPQvtC60L7QvdGC0YPRgNC90YvQvNC4XG4gICAgaWYgKEFsbERhdGEuQm91bmRzKSB7XG5cbiAgICAgICAgaWYgKEFsbERhdGEuQm91bmRzLkJvdW5kLnNwbGljZSkge1xuICAgICAgICAgICAgZm9yICh2YXIgaSA9IDA7IGkgPCBBbGxEYXRhLkJvdW5kcy5Cb3VuZC5sZW5ndGg7IGkrKykge1xuICAgICAgICAgICAgICAgIGlmIChBbGxEYXRhLkJvdW5kcy5Cb3VuZFtpXS5Cb3VuZGFyaWVzLkJvdW5kYXJ5LnNwbGljZSkge1xuICAgICAgICAgICAgICAgICAgICBmb3IgKHZhciBrID0gMDsgayA8IEFsbERhdGEuQm91bmRzLkJvdW5kW2ldLkJvdW5kYXJpZXMuQm91bmRhcnkubGVuZ3RoOyBrKyspIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIC8vINCT0YDQsNC90LjRhtCwXG4gICAgICAgICAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAndHlwZSc6ICdGZWF0dXJlJ1xuICAgICAgICAgICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGlmIChBbGxEYXRhLkJvdW5kcy5Cb3VuZFtpXS5Cb3VuZGFyaWVzLkJvdW5kYXJ5W2tdLkVudGl0eVNwYXRpYWwgIT09IG51bGwpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB2YXIgc3BPYmogPSBFUy5nZXRFbnRpdHlTcGF0aWFsKEFsbERhdGEuQm91bmRzLkJvdW5kW2ldLkJvdW5kYXJpZXMuQm91bmRhcnlba10uRW50aXR5U3BhdGlhbCwgcHJvak1TSywgJ0JvdW5kJywgZmFsc2UpO1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGlmICgoc3BPYmogPT09IHVuZGVmaW5lZCkgfHwgKHNwT2JqLmxlbmd0aCA9PT0gMCkpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDQk9GA0LDQvdC40YbRiyDRgSDQv9GD0YHRgtC+0Lkg0LPQtdC+0LzQtdGC0YDQuNC10LkhINCe0LHRitC10LrRgiDQsdGD0LTQtdGCINC/0YDQvtC/0YPRidC10L0uJyk7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIGNvbnRpbnVlO1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgLy8g0J7RgdGC0LDQu9GM0L3Ri9C1INGB0LLQvtC50YHRgtCy0LAuLi4uXG5cbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBnZW9KU09OQm91bmRzLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2coJ9Cd0LXRgiDQvtC/0LjRgdCw0L3QuNGPINC/0YDQvtGB0YLRgNCw0L3RgdGC0LLQtdC90L3QvtC5INGB0L7RgdGC0LDQstC70Y/RjtGJ0LXQuSDQs9GA0LDQvdC40YbRiycpO1xuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICAgICAgLy8g0JPRgNCw0L3QuNGG0LBcbiAgICAgICAgICAgICAgICAgICAgdmFyIGZlYXR1cmUgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAndHlwZSc6ICdGZWF0dXJlJ1xuICAgICAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgICAgICB2YXIgc3BPYmogPSBFUy5nZXRFbnRpdHlTcGF0aWFsKEFsbERhdGEuQm91bmRzLkJvdW5kW2ldLkJvdW5kYXJpZXMuQm91bmRhcnkuRW50aXR5U3BhdGlhbCwgcHJvak1TSywgJ0JvdW5kJywgZmFsc2UpO1xuICAgICAgICAgICAgICAgICAgICBpZiAoKHNwT2JqID09PSB1bmRlZmluZWQpIHx8IChzcE9iai5sZW5ndGggPT09IDApKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0J7QsdGK0LXQutGCINCT0YDQsNC90LjRhtGLINGBINC/0YPRgdGC0L7QuSDQs9C10L7QvNC10YLRgNC40LXQuSEg0J7QsdGK0LXQutGCINCx0YPQtNC10YIg0L/RgNC+0L/Rg9GJ0LXQvS4nKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGNvbnRpbnVlO1xuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIC8vZmVhdHVyZS5nZW9tZXRyeSA9IHNwT2JqO1xuICAgICAgICAgICAgICAgICAgICAvLyDQntGB0YLQsNC70YzQvdGL0LUg0YHQstC+0LnRgdGC0LLQsC4uLi5cbiAgICAgICAgICAgICAgICAgICAgaWYgKHNwT2JqKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAgICAgICAgICAgICAvLyDQntGB0YLQsNC70YzQvdGL0LUg0YHQstC+0LnRgdGC0LLQsC4uLi5cbiAgICAgICAgICAgICAgICAgICAgICAgIHZhciBwcm9wcyA9IFByb3BzLmdldFByb3BlcnRpZXMoQWxsRGF0YS5Cb3VuZHMuQm91bmRbaV0sICdCb3VuZCcpO1xuICAgICAgICAgICAgICAgICAgICAgICAgaWYgKHByb3BzKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5wcm9wZXJ0aWVzID0gcHJvcHMuYm91bmRQcm9wZXJ0aWVzO1xuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZygn0J7QsdGK0LXQutGCINGB0L7Qt9C00LDQvS4g0JrQnTonICsgZmVhdHVyZS5wcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGdlb0pTT05Cb3VuZHMuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAvL2dlb0pTT05Cb3VuZHMuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICB2YXIgc3BPYmogPSBFUy5nZXRFbnRpdHlTcGF0aWFsKEFsbERhdGEuQm91bmRzLkJvdW5kLkJvdW5kYXJpZXMuQm91bmRhcnkuRW50aXR5U3BhdGlhbCwgcHJvak1TSywgJ0JvdW5kJywgZmFsc2UpO1xuICAgICAgICAgICAgaWYgKChzcE9iaiA9PT0gdW5kZWZpbmVkKSB8fCAoc3BPYmoubGVuZ3RoID09PSAwKSkge1xuICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQntCx0YrQtdC60YIg0JPRgNCw0L3QuNGG0Ysg0YEg0L/Rg9GB0YLQvtC5INCz0LXQvtC80LXRgtGA0LjQtdC5ISDQntCx0YrQtdC60YIg0LHRg9C00LXRgiDQv9GA0L7Qv9GD0YnQtdC9LicpO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgLy9mZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAgICAgICAgIC8vINCe0YHRgtCw0LvRjNC90YvQtSDRgdCy0L7QudGB0YLQstCwLi4uLlxuICAgICAgICAgICAgICAgICAgICBpZiAoc3BPYmopIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgICAgICAgICAgICAgICAgIC8vINCe0YHRgtCw0LvRjNC90YvQtSDRgdCy0L7QudGB0YLQstCwLi4uLlxuICAgICAgICAgICAgICAgICAgICAgICAgdmFyIHByb3BzID0gUHJvcHMuZ2V0UHJvcGVydGllcyhBbGxEYXRhLkJvdW5kcy5Cb3VuZCwgJ0JvdW5kJyk7XG4gICAgICAgICAgICAgICAgICAgICAgICBpZiAocHJvcHMpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLnByb3BlcnRpZXMgPSBwcm9wcy5ib3VuZFByb3BlcnRpZXM7XG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQntCx0YrQtdC60YIg0YHQvtC30LTQsNC9LiDQmtCdOicgKyBmZWF0dXJlLnByb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIpO1xuICAgICAgICAgICAgICAgICAgICAgICAgZ2VvSlNPTkJvdW5kcy5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIC8vZ2VvSlNPTkJvdW5kcy5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgICAgICB9XG4gICAgfVxuICAgIC8vINCe0LHRgNCw0LHQvtGC0LrQsCDQt9C+0L0uINCd0LUg0LzQvtCz0YPRgiDQsdGL0YLRjCDQvNC90L7Qs9C+0LrQvtC90YLRg9GA0L3Ri9C80LhcbiAgICBpZiAoQWxsRGF0YS5ab25lcykge1xuXG4gICAgICAgIGlmIChBbGxEYXRhLlpvbmVzLlpvbmUuc3BsaWNlKSB7XG4gICAgICAgICAgICBmb3IgKHZhciBpID0gMDsgaSA8IEFsbERhdGEuWm9uZXMuWm9uZS5sZW5ndGg7IGkrKykge1xuICAgICAgICAgICAgICAgIC8vINCX0L7QvdCwXG4gICAgICAgICAgICAgICAgdmFyIGZlYXR1cmUgPSB7XG4gICAgICAgICAgICAgICAgICAgICd0eXBlJzogJ0ZlYXR1cmUnXG4gICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5ab25lcy5ab25lW2ldLkVudGl0eVNwYXRpYWwgIT09IG51bGwpIHtcbiAgICAgICAgICAgICAgICAgICAgdmFyIHNwT2JqID0gRVMuZ2V0RW50aXR5U3BhdGlhbChBbGxEYXRhLlpvbmVzLlpvbmVbaV0uRW50aXR5U3BhdGlhbCwgcHJvak1TSywgJ1pvbmUnLCBmYWxzZSk7XG4gICAgICAgICAgICAgICAgICAgIGlmICgoc3BPYmogPT09IHVuZGVmaW5lZCkgfHwgKHNwT2JqLmxlbmd0aCA9PT0gMCkpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQntCx0YrQtdC60YIg0JfQvtC90Ysg0YEg0L/Rg9GB0YLQvtC5INCz0LXQvtC80LXRgtGA0LjQtdC5ISDQntCx0YrQtdC60YIg0LHRg9C00LXRgiDQv9GA0L7Qv9GD0YnQtdC9LicpO1xuICAgICAgICAgICAgICAgICAgICAgICAgY29udGludWU7XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgLy9mZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAgICAgICAgIGlmIChzcE9iaikge1xuICAgICAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5nZW9tZXRyeSA9IHNwT2JqO1xuICAgICAgICAgICAgICAgICAgICAgICAgLy8g0J7RgdGC0LDQu9GM0L3Ri9C1INGB0LLQvtC50YHRgtCy0LAuLi4uXG4gICAgICAgICAgICAgICAgICAgICAgICB2YXIgcHJvcHMgPSBQcm9wcy5nZXRQcm9wZXJ0aWVzKEFsbERhdGEuWm9uZXMuWm9uZVtpXSwgJ1pvbmUnKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGlmIChwcm9wcykge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGZlYXR1cmUucHJvcGVydGllcyA9IHByb3BzLnpvbmVQcm9wZXJ0aWVzO1xuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZygn0J7QsdGK0LXQutGCINGB0L7Qt9C00LDQvS4g0JrQnTonICsgZmVhdHVyZS5wcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGdlb0pTT05ab25lcy5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIC8vZ2VvSlNPTlpvbmVzLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Cd0LXRgiDQvtC/0LjRgdCw0L3QuNGPINC/0YDQvtGB0YLRgNCw0L3RgdGC0LLQtdC90L3QvtC5INGB0L7RgdGC0LDQstC70Y/RjtGJ0LXQuSDQt9C+0L3RiycpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgIGlmIChBbGxEYXRhLlpvbmVzLlpvbmUuRW50aXR5U3BhdGlhbCAhPT0gbnVsbCkge1xuICAgICAgICAgICAgICAgIC8vINCX0L7QvdCwXG4gICAgICAgICAgICAgICAgdmFyIGZlYXR1cmUgPSB7XG4gICAgICAgICAgICAgICAgICAgICd0eXBlJzogJ0ZlYXR1cmUnXG4gICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICB2YXIgc3BPYmogPSBFUy5nZXRFbnRpdHlTcGF0aWFsKEFsbERhdGEuWm9uZXMuWm9uZS5FbnRpdHlTcGF0aWFsLCBwcm9qTVNLLCAnWm9uZScsIGZhbHNlKTtcbiAgICAgICAgICAgICAgICBpZiAoKHNwT2JqID09PSB1bmRlZmluZWQpIHx8IChzcE9iai5sZW5ndGggPT09IDApKSB7XG4gICAgICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQntCx0YrQtdC60YIg0JfQvtC90Ysg0YEg0L/Rg9GB0YLQvtC5INCz0LXQvtC80LXRgtGA0LjQtdC5ISDQntCx0YrQtdC60YIg0LHRg9C00LXRgiDQv9GA0L7Qv9GD0YnQtdC9LicpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAvL2ZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgICAgICAgICBpZiAoc3BPYmopIHtcbiAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5nZW9tZXRyeSA9IHNwT2JqO1xuICAgICAgICAgICAgICAgICAgICAvLyDQntGB0YLQsNC70YzQvdGL0LUg0YHQstC+0LnRgdGC0LLQsC4uLi5cbiAgICAgICAgICAgICAgICAgICAgdmFyIHByb3BzID0gUHJvcHMuZ2V0UHJvcGVydGllcyhBbGxEYXRhLlpvbmVzLlpvbmUsICdab25lJyk7XG4gICAgICAgICAgICAgICAgICAgIGlmIChwcm9wcykge1xuICAgICAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5wcm9wZXJ0aWVzID0gcHJvcHMuem9uZVByb3BlcnRpZXM7XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZygn0J7QsdGK0LXQutGCINGB0L7Qt9C00LDQvS4g0JrQnTonICsgZmVhdHVyZS5wcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyKTtcbiAgICAgICAgICAgICAgICAgICAgZ2VvSlNPTlpvbmVzLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIC8vZ2VvSlNPTlpvbmVzLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQndC10YIg0L7Qv9C40YHQsNC90LjRjyDQv9GA0L7RgdGC0YDQsNC90YHRgtCy0LXQvdC90L7QuSDRgdC+0YHRgtCw0LLQu9GP0Y7RidC10Lkg0LfQvtC90YsnKTtcbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cbiAgICAvLyDQntCx0YDQsNCx0L7RgtC60LAg0LLRgdC10YUg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LJcbiAgICBmb3IgKHZhciBlID0gMDsgZSA8IEFsbERhdGEuUGFyY2Vscy5QYXJjZWwubGVuZ3RoOyBlKyspIHtcbiAgICAgICAgdmFyIHNwT2JqID0gbnVsbDtcbiAgICAgICAgLy8g0JfQtdC80LXQu9GM0L3Ri9C5INGD0YfQsNGB0YLQvtC6XG4gICAgICAgIHZhciBmZWF0dXJlID0ge1xuICAgICAgICAgICAgJ3R5cGUnOiAnRmVhdHVyZSdcbiAgICAgICAgfTtcbiAgICAgICAgaWYgKEFsbERhdGEuUGFyY2Vscy5QYXJjZWxbZV0uRW50aXR5U3BhdGlhbCAhPT0gdW5kZWZpbmVkKSB7XG4gICAgICAgICAgICBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoQWxsRGF0YS5QYXJjZWxzLlBhcmNlbFtlXS5FbnRpdHlTcGF0aWFsLCBwcm9qTVNLLCAnUGFyY2VsJywgZmFsc2UpO1xuICAgICAgICAgICAgaWYgKChzcE9iaiA9PT0gdW5kZWZpbmVkKSB8fCAoc3BPYmoubGVuZ3RoID09PSAwKSkge1xuICAgICAgICAgICAgICAgIGNvbnRpbnVlO1xuICAgICAgICAgICAgfVxuXG4gICAgICAgIH1cbiAgICAgICAgLy8g0JzQvdC+0LPQvtC60L7QvdGC0YPRgNC90YvQuVxuICAgICAgICBlbHNlIGlmIChBbGxEYXRhLlBhcmNlbHMuUGFyY2VsW2VdLkNvbnRvdXJzKSB7XG4gICAgICAgICAgICB2YXIgQ29udG91cnMgPSBBbGxEYXRhLlBhcmNlbHMuUGFyY2VsW2VdLkNvbnRvdXJzLkNvbnRvdXI7XG4gICAgICAgICAgICB2YXIgbXVsdGlQb2x5Z29uID0gW107XG4gICAgICAgICAgICBmb3IgKHZhciBjID0gMDsgYyA8IENvbnRvdXJzLmxlbmd0aDsgYysrKSB7XG4gICAgICAgICAgICAgICAgdmFyIGVzID0gQ29udG91cnNbY10uRW50aXR5U3BhdGlhbDtcbiAgICAgICAgICAgICAgICB2YXIgcCA9IEVTLmdldEVudGl0eVNwYXRpYWwoZXMsIHByb2pNU0ssICdQYXJjZWwnLCB0cnVlKTtcbiAgICAgICAgICAgICAgICBpZiAocCkge1xuICAgICAgICAgICAgICAgICAgICBtdWx0aVBvbHlnb24ucHVzaChwKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBzcE9iaiA9IHtcbiAgICAgICAgICAgICAgICB0eXBlOiBcIk11bHRpUG9seWdvblwiLFxuICAgICAgICAgICAgICAgIGNvb3JkaW5hdGVzOiBtdWx0aVBvbHlnb25cbiAgICAgICAgICAgIH07XG4gICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQndC10YIg0L7Qv9C40YHQsNC90LjRjyDQv9GA0L7RgdGC0YDQsNC90YHRgtCy0LXQvdC90L7QuSDRgdC+0YHRgtCw0LLQu9GP0Y7RidC10LknKTtcbiAgICAgICAgfVxuXG4gICAgICAgIC8vINCV0YHQu9C4INC90LXRgiDQs9C10L7QvNC10YLRgNC40LgsINGC0L4g0L7QsdGK0LXQutGCINC90LUg0L3Rg9C20LXQvVxuICAgICAgICBpZiAoc3BPYmopIHtcbiAgICAgICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgICAgIC8vINCe0YHRgtCw0LvRjNC90YvQtSDRgdCy0L7QudGB0YLQstCwLi4uLlxuICAgICAgICAgICAgdmFyIHByb3BzID0gUHJvcHMuZ2V0UHJvcGVydGllcyhBbGxEYXRhLlBhcmNlbHMuUGFyY2VsW2VdLCAnUGFyY2VsJyk7XG4gICAgICAgICAgICBpZiAocHJvcHMpIHtcbiAgICAgICAgICAgICAgICBmZWF0dXJlLnByb3BlcnRpZXMgPSBwcm9wcy5wYXJjZWxQcm9wZXJ0aWVzO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgLy9jb25zb2xlLmxvZygn0J7QsdGK0LXQutGCINGB0L7Qt9C00LDQvS4g0JrQnTonICsgZmVhdHVyZS5wcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyKTtcbiAgICAgICAgICAgIGdlb0pTT05QYXJjZWxzLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgIH1cblxuICAgIH1cbiAgICAvLyDQntCx0YDQsNCx0L7RgtC60LAg0YHRgtGA0L7QtdC90LjQuS4g0LzQvtCz0YPRgiDQsdGL0YLRjCDRgdC+0YHRgtCw0LLQvdGL0LUg0LjQtyDRgNCw0LfQvdGL0YUg0LPQtdC+0LzQtdGC0YDQuNC5XG4gICAgaWYgKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHkpIHtcbiAgICAgICAgaWYgKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHkuc3BsaWNlKSB7XG5cbiAgICAgICAgICAgIGZ1bmN0aW9uIHByb2Nlc3NFUyhFbnRpdHlTcGF0aWFsLCBvVHlwZSkge1xuICAgICAgICAgICAgICAgIHZhciBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoRW50aXR5U3BhdGlhbCwgcHJvak1TSywgb1R5cGUsIGZhbHNlKTtcbiAgICAgICAgICAgICAgICBpZiAoc3BPYmopIHtcbiAgICAgICAgICAgICAgICAgICAgaWYgKHNwT2JqLnR5cGUgPT09ICdHZW9tZXRyeUNvbGxlY3Rpb24nKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAvLyBHZW9KU09OINGBINC60L7Qu9C70LXQutGG0LjQtdC5INGC0YDRg9C00L3QviDQvtGC0LrRgNGL0LLQsNGC0Ywg0L3QsCDQtNC10YHQutGC0L7Qv9C1XG4gICAgICAgICAgICAgICAgICAgICAgICAvLyBvZ3Iyb2dyIC1mIEdlb0pTT04gLWV4cGxvZGVjb2xsZWN0aW9ucyBleHBsb2RlIGRvYzIxMzk0MzNfeG1sX1JlYWx0eUdDLmdlb2pzb25cbiAgICAgICAgICAgICAgICAgICAgICAgIC8vINC/0L7RjdGC0L7QvNGDINC70YPRh9GI0LUg0YHQvtC30LTQsNGC0Ywg0YTQuNGHINC/0L4g0LrQvtC70LjRh9C10YHRgtCy0YMg0L7QsdGK0LXQutGC0L7QsiDQsiDQutC+0LvQu9C10LrRhtC40LhcbiAgICAgICAgICAgICAgICAgICAgICAgIGZvciAodmFyIGsgPSAwOyBrIDwgc3BPYmouZ2VvbWV0cmllcy5sZW5ndGggLSAxOyBrKyspIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmouZ2VvbWV0cmllc1trXTtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBnZW9KU09OUmVhbHR5LmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICAvL2dlb0pTT05SZWFsdHlDb2xsZWN0aW9uLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQlNC+0LHQsNCy0LvQtdC9IGdlb0pTT05SZWFsdHlHZW9tZXRyeUNvbGxlY3Rpb24nKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2coc3BPYmouZ2VvbWV0cmllcyk7XG4gICAgICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAgICAgICAgICAgICBnZW9KU09OUmVhbHR5LmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgIH1cblxuICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQntCa0KEg0YEg0L/Rg9GB0YLQvtC5INCz0LXQvtC80LXRgtGA0LjQtdC5ISDQntCx0YrQtdC60YIg0LHRg9C00LXRgiDQv9GA0L7Qv9GD0YnQtdC9LicpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cblxuICAgICAgICAgICAgZm9yICh2YXIgaSA9IDA7IGkgPCBBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5Lmxlbmd0aDsgaSsrKSB7XG4gICAgICAgICAgICAgICAgdmFyIHNwT2JqID0gbnVsbDtcbiAgICAgICAgICAgICAgICAvLyDQntCa0KFcbiAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICAgICAgICAgJ3R5cGUnOiAnRmVhdHVyZSdcbiAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgIC8vINGB0YLRgNC+0LXQvdC40Y9cbiAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5CdWlsZGluZykge1xuICAgICAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5CdWlsZGluZy5FbnRpdHlTcGF0aWFsKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICB2YXIgcHJvcHMgPSBQcm9wcy5nZXRQcm9wZXJ0aWVzKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uQnVpbGRpbmcsICdCdWlsZGluZycpO1xuICAgICAgICAgICAgICAgICAgICAgICAgaWYgKHByb3BzKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5wcm9wZXJ0aWVzID0gcHJvcHMuYnVpbGRpbmdQcm9wZXJ0aWVzO1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2cocHJvcHMuYnVpbGRpbmdQcm9wZXJ0aWVzKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgIHByb2Nlc3NFUyhBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLkJ1aWxkaW5nLkVudGl0eVNwYXRpYWwsICdCdWlsZGluZycpO1xuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIC8vINC+0LHRitC10LrRgtGLINC90LXQt9Cw0LLQtdGA0YjRkdC90L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LBcbiAgICAgICAgICAgICAgICBlbHNlIGlmIChBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLlVuY29tcGxldGVkKSB7XG4gICAgICAgICAgICAgICAgICAgIGlmIChBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLlVuY29tcGxldGVkLkVudGl0eVNwYXRpYWwpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIHZhciBwcm9wcyA9IFByb3BzLmdldFByb3BlcnRpZXMoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5VbmNvbXBsZXRlZCwgJ1VuY29tcGxldGVkJyk7XG4gICAgICAgICAgICAgICAgICAgICAgICBpZiAocHJvcHMpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLnByb3BlcnRpZXMgPSBwcm9wcy51bmNvbXBsZXRlZFByb3BlcnRpZXM7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZyhwcm9wcy51bmNvbXBsZXRlZFByb3BlcnRpZXMpO1xuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICAgcHJvY2Vzc0VTKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uVW5jb21wbGV0ZWQuRW50aXR5U3BhdGlhbCwgJ1VuY29tcGxldGVkJyk7XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgLy8g0YHQvtC+0YDRg9C20LXQvdC40Y9cbiAgICAgICAgICAgICAgICBlbHNlIGlmIChBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLkNvbnN0cnVjdGlvbikge1xuICAgICAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5Db25zdHJ1Y3Rpb24uRW50aXR5U3BhdGlhbCkge1xuICAgICAgICAgICAgICAgICAgICAgICAgdmFyIHByb3BzID0gUHJvcHMuZ2V0UHJvcGVydGllcyhBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLkNvbnN0cnVjdGlvbiwgJ0NvbnN0cnVjdGlvbicpO1xuICAgICAgICAgICAgICAgICAgICAgICAgaWYgKHByb3BzKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5wcm9wZXJ0aWVzID0gcHJvcHMuY29uc3RydWN0aW9uUHJvcGVydGllcztcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKHByb3BzLmNvbnN0cnVjdGlvblByb3BlcnRpZXMpO1xuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICAgcHJvY2Vzc0VTKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uQ29uc3RydWN0aW9uLkVudGl0eVNwYXRpYWwsICdDb25zdHJ1Y3Rpb24nKTtcbiAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cbiAgICAvLyDQntCx0YDQsNCx0L7RgtC60LAg0L/Rg9C90LrRgtC+0LIg0J7QnNChXG5cbiAgICByZXR1cm4ge1xuICAgICAgICBnZW9KU09OUXVhcnRhbDogZ2VvSlNPTlF1YXJ0YWwsXG4gICAgICAgIGdlb0pTT05Cb3VuZHM6IGdlb0pTT05Cb3VuZHMsXG4gICAgICAgIGdlb0pTT05ab25lczogZ2VvSlNPTlpvbmVzLFxuICAgICAgICBnZW9KU09OUGFyY2VsczogZ2VvSlNPTlBhcmNlbHMsXG4gICAgICAgIGdlb0pTT05SZWFsdHk6IGdlb0pTT05SZWFsdHlcbiAgICAgICAgICAgICAgICAvL2dlb0pTT05SZWFsdHlHZW9tZXRyeUNvbGxlY3Rpb246IGdlb0pTT05SZWFsdHlDb2xsZWN0aW9uXG4gICAgfTtcbn07XG4iLCIvKipcbiAqINCc0L7QtNGD0LvRjCDQvtCx0YDQsNCx0L7RgtC60Lgg0LPQtdC+0LzQtdGC0YDQuNC4INGC0LjQv9CwINC/0L7Qu9C40LPQvtC9LlxuICog0J7QtNC40L0g0LLQvdC10YjQvdC40Lkg0LrQvtC90YLRg9GAINC4IDAg0LjQu9C4INCx0L7Qu9C10LUg0LLQvdGD0YLRgNC10L3QvdC40YUg0LrQvtC90YLRg9GA0L7Qsi1cItC00YvRgNC+0LpcIlxuICogXG4gKiBHZW9KU09OIGdlb21ldHJ5INGC0LjQv9CwIHRFbnRpdHlTcGF0aWFsTGFuZE91dFxuICovXG5cbi8vXCJnZW9tZXRyeVwiOiB7XG4vLyAgICBcInR5cGVcIjogXCJQb2x5Z29uXCIsXG4vLyAgICBcImNvb3JkaW5hdGVzXCI6IFtcbi8vICAgICAgWyBbMTAwLjAsIDAuMF0sIFsxMDEuMCwgMC4wXSwgWzEwMS4wLCAxLjBdLFxuLy8gICAgICAgIFsxMDAuMCwgMS4wXSwgWzEwMC4wLCAwLjBdIF1cbi8vICAgICAgXVxuLy8gIH1cblxudmFyIHByb2plY3Rpb25zID0gcmVxdWlyZSgnLi9TcGF0aWFsU3lzdGVtcycpO1xuXG5tb2R1bGUuZXhwb3J0cy5nZXRFbnRpdHlTcGF0aWFsID0gZnVuY3Rpb24gKEVudGl0eVNwYXRpYWxPYmosIHByb2osIG9UeXBlLCBwYXJ0T2ZNdWx0dSkge1xuXG4vL1x0dGhpcy5nZW9tZXRyeSA9IHtcbi8vICAgICAgICB0eXBlOiAnJyxcbi8vXHRcdGNvb3JkaW5hdGVzOiBbXVxuLy9cdH07XG5cbiAgICB2YXIgX0VudGl0eVNwYXRpYWxPYmogPSBFbnRpdHlTcGF0aWFsT2JqO1xuICAgIHZhciBfcHJvaiA9IHByb2ogfHwgbnVsbDtcbiAgICB2YXIgQXJlYSA9IDAuMDtcbiAgICB2YXIgc3BhdGlhbFN5c05hbWUgPSBudWxsO1xuICAgIHZhciBMaW5lU3RyaW5nID0gZmFsc2U7XG5cbiAgICAvLyDQktGL0YfQuNGB0LvQtdC90LjQtSDQv9C70L7RidCw0LTQuCDQt9Cw0LzQutC90YPRgtC+0LPQviDQutC+0L3RgtGD0YDQsFxuICAgIGZ1bmN0aW9uIHBvbHlnb25BcmVhKFhzLCBZcywgbnVtUG9pbnRzKSB7XG4gICAgICAgIHZhciBhcmVhID0gMDtcbiAgICAgICAgdmFyIGogPSBudW1Qb2ludHMgLSAxO1xuICAgICAgICBmb3IgKHZhciBpID0gMDsgaSA8IG51bVBvaW50czsgaSsrKVxuICAgICAgICB7XG4gICAgICAgICAgICBhcmVhID0gYXJlYSArICgoWHNbal0pICsgKFhzW2ldKSkgKiAoKFlzW2pdKSAtIChZc1tpXSkpO1xuICAgICAgICAgICAgaiA9IGk7ICAvL2ogaXMgcHJldmlvdXMgdmVydGV4IHRvIGlcbiAgICAgICAgfVxuICAgICAgICByZXR1cm4gTWF0aC5hYnMoYXJlYSAvIDIpO1xuICAgIH1cblxuICAgIGZ1bmN0aW9uIGNvbnZlcnRDb29yZChjb29yZCkge1xuICAgICAgICAvLyBnbG9iYWxcbiAgICAgICAgaWYgKChfcHJvaiA9PT0gbnVsbCkgfHwgKHNwYXRpYWxTeXNOYW1lID09PSBudWxsKSkge1xuICAgICAgICAgICAgcmV0dXJuIGNvb3JkO1xuICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgcmV0dXJuIHByb2o0KHByb2plY3Rpb25zLlNwYXRpYWxTeXN0ZW1zW3NwYXRpYWxTeXNOYW1lXSwgJ0VQU0c6Mzg1NycsIGNvb3JkKTtcbiAgICAgICAgfVxuICAgIH1cblxuICAgIGZ1bmN0aW9uIGdldFNwYXRpYWxTeXNOYW1lKCkge1xuICAgICAgICB2YXIgaWQgPSBfRW50aXR5U3BhdGlhbE9iai5FbnRTeXM7XG4gICAgICAgIGZvciAodmFyIGkgPSAwOyBfcHJvai5Db29yZFN5c3RlbS5sZW5ndGg7IGkrKykge1xuICAgICAgICAgICAgaWYgKF9wcm9qLkNvb3JkU3lzdGVtW2ldLkNzSWQgPT09IGlkKSB7XG4gICAgICAgICAgICAgICAgcmV0dXJuIF9wcm9qLkNvb3JkU3lzdGVtW2ldLk5hbWU7XG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICAgICAgcmV0dXJuIG51bGw7XG4gICAgfVxuXG4gICAgLy8g0KHQvtC30LTQsNC90LjQtSDQvtC00L3QvtCz0L4g0LfQsNC80LrQvdGD0YLQvtCz0L4g0LrQvtC90YLRg9GA0LAg0LjQu9C4INC70LjQvdC40Lgg0LjQu9C4INC+0LrRgNGD0LbQvdC+0YHRgtC4XG4gICAgZnVuY3Rpb24gY3JlYXRlQ29udG91cihTcGF0aWFsRWxlbWVudCkge1xuICAgICAgICB2YXIgeHMgPSBbXTtcbiAgICAgICAgdmFyIHlzID0gW107XG4gICAgICAgIHZhciBjb250b3VyID0gW107XG4gICAgICAgIHZhciBjb29yZDtcbiAgICAgICAgdmFyIHJlX3Byb2plY3RlZCA9IFtdO1xuICAgICAgICAvLyDQv9GA0L7QstC10YDQutCwINC90LAg0L7QutGA0YPQttC90L7RgdGC0YxcbiAgICAgICAgaWYgKChTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0LlR5cGVVbml0ID09PSBcItCe0LrRgNGD0LbQvdC+0YHRgtGMXCIgfHwgXCLQotC+0YfQutCwXCIpICYmXG4gICAgICAgICAgICAgICAgKFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXQuUiAhPT0gdW5kZWZpbmVkKSkge1xuICAgICAgICAgICAgY29vcmQgPSBbTnVtYmVyKFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXQuT3JkaW5hdGUuWSksIE51bWJlcihTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0Lk9yZGluYXRlLlgpXTtcbiAgICAgICAgICAgIHJlX3Byb2plY3RlZCA9IGNvbnZlcnRDb29yZChjb29yZCk7XG4gICAgICAgICAgICByZXR1cm4ge1xuICAgICAgICAgICAgICAgICdSJzogTnVtYmVyKFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXQuUiksXG4gICAgICAgICAgICAgICAgJ1knOiBOdW1iZXIocmVfcHJvamVjdGVkWzBdKSxcbiAgICAgICAgICAgICAgICAnWCc6IE51bWJlcihyZV9wcm9qZWN0ZWRbMV0pXG4gICAgICAgICAgICB9O1xuICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgaWYgKFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXQubGVuZ3RoID09PSAxKVxuICAgICAgICAgICAgICAgIHJldHVybiBudWxsO1xuICAgICAgICAgICAgdmFyIGZpcnN0UG9pbnQgPSBTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0WzBdO1xuICAgICAgICAgICAgdmFyIGxhc3RQb2ludCA9IFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXRbU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5sZW5ndGggLSAxXTtcbiAgICAgICAgICAgIGlmIChmaXJzdFBvaW50LlN1Tm1iID09PSBsYXN0UG9pbnQuU3VObWIpIHtcbiAgICAgICAgICAgICAgICBMaW5lU3RyaW5nID0gZmFsc2U7XG4gICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZyhMaW5lU3RyaW5nLCBmaXJzdFBvaW50LlN1Tm1iLCBsYXN0UG9pbnQuU3VObWIpO1xuICAgICAgICAgICAgICAgIGZvciAodmFyIGogPSAwOyBqIDwgU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5sZW5ndGggLSAxOyBqKyspIHtcbiAgICAgICAgICAgICAgICAgICAgdmFyIHBvaW50ID0gU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdFtqXTtcbiAgICAgICAgICAgICAgICAgICAgdmFyIHh5ID0gW107XG4gICAgICAgICAgICAgICAgICAgIGNvb3JkID0gW051bWJlcihwb2ludC5PcmRpbmF0ZS5ZKSwgTnVtYmVyKHBvaW50Lk9yZGluYXRlLlgpXTtcbiAgICAgICAgICAgICAgICAgICAgcmVfcHJvamVjdGVkID0gY29udmVydENvb3JkKGNvb3JkKTtcbiAgICAgICAgICAgICAgICAgICAgeHkucHVzaChOdW1iZXIocmVfcHJvamVjdGVkWzBdKSk7XG4gICAgICAgICAgICAgICAgICAgIHh5LnB1c2goTnVtYmVyKHJlX3Byb2plY3RlZFsxXSkpO1xuICAgICAgICAgICAgICAgICAgICBjb250b3VyLnB1c2goeHkpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICBjb250b3VyLnB1c2goY29udG91clswXSk7XG4gICAgICAgICAgICAgICAgQXJlYSA9IHBvbHlnb25BcmVhKHhzLCB5cywgeHMubGVuZ3RoKTtcbiAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgTGluZVN0cmluZyA9IHRydWU7XG4gICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZyhMaW5lU3RyaW5nLCBmaXJzdFBvaW50LlN1Tm1iLCBsYXN0UG9pbnQuU3VObWIpO1xuICAgICAgICAgICAgICAgIGZvciAodmFyIGogPSAwOyBqIDwgU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5sZW5ndGg7IGorKykge1xuICAgICAgICAgICAgICAgICAgICB2YXIgcG9pbnQgPSBTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0W2pdO1xuICAgICAgICAgICAgICAgICAgICB2YXIgeHkgPSBbXTtcbiAgICAgICAgICAgICAgICAgICAgY29vcmQgPSBbTnVtYmVyKHBvaW50Lk9yZGluYXRlLlkpLCBOdW1iZXIocG9pbnQuT3JkaW5hdGUuWCldO1xuICAgICAgICAgICAgICAgICAgICByZV9wcm9qZWN0ZWQgPSBjb252ZXJ0Q29vcmQoY29vcmQpO1xuICAgICAgICAgICAgICAgICAgICB4eS5wdXNoKE51bWJlcihyZV9wcm9qZWN0ZWRbMF0pKTtcbiAgICAgICAgICAgICAgICAgICAgeHkucHVzaChOdW1iZXIocmVfcHJvamVjdGVkWzFdKSk7XG4gICAgICAgICAgICAgICAgICAgIGNvbnRvdXIucHVzaCh4eSk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIC8vINCx0YvQstCw0LUg0YfRgtC+IExpbmVTdHJpbmcg0LjQvNC10LXRgiDQvtC00LjQvdCw0LrQvtCy0YvQtSDQv9C10YDQstGD0Y4g0Lgg0L/QvtGB0LvQtdC00L3RjtGOINGC0L7Rh9C60LhcbiAgICAgICAgICAgICAgICAvLyDQvdC+IFN1Tm1iINGA0LDQt9C90YvQtS5cbi8vICAgICAgICAgICAgICAgIGlmICgoY29udG91clswXVswXVswXSA9PT0gY29udG91clswXVtjb250b3VyWzBdLmxlbmd0aC0xXVswXSkgJiZcbi8vICAgICAgICAgICAgICAgICAgICAgICAgKGNvbnRvdXJbMF1bMF1bMV0gPT09IGNvbnRvdXJbMF1bY29udG91clswXS5sZW5ndGgtMV1bMV0pKXtcbi8vICAgICAgICAgICAgICAgICAgICBkZWxldGUoY29udG91clswXVtjb250b3VyLmxlbmd0aC0xXSk7XG4vLyAgICAgICAgICAgICAgICAgICAgY29uc29sZS5sb2coY29udG91clswXVswXVswXSwgY29udG91clswXVtjb250b3VyWzBdLmxlbmd0aC0xXVswXSxMaW5lU3RyaW5nKTtcbi8vICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIC8vY29uc29sZS5sb2coQXJlYSk7XG4gICAgICAgICAgICByZXR1cm4gY29udG91cjtcbiAgICAgICAgfVxuICAgIH1cblxuICAgIGZ1bmN0aW9uIHByb2Nlc3NTcGF0aWFsRWxlbWVudChTcGF0aWFsRWxlbWVudCkge1xuICAgICAgICB2YXIgY250cnMgPSBbXTtcbiAgICAgICAgaWYgKF9wcm9qICE9PSBudWxsKSB7XG4gICAgICAgICAgICBzcGF0aWFsU3lzTmFtZSA9IGdldFNwYXRpYWxTeXNOYW1lKCk7XG4gICAgICAgIH1cbiAgICAgICAgLy8g0KPRgtC40L3QvdCw0Y8g0YLQuNC/0LjQt9Cw0YbQuNGPINC00LvRjyDQv9GA0L7QstC10YDQutC4INC90LDQu9C40YfQuNGPINC00YvRgNC+0Log0LIg0L/QvtC70LjQs9C+0L3QtVxuICAgICAgICAvLyDQkiDQoNC+0YHRgNC10LXRgdGC0YDQtSDQvdC1INGB0LvQtdC00Y/RgiDQt9CwINC/0L7RgNGP0LTQutC+0Lwg0LrQvtC90YLRg9GA0L7QsiDQv9C+0LvQuNCz0L7QvdCwXG4gICAgICAgIGlmIChTcGF0aWFsRWxlbWVudC5zcGxpY2UpIHtcbiAgICAgICAgICAgIHZhciBNYXhBcmVhO1xuICAgICAgICAgICAgdmFyIE1heEFyZWFJZHggPSAwO1xuICAgICAgICAgICAgZm9yICh2YXIgayA9IDA7IGsgPCBTcGF0aWFsRWxlbWVudC5sZW5ndGg7IGsrKykge1xuICAgICAgICAgICAgICAgIHZhciBjb250b3VyID0gU3BhdGlhbEVsZW1lbnRba107XG4gICAgICAgICAgICAgICAgdmFyIGNudCA9IGNyZWF0ZUNvbnRvdXIoY29udG91cik7XG4gICAgICAgICAgICAgICAgaWYgKGNudClcbiAgICAgICAgICAgICAgICAgICAgY250cnMucHVzaChjbnQpO1xuICAgICAgICAgICAgICAgIGlmIChBcmVhID4gTWF4QXJlYSkge1xuICAgICAgICAgICAgICAgICAgICBNYXhBcmVhID0gQXJlYTtcbiAgICAgICAgICAgICAgICAgICAgTWF4QXJlYUlkeCA9IGs7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfVxuICAgICAgICAgICAgLy8g0J/QtdGA0LXQvNC10YnQsNC10Lwg0L7RgdC90L7QstC90L7QuSAo0L3QsNGA0YPQttC90LjQuSkg0LrQvtC90YLRg9GAINCyINC90LDRh9Cw0LvQviDQvNCw0YHRgdC40LLQsFxuICAgICAgICAgICAgaWYgKE1heEFyZWFJZHggPiAwKSB7XG4gICAgICAgICAgICAgICAgdmFyIG1haW5DbnQgPSBjbnRycy5zcGxpY2UoTWF4QXJlYUlkeCwgMSk7XG4gICAgICAgICAgICAgICAgY250cnMuc3BsaWNlKDAsIDAsIG1haW5DbnQpO1xuICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2coJ9Cd0L7QvNC10YAg0L7RgdC90L7QstC90L7Qs9C+INC60L7QvdGC0YPRgNCwINCx0YvQuyAnICsgTWF4QXJlYUlkeCk7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBpZiAoKGNudHJzICE9PSBudWxsKSB8fCAoY250cnMgIT09IHVuZGVmaW5lZCkpIHtcbiAgICAgICAgICAgICAgICByZXR1cm4gY250cnM7XG4gICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgIHJldHVybiBudWxsO1xuICAgICAgICAgICAgfVxuICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgY250cnMucHVzaChjcmVhdGVDb250b3VyKFNwYXRpYWxFbGVtZW50KSk7XG4gICAgICAgICAgICBpZiAoKGNudHJzICE9PSBudWxsKSB8fCAoY250cnMgIT09IHVuZGVmaW5lZCkpIHtcbiAgICAgICAgICAgICAgICByZXR1cm4gY250cnM7XG4gICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgIHJldHVybiBudWxsO1xuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuXG4gICAgLy8g0YMg0YHQvtC+0YDRg9C20LXQvdC40Lkg0LzQvtC20LXRgiDQsdGL0YLRjCDRgdC80LXRiNCw0L3QsNGPINCz0LXQvtC80LXRgtGA0LjRjyAoTGluZVN0cmluZywgTGluZVN0cmluZywgQ2lyY2xlLCBMaW5lU3RyaW5nKVxuICAgIC8vINCyINGN0YLQvtC8INGB0LvRg9GH0LDQtSDQutC+0L3RgtGD0YDRiyBjbnRycyDQsdGD0LTRg9GCINGF0YDQsNC90LjRgtGMINC60L7Qu9C70LXQutGG0LjRjlxuICAgIGZ1bmN0aW9uIHByb2Nlc3NSZWFsdHlTcGF0aWFsRWxlbWVudChTcGF0aWFsRWxlbWVudCkge1xuICAgICAgICB2YXIgY250cnMgPSBbXTtcbiAgICAgICAgaWYgKF9wcm9qICE9PSBudWxsKSB7XG4gICAgICAgICAgICBzcGF0aWFsU3lzTmFtZSA9IGdldFNwYXRpYWxTeXNOYW1lKCk7XG4gICAgICAgIH1cbiAgICAgICAgaWYgKFNwYXRpYWxFbGVtZW50LnNwbGljZSkge1xuICAgICAgICAgICAgdmFyIE1heEFyZWE7XG4gICAgICAgICAgICB2YXIgTWF4QXJlYUlkeCA9IDA7XG4gICAgICAgICAgICBmb3IgKHZhciBrID0gMDsgayA8IFNwYXRpYWxFbGVtZW50Lmxlbmd0aDsgaysrKSB7XG4gICAgICAgICAgICAgICAgdmFyIGNvbnRvdXIgPSBTcGF0aWFsRWxlbWVudFtrXTtcbiAgICAgICAgICAgICAgICB2YXIgY250ID0gY3JlYXRlQ29udG91cihjb250b3VyKTtcbiAgICAgICAgICAgICAgICBpZiAoY250KVxuICAgICAgICAgICAgICAgICAgICBjbnRycy5wdXNoKGNudCk7XG4gICAgICAgICAgICAgICAgaWYgKEFyZWEgPiBNYXhBcmVhKSB7XG4gICAgICAgICAgICAgICAgICAgIE1heEFyZWEgPSBBcmVhO1xuICAgICAgICAgICAgICAgICAgICBNYXhBcmVhSWR4ID0gaztcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICAvLyDQn9C10YDQtdC80LXRidCw0LXQvCDQvtGB0L3QvtCy0L3QvtC5ICjQvdCw0YDRg9C20L3QuNC5KSDQutC+0L3RgtGD0YAg0LIg0L3QsNGH0LDQu9C+INC80LDRgdGB0LjQstCwXG4gICAgICAgICAgICBpZiAoKCFMaW5lU3RyaW5nKSAmJiAoTWF4QXJlYUlkeCA+IDApKSB7XG4gICAgICAgICAgICAgICAgdmFyIG1haW5DbnQgPSBjbnRycy5zcGxpY2UoTWF4QXJlYUlkeCwgMSk7XG4gICAgICAgICAgICAgICAgY250cnMuc3BsaWNlKDAsIDAsIG1haW5DbnQpO1xuICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2coJ9Cd0L7QvNC10YAg0L7RgdC90L7QstC90L7Qs9C+INC60L7QvdGC0YPRgNCwINCx0YvQuyAnICsgTWF4QXJlYUlkeCk7XG4gICAgICAgICAgICB9XG4gICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICBjbnRycy5wdXNoKGNyZWF0ZUNvbnRvdXIoU3BhdGlhbEVsZW1lbnQpKTtcbiAgICAgICAgfVxuICAgICAgICBpZiAoY250cnMubGVuZ3RoID4gMSkge1xuICAgICAgICAgICAgY29sbGVjdGlvbiA9IFtdO1xuXG4gICAgICAgICAgICBmb3IgKHZhciBpID0gMDsgaSA8IGNudHJzLmxlbmd0aCAtIDE7IGkrKykge1xuICAgICAgICAgICAgICAgIC8vINCe0LrRgNGD0LbQvdC+0YHRgtGMXG4gICAgICAgICAgICAgICAgaWYgKGNudHJzW2ldLlIpIHtcbiAgICAgICAgICAgICAgICAgICAgdmFyIHBvaW50cyA9IGFwcHJveGltYXRlQ2lyY2xlKGNudHJzW2ldLlgsIGNudHJzW2ldLlksIGNudHJzW2ldLlIpO1xuICAgICAgICAgICAgICAgICAgICBjb2xsZWN0aW9uLnB1c2goe1xuICAgICAgICAgICAgICAgICAgICAgICAgXCJ0eXBlXCI6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXCJjb29yZGluYXRlc1wiOiBbcG9pbnRzXVxuICAgICAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgLy8g0J/QvtC70LjQs9C+0L1cbiAgICAgICAgICAgICAgICBlbHNlIGlmICghTGluZVN0cmluZykge1xuICAgICAgICAgICAgICAgICAgICBjb2xsZWN0aW9uLnB1c2goe1xuICAgICAgICAgICAgICAgICAgICAgICAgXCJ0eXBlXCI6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXCJjb29yZGluYXRlc1wiOiBbY250cnNbaV1dXG4gICAgICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgIGNvbGxlY3Rpb24ucHVzaCh7XG4gICAgICAgICAgICAgICAgICAgICAgICBcInR5cGVcIjogXCJMaW5lU3RyaW5nXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBcImNvb3JkaW5hdGVzXCI6IGNudHJzW2ldXG4gICAgICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIHJldHVybiAge1xuICAgICAgICAgICAgICAgIFwidHlwZVwiOiBcIkdlb21ldHJ5Q29sbGVjdGlvblwiLFxuICAgICAgICAgICAgICAgIFwiZ2VvbWV0cmllc1wiOiBjb2xsZWN0aW9uXG4gICAgICAgICAgICB9O1xuXG4gICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAvLyDQntC60YDRg9C20L3QvtGB0YLRjFxuICAgICAgICAgICAgaWYgKGNudHJzWzBdLlIpIHtcbiAgICAgICAgICAgICAgICB2YXIgcG9pbnRzID0gYXBwcm94aW1hdGVDaXJjbGUoY250cnNbMF0uWCwgY250cnNbMF0uWSwgY250cnNbMF0uUik7XG4gICAgICAgICAgICAgICAgcmV0dXJuIHtcbiAgICAgICAgICAgICAgICAgICAgXCJ0eXBlXCI6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICBcImNvb3JkaW5hdGVzXCI6IFtwb2ludHNdXG4gICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIC8vINCf0L7Qu9C40LPQvtC9XG4gICAgICAgICAgICBlbHNlIGlmICghTGluZVN0cmluZykge1xuICAgICAgICAgICAgICAgIHJldHVybntcbiAgICAgICAgICAgICAgICAgICAgXCJ0eXBlXCI6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICBcImNvb3JkaW5hdGVzXCI6IFtjbnRyc1swXV1cbiAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICByZXR1cm57XG4gICAgICAgICAgICAgICAgICAgIFwidHlwZVwiOiBcIkxpbmVTdHJpbmdcIixcbiAgICAgICAgICAgICAgICAgICAgXCJjb29yZGluYXRlc1wiOiBjbnRyc1swXVxuICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cbiAgICBmdW5jdGlvbiBhcHByb3hpbWF0ZUNpcmNsZShYLCBZLCBSKSB7XG4gICAgICAgIHZhciByb3RhdGVkQW5nbGUsIHgsIHk7XG4gICAgICAgIHZhciBzaWRlcyA9IDMyO1xuICAgICAgICB2YXIgcG9pbnRzID0gW107XG4gICAgICAgIHggPSBYICsgUjsgLy8g0YHQtNCy0LjQsyDQvdCwINC+0LrRgNGD0LbQvdC+0YHRgtGMXG4gICAgICAgIC8vY29uc29sZS5sb2coJ2FwcHJveGltYXRlQ2lyY2xlJyk7XG4gICAgICAgIGZvciAodmFyIGQgPSAwOyBkIDwgc2lkZXMgLSAxOyBkKyspIHtcbiAgICAgICAgICAgIHZhciB4eSA9IFtdO1xuICAgICAgICAgICAgcm90YXRlZEFuZ2xlID0gKGQgKiAyICogTWF0aC5QSSAvIHNpZGVzKTsvL2FuZ2xlICsgKGQgKiAyICogTWF0aC5QSSAvIHNpZGVzKTtcbiAgICAgICAgICAgIHggPSBYICsgKFIgKiBNYXRoLmNvcyhyb3RhdGVkQW5nbGUpKTtcbiAgICAgICAgICAgIHkgPSBZICsgKFIgKiBNYXRoLnNpbihyb3RhdGVkQW5nbGUpKTtcbiAgICAgICAgICAgIGNvb3JkID0gW051bWJlcih5KSwgTnVtYmVyKHgpXTtcbiAgICAgICAgICAgIHh5LnB1c2goY29vcmRbMF0pO1xuICAgICAgICAgICAgeHkucHVzaChjb29yZFsxXSk7XG4gICAgICAgICAgICBwb2ludHMucHVzaCh4eSk7XG4gICAgICAgIH1cbiAgICAgICAgcG9pbnRzLnB1c2gocG9pbnRzWzBdKTtcbiAgICAgICAgcmV0dXJuIHBvaW50cztcbiAgICB9XG5cbiAgICBpZiAoKF9FbnRpdHlTcGF0aWFsT2JqICE9PSB1bmRlZmluZWQpICYmIChfRW50aXR5U3BhdGlhbE9iaiAhPT0gbnVsbCkpIHtcblxuICAgICAgICB2YXIgY250cnMgPSBbXTtcblxuICAgICAgICBzd2l0Y2ggKG9UeXBlKSB7XG4gICAgICAgICAgICBjYXNlICdQYXJjZWwnIDpcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgICBjbnRycyA9IHByb2Nlc3NTcGF0aWFsRWxlbWVudChfRW50aXR5U3BhdGlhbE9iai5TcGF0aWFsRWxlbWVudCk7XG4gICAgICAgICAgICAgICAgLy8g0JXRgdC70Lgg0Y3RgtC+INC00LvRjyDQvNC90L7Qs9C+0LrQvtC90YLRg9GA0L3QvtCz0L4g0L7QsdGK0LXQutGC0LAsINGC0L4g0LLQvtC30LLRgNCw0YnQtdC8INC80LDRgdGB0LjQsiDQutC+0L3RgtGD0YDQvtCyXG4gICAgICAgICAgICAgICAgaWYgKHBhcnRPZk11bHR1KSB7XG4gICAgICAgICAgICAgICAgICAgIHJldHVybiBjbnRycztcbiAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICByZXR1cm4ge1xuICAgICAgICAgICAgICAgICAgICAgICAgdHlwZTogXCJQb2x5Z29uXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBjb29yZGluYXRlczogY250cnNcbiAgICAgICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgYnJlYWs7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBjYXNlICdDb25zdHJ1Y3Rpb24nOlxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAgIHJldHVybiBwcm9jZXNzUmVhbHR5U3BhdGlhbEVsZW1lbnQoX0VudGl0eVNwYXRpYWxPYmouU3BhdGlhbEVsZW1lbnQpO1xuICAgICAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgY2FzZSAnQnVpbGRpbmcnOlxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAgIHJldHVybiBwcm9jZXNzUmVhbHR5U3BhdGlhbEVsZW1lbnQoX0VudGl0eVNwYXRpYWxPYmouU3BhdGlhbEVsZW1lbnQpO1xuICAgICAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgY2FzZSAnVW5jb21wbGV0ZWQnOlxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAgIHJldHVybiBwcm9jZXNzUmVhbHR5U3BhdGlhbEVsZW1lbnQoX0VudGl0eVNwYXRpYWxPYmouU3BhdGlhbEVsZW1lbnQpO1xuICAgICAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgY2FzZSAnWm9uZSc6XG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICAgY250cnMgPSBwcm9jZXNzU3BhdGlhbEVsZW1lbnQoX0VudGl0eVNwYXRpYWxPYmouU3BhdGlhbEVsZW1lbnQpO1xuICAgICAgICAgICAgICAgIGlmIChwYXJ0T2ZNdWx0dSkge1xuICAgICAgICAgICAgICAgICAgICByZXR1cm4gY250cnM7XG4gICAgICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICAgICAgcmV0dXJuIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIHR5cGU6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgY29vcmRpbmF0ZXM6IGNudHJzXG4gICAgICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgY2FzZSAnUXVhcnRhbCc6XG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICAgY250cnMgPSBwcm9jZXNzU3BhdGlhbEVsZW1lbnQoX0VudGl0eVNwYXRpYWxPYmouU3BhdGlhbEVsZW1lbnQpO1xuICAgICAgICAgICAgICAgIGlmIChwYXJ0T2ZNdWx0dSkge1xuICAgICAgICAgICAgICAgICAgICByZXR1cm4gY250cnM7XG4gICAgICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICAgICAgcmV0dXJuIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIHR5cGU6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgY29vcmRpbmF0ZXM6IGNudHJzXG4gICAgICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgY2FzZSAnQm91bmQnOlxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAgIGNudHJzID0gcHJvY2Vzc1NwYXRpYWxFbGVtZW50KF9FbnRpdHlTcGF0aWFsT2JqLlNwYXRpYWxFbGVtZW50KTtcbiAgICAgICAgICAgICAgICBpZiAocGFydE9mTXVsdHUpIHtcbiAgICAgICAgICAgICAgICAgICAgcmV0dXJuIGNudHJzO1xuICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgIHJldHVybiB7XG4gICAgICAgICAgICAgICAgICAgICAgICB0eXBlOiBcIlBvbHlnb25cIixcbiAgICAgICAgICAgICAgICAgICAgICAgIGNvb3JkaW5hdGVzOiBjbnRyc1xuICAgICAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICBicmVhaztcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIGRlZmF1bHQgOlxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQotC40L8g0L7QsdGK0LXQutGC0LAg0L3QtSDRgNCw0YHQv9C+0LfQvdCw0L0nKTtcbiAgICAgICAgICAgICAgICByZXR1cm4gbnVsbDtcbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cblxufVxuO1xuIiwiLyogXG4gKiBUaGUgTUlUIExpY2Vuc2VcbiAqXG4gKiBDb3B5cmlnaHQgMjAxNSBmaWxpcHBvdi5cbiAqXG4gKiBQZXJtaXNzaW9uIGlzIGhlcmVieSBncmFudGVkLCBmcmVlIG9mIGNoYXJnZSwgdG8gYW55IHBlcnNvbiBvYnRhaW5pbmcgYSBjb3B5XG4gKiBvZiB0aGlzIHNvZnR3YXJlIGFuZCBhc3NvY2lhdGVkIGRvY3VtZW50YXRpb24gZmlsZXMgKHRoZSBcIlNvZnR3YXJlXCIpLCB0byBkZWFsXG4gKiBpbiB0aGUgU29mdHdhcmUgd2l0aG91dCByZXN0cmljdGlvbiwgaW5jbHVkaW5nIHdpdGhvdXQgbGltaXRhdGlvbiB0aGUgcmlnaHRzXG4gKiB0byB1c2UsIGNvcHksIG1vZGlmeSwgbWVyZ2UsIHB1Ymxpc2gsIGRpc3RyaWJ1dGUsIHN1YmxpY2Vuc2UsIGFuZC9vciBzZWxsXG4gKiBjb3BpZXMgb2YgdGhlIFNvZnR3YXJlLCBhbmQgdG8gcGVybWl0IHBlcnNvbnMgdG8gd2hvbSB0aGUgU29mdHdhcmUgaXNcbiAqIGZ1cm5pc2hlZCB0byBkbyBzbywgc3ViamVjdCB0byB0aGUgZm9sbG93aW5nIGNvbmRpdGlvbnM6XG4gKlxuICogVGhlIGFib3ZlIGNvcHlyaWdodCBub3RpY2UgYW5kIHRoaXMgcGVybWlzc2lvbiBub3RpY2Ugc2hhbGwgYmUgaW5jbHVkZWQgaW5cbiAqIGFsbCBjb3BpZXMgb3Igc3Vic3RhbnRpYWwgcG9ydGlvbnMgb2YgdGhlIFNvZnR3YXJlLlxuICpcbiAqIFRIRSBTT0ZUV0FSRSBJUyBQUk9WSURFRCBcIkFTIElTXCIsIFdJVEhPVVQgV0FSUkFOVFkgT0YgQU5ZIEtJTkQsIEVYUFJFU1MgT1JcbiAqIElNUExJRUQsIElOQ0xVRElORyBCVVQgTk9UIExJTUlURUQgVE8gVEhFIFdBUlJBTlRJRVMgT0YgTUVSQ0hBTlRBQklMSVRZLFxuICogRklUTkVTUyBGT1IgQSBQQVJUSUNVTEFSIFBVUlBPU0UgQU5EIE5PTklORlJJTkdFTUVOVC4gSU4gTk8gRVZFTlQgU0hBTEwgVEhFXG4gKiBBVVRIT1JTIE9SIENPUFlSSUdIVCBIT0xERVJTIEJFIExJQUJMRSBGT1IgQU5ZIENMQUlNLCBEQU1BR0VTIE9SIE9USEVSXG4gKiBMSUFCSUxJVFksIFdIRVRIRVIgSU4gQU4gQUNUSU9OIE9GIENPTlRSQUNULCBUT1JUIE9SIE9USEVSV0lTRSwgQVJJU0lORyBGUk9NLFxuICogT1VUIE9GIE9SIElOIENPTk5FQ1RJT04gV0lUSCBUSEUgU09GVFdBUkUgT1IgVEhFIFVTRSBPUiBPVEhFUiBERUFMSU5HUyBJTlxuICogVEhFIFNPRlRXQVJFLlxuICovXG5cbi8qICDQodC4Y9GC0LXQvNGLINC60L7QvtGA0LTQuNC90LDRgiDQuNC80LXRjtGCINGB0LzRi9GB0Lsg0LTQu9GPINCy0LjQt9GD0LDQu9C40LfQsNGG0LjQuCDQv9C+0LvRg9GH0LDQtdC80YvRhSBHZW9KU09OLFxuICAgINC00LvRjyDRgdC+0YXRgNCw0L3QtdC90LjRjyDQsiDRhNCw0LnQuyDQvdC10YIg0L3QsNC00L7QsdC90L7RgdGC0Lgg0LIg0L/RgNC10L7QsdGA0LDQt9C+0LLQsNC90LjQuC5cbiAgICDQmNC90YTQvtGA0LzQsNGG0LjRjyDQviDRgdC40YHRgtC10LzQsNGFINC60L7QvtGA0LTQuNC90LDRgiDRhdGA0LDQvdC40YLRgdGPINCyINGC0LXQs9C1IDxDb29yZFN5c3RlbXM+XG4gICAgPENvb3JkU3lzdGVtcz5cbiAgICAgICAgPG5zMzpDb29yZFN5c3RlbSBOYW1lPVwi0JzQodCaIDcwLCDQt9C+0L3QsCAzXCIgQ3NJZD1cIklEM1wiIC8+XG4gICAgICAgIDxuczM6Q29vcmRTeXN0ZW0gTmFtZT1cItCc0KHQmiA3MCwg0LfQvtC90LAgNFwiIENzSWQ9XCJJRDRcIiAvPlxuICAgIDwvQ29vcmRTeXN0ZW1zPlxuICAgINC40YUg0LzQvtC20LXRgiDQsdGL0YLRjCDQvdC10YHQutC+0LvRjNC60L4uXG4gICAg0KMg0L7QsdGK0LXQutGC0L7QsiDQsiDRgtC10LPQtSA8RW50aXR5U3BhdGlhbD4g0YPQutCw0LfQsNC90L4g0LIg0LrQsNC60L7QuSDQodCaINC+0L0g0LjQvNC10LXRgiDQutC+0L7RgNC00LjQvdCw0YLRiyxcbiAgICDQvdCw0L/RgNC40LzQtdGAOlxuICAgIDxFbnRpdHlTcGF0aWFsIEVudFN5cz1cIklEM1wiPlxuXG4gICAg0L/RgNC+0LHQu9C10LzRiyDQutC+0L3QstC10YDRgtCw0YbQuNC4INGDINGC0LXRhSB4bWwg0YMg0LrQvtGC0L7RgNGL0Lkg0YPQutCw0LfQsNC90L4gPG5zMzpDb29yZFN5c3RlbSBOYW1lPVwi0KHQmiDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0L7QutGA0YPQs9CwXCIgQ3NJZD1cIklEMVwiIC8+XG4qLyBcblxuXG5tb2R1bGUuZXhwb3J0cy5TcGF0aWFsU3lzdGVtcyA9IHtcbiAgICAvLyDQotC+0LzRgdC60LDRjyDQvtCx0LvQsNGB0YLRjFxuICAgICfQnNCh0JogNzAsINC30L7QvdCwIDQnOiAnK3Byb2o9dG1lcmMgK2xhdF8wPTAgK2xvbl8wPTgzLjczMzMzMzMzMzMzICtrPTEgK3hfMD00MjUwMDAwICt5XzA9LTU5MTI5MDAuNTY2ICtlbGxwcz1rcmFzcyArdG93Z3M4ND0yMy41NywtMTQwLjk1LC03OS44LDAsMC4zNSwwLjc5LC0wLjIyICt1bml0cz1tICtub19kZWZzJyxcbiAgICAn0JzQodCaIDcwLCDQt9C+0L3QsCAyJzogJytwcm9qPXRtZXJjICtsYXRfMD0wICtsb25fMD03Ny43MzMzMzMzMzMzMyAraz0xICt4XzA9MjI1MDAwMCAreV8wPS01OTEyOTAwLjU2NiArZWxscHM9a3Jhc3MgK3Rvd2dzODQ9MjMuNTcsLTE0MC45NSwtNzkuOCwwLDAuMzUsMC43OSwtMC4yMiArdW5pdHM9bSArbm9fZGVmcycsXG4gICAgJ9Cc0KHQmiA3MCwg0LfQvtC90LAgMyc6ICcrcHJvaj10bWVyYyArbGF0XzA9MCArbG9uXzA9ODAuNzMzMzMzMzMzMzMgK2s9MSAreF8wPTMyNTAwMDAgK3lfMD0tNTkxMjkwMC41NjYgK2VsbHBzPWtyYXNzICt0b3dnczg0PTIzLjU3LC0xNDAuOTUsLTc5LjgsMCwwLjM1LDAuNzksLTAuMjIgK3VuaXRzPW0gK25vX2RlZnMnXG59OyJdfQ==
