(function e(t,n,r){function s(o,u){if(!n[o]){if(!t[o]){var a=typeof require=="function"&&require;if(!u&&a)return a(o,!0);if(i)return i(o,!0);var f=new Error("Cannot find module '"+o+"'");throw f.code="MODULE_NOT_FOUND",f}var l=n[o]={exports:{}};t[o][0].call(l.exports,function(e){var n=t[o][1][e];return s(n?n:e)},l,l.exports,e,t,n,r)}return n[o].exports}var i=typeof require=="function"&&require;for(var o=0;o<r.length;o++)s(r[o]);return s})({1:[function(require,module,exports){
/* 
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */

var Converter = require('./cadXML2GeoJSON.js');
var map;

StartParse();

function StartParse() {

    var container = document.getElementById('popup');
    var content = document.getElementById('popup-content');
    var closer = document.getElementById('popup-closer');

    closer.onclick = function () {
        overlay.setPosition(undefined);
        closer.blur();
        return false;
    };

    var overlay = new ol.Overlay(/** @type {olx.OverlayOptions} */ ({
        element: container,
        autoPan: true,
        autoPanAnimation: {
            duration: 250
        }
    }));

    // https://bitbucket.org/surenrao/xml2json
    // http://www.chrome-allow-file-access-from-file.com/
    var parsedData;
    $('#wait').toggleClass('hidden');
    $.get('./testdata/doc2153522.xml', function (xml) {
        //var json = $.xml2json(xml).CadastralBlocks;
        // $("#data").html('<code>'+JSON.stringify(json)+'</code>');
        //console.log(Converter.GeoJSON);
        parsedData = Converter.GeoJSON(xml, true);
    }).success(
            function () {
                $('#wait').toggleClass('hidden');
                // http://www.color-hex.com/
                var parcelFill = new ol.style.Fill({
                    color: '#bbf144'
                });
                var zoneFill = new ol.style.Fill({
                    color: '#009fff'
                });
                var realtylStroke = new ol.style.Stroke({
                    color: '#FF00C1',
                    width: 1.2
                });

                var stroke = new ol.style.Stroke({
                    color: '#313030',
                    width: 1
                });
                var boundStroke = new ol.style.Stroke({
                    color: '#004C00',
                    width: 1
                });
                var zoneStroke = new ol.style.Stroke({
                    color: '#143388',
                    width: 1
                });
                var quartalStroke = new ol.style.Stroke({
                    color: '#3b202f',
                    width: 2
                });
                var text = new ol.style.Text({
                    // TODO Подписать кадастровые номера
                });

                // Стили
                var parcelStyle = new ol.style.Style({
                    fill: parcelFill,
                    stroke: stroke
                });
                var realtyStyle = new ol.style.Style({
                    stroke: realtylStroke
                });
                var quartalStyle = new ol.style.Style({
                    stroke: quartalStroke
                });
                var boundStyle = new ol.style.Style({
                    stroke: boundStroke
                });
                var zoneStyle = new ol.style.Style({
                    fill: zoneFill,
                    stroke: zoneStroke
                });


                var quartalSource = new ol.source.Vector({
                    projection: 'EPSG:3857'
                });
                var parcelSource = new ol.source.Vector({
                    features: (new ol.format.GeoJSON()).readFeatures(parsedData.geoJSONParcels),
                    projection: 'EPSG:3857'
                });
                var realtySource = new ol.source.Vector({
                    features: (new ol.format.GeoJSON()).readFeatures(parsedData.geoJSONRealty),
                    projection: 'EPSG:3857'
                });
                var realtyCollectionSource = new ol.source.Vector({
                    features: (new ol.format.GeoJSON()).readFeatures(parsedData.geoJSONRealtyGeometryCollection),
                    projection: 'EPSG:3857'
                });
                var boundSource = new ol.source.Vector({
                    projection: 'EPSG:3857'
                });
                var zoneSource = new ol.source.Vector({
                    projection: 'EPSG:3857'
                });
                var quartalLayer = new ol.layer.Vector({
                    title: 'Квартал',
                    source: quartalSource,
                    style: quartalStyle,
                    opacity: 0.54326
                });
                var parcelLayer = new ol.layer.Vector({
                    title: 'ЗУ',
                    source: parcelSource,
                    style: parcelStyle,
                    opacity: 0.5
                });
                var realtyLayer = new ol.layer.Vector({
                    title: 'ОКС',
                    source: realtySource,
                    style: realtyStyle,
                    opacity: 0.5
                }); 
                var realtyCollectionLayer = new ol.layer.Vector({
                    title: 'ОКС сложные',
                    source: realtyCollectionSource,
                    style: realtyStyle,
                    opacity: 0.5
                }); 
                var boundLayer = new ol.layer.Vector({
                    title: 'Границы',
                    source: boundSource,
                    style: boundStyle,
                    opacity: 0.5
                });
                var zoneLayer = new ol.layer.Vector({
                    title: 'Зоны',
                    source: zoneSource,
                    style: zoneStyle,
                    opacity: 0.5
                });

                var format = new ol.format.GeoJSON();

                var realtysCollection = parsedData.geoJSONRealtyGeometryCollection;

                for (var i = 0; i < realtysCollection.features.length; i++) {
                    //console.log(realtysCollection.features[i]);
                    var geometryObj = format.readGeometry(realtysCollection.features[i].geometry);
                    var feature = new ol.Feature({
                        geometry: geometryObj//,
                                //propA : parsedData.features[i].properties.cadnumber
                    });
                    realtyCollectionLayer.getSource().addFeature(feature);
                }
                var zones = parsedData.geoJSONZones;
                for (var i = 0; i < zones.features.length; i++) {
                    var geometryObj = format.readGeometry(zones.features[i].geometry);
                    var feature = new ol.Feature({
                        geometry: geometryObj//,
                                //propA : parsedData.features[i].properties.cadnumber
                    });
                    zoneLayer.getSource().addFeature(feature);
                }
                var quartal = parsedData.geoJSONQuartal;
                for (var i = 0; i < quartal.features.length; i++) {
                    var geometryObj = format.readGeometry(quartal.features[i].geometry);
                    var feature = new ol.Feature({
                        geometry: geometryObj//,
                                //propA : parsedData.features[i].properties.cadnumber
                    });
                    quartalLayer.getSource().addFeature(feature);
                }
                var bounds = parsedData.geoJSONBounds;
                for (var i = 0; i < bounds.features.length; i++) {
                    var geometryObj = format.readGeometry(bounds.features[i].geometry);
                    var feature = new ol.Feature({
                        geometry: geometryObj//,
                                //propA : parsedData.features[i].properties.cadnumber
                    });
                    boundLayer.getSource().addFeature(feature);
                }

                map = new ol.Map({
                    target: 'map',
                    layers: [
                        new ol.layer.Tile({
                            source: new ol.source.OSM(),
                            opacity: 0.5,
                            visible: true,
                            title: 'Подложка'
                        }),
                        new ol.layer.Tile({
                            title: 'ПКК',
                            visible: false,
                            source: new ol.source.TileArcGISRest({
                                url: 'http://maps.rosreestr.ru/arcgis/rest/services/Cadastre/Cadastre/MapServer/'
                            })
                        }),
                        quartalLayer, boundLayer, zoneLayer,
                        parcelLayer, realtyLayer, realtyCollectionLayer
                    ],
                    overlays: [overlay],
                    view: new ol.View({
                        projection: 'EPSG:3857',
                        center: [0, 0],
                        zoom: 7
                    })
                });
                map.getView().fit(quartalLayer.getSource().getExtent(), map.getSize());
                var layerSwitcher = new ol.control.LayerSwitcher({
                    tipLabel: 'Слои' // Optional label for button
                });
                map.addControl(layerSwitcher);
//                var graticule = new ol.Graticule({
//                    map: map
//                });
                map.on('singleclick', function (evt) {
                    var features = [];
                    var coordinate = evt.coordinate;

                    for (var i = 0; i < map.getLayers().getLength(); i++) {
                        var layer = map.getLayers().item(i);
                        if (layer instanceof ol.layer.Vector) {
                            var feature = layer.getSource().getClosestFeatureToCoordinate(evt.coordinate);
                            if (feature) {
                                features.push(feature);
                            }
                        }
                    }
                    createInfoContetnt(features, coordinate);
                });

                function createInfoContetnt(features, coordinate) {
                    var contenInfo = '';
//                    var st = '';
//                    var cat = '';
//                    var name = '';
//                    var ut = '';
                    for (var i = 0; i < features.length; i++) {
//                        var f = features[i];
//                        if (f.get('cadastreNumber') !== undefined) {
//                            cn = f.get('cadastreNumber');
//                        }
//                        if (f.get('State') !== undefined) {
//                            st = f.get('State');
//                        }
//                        if (f.get('Name') !== undefined) {
//                            name = f.get('Name');
//                        }
//                        if (f.get('Category') !== undefined) {
//                            cat = f.get('Category');
//                        }
//                        if (f.get('Category') !== undefined) {
//                            cat = f.get('Category');
//                        }
                        console.log(features[i].getProperties());
//                    }
//                    var hdms = ol.coordinate.toStringHDMS(ol.proj.transform(
//                            coordinate, 'EPSG:3857', 'EPSG:4326'));
//                        var json = JSON.stringify(features[i].getProperties());
//                        contenInfo += '<p>' + $('').jJsonViewer(json) + '</p>';
                        
//                    content.innerHTML = '<p>Кадастровый номер:<code>' + cn +
//                            '</code></p><p>Объект:<code>' + name + '</code></p>' +
//                            '</code><p>Статус:<code>' + st + '</code></p>' +
//                            '</code><p>Категория земель:<code>' + cat + '</code></p>';
                        //content.jJsonViewer(features[i].getProperties()); 
                    }
//                    content.innerHTML = contenInfo;
//                    overlay.setPosition(coordinate);
                }
            });

}

},{"./cadXML2GeoJSON.js":3}],2:[function(require,module,exports){
/* 
 * The MIT License
 *
 * Copyright 2015 filippov.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */
'use strict';
// Dicts

// Статус объекта недвижимости
var dStates = {
    '01': 'Ранее учтенный',
    '05': 'Временный',
    '06': 'Учтенный',
    '07': 'Снят с учета',
    '08': 'Аннулированный'
};
// Тип  объекта недвижимости
var dParcels = {
    '01': 'Землепользование',
    '02': 'Единое землепользование',
    '03': 'Обособленный участок',
    '04': 'Условный участок',
    '05': 'Многоконтурный участок',
    '06': 'Значение отсутствует'
};
// Категория земель
var dCategories = {
    '003001000000': 'Земли сельскохозяйственного назначения',
    '003002000000': 'Земли населённых пунктов',
    '003003000000': 'Земли промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, земли для обеспечения космической деятельности, земли обороны, безопасности и земли иного специального назначения',
    '003004000000': 'Земли особо охраняемых территорий и объектов',
    '003005000000': 'Земли лесного фонда',
    '003006000000': 'Земли водного фонда',
    '003007000000': 'Земли запаса',
    '003008000000': 'Категория не установлена'
};
// Ограничения (обременения) прав
var dEncumbrances = {
	'022001000000': 'Сервитут',
	'022001001000': 'Публичный сервитут',
	'022001002000': 'Частный сервитут',
	'022002000000': 'Арест',
	'022003000000': 'Запрещение',
	'022004000000': 'Ограничения прав на земельный участок, предусмотренные статьями 56, 56.1 Земельного кодекса Российской Федерации',
	'022005000000': 'Решение об изъятии земельного участка, жилого помещения',
	'022006000000': 'Аренда (в том числе, субаренда)',
	'022007000000': 'Ипотека',
	'022008000000': 'Ипотека в силу закона',
	'022009000000': 'Безвозмездное (срочное) пользование земельным/лесным участком',
	'022010000000': 'Доверительное управление',
	'022011000000': 'Рента',
	'022012000000': 'Запрет на совершение действий в сфере ГКУ в отношении ОН',
	'022099000000': 'Иные ограничения (обременения) прав'
};
// Единицы измерений
var dUnits = {
	'003': 'Миллиметр',
	'004': 'Сантиметр',
	'005': 'Дециметр',
	'006': 'Метр',
	'008': 'Километр',
	'009': 'Мегаметр',
	'047': 'Морская миля',
	'050': 'Квадратный миллиметр',
	'051': 'Квадратный сантиметр',
	'053': 'Квадратный дециметр',
	'055': 'Квадратный метр',
	'058': 'Тысяча квадратных метров',
	'059': 'Гектар',
	'061': 'Квадратный километр',
	'109': 'Ар (100 м2)',
	'359': 'Сутки',
	'360': 'Неделя',
	'361': 'Декада',
	'362': 'Месяц',
	'364': 'Квартал',
	'365': 'Полугодие',
	'356': 'Час',
	'355': 'Минута ',
	'366': 'Год',
	'383': 'Рубль',
	'384': 'Тысяча рублей',
	'385': 'Миллион рублей',
	'386': 'Миллиард рублей',
	'1000': 'Неопределено',
	'1001': 'Значение отсутствует',
	'1002': 'Рублей за кв. метр',
	'1003': 'Рублей за ар',
	'1004': 'Рублей  за гектар',
	'1005': 'Иные',
	'1006': 'Рублей за кв. км',
	'1007': 'Рабочий день'
};
// Все документы (Сборник классификаторов, коды 8.1, 8.2, 555, 558.1, 558.2, 558.3, 558.4, 558.5, 558.6)
var dAllDocuments = {
	'008001000000': 'Документы, удостоверяющие личность физического лица',
	'008001001000': 'Паспорт гражданина Российской Федерации',
	'008001002000': 'Паспорт гражданина СССР',
	'008001003000': 'Паспорт гражданина иностранного государства',
	'008001004000': 'Общегражданский заграничный паспорт',
	'008001005000': 'Заграничный паспорт Министерства морского флота',
	'008001006000': 'Дипломатический паспорт',
	'008001007000': 'Паспорт моряка (удостоверение личности моряка)',
	'008001008000': 'Военный билет военнослужащего',
	'008001009000': 'Временное удостоверение, выданное взамен военного билета',
	'008001010000': 'Удостоверение личности офицера Министерства обороны Российской Федерации, Министерства внутренних дел Российской Федерации и других воинских формирований с приложением справки о прописке (регистрации) Ф-33',
	'008001011000': 'Свидетельство о рождении',
	'008001012000': 'Свидетельство о рассмотрении ходатайства о признании беженцем на территории Российской Федерации по существу',
	'008001013000': 'Вид на жительство иностранного гражданина или лица без гражданства',
	'008001014000': 'Справка об освобождении из мест лишения свободы',
	'008001015000': 'Временное удостоверение личности гражданина Российской Федерации',
	'008001016000': 'Удостоверение вынужденного переселенца',
	'008001017000': 'Разрешение на временное проживание в Российской Федерации',
	'008001018000': 'Удостоверение беженца в Российской Федерации',
	'008001019000': 'Свидетельство о рассмотрении ходатайства о признании лица вынужденным переселенцем',
	'008001020000': 'Свидетельство о предоставлении временного убежища на территории Российской Федерации',
	'008001099000': 'Иные документы, предусмотренные законодательством Российской Федерации или признаваемые в соответствии с международным договором Российской Федерации в качестве документов, удостоверяющих личность',
	'008002000000': 'Документы, идентифицирующие юридическое лицо',
	'008002001000': 'Свидетельство о государственной регистрации юридического лица',
	'008002002000': 'Свидетельство о внесении записей в ЕГРЮЛ',
	'008002004000': 'Устав',
	'008002005000': 'Учредительный договор',
	'008002006000': 'Положение (общее положение об организации)',
	'008002007000': 'Свидетельство (или уведомление) о постановке на учёт в налоговом органе с указанием ИНН',
	'008002008000': 'Выписка из ЕГРЮЛ',
	'008002099000': 'Иной документ',
	'555001000000': 'Квитанция',
	'555002000000': 'Платёжное поручение',
	'555003000000': 'Чек',
	'555004000000': 'Подтверждение электронного платежа',
	'555005000000': 'Документ, подтверждающий право заявителя на безвозмездное получение сведений',
	'558100000000': 'ЗАЯВЛЕНИЯ',
	'558101000000': 'Заявления и запросы, связанные с государственным кадастровым учётом',
	'558101010000': 'Запрос о предоставлении сведений, внесённых в государственный кадастр недвижимости, в виде кадастровой выписки об объекте недвижимости, кадастрового паспорта объекта недвижимости и кадастрового плана территории, кадастровой справки о кадастровой стоимости объекта недвижимости',
	'558101020000': 'Заявление о постановке на государственный кадастровый учёт объекта недвижимости',
	'558101030000': 'Заявление о государственном кадастровом учёте изменений объекта недвижимости',
	'558101040000': 'Заявление о внесении в Единый государственный реестр объектов капитального строительства (ЕГРОКС) сведений об объекте капитального строительства (ОКС)',
	'558101050000': 'Запрос о предоставлении сведений об ОКС',
	'558101060000': 'Заявление о снятии с государственного кадастрового учёта объекта недвижимости',
	'558101070000': 'Заявление о внесении в государственный кадастр недвижимости сведений о ранее учтённом объекте недвижимости',
	'558101080000': 'Заявление об исправлении кадастровой ошибки',
	'558101090000': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости',
	'558101090100': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости об объекте недвижимости',
	'558101090200': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости о прохождении участка Государственной границы Российской Федерации; о границах между субъектами Российской Федерации; о границах муниципальных образований; о границах населённых пунктов; о территориальных зонах и зонах с особыми условиями использования территорий; о картографической и геодезической основах государственного кадастра недвижимости',
	'558101100000': 'Заявление о представлении дополнительных документов на государственный кадастровый учёт',
	'558101110000': 'Внутриведомственный запрос информации государственного кадастра недвижимости',
	'558101120000': 'Запрос о предоставлении копии документа, на основании которого сведения об объекте недвижимости внесены в государственный кадастр недвижимости',
	'558101130000': 'Запрос о предоставлении сведений, внесённых в государственный кадастр недвижимости, посредством обеспечения доступа к информационному ресурсу, содержащему сведения государственного кадастра недвижимости',
	'558101140000': 'Запрос о предоставлении перечня объектов недвижимости, подлежащих государственной кадастровой оценке',
	'558101150000': 'Заявление о прекращении осуществления кадастрового учёта',
	'558101160000': 'Межведомственный запрос документов в органах государственной власти и органах местного самоуправления',
	'558101170000': 'Запрос документов о ранее учтённом объекте недвижимости в органах государственной власти, органах местного самоуправления или органах и организациях по государственному техническому учёту и (или) технической инвентаризации',
	'558102000000': 'Заявления и запросы, связанные с регистрацией прав',
	'558102010000': 'Заявление о государственной регистрации права на недвижимое имущество, сделки с ним, ограничения (обременения), перехода, прекращения права на недвижимое имущество',
	'558102020000': 'Заявление о государственной регистрации прекращения права (ограничения (обременения) права)',
	'558102030000': 'Заявление о внесении изменений в ЕГРП',
	'558102040000': 'Заявление об исправлении технической ошибки',
	'558102050000': 'Заявление о представлении дополнительных документов для государственной регистрации прав',
	'558102060000': 'Заявление о приостановлении государственной регистрации прав на недвижимое имущество и сделок с ним',
	'558102070000': 'Заявление о возобновлении государственной регистрации',
	'558102080000': 'Заявление о прекращении государственной регистрации',
	'558102090000': 'Заявление о повторной выдаче свидетельства о государственной регистрации права',
	'558102100000': 'Запрос о предоставлении сведений, содержащихся в Едином государственном реестре прав на недвижимое имущество и сделок с ним',
	'558102110000': 'Заявление о постановке на учёт бесхозяйных недвижимых вещей',
	'558102120000': 'Заявление о выдаче закладной (новой закладной, дубликата закладной, аннулированной закладной)',
	'558102130000': 'Запрос о выдаче копий договоров и иных документов, выражающих содержание односторонних сделок, совершенных в простой письменной форме',
	'558102140000': 'Заявление о приостановлении государственной регистрации, возврате документов без проведения государственной регистрации, представлении дополнительных документов, о возобновлении государственной регистрации, ранее приостановленной по заявлению правообладателя, стороны (сторон) сделки, лица, чьё право ограничивается (обременяется), лица, в пользу которого право ограничивается (обременяется), законного владельца закладной (их представителя)',
	'558102150000': 'Заявление о повторной выдаче нового свидетельства о государственной регистрации права, выдаче закладной, внесении изменений в запись Единого государственного реестра прав на недвижимое имущество и сделок с ним, погашении регистрационной записи об ипотеке',
	'558102160000': 'Заявление о принятии объекта недвижимого имущества вновь во владение, пользование и распоряжение (в собственность)',
	'558102170000': 'Заявление о внесении в Единый государственный реестр прав на недвижимое имущество и сделок с ним отметки о наличии судебного спора в отношении зарегистрированного права',
	'558102180000': 'Заявление об исправлении технической ошибки в записях Единого государственного реестра прав на недвижимое имущество и сделок с ним, о наличии возражения в отношении зарегистрированного права на объект недвижимости, о погашении записи в Едином государственном реестре прав на недвижимое имущество и сделок с ним о наличии возражения в отношении зарегистрированного права на объект недвижимости, о невозможности государственной регистрации перехода, ограничения (обременения), прекращения права на объект недвижимости без личного участия собственника (его законного представителя), об отзыве ранее представленного заявления о невозможности государственной регистрации перехода, ограничения (обременения), прекращения права на объект недвижимости без личного участия собственника (его законного представителя)',
	'558102190000': 'Заявление о скреплении добавочного листа (добавочных листов) с закладной',
	'558102200000': 'Запрос о предоставлении сведений, содержащихся в Едином государственном реестре прав на недвижимое имущество и сделок с ним, посредством обеспечения доступа к информационному ресурсу, содержащему сведения Единого государственного реестра прав на недвижимое имущество и сделок с ним',
	'558102210000': 'Заявление о государственной регистрации законного владельца закладной',
	'558102220000': 'Заявление о внесении изменений в запись Единого государственного реестра прав на недвижимое имущество и сделок с ним, погашении регистрационной записи об ипотеке',
	'558103000000': 'Заявления о государственном учёте зданий, сооружений, помещений, объектов незавершённого строительства (объектов учёта) и запросы о предоставлении сведений, внесённых в Единый государственный реестр',
	'558103010000': 'Заявление о постановке на государственный учёт объекта учёта',
	'558103020000': 'Заявление о внесении в ЕГРОКС сведений о ранее учтённом объекте капитального строительства',
	'558103030000': 'Заявление о государственном учёте изменений объекта учёта',
	'558103040000': 'Заявление о снятии с государственного учёта объекта учёта',
	'558103050000': 'Заявление об исправлении технической ошибки',
	'558103060000': 'Заявление об исключении сведений из ЕГРОКС, носящих временный характер',
	'558103070000': 'Запрос о предоставлении копии документа, на основании которого сведения об объекте внесены в Единый государственный реестр',
	'558103080000': 'Запрос о предоставлении сведений, внесенных в Единый государственный реестр',
	'558103090000': 'Заявление о представлении дополнительных документов на государственный учёт',
	'558104000000': 'Заявление о возврате платежа',
	'558199000000': 'Иное заявление',
	'558200000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ ОПИСАНИЕ ОБЪЕКТА',
	'558201000000': 'Описание земельных участков',
	'558202000000': 'Землеустроительное дело',
	'558203000000': 'Межевой план',
	'558204000000': 'Документ (копия), на основании которого сведения об объекте недвижимости внесены в ГКН',
	'558205000000': 'Технический паспорт объекта учёта',
	'558205010000': 'Технический паспорт домовладения',
	'558205020000': 'Технический паспорт здания (строения)',
	'558205030000': 'Технический паспорт жилого помещения (квартиры)',
	'558205040000': 'Технический паспорт объекта индивидуального жилищного строительства',
	'558205050000': 'Технический паспорт сооружения',
	'558205060000': 'Технический паспорт объекта незавершённого строительства',
	'558206000000': 'Выписка из технического паспорта',
	'558206010000': 'Выписка из технического паспорта на здание (строение)',
	'558206020000': 'Выписка из технического паспорта БТИ',
	'558207000000': 'Документ (копия), подтверждающий разрешение земельного спора о согласовании местоположения границ земельного участка',
	'558208000000': 'Документ (копия), подтверждающий принадлежность земельного участка к определенной категории земель',
	'558209000000': 'Документ (копия), подтверждающий установленное разрешенное использование земельного участка',
	'558210000000': 'Кадастровый план земельного участка (выписка из государственного земельного кадастра)',
	'558211000000': 'Планы иных объектов недвижимости',
	'558211010000': 'Технический план здания, сооружения, помещения либо объекта незавершённого строительства',
	'558211020000': 'План участка лесного фонда',
	'558211030000': 'План объекта недвижимости',
	'558211040000': 'Экспликация к поэтажному плану',
	'558212000000': 'Декларация об объекте недвижимости',
	'558213000000': 'Кадастровый паспорт объекта недвижимости',
	'558213010000': 'Кадастровый паспорт земельного участка',
	'558213020000': 'Кадастровый паспорт помещения (выписка из ГКН)',
	'558213030000': 'Кадастровый паспорт здания, сооружения, объекта незавершённого строительства',
	'558214000000': 'Кадастровая выписка об объекте недвижимости',
	'558214010000': 'Кадастровая выписка о земельном участке',
	'558214020000': 'Кадастровая выписка о здании, сооружении, объекте незавершённого строительства',
	'558216000000': 'Документ, подтверждающий изменение назначения здания, помещения или сооружения, наименования сооружения',
	'558217000000': 'Кадастровый план территории',
	'558218000000': 'Кадастровая справка о кадастровой стоимости объекта недвижимости',
	'558219000000': 'Акт обследования, подтверждающий прекращение существования объекта учёта',
	'558220000000': 'Документы, в виде которых предоставляются сведения Единого государственного реестра',
	'558220010000': 'Выписка из Реестра, содержащая относящиеся к информации ограниченного доступа сведения об объекте учета',
	'558220020000': 'Справка, содержащая, внесённые в Единый государственный реестр сведения о прекращении существования объекта учёта',
	'558220030000': 'Выписка из Реестра, подтверждающая факт отсутствия в Реестре сведений об объекте учета',
	'558221000000': 'ПРОЧИЕ',
	'558221010000': 'Решение о необходимости устранения кадастровой ошибки',
	'558221020000': 'Международный договор Российской Федерации, в соответствии с которым установлено или изменено прохождение государственной границы Российской Федерации',
	'558221030000': 'Документ, содержащий необходимые для внесения в государственный кадастр недвижимости сведения о границах между субъектами Российской Федерации, границах муниципального образования, границах населённого пункта',
	'558221040000': 'Документ, содержащий необходимые для внесения в государственный кадастр недвижимости сведения об установлении или изменении территориальной зоны или зоны с особыми условиями использования территорий, либо об отмене установления такой зоны',
	'558221050000': 'Решение о присвоении, изменении адреса',
	'558221060000': 'Документы органов, осуществляющих ведение лесного и водного кадастра, содержащие сведения о природных объектах',
	'558221070000': 'Документ, содержащий сведения об адресе объекта недвижимости',
	'558221080000': 'Акт об утверждении результатов определения кадастровой стоимости',
	'558221990000': 'Иной документ, содержащий описание объекта',
	'558222000000': 'Документ, воспроизводящий сведения, содержащиеся в международном договоре Российской Федерации, в соответствии с которым установлено или изменено прохождение государственной границы Российской Федерации, а также сведения о федеральном законе, которым ратифицирован международный договор Российской Федерации, и об официальном опубликовании такого федерального закона',
	'558223000000': 'Соглашение об изменении границ между субъектами Российской Федерации',
	'558224000000': 'Закон субъекта Российской Федерации об установлении или изменении границ муниципальных образований либо о преобразовании муниципальных образований',
	'558225000000': 'Акт уполномоченного органа об установлении или изменении границ населённых пунктов',
	'558226000000': 'Документ, воспроизводящий необходимые для внесения в государственный кадастр недвижимости сведения о границах между субъектами Российской Федерации, границах муниципального образования, границах населённого пункта, содержащиеся в утверждённых органами власти документах',
	'558227000000': 'Решение об установлении или изменении границ зон с особыми условиями использования территорий',
	'558228000000': 'Правовой акт, которым утверждены или изменены правила землепользования и застройки',
	'558229000000': 'Документ, подтверждающий изменение назначения помещения',
	'558230000000': 'Решение о переводе жилого помещения в нежилое помещение, нежилого помещения в жилое помещение',
	'558231000000': 'Акт приемочной комиссии, подтверждающий завершение переустройства и (или) перепланировки и (или) иных работ',
	'558232000000': 'Документы, воспроизводящие сведения об изменении назначения помещения',
	'558233000000': 'Документ, воспроизводящий сведения, содержащиеся в решении о переводе жилого помещения в нежилое помещение, нежилого помещения в жилое помещение',
	'558234000000': 'Документ, воспроизводящий сведения, содержащиеся в акте приемочной комиссии, подтверждающем завершение переустройства и (или) перепланировки и (или) иных работ',
	'558235000000': 'Документ, подтверждающий изменение назначения здания',
	'558236000000': 'Документ, подтверждающий изменение назначения сооружения',
	'558237000000': 'Решение о предоставлении разрешения на условно разрешенный вид использования',
	'558238000000': 'Решение об определении (изменении) вида разрешенного использования',
	'558239000000': 'Документ (копия), воспроизводящий сведения о предоставлении разрешения на условно разрешенный вид использования, об определении (изменении) вида разрешенного использования',
	'558240000000': 'Документ, воспроизводящий сведения, содержащиеся в решении о присвоении, изменении адреса',
	'558241000000': 'Документ, воспроизводящий содержащиеся в разрешении на ввод объекта капитального строительства в эксплуатацию сведения',
	'558242000000': 'Документ, воспроизводящий сведения, содержащиеся в реестре объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
	'558243000000': 'Документ, воспроизводящий сведения, содержащиеся в акте Правительства Российской Федерации об исключении объекта недвижимости из единого государственного реестра объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
	'558244000000': 'Документ, содержащий сведения о дате поступления документов, предусмотренных статьей 17 Федерального закона "Об объектах культурного наследия (памятниках истории и культуры) народов Российской Федерации", в отношении объекта недвижимости',
	'558245000000': 'Решение (копия решения) соответствующего органа государственной власти об отказе включить объект недвижимости в единый государственный реестр объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
	'558246000000': 'Акт Правительства Российской Федерации об исключении объекта недвижимости из единого государственного реестра объектов культурного наследия',
	'558247000000': 'Документ, воспроизводящий сведения о наименовании водного объекта и установленных параметрах водоохранных зон и прибрежных защитных полос, зон затопления, подтопления и других зон с особыми условиями их использования',
	'558248000000': 'Документ, воспроизводящий содержащиеся в государственном лесном реестре сведения в отношении лесного участка',
	'558249000000': 'Документ, воспроизводящий сведения, содержащиеся во вступившем в силу акте об утверждении результатов определения кадастровой стоимости',
	'558250000000': 'Документ, воспроизводящий сведения, содержащиеся в решении об установлении или изменении границ зон с особыми условиями использования территорий',
	'558251000000': 'Документ, воспроизводящий сведения, содержащиеся в правовом акте, которым утверждены или изменены правила землепользования и застройки, включая сведения о территориальных зонах',
	'558252000000': 'Карта (план) объекта землеустройства',
	'558253000000': 'Декларация заинтересованного лица о выбранном виде разрешенного использования земельного участка',
	'558254000000': 'Документы, определяющие (определявшие) в соответствии с законодательством Российской Федерации местоположение границ земельного участка (земельных участков)',
	'558254010000': 'Землеустроительная документация',
	'558254020000': 'Лесоустроительная документация',
	'558254030000': 'Документы градостроительного зонирования (Правила землепользования и застройки)',
	'558254040000': 'Документация по планировке территории (проекты межевания территорий), в т.ч. документ по планировке территории в планируемых границах искусственного земельного участка',
	'558254050000': 'Копия проекта межевания земельных участков',
	'558254060000': 'Акт отвода земельных участков в натуре',
	'558254070000': 'Проект границ земельных участков',
	'558254080000': 'Проект (копии отдельных составных частей) организации и застройки территорий садоводческих, огороднических или дачных некоммерческих объединений граждан',
	'558254090000': 'Проект (копии отдельных составных частей) перераспределения сельскохозяйственных угодий и иных земель сельскохозяйственного назначения',
	'558254100000': 'Решение о предварительном согласовании мест размещения объектов',
	'558254110000': 'Копия решения общего собрания участников долевой собственности на земельный участок из земель сельскохозяйственного назначения об утверждении проекта межевания земельных участков',
	'558254120000': 'Копия документа, подтверждающего согласование проекта межевания земельного участка',
	'558254130000': 'Возражения заинтересованных лиц по поводу местоположения границ земельного участка',
	'558254140000': 'Документ, свидетельствующий о снятии возражений заинтересованных лиц по поводу местоположения границ земельного участка',
	'558254150000': 'Схема расположения земельных участков на кадастровых планах или кадастровых картах соответствующих территорий',
	'558254990000': 'Прочие документы, определяющие (определявшие) в соответствии с законодательством Российской Федерации местоположение границ земельного участка (земельных участков)',
	'558255000000': 'Картографические материалы',
	'558256000000': 'Материалы картографо-геодезического фонда',
	'558257000000': 'Документы, устанавливающие предельные минимальные и максимальные размеры, соответствующие виду разрешенного использования земельного участка',
	'558257010000': 'Федеральный закон',
	'558257020000': 'Закон субъекта Российской Федерации',
	'558257030000': 'Нормативный правовой акт органа местного самоуправления',
	'558258000000': 'Документ, содержащий информацию о ранее присвоенных государственных учетных номерах объекта недвижимости',
	'558259000000': 'Протокол образования земельных участков',
	'558260000000': 'Чертеж (абрис) помещения',
	'558261000000': 'Проектная документация здания',
	'558262000000': 'Проектная документация сооружения',
	'558263000000': 'Решение комиссии по рассмотрению споров о результатах определения кадастровой стоимости',
	'558264000000': 'Решение суда',
	'558299000000': 'Иной документ, содержащий описание объекта',
	'558300000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ ОПИСАНИЕ ЗАЯВИТЕЛЯ ИЛИ ЕГО ПРЕДСТАВИТЕЛЯ',
	'558301000000': 'Документы, подтверждающие полномочия представителя',
	'558301010000': 'Доверенность',
	'558301020000': 'Свидетельство о рождении',
	'558301030000': 'Свидетельство об усыновлении',
	'558301040000': 'Решение суда',
	'558301050000': 'Определение суда',
	'558301060000': 'Протокол об избрании (единоличного исполнительного органа юридического лица)',
	'558301070000': 'Выписка из протокола об избрании (единоличного исполнительного органа юридического лица)',
	'558301080000': 'Приказ о назначении (руководителя или иного уполномоченного лица)',
	'558301090000': 'Решение органов опеки и попечительства',
	'558301100000': 'Договор коммерческого представительства',
	'558301110000': 'Договор доверительного управления',
	'558301120000': 'Постановление судебного пристава-исполнителя',
	'558301130000': 'Протокол общего собрания',
	'558301140000': 'Акт органа государственной власти или органа местного самоуправления, подтверждающий полномочия представителя заявителя',
	'558301990000': 'Иной документ',
	'558400000000': 'ДОКУМЕНТЫ О ПРАВАХ, СДЕЛКАХ, ОГРАНИЧЕНИЯХ (ОБРЕМЕНЕНИЯХ)',
	'558401000000': 'Правоустанавливающие и правоудостоверяющие документы',
	'558401010000': 'Договоры / соглашения',
	'558401010100': 'Сделки об отчуждении',
	'558401010101': 'Договор купли-продажи',
	'558401010102': 'Договор мены',
	'558401010103': 'Договор дарения',
	'558401010104': 'Договор ренты',
	'558401010105': 'Договор пожизненного содержания с иждивением',
	'558401010106': 'Договор приватизации (договор передачи объекта недвижимости в собственность)',
	'558401010200': 'Другие сделки',
	'558401010201': 'Договор участия в долевом строительстве',
	'558401010202': 'Соглашение об определении (перераспределении) долей в праве общей долевой собственности',
	'558401010203': 'Брачный договор',
	'558401010204': 'Соглашение об отступном',
	'558401010205': 'Соглашение о разделе имущества',
	'558401010206': 'Соглашение о выделе доли',
	'558401010207': 'Инвестиционный договор (договор об инвестировании)',
	'558401010208': 'Мировое соглашение',
	'558401010209': 'Договор аренды (субаренды)',
	'558401010210': 'Договор об ипотеке',
	'558401010211': 'Договор безвозмездного срочного пользования земельным участком',
	'558401010212': 'Кредитный договор',
	'558401010213': 'Договор займа',
	'558401010214': 'Соглашение об установлении сервитута',
	'558401010215': 'Соглашение об изменении содержания закладной',
	'558401010216': 'Дополнительное соглашение (соглашение об изменении условий договора) к договору',
	'558401010217': 'Соглашение о расторжении договора',
	'558401010218': 'Соглашение об уступке прав требования по договору (договор о передаче прав и обязанностей)',
	'558401010219': 'Договор простого товарищества (договор о совместной деятельности)',
	'558401010220': 'Государственный контракт',
	'558401010299': 'Иная сделка',
	'558401020000': 'Акты органов государственной власти или органов местного самоуправления',
	'558401020100': 'Федеральный закон',
	'558401020200': 'Указ Президента Российской Федерации',
	'558401020300': 'Постановление Правительства Российской Федерации',
	'558401020400': 'Закон (законы Российской Федерации, субъекта Российской Федерации)',
	'558401020500': 'Документ о предоставлении земельных участков',
	'558401020600': 'Решение об образовании земельных участков',
	'558401020700': 'Акт об установлении сервитута',
	'558401020800': 'Акт об установлении ограничения (обременения)',
	'558401029900': 'Иные акты органов государственной власти или органов местного самоуправления',
	'558401030000': 'Свидетельство о праве на наследство',
	'558401030100': 'Свидетельство о праве на наследство по закону',
	'558401030200': 'Свидетельство о праве на наследство по завещанию',
	'558401040000': 'Вступившие в силу судебные акты',
	'558401040100': 'Судебный акт, устанавливающий запрет на совершение действий в сфере государственного кадастрового учета в отношении объекта недвижимости',
	'558401040200': 'Судебный акт о восстановлении аннулированных и исключенных из государственного кадастра недвижимости сведений об объекте недвижимости',
	'558401040300': 'Судебный акт об установлении обременения (ограничении) в использовании объекта недвижимости  (части объекта недвижимости)',
	'558401049900': 'Иные предусмотренные законодательством судебные акты',
	'558401050000': 'Акты (свидетельства) о правах на объекты недвижимости',
	'558401050100': 'Регистрационное удостоверение',
	'558401050200': 'Свидетельство о праве на землю',
	'558401050300': 'Государственный акт о праве на землю',
	'558401050400': 'Свидетельство о праве собственности',
	'558401059900': 'Иные акты, свидетельства о правах на объекты недвижимости',
	'558401060000': 'Документы на вновь возведенный (реконструированный) объект',
	'558401060100': 'Разрешение на ввод объекта в эксплуатацию',
	'558401060200': 'Разрешение на строительство',
	'558401060300': 'Акт ввода в эксплуатацию',
	'558401060400': 'Копия решения о создании искусственного земельного участка',
	'558401070000': 'Документы при упрощенном порядке оформления прав граждан на отдельные объекты недвижимого имущества',
	'558401070100': 'Выписка из похозяйственной книги о наличии у гражданина права на земельный участок',
	'558401070200': 'Кадастровый паспорт объекта недвижимости',
	'558401070300': 'Декларация об объекте недвижимого имущества',
	'558401080000': 'Прочие правоустанавливающие документы',
	'558401080100': 'Передаточный акт',
	'558401080200': 'Разделительный баланс',
	'558401080300': 'План приватизации',
	'558401080400': 'Правила доверительного управления',
	'558401080500': 'Акт описи и ареста имущества',
	'558401080600': 'Протокол о выделе земельного участка в счет земельной доли',
	'558401080700': 'Протокол общего собрания собственников помещений в многоквартирном доме',
	'558401080800': 'Отказ одаряемого принять дар (отказ от дара)',
	'558401080900': 'Соглашение о новации',
	'558401081000': 'Соглашение о разделе наследственного имущества',
	'558401081100': 'Соглашение об уплате алиментов',
	'558401081200': 'Документ, подтверждающий наличие, возникновение, переход ограничения (обременения) вещного права на объект недвижимости в пользу заявителя',
	'558401089900': 'Иной документ',
	'558402000000': 'СОПУТСТВУЮЩИЕ И ДОПОЛНИТЕЛЬНЫЕ ДОКУМЕНТЫ',
	'558402010000': 'Согласие супруга на совершение сделки',
	'558402020000': 'Согласие органов опеки и попечительства',
	'558402030000': 'Свидетельство о заключении брака',
	'558402040000': 'Свидетельство о расторжении брака',
	'558402050000': 'Решение об одобрении (о совершении) сделки',
	'558402060000': 'Справка о стоимости (справка о соотношении стоимости отчуждаемого объекта и балансовой стоимости имущества или активов хозяйственного общества)',
	'558402070000': 'Справка о заинтересованных лицах в сделке',
	'558402080000': 'Выписка из домовой книги (сведения о лицах, сохраняющих право проживания в жилом помещении после перехода права на него)',
	'558402090000': 'Выписка из лицевого счета (сведения о лицах, сохраняющих право проживания в жилом помещении после перехода права на него)',
	'558402100000': 'Протокол о результатах торгов',
	'558402110000': 'Лицензия (лицензия на осуществление определенных видов деятельности)',
	'558402120000': 'Проектная декларация',
	'558402130000': 'Отказ от преимущественного права покупки (для участников долевой собственности, для субъекта Российской Федерации при продаже земельного участка из состава земель сельскохозяйственного назначения)',
	'558402140000': 'Решение о создании юридического лица',
	'558402150000': 'Решение о реорганизации юридического лица',
	'558402160000': 'Решение о ликвидации юридического лица',
	'558402170000': 'Решение об утверждении оценки имущества (решение об утверждении оценки неденежных вкладов в уставный капитал общества)',
	'558402180000': 'Исполнительный лист',
	'558402190000': 'Договор поручения',
	'558402200000': 'Бухгалтерский баланс',
	'558402210000': 'Закладная',
	'558402220000': 'Добавочный лист к закладной',
	'558402230000': 'Выписка из реестра муниципальной собственности',
	'558402240000': 'Выписка из реестра собственности субъекта Российской Федерации',
	'558402250000': 'Выписка из реестра федерального имущества',
	'558402260000': 'Жилищный сертификат',
	'558402270000': 'Аудиторское заключение',
	'558402280000': 'Отчет о проведении независимой оценки (акт оценки)',
	'558402390000': 'Акт инвентаризации',
	'558402400000': 'Охранное обязательство собственника объекта культурного наследия',
	'558402990000': 'Иной документ',
	'558403000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ СВЕДЕНИЯ ЕГРП',
	'558403010000': 'Свидетельство о государственной регистрации права',
	'558403020000': 'Выписка о правах на объект недвижимого имущества',
	'558403030000': 'Выписка о переходе прав на объект недвижимого имущества',
	'558403040000': 'Выписка о правах отдельного лица на имеющиеся у него объекты недвижимого имущества',
	'558403050000': 'Выписка о признании правообладателя недееспособным или ограниченно дееспособным',
	'558403060000': 'Справка о содержании правоустанавливающих документов на объект недвижимого имущества',
	'558403070000': 'Справка о лицах, получивших сведения об объекте недвижимого имущества',
	'558403080000': 'Копии договоров и иных документов, выражающих содержание односторонних сделок, совершенных в простой письменной форме',
	'558403090000': 'Выписка из ЕГРП о принятии на учёт бесхозяйного объекта недвижимого имущества',
	'558403100000': 'Выписка из ЕГРП о принятии на учёт бесхозяйного объекта недвижимого имущества, от права собственности на который собственник отказался',
	'558403110000': 'Выписка из ЕГРП о бесхозяйном объекте недвижимого имущества, принятом на учёт',
	'558403120000': 'Выписка из единого государственного реестра прав на недвижимое имущество и сделок с ним, удостоверяющая проведение государственной регистрации возникновения и (или) перехода прав на недвижимое имущество',
	'558403990000': 'Иной документ',
	'558404000000': 'Соглашения и согласия об образовании земельных участков',
	'558404010000': 'Соглашение о разделе, об объединении, о перераспределении земельных участков или о выделе из земельных участков',
	'558404020000': 'Согласие на образование земельных участков',
	'558404030000': 'Соглашение об образовании общей долевой собственности на земельный участок, образуемый при выделе его в счет земельной доли или земельных долей',
	'558404040000': 'Соглашение об образовании общей совместной собственности на земельный участок, образуемый при выделе его в счет земельной доли или земельных долей',
	'558405000000': 'Документы, подтверждающие возникновение права собственности в отношении земельного участка в силу федерального закона вне зависимости от момента государственной регистрации этого права в ЕГРП',
	'558405010000': 'Копия решения о безвозмездной передаче военного недвижимого имущества из федеральной собственности в собственность субъекта Российской Федерации - города федерального значения Москвы или Санкт-Петербурга либо муниципальную собственность',
	'558405020000': 'Подлинник или копия письма органа исполнительной власти субъекта Российской Федерации - города федерального значения Москвы или Санкт-Петербурга либо органа местного самоуправления муниципального образования о согласовании границ образуемого земельного участка с приложением согласованного проекта границ земельного участка в случае, если акт согласования границ земельного участка не заверен подписью уполномоченного должностного лица соответствующего органа',
	'558405030000': 'Решение об изъятии земельных участков и (или) расположенных на них иных объектов недвижимого имущества в целях размещения олимпийских объектов',
	'558405040000': 'Копия акта приема-передачи объектов недвижимого имущества, в отношении которых принято решение об изъятии в целях размещения олимпийских объектов',
	'558405990000': 'Иные документы, подтверждающие возникновение права собственности в отношении земельного участка в силу федерального закона вне зависимости от момента государственной регистрации этого права в ЕГРП',
	'558500000000': 'Решения, уведомления, расписки',
	'558501000000': 'Документы о результатах государственного кадастрового учёта',
	'558501010000': 'РЕШЕНИЯ',
	'558501010100': 'Решение об отказе в предоставлении запрашиваемых сведений',
	'558501010200': 'Решение об отказе в исправлении кадастровой ошибки',
	'558501010300': 'Решение об отказе в исправлении технической ошибки',
	'558501010400': 'Решение об исправлении технической и кадастровой ошибок',
	'558501010500': 'Решение об отказе в осуществлении кадастровой процедуры',
	'558501010600': 'Решение о приостановлении осуществления кадастровой процедуры',
	'558501010700': 'Решение об отказе в снятии приостановления',
	'558501010800': 'Решение о снятии с кадастрового учёта земельных участков со статусом «временные» по заявлению заинтересованного лица',
	'558501010900': 'Решение об отказе в выдаче кадастрового паспорта',
	'558501011000': 'Решение об осуществлении кадастровой процедуры',
	'558501011100': 'Решение об аннулировании кадастровых сведений',
	'558501011200': 'Решение об отклонении заявления об исправлении технической ошибки',
	'558501011300': 'Решение о внесении записи о наличии возражения',
	'558501011400': 'Решение о погашении записи о наличии возражения',
	'558501011500': 'Решение о внесении записи о заявлении о невозможности государственной регистрации',
	'558501011600': 'Решение о погашении записи о заявлении о невозможности государственной регистрации',
	'558501020000': 'УВЕДОМЛЕНИЯ',
	'558501020100': 'Уведомление об отсутствии в ГКН запрашиваемых сведений',
	'558501020200': 'Уведомление об осуществлённом кадастровом учёте',
	'558501020300': 'Уведомление об отказе в приеме документов для внесения в Единый государственный реестр объектов капитального строительства (далее - Единый государственный реестр) сведений об ОКС',
	'558501020400': 'Уведомление об отказе в приеме документов для предоставления из Единого государственного реестра сведений об ОКС',
	'558501020500': 'Уведомление об устранении технической ошибки в сведениях ГКН',
	'558501020600': 'Уведомление об отказе в выдаче сведений об ОКС',
	'558501020700': 'Уведомление о приостановлении осуществления кадастровой процедуры',
	'558501020800': 'Уведомление об отказе в осуществлении кадастровой процедуры',
	'558501020900': 'Уведомление о регистрации права',
	'558501021000': 'Уведомление о приостановлении принятия на учёт имущества в качестве бесхозяйного',
	'558501021100': 'Сообщение об отказе в принятии на учёт имущества в качестве бесхозяйного',
	'558501021200': 'Уведомление о снятии с учёта имущества в качестве бесхозяйного',
	'558501021300': 'Уведомление о возврате заявления о наличии возражения в отношении зарегистрированного права на объект недвижимости без рассмотрения',
	'558501030000': 'ПРОЧИЕ',
	'558501030100': 'Расписка в получении соответствующих документов для проведения государственного кадастрового учёта',
	'558501030200': 'Протокол проверки документов',
	'558501030300': 'Акт определения кадастровой стоимости земельных участков',
	'558501030400': 'Протокол выявления технической ошибки',
	'558501030500': 'Акт определения кадастровой стоимости объектов недвижимости',
	'558501039900': 'Иные документы',
	'558502000000': 'ДОКУМЕНТЫ О РЕЗУЛЬТАТАХ РЕГИСТРАЦИИ ПРАВ',
	'558502010000': 'УВЕДОМЛЕНИЯ, СООБЩЕНИЯ',
	'558502010100': 'Уведомление о приостановлении государственной регистрации прав',
	'558502010200': 'Уведомление о прекращении государственной регистрации прав',
	'558502010300': 'Уведомление о зарегистрированных ограничениях (обременениях) прав',
	'558502010400': 'Уведомление о внесении изменений в ЕГРП',
	'558502010500': 'Уведомление об исправлении технической ошибки в записях единого государственного реестра прав на недвижимое имущество и сделок с ним',
	'558502010600': 'Сообщение об отказе в государственной регистрации прав',
	'558502010700': 'Сообщение об отказе в предоставлении сведений из ЕГРП',
	'558502010800': 'Уведомление об отсутствии в ЕГРП запрашиваемых сведений',
	'558502010900': 'Сообщение о приёме заявления о государственной регистрации права, ограничения (обременения) права на предприятие, сделки с ним',
	'558502011000': 'Сообщение о поступлении документов на государственную регистрацию договоров мены и (или) перехода права',
	'558502011100': 'Уведомление о возврате приложенных к заявлению документов без рассмотрения',
	'558502011200': 'Уведомление о государственной регистрации прекращения ограничения (обременения)',
	'558502011300': 'Уведомление об отсутствии сведений о лицах, получивших сведения об объектах недвижимого имущества',
	'558502011400': 'Уведомление о государственной регистрации права собственности субъекта Российской Федерации или муниципального образования на земельный участок или земельную долю вследствие отказа от соответствующего права правообладателем',
	'558502011500': 'Уведомление о поступлении решения суда, вступившего в законную силу, с указанием срока окончания осуществления государственной регистрации прав, в случае если отказ в государственной регистрации прав признан судом необоснованным',
	'558502011600': 'Уведомление о внесении изменений в единый государственный реестр прав на недвижимое имущество и сделок с ним в связи с изменением содержащихся в базовых государственных информационных ресурсах сведений о правообладателе (правообладателях)',
	'558502011700': 'Уведомление о возврате документов без рассмотрения при отказе в осуществлении государственного кадастрового учета',
	'558502020000': 'ПРОЧИЕ',
	'558502020100': 'Расписка в получении документов на государственную регистрацию прав',
	'558502029900': 'Иной документ',
	'558601000000': 'Расписка в получении извещений о проведении собрания о согласовании местоположения границ',
	'558602000000': 'Уведомление о вручении извещения о проведении собрания о согласовании местоположения границ',
	'558603000000': 'Копия страницы печатного издания, содержащей извещение о проведении собрания о согласовании местоположения границ земельного участка, включая первый лист, содержащего реквизиты такого печатного издания',
	'558699000000': 'Иные документы, свидетельствующие о соблюдении установленного порядка извещения заинтересованных лиц о проведении собрания о согласовании местоположения границ земельного участка'
};
//Территориальные зоны и зоны с особыми условиями использования территорий
var dZone = {
	'218010000000': 'Территориальные зоны',
	'218010010000': 'Жилая зона',
	'218010020000': 'Общественно-деловая зона',
	'218010030000': 'Производственная зона, зона инженерной и транспортной инфраструктур',
	'218010040000': 'Зона сельскохозяйственного использования',
	'218010050000': 'Зона рекреационного назначения',
	'218010060000': 'Зона особо охраняемых территорий',
	'218010070000': 'Зона специального назначения',
	'218010080000': 'Зона размещения военных объектов',
	'218010090000': 'Иная зона',
	'218020000000': 'Зоны с особыми условиями использования территории',
	'218020010000': 'Зоны охраны природных объектов',
	'218020010001': 'Территория особо охраняемого природного объекта',
	'218020010002': 'Охранная зона особо охраняемого природного объекта',
	'218020010003': 'Водоохранная зона',
	'218020010004': 'Прибрежная защитная полоса',
	'218020010005': 'Зона санитарной охраны источников водоснабжения и водопроводов питьевого назначения',
	'218020010006': 'Особо ценные земли',
	'218020020000': 'Зоны охраны искусственных объектов',
	'218020020001': 'Территория объекта культурного наследия',
	'218020020002': 'Зона охраны объекта культурного наследия',
	'218020020003': 'Охранная зона геодезического пункта',
	'218020020004': 'Охранная зона стационарного пункта наблюдений за состоянием окружающей природной среды',
	'218020020005': 'Охранная зона транспорта',
	'218020020006': 'Охранная зона инженерных коммуникаций',
	'218020020007': 'Охранная зона линий и сооружений связи и линий и сооружений радиофикации',
	'218020020008': 'Придорожная полоса',
	'218020030000': 'Зоны защиты населения',
	'218020030001': 'Запретная зона при военном складе',
	'218020030002': 'Запретный район при военном складе',
	'218020030003': 'Загрязненные земли',
	'218020030004': 'Охранная зона загрязненных земель',
	'218020030005': 'Санитарно-защитная зона предприятий, сооружений и иных объектов',
	'218020030006': 'Санитарный разрыв (санитарная полоса отчуждения)',
	'218020030007': 'Зона ограничения от передающего радиотехнического объекта',
	'218020030008': 'Район падения отделяющихся частей ракет',
	'218020040000': 'Прочие зоны с особыми условиями использования территории',
	'218020040001': 'Зона публичного сервитута',
	'218020040002': 'Зона резервирования земель',
	'218020040003': 'Горный отвод',
	'218020040004': 'Пригородная зона',
	'218020040005': 'Зеленая зона',
	'218020040006': 'Особая экономическая зона',
	'218020040007': 'Пограничная зона',
	'218020040008': 'Территория традиционного природопользования',
	'218020050000': 'Иные зоны с особыми условиями использования территории',
	'218020050001': 'Иная зона с особыми условиями использования территории'		
};
// Классификатор видов использования земель
var dUtilizations = {
	'141000000000': 'Для размещения объектов сельскохозяйственного назначения и сельскохозяйственных угодий',
	'141001000000': 'Для сельскохозяйственного производства',
	'141001010000': 'Для использования в качестве сельскохозяйственных угодий',
	'141001020000': 'Для размещения зданий, строений, сооружений, используемых для производства, хранения и первичной переработки сельскохозяйственной продукции',
	'141001030000': 'Для размещения внутрихозяйственных дорог и коммуникаций',
	'141001040000': 'Для размещения водных объектов',
	'141002000000': 'Для ведения крестьянского (фермерского) хозяйства',
	'141003000000': 'Для ведения личного подсобного хозяйства',
	'141004000000': 'Для ведения гражданами садоводства и огородничества',
	'141005000000': 'Для ведения гражданами животноводства',
	'141006000000': 'Для дачного строительства',
	'141007000000': 'Для размещения древесно-кустарниковой растительности, предназначенной для защиты земель от воздействия негативных (вредных) природных, антропогенных и техногенных явлений',
	'141008000000': 'Для научно-исследовательских целей',
	'141009000000': 'Для учебных целей',
	'141010000000': 'Для сенокошения и выпаса скота гражданами',
	'141011000000': 'Фонд перераспределения',
	'141012000000': 'Для размещения объектов охотничьего хозяйства',
	'141013000000': 'Для размещения объектов рыбного хозяйства',
	'141014000000': 'Для иных видов сельскохозяйственного использования',
	'142000000000': 'Для размещения объектов, характерных для населённых пунктов',
	'142001000000': 'Для объектов жилой застройки',
	'142001010000': 'Для индивидуальной жилой застройки',
	'142001020000': 'Для многоквартирной застройки',
	'142001020100': 'Для малоэтажной застройки',
	'142001020200': 'Для среднеэтажной застройки',
	'142001020300': 'Для многоэтажной застройки',
	'142001020400': 'Для иных видов жилой застройки',
	'142001030000': 'Для размещения объектов дошкольного, начального, общего и среднего (полного) общего образования',
	'142001040000': 'Для размещения иных объектов, допустимых в жилых зонах и не перечисленных в классификаторе',
	'142002000000': 'Для объектов общественно-делового значения',
	'142002010000': 'Для размещения объектов социального и коммунально-бытового назначения',
	'142002020000': 'Для размещения объектов здравоохранения',
	'142002030000': 'Для размещения объектов культуры',
	'142002040000': 'Для размещения объектов торговли',
	'142002040100': 'Для размещения объектов розничной торговли',
	'142002040200': 'Для размещения объектов оптовой торговли',
	'142002050000': 'Для размещения объектов общественного питания',
	'142002060000': 'Для размещения объектов предпринимательской деятельности',
	'142002070000': 'Для размещения объектов среднего профессионального и высшего профессионального образования',
	'142002080000': 'Для размещения административных зданий',
	'142002090000': 'Для размещения научно-исследовательских учреждений',
	'142002100000': 'Для размещения культовых зданий',
	'142002110000': 'Для стоянок автомобильного транспорта',
	'142002120000': 'Для размещения объектов делового назначения, в том числе офисных центров',
	'142002130000': 'Для размещения объектов финансового назначения',
	'142002140000': 'Для размещения гостиниц',
	'142002150000': 'Для размещения подземных или многоэтажных гаражей',
	'142002160000': 'Для размещения индивидуальных гаражей',
	'142002170000': 'Для размещения иных объектов общественно-делового значения, обеспечивающих жизнь граждан',
	'142003000000': 'Для общего пользования (уличная сеть)',
	'142004000000': 'Для размещения объектов специального назначения',
	'142004010000': 'Для размещения кладбищ',
	'142004020000': 'Для размещения крематориев',
	'142004030000': 'Для размещения скотомогильников',
	'142004040000': 'Под объектами размещения отходов потребления',
	'142004050000': 'Под иными объектами специального назначения',
	'142005000000': 'Для размещения коммунальных, складских объектов',
	'142006000000': 'Для размещения объектов жилищно-коммунального хозяйства',
	'142007000000': 'Для иных видов использования, характерных для населённых пунктов',
	'143000000000': 'Для размещения объектов промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, обеспечения космической деятельности, обороны, безопасности и иного специального назначения',
	'143001000000': 'Для размещения промышленных объектов',
	'143001010000': 'Для размещения производственных и административных зданий, строений, сооружений и обслуживающих их объектов',
	'143001010100': 'Для размещения производственных зданий',
	'143001010200': 'Для размещения коммуникаций',
	'143001010300': 'Для размещения подъездных путей',
	'143001010400': 'Для размещения складских помещений',
	'143001010500': 'Для размещения административных зданий',
	'143001010600': 'Для размещения культурно-бытовых зданий',
	'143001010700': 'Для размещения иных сооружений промышленности',
	'143001020000': 'Для добычи и разработки полезных ископаемых',
	'143001030000': 'Для размещения иных объектов промышленности',
	'143002000000': 'Для размещения объектов энергетики',
	'143002010000': 'Для размещения электростанций и обслуживающих сооружений и объектов',
	'143002010100': 'Для размещения гидроэлектростанций',
	'143002010200': 'Для размещения атомных станций',
	'143002010300': 'Для размещения ядерных установок',
	'143002010400': 'Для размещения пунктов хранения ядерных материалов и радиоактивных веществ энергетики',
	'143002010500': 'Для размещения хранилищ радиоактивных отходов',
	'143002010600': 'Для размещения тепловых станций',
	'143002010700': 'Для размещения иных типов электростанций',
	'143002010800': 'Для размещения иных обслуживающих сооружений и объектов',
	'143002020000': 'Для размещения объектов электросетевого хозяйства',
	'143002020100': 'Для размещения воздушных линий электропередачи',
	'143002020200': 'Для размещения наземных сооружений кабельных линий электропередачи',
	'143002020300': 'Для размещения подстанций',
	'143002020400': 'Для размещения распределительных пунктов',
	'143002020500': 'Для размещения других сооружений и объектов электросетевого хозяйства',
	'143002030000': 'Для размещения иных объектов энергетики',
	'143003000000': 'Для размещения объектов транспорта',
	'143003010000': 'Для размещения и эксплуатации объектов железнодорожного транспорта',
	'143003010100': 'Для размещения железнодорожных путей и их конструктивных элементов',
	'143003010200': 'Для размещения полос отвода железнодорожных путей',
	'143003010300': 'Для размещения, эксплуатации, расширения и реконструкции строений, зданий, сооружений, в том числе железнодорожных вокзалов, железнодорожных станций, а также устройств и других объектов, необходимых для эксплуатации, содержания, строительства, реконструкции, ремонта, развития наземных и подземных зданий, строений, сооружений, устройств и других объектов железнодорожного транспорта',
	'143003010301': 'Для размещения железнодорожных вокзалов',
	'143003010302': 'Для размещения железнодорожных станций',
	'143003010303': 'Для размещения устройств и других объектов, необходимых для эксплуатации, содержания, строительства, реконструкции, ремонта, развития наземных и подземных зданий, строений, сооружений, устройств и других объектов железнодорожного транспорта',
	'143003020000': 'Для размещения и эксплуатации объектов автомобильного транспорта и объектов дорожного хозяйства',
	'143003020100': 'Для размещения автомобильных дорог и их конструктивных элементов',
	'143003020200': 'Для размещения полос отвода',
	'143003020300': 'Для размещения объектов дорожного сервиса в полосах отвода автомобильных дорог',
	'143003020400': 'Для размещения дорожных сооружений',
	'143003020500': 'Для размещения автовокзалов и автостанций',
	'143003020600': 'Для размещения иных объектов автомобильного транспорта и дорожного хозяйства',
	'143003030000': 'Для размещения и эксплуатации объектов морского, внутреннего водного транспорта',
	'143003030100': 'Для размещения искусственно созданных внутренних водных путей',
	'143003030200': 'Для размещения морских и речных портов, причалов, пристаней',
	'143003030300': 'Для размещения иных объектов морского, внутреннего водного транспорта',
	'143003030400': 'Для выделения береговой полосы',
	'143003040000': 'Для размещения и эксплуатации объектов воздушного транспорта',
	'143003040100': 'Для размещения аэропортов и аэродромов',
	'143003040200': 'Для размещения аэровокзалов',
	'143003040300': 'Для размещения взлетно-посадочных полос',
	'143003040400': 'Для размещения иных наземных объектов воздушного транспорта',
	'143003050000': 'Для размещения и эксплуатации объектов трубопроводного транспорта',
	'143003050100': 'Для размещения нефтепроводов',
	'143003050200': 'Для размещения газопроводов',
	'143003050300': 'Для размещения иных трубопроводов',
	'143003050400': 'Для размещения иных объектов трубопроводного транспорта',
	'143003060000': 'Для размещения и эксплуатации иных объектов транспорта',
	'143004000000': 'Для размещения объектов связи, радиовещания, телевидения, информатики',
	'143004010000': 'Для размещения эксплуатационных предприятий связи и обслуживания линий связи',
	'143004020000': 'Для размещения кабельных, радиорелейных и воздушных линий связи и линий радиофикации на трассах кабельных и воздушных линий связи и радиофикации и их охранные зоны',
	'143004030000': 'Для размещения подземных кабельных и воздушных линий связи и радиофикации и их охранные зоны',
	'143004040000': 'Для размещения наземных и подземных необслуживаемых усилительных пунктов на кабельных линиях связи и их охранные зоны',
	'143004050000': 'Для размещения наземных сооружений и инфраструктур спутниковой связи',
	'143004060000': 'Для размещения иных объектов связи, радиовещания, телевидения, информатики',
	'143005000000': 'Для размещения объектов, предназначенных для обеспечения космической деятельности',
	'143005010000': 'Для размещения космодромов, стартовых комплексов и пусковых установок',
	'143005020000': 'Для размещения командно-измерительных комплексов, центров и пунктов управления полетами космических объектов, приема, хранения и переработки информации',
	'143005030000': 'Для размещения баз хранения космической техники',
	'143005040000': 'Для размещения полигонов приземления космических объектов и взлетно-посадочных полос',
	'143005050000': 'Для размещения объектов экспериментальной базы для отработки космической техники',
	'143005060000': 'Для размещения центров и оборудования для подготовки космонавтов',
	'143005070000': 'Для размещения других наземных сооружений и техники, используемых при осуществлении космической деятельности',
	'143006000000': 'Для размещения объектов, предназначенных для обеспечения обороны и безопасности',
	'143006010000': 'Для обеспечения задач обороны',
	'143006010100': 'Для размещения военных организаций, учреждений и других объектов',
	'143006010200': 'Для дислокации войск и сил флота',
	'143006010300': 'Для проведения учений и иных мероприятий',
	'143006010400': 'Для испытательных полигонов',
	'143006010500': 'Для мест уничтожения оружия и захоронения отходов',
	'143006010600': 'Для создания запасов материальных ценностей в государственном и мобилизационном резервах (хранилища, склады и другие)',
	'143006010700': 'Для размещения иных объектов обороны',
	'143006020000': 'Для размещения объектов (территорий), обеспечивающих защиту и охрану Государственной границы Российской Федерации',
	'143006020100': 'Для обустройства и содержания инженерно-технических сооружений и заграждений',
	'143006020200': 'Для обустройства и содержания пограничных знаков',
	'143006020300': 'Для обустройства и содержания пограничных просек',
	'143006020400': 'Для обустройства и содержания коммуникаций',
	'143006020500': 'Для обустройства и содержания пунктов пропуска через Государственную границу Российской Федерации',
	'143006020600': 'Для размещения иных объектов для защиты и охраны Государственной границы Российской Федерации',
	'143006030000': 'Для размещения иных объектов обороны и безопасности',
	'143007000000': 'Для размещения иных объектов промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, обеспечения космической деятельности, обороны, безопасности и иного специального назначения',
	'144000000000': 'Для размещения особо охраняемых историко-культурных и природных объектов (территорий)',
	'144001000000': 'Для размещения особо охраняемых природных объектов (территорий)',
	'144001010000': 'Для размещения государственных природных заповедников (в том числе биосферных)',
	'144001020000': 'Для размещения государственных природных заказников',
	'144001030000': 'Для размещения национальных парков',
	'144001040000': 'Для размещения природных парков',
	'144001050000': 'Для размещения дендрологических парков',
	'144001060000': 'Для размещения ботанических садов',
	'144001070000': 'Для размещения объектов санаторного и курортного назначения',
	'144001080000': 'Территории месторождений минеральных вод, лечебных грязей, рапы лиманов и озер',
	'144001090000': 'Для традиционного природопользования',
	'144001100000': 'Для размещения иных особо охраняемых природных территорий (объектов)',
	'144002000000': 'Для размещения объектов (территорий) природоохранного назначения',
	'144003000000': 'Для размещения объектов (территорий) рекреационного назначения',
	'144003010000': 'Для размещения домов отдыха, пансионатов, кемпингов',
	'144003020000': 'Для размещения объектов физической культуры и спорта',
	'144003030000': 'Для размещения туристических баз, стационарных и палаточных туристско-оздоровительных лагерей, домов рыболова и охотника, детских туристических станций',
	'144003040000': 'Для размещения туристических парков',
	'144003050000': 'Для размещения лесопарков',
	'144003060000': 'Для размещения учебно-туристических троп и трасс',
	'144003070000': 'Для размещения детских и спортивных лагерей',
	'144003080000': 'Для размещения скверов, парков, городских садов',
	'144003090000': 'Для размещения пляжей',
	'144003100000': 'Для размещения иных объектов (территорий) рекреационного назначения',
	'144004000000': 'Для размещения объектов историко-культурного назначения',
	'144004010000': 'Для размещения объектов культурного наследия народов Российской Федерации (памятников истории и культуры), в том числе объектов археологического наследия',
	'144004020000': 'Для размещения военных и гражданских захоронений',
	'144005000000': 'Для размещения иных особо охраняемых историко-культурных и природных объектов (территорий)',
	'145000000000': 'Для размещения объектов лесного фонда',
	'145001000000': 'Для размещения лесной растительности',
	'145002000000': 'Для восстановления лесной растительности',
	'145003000000': 'Для прочих объектов лесного хозяйства',
	'146000000000': 'Для размещения объектов водного фонда',
	'146001000000': 'Под водными объектами',
	'146002000000': 'Для размещения гидротехнических сооружений',
	'146003000000': 'Для размещения иных сооружений, расположенных на водных объектах',
	'147000000000': 'Земли запаса (неиспользуемые)'
};
// Назначение зданий
var dAssBuilding = {
	'204001000000': 'Нежилое здание',
	'204002000000': 'Жилой дом',
	'204003000000': 'Многоквартирный дом'
};

var ParcelProperties;
var ConstructionProperties;
var UncompletedProperties;
var BuildingProperties;
var ZoneProperties;
var BoundProperties;

function getValueFromDict(Key, Dic) {
    for (var k in Dic) {
        if (k === Key) {
            return Dic[k];
        }
    }
}

module.exports.getProperties = function (Feature, FeatureType) {
    switch (FeatureType) {
        case 'Parcel' :
        {
            ParcelProperties = {
                "Кадастровый номер": '', // require
                "Статус": '01', // dStates require
                "Дата создания": '',
                "Тип объекта": '', //dParcels require
                "Категория земель": '', // dCategories // require
                "Площадь": {// requre
                    "Значение": 0, // require
                    "ед.изм": '', //dUnit require
                    "Точность": '' // d20_2
                },
                "Разрешённое использование": {// require
                    "по документу": '',
                    "по справочнику": '' // dUtilization require
                }
            };
            ParcelProperties["Кадастровый номер"] = Feature.CadastralNumber;
            ParcelProperties["Статус"] = getValueFromDict(Feature.State, dStates);
            ParcelProperties["Тип объекта"] = getValueFromDict(Feature.Name, dParcels);
            ParcelProperties["Категория земель"] = getValueFromDict(Feature.Category, dCategories);
            ParcelProperties["Дата создания"] = Feature.DateCreated;
            ParcelProperties["Разрешённое использование"]["по справочнику"] = 
                    getValueFromDict(Feature.Utilization.Utilization, dUtilizations);
            ParcelProperties["Разрешённое использование"]["по документу"] = Feature.Utilization.ByDoc;
            break;
        }
        case 'Construction':{
            ConstructionProperties = {
                cadastreNumber: '', // 
                ObjectType: '', // require
                AssignationName: '',
                Address: {
                    Note: ''
                }
            };
            if (Feature.CadastralNumber) {
                ConstructionProperties.cadastreNumber = Feature.CadastralNumber;
            } else {
                ConstructionProperties.cadastreNumber = '';
            }
            
            ConstructionProperties.AssignationName = Feature.AssignationName;
            ConstructionProperties.ObjectType = getValueFromDict(Feature.ObjectType, dZone);
            ConstructionProperties["Address"]["Note"] = Feature.Address.Note;
            break;
        }
        case 'Building':{
            BuildingProperties = {
                cadastreNumber: '', // 
                ObjectType: '', // require
                AssignationName: '',
                Address: {
                    Note: ''
                }
            };
            if (Feature.CadastralNumber) {
                BuildingProperties.cadastreNumber = Feature.CadastralNumber;
            } else {
                BuildingProperties.cadastreNumber = '';
            }
            
            BuildingProperties.AssignationName = Feature.AssignationName;
            BuildingProperties.ObjectType = getValueFromDict(Feature.ObjectType, dZone);
            BuildingProperties["Address"]["Note"] = Feature.Address.Note;
            break;
        }
        case 'Uncompleted':{
            UncompletedProperties = {
                cadastreNumber: '', // 
                ObjectType: '', // require
                AssignationName: '',
                Address: {
                    Note: ''
                }
            };
            if (Feature.CadastralNumber) {
                UncompletedProperties.cadastreNumber = Feature.CadastralNumber;
            } else {
                UncompletedProperties.cadastreNumber = '';
            }
            
            UncompletedProperties.AssignationName = Feature.AssignationName;
            UncompletedProperties.ObjectType = getValueFromDict(Feature.ObjectType, dZone);
            UncompletedProperties["Address"]["Note"] = Feature.Address.Note;
            break;
        }
        default :{
                console.log('Тип объекта не распознан');
        }
    }
    return {
        parcelProperties: ParcelProperties,
        constructionProperties: ConstructionProperties,
        uncompletedProperties: UncompletedProperties,
        buildingProperties: BuildingProperties,
        zoneProperties: ZoneProperties,
        boundProperties: BoundProperties
    };
};
},{}],3:[function(require,module,exports){
var ES = require('./spatial/EntitySpatial.js');
var Props = require('./cadProps');

module.exports.GeoJSON = function (xmlData, reproject) {

    var geoJSONQuartal = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONBounds = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONZones = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONParcels = {
        'type': 'FeatureCollection',
        'features': []
    };
    var geoJSONRealty = {
        type: "FeatureCollection",
        features: []
    };
    // Отдельное хранилище для GeometryCollection
    var geoJSONRealtyCollection = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONOSMPoints = {
        type: "FeatureCollection",
        features: []
    };

    var _reproject = reproject || null;

    var AllData = $.xml2json(xmlData).CadastralBlocks.CadastralBlock;
    //console.log(AllData);

    // Может быть несколько СК
    var projMSK;
    if (_reproject !== null) {
        projMSK = AllData.CoordSystems;
    }

    // Обработка квартала. Не может быть многоконтурным           
    if (AllData.SpatialData !== null) {
        var spObj = ES.getEntitySpatial(AllData.SpatialData.EntitySpatial, projMSK, 'Quartal', false);
        if ((spObj === undefined) || (spObj.length === 0)) {
            console.log('Объект квартала с пустой геометрией! Объект будет пропущен.');
        }
        // Квартал
        var feature = {
            'type': 'Feature'
        };
        feature.geometry = spObj;
        // Остальные свойства....

        geoJSONQuartal.features.push(feature);
    } else {
        console.log('Нет описания пространственной составляющей квартала');
    }

    // Обработка границ. Не могут быть многоконтурными
    if (AllData.Bounds) {

        if (AllData.Bounds.Bound.splice) {
            for (var i = 0; i < AllData.Bounds.Bound.length; i++) {
                if (AllData.Bounds.Bound[i].Boundaries.Boundary.splice) {
                    for (var k = 0; k < AllData.Bounds.Bound[i].Boundaries.Boundary.length; k++) {
                        // Граница
                        var feature = {
                            'type': 'Feature'
                        };
                        if (AllData.Bounds.Bound[i].Boundaries.Boundary[k].EntitySpatial !== null) {
                            var spObj = ES.getEntitySpatial(AllData.Bounds.Bound[i].Boundaries.Boundary[k].EntitySpatial, projMSK, 'Bound', false);
                            if ((spObj === undefined) || (spObj.length === 0)) {
                                console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
                                continue;
                            }
                            feature.geometry = spObj;
                            // Остальные свойства....

                            geoJSONBounds.features.push(feature);
                        } else {
                            //console.log('Нет описания пространственной составляющей границы');
                        }
                    }
                } else {
                    // Граница
                    var feature = {
                        'type': 'Feature'
                    };
                    var spObj = ES.getEntitySpatial(AllData.Bounds.Bound[i].Boundaries.Boundary.EntitySpatial, projMSK, 'Bound', false);
                    if ((spObj === undefined) || (spObj.length === 0)) {
                        console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
                        continue;
                    }
                    feature.geometry = spObj;
                    // Остальные свойства....

                    geoJSONBounds.features.push(feature);
                }
            }
        } else {
            var spObj = ES.getEntitySpatial(AllData.Bounds.Bound.Boundaries.Boundary.EntitySpatial, projMSK, 'Bound', false);
            if ((spObj === undefined) || (spObj.length === 0)) {
                console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
            }
            feature.geometry = spObj;
            // Остальные свойства....

            geoJSONBounds.features.push(feature);
        }
    }
    // Обработка зон. Не могут быть многоконтурными
    if (AllData.Zones) {

        if (AllData.Zones.Zone.splice) {
            for (var i = 0; i < AllData.Zones.Zone.length; i++) {
                // Зона
                var feature = {
                    'type': 'Feature'
                };
                if (AllData.Zones.Zone[i].EntitySpatial !== null) {
                    var spObj = ES.getEntitySpatial(AllData.Zones.Zone[i].EntitySpatial, projMSK, 'Zone', false);
                    if ((spObj === undefined) || (spObj.length === 0)) {
                        console.log('Объект Зоны с пустой геометрией! Объект будет пропущен.');
                        continue;
                    }
                    feature.geometry = spObj;

                    geoJSONZones.features.push(feature);
                } else {
                    console.log('Нет описания пространственной составляющей зоны');
                }
            }
        } else {
            if (AllData.Zones.Zone.EntitySpatial !== null) {
                // Зона
                var feature = {
                    'type': 'Feature'
                };
                var spObj = ES.getEntitySpatial(AllData.Zones.Zone.EntitySpatial, projMSK, 'Zone', false);
                if ((spObj === undefined) || (spObj.length === 0)) {
                    console.log('Объект Зоны с пустой геометрией! Объект будет пропущен.');
                }
                feature.geometry = spObj;

                geoJSONZones.features.push(feature);
            } else {
                console.log('Нет описания пространственной составляющей зоны');
            }
        }
    }
    // Обработка всех земельных участков
    for (var e = 0; e < AllData.Parcels.Parcel.length; e++) {
        var spObj = null;
        // Земельный участок
        var feature = {
            'type': 'Feature'
        };
        if (AllData.Parcels.Parcel[e].EntitySpatial !== undefined) {
            spObj = ES.getEntitySpatial(AllData.Parcels.Parcel[e].EntitySpatial, projMSK, 'Parcel', false);
            if ((spObj === undefined) || (spObj.length === 0)) {
                continue;
            }

        }
        // Многоконтурный
        else if (AllData.Parcels.Parcel[e].Contours) {
            var Contours = AllData.Parcels.Parcel[e].Contours.Contour;
            var multiPolygon = [];
            for (var c = 0; c < Contours.length; c++) {
                var es = Contours[c].EntitySpatial;
                var p = ES.getEntitySpatial(es, projMSK, 'Parcel', true);
                if (p) {
                    multiPolygon.push(p);
                }
            }
            spObj = {
                type: "MultiPolygon",
                coordinates: multiPolygon
            };
        } else {
            //console.log('Нет описания пространственной составляющей');
        }

        // Если нет геометрии, то объект не нужен
        if (spObj) {
            feature.geometry = spObj;
            // Остальные свойства....
            var props = Props.getProperties(AllData.Parcels.Parcel[e], 'Parcel');
            if (props) {
                feature.properties = props.parcelProperties;
            }
            //console.log('Объект создан. КН:' + feature.properties.cadastreNumber);
            geoJSONParcels.features.push(feature);
        }

    }
    // Обработка строений. могут быть составные из разных геометрий
    if (AllData.ObjectsRealty.ObjectRealty) {
        if (AllData.ObjectsRealty.ObjectRealty.splice) {

            function processES(EntitySpatial, oType) {
                var spObj = ES.getEntitySpatial(EntitySpatial, projMSK, oType, false);
                if (spObj) {
                    feature.geometry = spObj;
                    if (spObj.type === 'GeometryCollection') {
                        geoJSONRealtyCollection.features.push(feature);
                        //console.log('Добавлен geoJSONRealtyGeometryCollection');
                        //console.log(spObj.geometries);
                    } else {
                        geoJSONRealty.features.push(feature);
                        //console.log('Добавлен geoJSONRealty. Type ' + spObj.type);
                        //console.log(spObj.coordinates);
                    }
                } else {
                    console.log('ОКС с пустой геометрией! Объект будет пропущен.');
                }
            }

            for (var i = 0; i < AllData.ObjectsRealty.ObjectRealty.length; i++) {
                var spObj = null;
                // ОКС
                var feature = {
                    'type': 'Feature'
                };
                // строения
                if (AllData.ObjectsRealty.ObjectRealty[i].Building) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Building.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Building, 'Building');
                        if (props) {
                            feature.properties = props.buildingProperties;
                            //console.log(props.buildingProperties);
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Building.EntitySpatial, 'Building');
                    }
                }
                // объекты незавершённого строительства
                else if (AllData.ObjectsRealty.ObjectRealty[i].Uncompleted) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Uncompleted.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Uncompleted, 'Uncompleted');
                        if (props) {
                            feature.properties = props.uncompletedProperties;
                            //console.log(props.uncompletedProperties);
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Uncompleted.EntitySpatial, 'Uncompleted');
                    }
                }
                // сооружения
                else if (AllData.ObjectsRealty.ObjectRealty[i].Construction) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Construction.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Construction, 'Construction');
                        if (props) {
                            feature.properties = props.constructionProperties;
                            //console.log(props.constructionProperties);
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Construction.EntitySpatial, 'Construction');
                    }
                }
            }
        }
    }
    // Обработка пунктов ОМС

    return {
        geoJSONQuartal: geoJSONQuartal,
        geoJSONBounds: geoJSONBounds,
        geoJSONZones: geoJSONZones,
        geoJSONParcels: geoJSONParcels,
        geoJSONRealty: geoJSONRealty,
        geoJSONRealtyGeometryCollection: geoJSONRealtyCollection
    };
};

},{"./cadProps":2,"./spatial/EntitySpatial.js":4}],4:[function(require,module,exports){
/**
 * Модуль обработки геометрии типа полигон.
 * Один внешний контур и 0 или более внутренних контуров-"дырок"
 * 
 * GeoJSON geometry типа tEntitySpatialLandOut
 */

//"geometry": {
//    "type": "Polygon",
//    "coordinates": [
//      [ [100.0, 0.0], [101.0, 0.0], [101.0, 1.0],
//        [100.0, 1.0], [100.0, 0.0] ]
//      ]
//  }

var projections = require('./SpatialSystems');

module.exports.getEntitySpatial = function (EntitySpatialObj, proj, oType, partOfMultu) {

//	this.geometry = {
//        type: '',
//		coordinates: []
//	};

    var _EntitySpatialObj = EntitySpatialObj;
    var _proj = proj || null;
    var Area = 0.0;
    var spatialSysName = null;
    var LineString = false;

    // Вычисление площади замкнутого контура
    function polygonArea(Xs, Ys, numPoints) {
        var area = 0;
        var j = numPoints - 1;
        for (var i = 0; i < numPoints; i++)
        {
            area = area + ((Xs[j]) + (Xs[i])) * ((Ys[j]) - (Ys[i]));
            j = i;  //j is previous vertex to i
        }
        return Math.abs(area / 2);
    }

    function convertCoord(coord) {
        // global
        if ((_proj === null) || (spatialSysName === null)) {
            return coord;
        } else {
            return proj4(projections.SpatialSystems[spatialSysName], 'EPSG:3857', coord);
        }
    }

    function getSpatialSysName() {
        var id = _EntitySpatialObj.EntSys;
        for (var i = 0; _proj.CoordSystem.length; i++) {
            if (_proj.CoordSystem[i].CsId === id) {
                return _proj.CoordSystem[i].Name;
            }
        }
        return null;
    }

    // Создание одного замкнутого контура или линии или окружности
    function createContour(SpatialElement) {
        var xs = [];
        var ys = [];
        var contour = [];
        var coord;
        var re_projected = [];
        // проверка на окружность
        if ((SpatialElement.SpelementUnit.TypeUnit === "Окружность" || "Точка") &&
                (SpatialElement.SpelementUnit.R !== undefined)) {
            coord = [Number(SpatialElement.SpelementUnit.Ordinate.Y), Number(SpatialElement.SpelementUnit.Ordinate.X)];
            re_projected = convertCoord(coord);
            console.log(coord[0], re_projected[0]);
            return {
                'R': Number(SpatialElement.SpelementUnit.R),
                'Y': Number(re_projected[0]),
                'X': Number(re_projected[1])
            };
        } else {
            if (SpatialElement.SpelementUnit.length === 1)
                return null;
            var firstPoint = SpatialElement.SpelementUnit[0];
            var lastPoint = SpatialElement.SpelementUnit[SpatialElement.SpelementUnit.length - 1];
            if (firstPoint.SuNmb === lastPoint.SuNmb) {
                LineString = false;
                //console.log(LineString, firstPoint.SuNmb, lastPoint.SuNmb);
                for (var j = 0; j < SpatialElement.SpelementUnit.length - 1; j++) {
                    var point = SpatialElement.SpelementUnit[j];
                    var xy = [];
                    coord = [Number(point.Ordinate.Y), Number(point.Ordinate.X)];
                    re_projected = convertCoord(coord);
                    xy.push(Number(re_projected[0]));
                    xy.push(Number(re_projected[1]));
                    contour.push(xy);
                }
                Area = polygonArea(xs, ys, xs.length);
            } else {
                LineString = true;
                //console.log(LineString, firstPoint.SuNmb, lastPoint.SuNmb);
                for (var j = 0; j < SpatialElement.SpelementUnit.length - 1; j++) {
                    var point = SpatialElement.SpelementUnit[j];
                    var xy = [];
                    coord = [Number(point.Ordinate.Y), Number(point.Ordinate.X)];
                    re_projected = convertCoord(coord);
                    xy.push(Number(re_projected[0]));
                    xy.push(Number(re_projected[1]));
                    contour.push(xy);
                }
                // бывае что LineString имеет одинаковые первую и последнюю точки
                // но SuNmb разные.
//                if ((contour[0][0][0] === contour[0][contour[0].length-1][0]) &&
//                        (contour[0][0][1] === contour[0][contour[0].length-1][1])){
//                    delete(contour[0][contour.length-1]);
//                    console.log(contour[0][0][0], contour[0][contour[0].length-1][0],LineString);
//                }
            }
            //console.log(Area);
            return contour;
        }
    }

    function processSpatialElement(SpatialElement) {
        var cntrs = [];
        if (_proj !== null) {
            spatialSysName = getSpatialSysName();
        }
        // Утинная типизация для проверки наличия дырок в полигоне
        // В Росреестре не следят за порядком контуров полигона
        if (SpatialElement.splice) {
            var MaxArea;
            var MaxAreaIdx = 0;
            for (var k = 0; k < SpatialElement.length; k++) {
                var contour = SpatialElement[k];
                var cnt = createContour(contour);
                if (cnt)
                    cntrs.push(cnt);
                if (Area > MaxArea) {
                    MaxArea = Area;
                    MaxAreaIdx = k;
                }
            }
            // Перемещаем основной (наружний) контур в начало массива
            if (MaxAreaIdx > 0) {
                var mainCnt = cntrs.splice(MaxAreaIdx, 1);
                cntrs.splice(0, 0, mainCnt);
                //console.log('Номер основного контура был ' + MaxAreaIdx);
            }
            if ((cntrs !== null) || (cntrs !== undefined)) {
                return cntrs;
            } else {
                return null;
            }
        } else {
            cntrs.push(createContour(SpatialElement));
            if ((cntrs !== null) || (cntrs !== undefined)) {
                return cntrs;
            } else {
                return null;
            }
        }
    }

    // у сооружений может быть смешаная геометрия (LineString, LineString, Circle, LineString)
    // в этом случае контуры cntrs будут хранить коллекцию
    function processRealtySpatialElement(SpatialElement) {
        var cntrs = [];
        if (_proj !== null) {
            spatialSysName = getSpatialSysName();
        }
        if (SpatialElement.splice) {
            var MaxArea;
            var MaxAreaIdx = 0;
            for (var k = 0; k < SpatialElement.length; k++) {
                var contour = SpatialElement[k];
                var cnt = createContour(contour);
                if (cnt)
                    cntrs.push(cnt);
                if (Area > MaxArea) {
                    MaxArea = Area;
                    MaxAreaIdx = k;
                }
            }
            // Перемещаем основной (наружний) контур в начало массива
            if ((!LineString) && (MaxAreaIdx > 0)) {
                var mainCnt = cntrs.splice(MaxAreaIdx, 1);
                cntrs.splice(0, 0, mainCnt);
                //console.log('Номер основного контура был ' + MaxAreaIdx);
            }
        } else {
            cntrs.push(createContour(SpatialElement));
        }
        if (cntrs.length > 1) {
            collection = [];

            for (var i = 0; i < cntrs.length - 1; i++) {
                // Окружность
                if (cntrs[i].R) {
                    var points = approximateCircle(cntrs[i].X, cntrs[i].Y, cntrs[i].R);
                    collection.push({
                        "type": "Polygon",
                        "coordinates": [points]
                    });
                }
                // Полигон
                else if (!LineString) {
                    collection.push({
                        "type": "Polygon",
                        "coordinates": [cntrs[i]]
                    });
                } else {
                    collection.push({
                        "type": "LineString",
                        "coordinates": cntrs[i]
                    });
                }
            }
            return  {
                "type": "GeometryCollection",
                "geometries": collection
            };

        } else {
            // Окружность
            if (cntrs[0].R) {
                var points = approximateCircle(cntrs[0].X, cntrs[0].Y, cntrs[0].R);
                return {
                    "type": "Polygon",
                    "coordinates": [points]
                };
            }
            // Полигон
            else if (!LineString) {
                return{
                    "type": "Polygon",
                    "coordinates": [cntrs[0]]
                };
            } else {
                return{
                    "type": "LineString",
                    "coordinates": cntrs[0]
                };
            }
        }
    }

    function approximateCircle(X, Y, R) {
        var rotatedAngle, x, y;
        var sides = 32;
        var points = [];
        x = X + R; // сдвиг на окружность
        //console.log('approximateCircle');
        for (var d = 0; d < sides - 1; d++) {
            var xy = [];
            rotatedAngle = (d * 2 * Math.PI / sides);//angle + (d * 2 * Math.PI / sides);
            x = X + (R * Math.cos(rotatedAngle));
            y = Y + (R * Math.sin(rotatedAngle));
            coord = [Number(y), Number(x)];
            xy.push(coord[0]);
            xy.push(coord[1]);
            points.push(xy);
        }
        points.push(points[0]);
        return points;
    }

    if ((_EntitySpatialObj !== undefined) && (_EntitySpatialObj !== null)) {

        var cntrs = [];

        switch (oType) {
            case 'Parcel' :
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                // Если это для многоконтурного объекта, то возвращем массив контуров
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            case 'Construction':
            {
                return processRealtySpatialElement(_EntitySpatialObj.SpatialElement);
                break;
            }
            case 'Building':
            {
                return processRealtySpatialElement(_EntitySpatialObj.SpatialElement);
                break;
            }
            case 'Uncompleted':
            {
                return processRealtySpatialElement(_EntitySpatialObj.SpatialElement);
                break;
            }
            case 'Zone':
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            case 'Quartal':
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            case 'Bound':
            {
                cntrs = processSpatialElement(_EntitySpatialObj.SpatialElement);
                if (partOfMultu) {
                    return cntrs;
                } else {
                    return {
                        type: "Polygon",
                        coordinates: cntrs
                    };
                }
                break;
            }
            default :
            {
                console.log('Тип объекта не распознан');
                return null;
            }
        }
    }

}
;

},{"./SpatialSystems":5}],5:[function(require,module,exports){
/* 
 * The MIT License
 *
 * Copyright 2015 filippov.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

/*  Сиcтемы координат имеют смысл для визуализации получаемых GeoJSON,
    для сохранения в файл нет надобности в преобразовании.
    Информация о системах координат хранится в теге <CoordSystems>
    <CoordSystems>
        <ns3:CoordSystem Name="МСК 70, зона 3" CsId="ID3" />
        <ns3:CoordSystem Name="МСК 70, зона 4" CsId="ID4" />
    </CoordSystems>
    их может быть несколько.
    У объектов в теге <EntitySpatial> указано в какой СК он имеет координаты,
    например:
    <EntitySpatial EntSys="ID3">

    проблемы конвертации у тех xml у который указано <ns3:CoordSystem Name="СК кадастрового округа" CsId="ID1" />
*/ 


module.exports.SpatialSystems = {
    // Томская область
    'МСК 70, зона 4': '+proj=tmerc +lat_0=0 +lon_0=83.73333333333 +k=1 +x_0=4250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs',
    'МСК 70, зона 2': '+proj=tmerc +lat_0=0 +lon_0=77.73333333333 +k=1 +x_0=2250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs',
    'МСК 70, зона 3': '+proj=tmerc +lat_0=0 +lon_0=80.73333333333 +k=1 +x_0=3250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs'
};
},{}]},{},[1])
//# sourceMappingURL=data:application/json;charset=utf-8;base64,eyJ2ZXJzaW9uIjozLCJzb3VyY2VzIjpbIm5vZGVfbW9kdWxlcy9ncnVudC1icm93c2VyaWZ5L25vZGVfbW9kdWxlcy9icm93c2VyaWZ5L25vZGVfbW9kdWxlcy9icm93c2VyLXBhY2svX3ByZWx1ZGUuanMiLCJzcmMvYXBwLmpzIiwic3JjL2NhZFByb3BzLmpzIiwic3JjL2NhZFhNTDJHZW9KU09OLmpzIiwic3JjL3NwYXRpYWwvRW50aXR5U3BhdGlhbC5qcyIsInNyYy9zcGF0aWFsL1NwYXRpYWxTeXN0ZW1zLmpzIl0sIm5hbWVzIjpbXSwibWFwcGluZ3MiOiJBQUFBO0FDQUE7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBOztBQzVSQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBOztBQ3g0QkE7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTs7QUNyUkE7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTs7QUM3VkE7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0EiLCJmaWxlIjoiZ2VuZXJhdGVkLmpzIiwic291cmNlUm9vdCI6IiIsInNvdXJjZXNDb250ZW50IjpbIihmdW5jdGlvbiBlKHQsbixyKXtmdW5jdGlvbiBzKG8sdSl7aWYoIW5bb10pe2lmKCF0W29dKXt2YXIgYT10eXBlb2YgcmVxdWlyZT09XCJmdW5jdGlvblwiJiZyZXF1aXJlO2lmKCF1JiZhKXJldHVybiBhKG8sITApO2lmKGkpcmV0dXJuIGkobywhMCk7dmFyIGY9bmV3IEVycm9yKFwiQ2Fubm90IGZpbmQgbW9kdWxlICdcIitvK1wiJ1wiKTt0aHJvdyBmLmNvZGU9XCJNT0RVTEVfTk9UX0ZPVU5EXCIsZn12YXIgbD1uW29dPXtleHBvcnRzOnt9fTt0W29dWzBdLmNhbGwobC5leHBvcnRzLGZ1bmN0aW9uKGUpe3ZhciBuPXRbb11bMV1bZV07cmV0dXJuIHMobj9uOmUpfSxsLGwuZXhwb3J0cyxlLHQsbixyKX1yZXR1cm4gbltvXS5leHBvcnRzfXZhciBpPXR5cGVvZiByZXF1aXJlPT1cImZ1bmN0aW9uXCImJnJlcXVpcmU7Zm9yKHZhciBvPTA7bzxyLmxlbmd0aDtvKyspcyhyW29dKTtyZXR1cm4gc30pIiwiLyogXG4gKiBUbyBjaGFuZ2UgdGhpcyBsaWNlbnNlIGhlYWRlciwgY2hvb3NlIExpY2Vuc2UgSGVhZGVycyBpbiBQcm9qZWN0IFByb3BlcnRpZXMuXG4gKiBUbyBjaGFuZ2UgdGhpcyB0ZW1wbGF0ZSBmaWxlLCBjaG9vc2UgVG9vbHMgfCBUZW1wbGF0ZXNcbiAqIGFuZCBvcGVuIHRoZSB0ZW1wbGF0ZSBpbiB0aGUgZWRpdG9yLlxuICovXG5cbnZhciBDb252ZXJ0ZXIgPSByZXF1aXJlKCcuL2NhZFhNTDJHZW9KU09OLmpzJyk7XG52YXIgbWFwO1xuXG5TdGFydFBhcnNlKCk7XG5cbmZ1bmN0aW9uIFN0YXJ0UGFyc2UoKSB7XG5cbiAgICB2YXIgY29udGFpbmVyID0gZG9jdW1lbnQuZ2V0RWxlbWVudEJ5SWQoJ3BvcHVwJyk7XG4gICAgdmFyIGNvbnRlbnQgPSBkb2N1bWVudC5nZXRFbGVtZW50QnlJZCgncG9wdXAtY29udGVudCcpO1xuICAgIHZhciBjbG9zZXIgPSBkb2N1bWVudC5nZXRFbGVtZW50QnlJZCgncG9wdXAtY2xvc2VyJyk7XG5cbiAgICBjbG9zZXIub25jbGljayA9IGZ1bmN0aW9uICgpIHtcbiAgICAgICAgb3ZlcmxheS5zZXRQb3NpdGlvbih1bmRlZmluZWQpO1xuICAgICAgICBjbG9zZXIuYmx1cigpO1xuICAgICAgICByZXR1cm4gZmFsc2U7XG4gICAgfTtcblxuICAgIHZhciBvdmVybGF5ID0gbmV3IG9sLk92ZXJsYXkoLyoqIEB0eXBlIHtvbHguT3ZlcmxheU9wdGlvbnN9ICovICh7XG4gICAgICAgIGVsZW1lbnQ6IGNvbnRhaW5lcixcbiAgICAgICAgYXV0b1BhbjogdHJ1ZSxcbiAgICAgICAgYXV0b1BhbkFuaW1hdGlvbjoge1xuICAgICAgICAgICAgZHVyYXRpb246IDI1MFxuICAgICAgICB9XG4gICAgfSkpO1xuXG4gICAgLy8gaHR0cHM6Ly9iaXRidWNrZXQub3JnL3N1cmVucmFvL3htbDJqc29uXG4gICAgLy8gaHR0cDovL3d3dy5jaHJvbWUtYWxsb3ctZmlsZS1hY2Nlc3MtZnJvbS1maWxlLmNvbS9cbiAgICB2YXIgcGFyc2VkRGF0YTtcbiAgICAkLmdldCgnLi90ZXN0ZGF0YS9kb2MyMTUzNTIyLnhtbCcsIGZ1bmN0aW9uICh4bWwpIHtcbiAgICAgICAgLy92YXIganNvbiA9ICQueG1sMmpzb24oeG1sKS5DYWRhc3RyYWxCbG9ja3M7XG4gICAgICAgIC8vICQoXCIjZGF0YVwiKS5odG1sKCc8Y29kZT4nK0pTT04uc3RyaW5naWZ5KGpzb24pKyc8L2NvZGU+Jyk7XG4gICAgICAgIC8vY29uc29sZS5sb2coQ29udmVydGVyLkdlb0pTT04pO1xuICAgICAgICBwYXJzZWREYXRhID0gQ29udmVydGVyLkdlb0pTT04oeG1sLCB0cnVlKTtcbiAgICB9KS5zdWNjZXNzKFxuICAgICAgICAgICAgZnVuY3Rpb24gKCkge1xuICAgICAgICAgICAgICAgIC8vIGh0dHA6Ly93d3cuY29sb3ItaGV4LmNvbS9cbiAgICAgICAgICAgICAgICB2YXIgcGFyY2VsRmlsbCA9IG5ldyBvbC5zdHlsZS5GaWxsKHtcbiAgICAgICAgICAgICAgICAgICAgY29sb3I6ICcjYmJmMTQ0J1xuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIHZhciB6b25lRmlsbCA9IG5ldyBvbC5zdHlsZS5GaWxsKHtcbiAgICAgICAgICAgICAgICAgICAgY29sb3I6ICcjMDA5ZmZmJ1xuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIHZhciByZWFsdHlsU3Ryb2tlID0gbmV3IG9sLnN0eWxlLlN0cm9rZSh7XG4gICAgICAgICAgICAgICAgICAgIGNvbG9yOiAnI0ZGMDBDMScsXG4gICAgICAgICAgICAgICAgICAgIHdpZHRoOiAxLjJcbiAgICAgICAgICAgICAgICB9KTtcblxuICAgICAgICAgICAgICAgIHZhciBzdHJva2UgPSBuZXcgb2wuc3R5bGUuU3Ryb2tlKHtcbiAgICAgICAgICAgICAgICAgICAgY29sb3I6ICcjMzEzMDMwJyxcbiAgICAgICAgICAgICAgICAgICAgd2lkdGg6IDFcbiAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB2YXIgYm91bmRTdHJva2UgPSBuZXcgb2wuc3R5bGUuU3Ryb2tlKHtcbiAgICAgICAgICAgICAgICAgICAgY29sb3I6ICcjMDA0QzAwJyxcbiAgICAgICAgICAgICAgICAgICAgd2lkdGg6IDFcbiAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB2YXIgem9uZVN0cm9rZSA9IG5ldyBvbC5zdHlsZS5TdHJva2Uoe1xuICAgICAgICAgICAgICAgICAgICBjb2xvcjogJyMxNDMzODgnLFxuICAgICAgICAgICAgICAgICAgICB3aWR0aDogMVxuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIHZhciBxdWFydGFsU3Ryb2tlID0gbmV3IG9sLnN0eWxlLlN0cm9rZSh7XG4gICAgICAgICAgICAgICAgICAgIGNvbG9yOiAnIzNiMjAyZicsXG4gICAgICAgICAgICAgICAgICAgIHdpZHRoOiAyXG4gICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgdmFyIHRleHQgPSBuZXcgb2wuc3R5bGUuVGV4dCh7XG4gICAgICAgICAgICAgICAgICAgIC8vIFRPRE8g0J/QvtC00L/QuNGB0LDRgtGMINC60LDQtNCw0YHRgtGA0L7QstGL0LUg0L3QvtC80LXRgNCwXG4gICAgICAgICAgICAgICAgfSk7XG5cbiAgICAgICAgICAgICAgICAvLyDQodGC0LjQu9C4XG4gICAgICAgICAgICAgICAgdmFyIHBhcmNlbFN0eWxlID0gbmV3IG9sLnN0eWxlLlN0eWxlKHtcbiAgICAgICAgICAgICAgICAgICAgZmlsbDogcGFyY2VsRmlsbCxcbiAgICAgICAgICAgICAgICAgICAgc3Ryb2tlOiBzdHJva2VcbiAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB2YXIgcmVhbHR5U3R5bGUgPSBuZXcgb2wuc3R5bGUuU3R5bGUoe1xuICAgICAgICAgICAgICAgICAgICBzdHJva2U6IHJlYWx0eWxTdHJva2VcbiAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB2YXIgcXVhcnRhbFN0eWxlID0gbmV3IG9sLnN0eWxlLlN0eWxlKHtcbiAgICAgICAgICAgICAgICAgICAgc3Ryb2tlOiBxdWFydGFsU3Ryb2tlXG4gICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgdmFyIGJvdW5kU3R5bGUgPSBuZXcgb2wuc3R5bGUuU3R5bGUoe1xuICAgICAgICAgICAgICAgICAgICBzdHJva2U6IGJvdW5kU3Ryb2tlXG4gICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgdmFyIHpvbmVTdHlsZSA9IG5ldyBvbC5zdHlsZS5TdHlsZSh7XG4gICAgICAgICAgICAgICAgICAgIGZpbGw6IHpvbmVGaWxsLFxuICAgICAgICAgICAgICAgICAgICBzdHJva2U6IHpvbmVTdHJva2VcbiAgICAgICAgICAgICAgICB9KTtcblxuXG4gICAgICAgICAgICAgICAgdmFyIHF1YXJ0YWxTb3VyY2UgPSBuZXcgb2wuc291cmNlLlZlY3Rvcih7XG4gICAgICAgICAgICAgICAgICAgIHByb2plY3Rpb246ICdFUFNHOjM4NTcnXG4gICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgdmFyIHBhcmNlbFNvdXJjZSA9IG5ldyBvbC5zb3VyY2UuVmVjdG9yKHtcbiAgICAgICAgICAgICAgICAgICAgZmVhdHVyZXM6IChuZXcgb2wuZm9ybWF0Lkdlb0pTT04oKSkucmVhZEZlYXR1cmVzKHBhcnNlZERhdGEuZ2VvSlNPTlBhcmNlbHMpLFxuICAgICAgICAgICAgICAgICAgICBwcm9qZWN0aW9uOiAnRVBTRzozODU3J1xuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIHZhciByZWFsdHlTb3VyY2UgPSBuZXcgb2wuc291cmNlLlZlY3Rvcih7XG4gICAgICAgICAgICAgICAgICAgIGZlYXR1cmVzOiAobmV3IG9sLmZvcm1hdC5HZW9KU09OKCkpLnJlYWRGZWF0dXJlcyhwYXJzZWREYXRhLmdlb0pTT05SZWFsdHkpLFxuICAgICAgICAgICAgICAgICAgICBwcm9qZWN0aW9uOiAnRVBTRzozODU3J1xuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIHZhciByZWFsdHlDb2xsZWN0aW9uU291cmNlID0gbmV3IG9sLnNvdXJjZS5WZWN0b3Ioe1xuICAgICAgICAgICAgICAgICAgICBmZWF0dXJlczogKG5ldyBvbC5mb3JtYXQuR2VvSlNPTigpKS5yZWFkRmVhdHVyZXMocGFyc2VkRGF0YS5nZW9KU09OUmVhbHR5R2VvbWV0cnlDb2xsZWN0aW9uKSxcbiAgICAgICAgICAgICAgICAgICAgcHJvamVjdGlvbjogJ0VQU0c6Mzg1NydcbiAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB2YXIgYm91bmRTb3VyY2UgPSBuZXcgb2wuc291cmNlLlZlY3Rvcih7XG4gICAgICAgICAgICAgICAgICAgIHByb2plY3Rpb246ICdFUFNHOjM4NTcnXG4gICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgdmFyIHpvbmVTb3VyY2UgPSBuZXcgb2wuc291cmNlLlZlY3Rvcih7XG4gICAgICAgICAgICAgICAgICAgIHByb2plY3Rpb246ICdFUFNHOjM4NTcnXG4gICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgdmFyIHF1YXJ0YWxMYXllciA9IG5ldyBvbC5sYXllci5WZWN0b3Ioe1xuICAgICAgICAgICAgICAgICAgICB0aXRsZTogJ9Ca0LLQsNGA0YLQsNC7JyxcbiAgICAgICAgICAgICAgICAgICAgc291cmNlOiBxdWFydGFsU291cmNlLFxuICAgICAgICAgICAgICAgICAgICBzdHlsZTogcXVhcnRhbFN0eWxlLFxuICAgICAgICAgICAgICAgICAgICBvcGFjaXR5OiAwLjU0MzI2XG4gICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgdmFyIHBhcmNlbExheWVyID0gbmV3IG9sLmxheWVyLlZlY3Rvcih7XG4gICAgICAgICAgICAgICAgICAgIHRpdGxlOiAn0JfQoycsXG4gICAgICAgICAgICAgICAgICAgIHNvdXJjZTogcGFyY2VsU291cmNlLFxuICAgICAgICAgICAgICAgICAgICBzdHlsZTogcGFyY2VsU3R5bGUsXG4gICAgICAgICAgICAgICAgICAgIG9wYWNpdHk6IDAuNVxuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIHZhciByZWFsdHlMYXllciA9IG5ldyBvbC5sYXllci5WZWN0b3Ioe1xuICAgICAgICAgICAgICAgICAgICB0aXRsZTogJ9Ce0JrQoScsXG4gICAgICAgICAgICAgICAgICAgIHNvdXJjZTogcmVhbHR5U291cmNlLFxuICAgICAgICAgICAgICAgICAgICBzdHlsZTogcmVhbHR5U3R5bGUsXG4gICAgICAgICAgICAgICAgICAgIG9wYWNpdHk6IDAuNVxuICAgICAgICAgICAgICAgIH0pOyBcbiAgICAgICAgICAgICAgICB2YXIgcmVhbHR5Q29sbGVjdGlvbkxheWVyID0gbmV3IG9sLmxheWVyLlZlY3Rvcih7XG4gICAgICAgICAgICAgICAgICAgIHRpdGxlOiAn0J7QmtChINGB0LvQvtC20L3Ri9C1JyxcbiAgICAgICAgICAgICAgICAgICAgc291cmNlOiByZWFsdHlDb2xsZWN0aW9uU291cmNlLFxuICAgICAgICAgICAgICAgICAgICBzdHlsZTogcmVhbHR5U3R5bGUsXG4gICAgICAgICAgICAgICAgICAgIG9wYWNpdHk6IDAuNVxuICAgICAgICAgICAgICAgIH0pOyBcbiAgICAgICAgICAgICAgICB2YXIgYm91bmRMYXllciA9IG5ldyBvbC5sYXllci5WZWN0b3Ioe1xuICAgICAgICAgICAgICAgICAgICB0aXRsZTogJ9CT0YDQsNC90LjRhtGLJyxcbiAgICAgICAgICAgICAgICAgICAgc291cmNlOiBib3VuZFNvdXJjZSxcbiAgICAgICAgICAgICAgICAgICAgc3R5bGU6IGJvdW5kU3R5bGUsXG4gICAgICAgICAgICAgICAgICAgIG9wYWNpdHk6IDAuNVxuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIHZhciB6b25lTGF5ZXIgPSBuZXcgb2wubGF5ZXIuVmVjdG9yKHtcbiAgICAgICAgICAgICAgICAgICAgdGl0bGU6ICfQl9C+0L3RiycsXG4gICAgICAgICAgICAgICAgICAgIHNvdXJjZTogem9uZVNvdXJjZSxcbiAgICAgICAgICAgICAgICAgICAgc3R5bGU6IHpvbmVTdHlsZSxcbiAgICAgICAgICAgICAgICAgICAgb3BhY2l0eTogMC41XG4gICAgICAgICAgICAgICAgfSk7XG5cbiAgICAgICAgICAgICAgICB2YXIgZm9ybWF0ID0gbmV3IG9sLmZvcm1hdC5HZW9KU09OKCk7XG5cbiAgICAgICAgICAgICAgICB2YXIgcmVhbHR5c0NvbGxlY3Rpb24gPSBwYXJzZWREYXRhLmdlb0pTT05SZWFsdHlHZW9tZXRyeUNvbGxlY3Rpb247XG5cbiAgICAgICAgICAgICAgICBmb3IgKHZhciBpID0gMDsgaSA8IHJlYWx0eXNDb2xsZWN0aW9uLmZlYXR1cmVzLmxlbmd0aDsgaSsrKSB7XG4gICAgICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2cocmVhbHR5c0NvbGxlY3Rpb24uZmVhdHVyZXNbaV0pO1xuICAgICAgICAgICAgICAgICAgICB2YXIgZ2VvbWV0cnlPYmogPSBmb3JtYXQucmVhZEdlb21ldHJ5KHJlYWx0eXNDb2xsZWN0aW9uLmZlYXR1cmVzW2ldLmdlb21ldHJ5KTtcbiAgICAgICAgICAgICAgICAgICAgdmFyIGZlYXR1cmUgPSBuZXcgb2wuRmVhdHVyZSh7XG4gICAgICAgICAgICAgICAgICAgICAgICBnZW9tZXRyeTogZ2VvbWV0cnlPYmovLyxcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgLy9wcm9wQSA6IHBhcnNlZERhdGEuZmVhdHVyZXNbaV0ucHJvcGVydGllcy5jYWRudW1iZXJcbiAgICAgICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgICAgIHJlYWx0eUNvbGxlY3Rpb25MYXllci5nZXRTb3VyY2UoKS5hZGRGZWF0dXJlKGZlYXR1cmUpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICB2YXIgem9uZXMgPSBwYXJzZWREYXRhLmdlb0pTT05ab25lcztcbiAgICAgICAgICAgICAgICBmb3IgKHZhciBpID0gMDsgaSA8IHpvbmVzLmZlYXR1cmVzLmxlbmd0aDsgaSsrKSB7XG4gICAgICAgICAgICAgICAgICAgIHZhciBnZW9tZXRyeU9iaiA9IGZvcm1hdC5yZWFkR2VvbWV0cnkoem9uZXMuZmVhdHVyZXNbaV0uZ2VvbWV0cnkpO1xuICAgICAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZSA9IG5ldyBvbC5GZWF0dXJlKHtcbiAgICAgICAgICAgICAgICAgICAgICAgIGdlb21ldHJ5OiBnZW9tZXRyeU9iai8vLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAvL3Byb3BBIDogcGFyc2VkRGF0YS5mZWF0dXJlc1tpXS5wcm9wZXJ0aWVzLmNhZG51bWJlclxuICAgICAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICAgICAgem9uZUxheWVyLmdldFNvdXJjZSgpLmFkZEZlYXR1cmUoZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIHZhciBxdWFydGFsID0gcGFyc2VkRGF0YS5nZW9KU09OUXVhcnRhbDtcbiAgICAgICAgICAgICAgICBmb3IgKHZhciBpID0gMDsgaSA8IHF1YXJ0YWwuZmVhdHVyZXMubGVuZ3RoOyBpKyspIHtcbiAgICAgICAgICAgICAgICAgICAgdmFyIGdlb21ldHJ5T2JqID0gZm9ybWF0LnJlYWRHZW9tZXRyeShxdWFydGFsLmZlYXR1cmVzW2ldLmdlb21ldHJ5KTtcbiAgICAgICAgICAgICAgICAgICAgdmFyIGZlYXR1cmUgPSBuZXcgb2wuRmVhdHVyZSh7XG4gICAgICAgICAgICAgICAgICAgICAgICBnZW9tZXRyeTogZ2VvbWV0cnlPYmovLyxcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgLy9wcm9wQSA6IHBhcnNlZERhdGEuZmVhdHVyZXNbaV0ucHJvcGVydGllcy5jYWRudW1iZXJcbiAgICAgICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgICAgIHF1YXJ0YWxMYXllci5nZXRTb3VyY2UoKS5hZGRGZWF0dXJlKGZlYXR1cmUpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICB2YXIgYm91bmRzID0gcGFyc2VkRGF0YS5nZW9KU09OQm91bmRzO1xuICAgICAgICAgICAgICAgIGZvciAodmFyIGkgPSAwOyBpIDwgYm91bmRzLmZlYXR1cmVzLmxlbmd0aDsgaSsrKSB7XG4gICAgICAgICAgICAgICAgICAgIHZhciBnZW9tZXRyeU9iaiA9IGZvcm1hdC5yZWFkR2VvbWV0cnkoYm91bmRzLmZlYXR1cmVzW2ldLmdlb21ldHJ5KTtcbiAgICAgICAgICAgICAgICAgICAgdmFyIGZlYXR1cmUgPSBuZXcgb2wuRmVhdHVyZSh7XG4gICAgICAgICAgICAgICAgICAgICAgICBnZW9tZXRyeTogZ2VvbWV0cnlPYmovLyxcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgLy9wcm9wQSA6IHBhcnNlZERhdGEuZmVhdHVyZXNbaV0ucHJvcGVydGllcy5jYWRudW1iZXJcbiAgICAgICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgICAgIGJvdW5kTGF5ZXIuZ2V0U291cmNlKCkuYWRkRmVhdHVyZShmZWF0dXJlKTtcbiAgICAgICAgICAgICAgICB9XG5cbiAgICAgICAgICAgICAgICBtYXAgPSBuZXcgb2wuTWFwKHtcbiAgICAgICAgICAgICAgICAgICAgdGFyZ2V0OiAnbWFwJyxcbiAgICAgICAgICAgICAgICAgICAgbGF5ZXJzOiBbXG4gICAgICAgICAgICAgICAgICAgICAgICBuZXcgb2wubGF5ZXIuVGlsZSh7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgc291cmNlOiBuZXcgb2wuc291cmNlLk9TTSgpLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgIG9wYWNpdHk6IDAuNSxcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB2aXNpYmxlOiB0cnVlLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgIHRpdGxlOiAn0J/QvtC00LvQvtC20LrQsCdcbiAgICAgICAgICAgICAgICAgICAgICAgIH0pLFxuICAgICAgICAgICAgICAgICAgICAgICAgbmV3IG9sLmxheWVyLlRpbGUoe1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIHRpdGxlOiAn0J/QmtCaJyxcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB2aXNpYmxlOiBmYWxzZSxcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBzb3VyY2U6IG5ldyBvbC5zb3VyY2UuVGlsZUFyY0dJU1Jlc3Qoe1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICB1cmw6ICdodHRwOi8vbWFwcy5yb3NyZWVzdHIucnUvYXJjZ2lzL3Jlc3Qvc2VydmljZXMvQ2FkYXN0cmUvQ2FkYXN0cmUvTWFwU2VydmVyLydcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9KVxuICAgICAgICAgICAgICAgICAgICAgICAgfSksXG4gICAgICAgICAgICAgICAgICAgICAgICBxdWFydGFsTGF5ZXIsIGJvdW5kTGF5ZXIsIHpvbmVMYXllcixcbiAgICAgICAgICAgICAgICAgICAgICAgIHBhcmNlbExheWVyLCByZWFsdHlMYXllciwgcmVhbHR5Q29sbGVjdGlvbkxheWVyXG4gICAgICAgICAgICAgICAgICAgIF0sXG4gICAgICAgICAgICAgICAgICAgIG92ZXJsYXlzOiBbb3ZlcmxheV0sXG4gICAgICAgICAgICAgICAgICAgIHZpZXc6IG5ldyBvbC5WaWV3KHtcbiAgICAgICAgICAgICAgICAgICAgICAgIHByb2plY3Rpb246ICdFUFNHOjM4NTcnLFxuICAgICAgICAgICAgICAgICAgICAgICAgY2VudGVyOiBbMCwgMF0sXG4gICAgICAgICAgICAgICAgICAgICAgICB6b29tOiA3XG4gICAgICAgICAgICAgICAgICAgIH0pXG4gICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgbWFwLmdldFZpZXcoKS5maXQocXVhcnRhbExheWVyLmdldFNvdXJjZSgpLmdldEV4dGVudCgpLCBtYXAuZ2V0U2l6ZSgpKTtcbiAgICAgICAgICAgICAgICB2YXIgbGF5ZXJTd2l0Y2hlciA9IG5ldyBvbC5jb250cm9sLkxheWVyU3dpdGNoZXIoe1xuICAgICAgICAgICAgICAgICAgICB0aXBMYWJlbDogJ9Ch0LvQvtC4JyAvLyBPcHRpb25hbCBsYWJlbCBmb3IgYnV0dG9uXG4gICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgbWFwLmFkZENvbnRyb2wobGF5ZXJTd2l0Y2hlcik7XG4vLyAgICAgICAgICAgICAgICB2YXIgZ3JhdGljdWxlID0gbmV3IG9sLkdyYXRpY3VsZSh7XG4vLyAgICAgICAgICAgICAgICAgICAgbWFwOiBtYXBcbi8vICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIG1hcC5vbignc2luZ2xlY2xpY2snLCBmdW5jdGlvbiAoZXZ0KSB7XG4gICAgICAgICAgICAgICAgICAgIHZhciBmZWF0dXJlcyA9IFtdO1xuICAgICAgICAgICAgICAgICAgICB2YXIgY29vcmRpbmF0ZSA9IGV2dC5jb29yZGluYXRlO1xuXG4gICAgICAgICAgICAgICAgICAgIGZvciAodmFyIGkgPSAwOyBpIDwgbWFwLmdldExheWVycygpLmdldExlbmd0aCgpOyBpKyspIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIHZhciBsYXllciA9IG1hcC5nZXRMYXllcnMoKS5pdGVtKGkpO1xuICAgICAgICAgICAgICAgICAgICAgICAgaWYgKGxheWVyIGluc3RhbmNlb2Ygb2wubGF5ZXIuVmVjdG9yKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgdmFyIGZlYXR1cmUgPSBsYXllci5nZXRTb3VyY2UoKS5nZXRDbG9zZXN0RmVhdHVyZVRvQ29vcmRpbmF0ZShldnQuY29vcmRpbmF0ZSk7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgaWYgKGZlYXR1cmUpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgY3JlYXRlSW5mb0NvbnRldG50KGZlYXR1cmVzLCBjb29yZGluYXRlKTtcbiAgICAgICAgICAgICAgICB9KTtcblxuICAgICAgICAgICAgICAgIGZ1bmN0aW9uIGNyZWF0ZUluZm9Db250ZXRudChmZWF0dXJlcywgY29vcmRpbmF0ZSkge1xuICAgICAgICAgICAgICAgICAgICB2YXIgY29udGVuSW5mbyA9ICcnO1xuLy8gICAgICAgICAgICAgICAgICAgIHZhciBzdCA9ICcnO1xuLy8gICAgICAgICAgICAgICAgICAgIHZhciBjYXQgPSAnJztcbi8vICAgICAgICAgICAgICAgICAgICB2YXIgbmFtZSA9ICcnO1xuLy8gICAgICAgICAgICAgICAgICAgIHZhciB1dCA9ICcnO1xuICAgICAgICAgICAgICAgICAgICBmb3IgKHZhciBpID0gMDsgaSA8IGZlYXR1cmVzLmxlbmd0aDsgaSsrKSB7XG4vLyAgICAgICAgICAgICAgICAgICAgICAgIHZhciBmID0gZmVhdHVyZXNbaV07XG4vLyAgICAgICAgICAgICAgICAgICAgICAgIGlmIChmLmdldCgnY2FkYXN0cmVOdW1iZXInKSAhPT0gdW5kZWZpbmVkKSB7XG4vLyAgICAgICAgICAgICAgICAgICAgICAgICAgICBjbiA9IGYuZ2V0KCdjYWRhc3RyZU51bWJlcicpO1xuLy8gICAgICAgICAgICAgICAgICAgICAgICB9XG4vLyAgICAgICAgICAgICAgICAgICAgICAgIGlmIChmLmdldCgnU3RhdGUnKSAhPT0gdW5kZWZpbmVkKSB7XG4vLyAgICAgICAgICAgICAgICAgICAgICAgICAgICBzdCA9IGYuZ2V0KCdTdGF0ZScpO1xuLy8gICAgICAgICAgICAgICAgICAgICAgICB9XG4vLyAgICAgICAgICAgICAgICAgICAgICAgIGlmIChmLmdldCgnTmFtZScpICE9PSB1bmRlZmluZWQpIHtcbi8vICAgICAgICAgICAgICAgICAgICAgICAgICAgIG5hbWUgPSBmLmdldCgnTmFtZScpO1xuLy8gICAgICAgICAgICAgICAgICAgICAgICB9XG4vLyAgICAgICAgICAgICAgICAgICAgICAgIGlmIChmLmdldCgnQ2F0ZWdvcnknKSAhPT0gdW5kZWZpbmVkKSB7XG4vLyAgICAgICAgICAgICAgICAgICAgICAgICAgICBjYXQgPSBmLmdldCgnQ2F0ZWdvcnknKTtcbi8vICAgICAgICAgICAgICAgICAgICAgICAgfVxuLy8gICAgICAgICAgICAgICAgICAgICAgICBpZiAoZi5nZXQoJ0NhdGVnb3J5JykgIT09IHVuZGVmaW5lZCkge1xuLy8gICAgICAgICAgICAgICAgICAgICAgICAgICAgY2F0ID0gZi5nZXQoJ0NhdGVnb3J5Jyk7XG4vLyAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKGZlYXR1cmVzW2ldLmdldFByb3BlcnRpZXMoKSk7XG4vLyAgICAgICAgICAgICAgICAgICAgfVxuLy8gICAgICAgICAgICAgICAgICAgIHZhciBoZG1zID0gb2wuY29vcmRpbmF0ZS50b1N0cmluZ0hETVMob2wucHJvai50cmFuc2Zvcm0oXG4vLyAgICAgICAgICAgICAgICAgICAgICAgICAgICBjb29yZGluYXRlLCAnRVBTRzozODU3JywgJ0VQU0c6NDMyNicpKTtcbi8vICAgICAgICAgICAgICAgICAgICAgICAgdmFyIGpzb24gPSBKU09OLnN0cmluZ2lmeShmZWF0dXJlc1tpXS5nZXRQcm9wZXJ0aWVzKCkpO1xuLy8gICAgICAgICAgICAgICAgICAgICAgICBjb250ZW5JbmZvICs9ICc8cD4nICsgJCgnJykuakpzb25WaWV3ZXIoanNvbikgKyAnPC9wPic7XG4gICAgICAgICAgICAgICAgICAgICAgICBcbi8vICAgICAgICAgICAgICAgICAgICBjb250ZW50LmlubmVySFRNTCA9ICc8cD7QmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC90L7QvNC10YA6PGNvZGU+JyArIGNuICtcbi8vICAgICAgICAgICAgICAgICAgICAgICAgICAgICc8L2NvZGU+PC9wPjxwPtCe0LHRitC10LrRgjo8Y29kZT4nICsgbmFtZSArICc8L2NvZGU+PC9wPicgK1xuLy8gICAgICAgICAgICAgICAgICAgICAgICAgICAgJzwvY29kZT48cD7QodGC0LDRgtGD0YE6PGNvZGU+JyArIHN0ICsgJzwvY29kZT48L3A+JyArXG4vLyAgICAgICAgICAgICAgICAgICAgICAgICAgICAnPC9jb2RlPjxwPtCa0LDRgtC10LPQvtGA0LjRjyDQt9C10LzQtdC70Yw6PGNvZGU+JyArIGNhdCArICc8L2NvZGU+PC9wPic7XG4gICAgICAgICAgICAgICAgICAgICAgICAvL2NvbnRlbnQuakpzb25WaWV3ZXIoZmVhdHVyZXNbaV0uZ2V0UHJvcGVydGllcygpKTsgXG4gICAgICAgICAgICAgICAgICAgIH1cbi8vICAgICAgICAgICAgICAgICAgICBjb250ZW50LmlubmVySFRNTCA9IGNvbnRlbkluZm87XG4vLyAgICAgICAgICAgICAgICAgICAgb3ZlcmxheS5zZXRQb3NpdGlvbihjb29yZGluYXRlKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9KTtcblxufVxuIiwiLyogXG4gKiBUaGUgTUlUIExpY2Vuc2VcbiAqXG4gKiBDb3B5cmlnaHQgMjAxNSBmaWxpcHBvdi5cbiAqXG4gKiBQZXJtaXNzaW9uIGlzIGhlcmVieSBncmFudGVkLCBmcmVlIG9mIGNoYXJnZSwgdG8gYW55IHBlcnNvbiBvYnRhaW5pbmcgYSBjb3B5XG4gKiBvZiB0aGlzIHNvZnR3YXJlIGFuZCBhc3NvY2lhdGVkIGRvY3VtZW50YXRpb24gZmlsZXMgKHRoZSBcIlNvZnR3YXJlXCIpLCB0byBkZWFsXG4gKiBpbiB0aGUgU29mdHdhcmUgd2l0aG91dCByZXN0cmljdGlvbiwgaW5jbHVkaW5nIHdpdGhvdXQgbGltaXRhdGlvbiB0aGUgcmlnaHRzXG4gKiB0byB1c2UsIGNvcHksIG1vZGlmeSwgbWVyZ2UsIHB1Ymxpc2gsIGRpc3RyaWJ1dGUsIHN1YmxpY2Vuc2UsIGFuZC9vciBzZWxsXG4gKiBjb3BpZXMgb2YgdGhlIFNvZnR3YXJlLCBhbmQgdG8gcGVybWl0IHBlcnNvbnMgdG8gd2hvbSB0aGUgU29mdHdhcmUgaXNcbiAqIGZ1cm5pc2hlZCB0byBkbyBzbywgc3ViamVjdCB0byB0aGUgZm9sbG93aW5nIGNvbmRpdGlvbnM6XG4gKlxuICogVGhlIGFib3ZlIGNvcHlyaWdodCBub3RpY2UgYW5kIHRoaXMgcGVybWlzc2lvbiBub3RpY2Ugc2hhbGwgYmUgaW5jbHVkZWQgaW5cbiAqIGFsbCBjb3BpZXMgb3Igc3Vic3RhbnRpYWwgcG9ydGlvbnMgb2YgdGhlIFNvZnR3YXJlLlxuICpcbiAqIFRIRSBTT0ZUV0FSRSBJUyBQUk9WSURFRCBcIkFTIElTXCIsIFdJVEhPVVQgV0FSUkFOVFkgT0YgQU5ZIEtJTkQsIEVYUFJFU1MgT1JcbiAqIElNUExJRUQsIElOQ0xVRElORyBCVVQgTk9UIExJTUlURUQgVE8gVEhFIFdBUlJBTlRJRVMgT0YgTUVSQ0hBTlRBQklMSVRZLFxuICogRklUTkVTUyBGT1IgQSBQQVJUSUNVTEFSIFBVUlBPU0UgQU5EIE5PTklORlJJTkdFTUVOVC4gSU4gTk8gRVZFTlQgU0hBTEwgVEhFXG4gKiBBVVRIT1JTIE9SIENPUFlSSUdIVCBIT0xERVJTIEJFIExJQUJMRSBGT1IgQU5ZIENMQUlNLCBEQU1BR0VTIE9SIE9USEVSXG4gKiBMSUFCSUxJVFksIFdIRVRIRVIgSU4gQU4gQUNUSU9OIE9GIENPTlRSQUNULCBUT1JUIE9SIE9USEVSV0lTRSwgQVJJU0lORyBGUk9NLFxuICogT1VUIE9GIE9SIElOIENPTk5FQ1RJT04gV0lUSCBUSEUgU09GVFdBUkUgT1IgVEhFIFVTRSBPUiBPVEhFUiBERUFMSU5HUyBJTlxuICogVEhFIFNPRlRXQVJFLlxuICovXG4ndXNlIHN0cmljdCc7XG4vLyBEaWN0c1xuXG4vLyDQodGC0LDRgtGD0YEg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4XG52YXIgZFN0YXRlcyA9IHtcbiAgICAnMDEnOiAn0KDQsNC90LXQtSDRg9GH0YLQtdC90L3Ri9C5JyxcbiAgICAnMDUnOiAn0JLRgNC10LzQtdC90L3Ri9C5JyxcbiAgICAnMDYnOiAn0KPRh9GC0LXQvdC90YvQuScsXG4gICAgJzA3JzogJ9Ch0L3Rj9GCINGBINGD0YfQtdGC0LAnLFxuICAgICcwOCc6ICfQkNC90L3Rg9C70LjRgNC+0LLQsNC90L3Ri9C5J1xufTtcbi8vINCi0LjQvyAg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4XG52YXIgZFBhcmNlbHMgPSB7XG4gICAgJzAxJzogJ9CX0LXQvNC70LXQv9C+0LvRjNC30L7QstCw0L3QuNC1JyxcbiAgICAnMDInOiAn0JXQtNC40L3QvtC1INC30LXQvNC70LXQv9C+0LvRjNC30L7QstCw0L3QuNC1JyxcbiAgICAnMDMnOiAn0J7QsdC+0YHQvtCx0LvQtdC90L3Ri9C5INGD0YfQsNGB0YLQvtC6JyxcbiAgICAnMDQnOiAn0KPRgdC70L7QstC90YvQuSDRg9GH0LDRgdGC0L7QuicsXG4gICAgJzA1JzogJ9Cc0L3QvtCz0L7QutC+0L3RgtGD0YDQvdGL0Lkg0YPRh9Cw0YHRgtC+0LonLFxuICAgICcwNic6ICfQl9C90LDRh9C10L3QuNC1INC+0YLRgdGD0YLRgdGC0LLRg9C10YInXG59O1xuLy8g0JrQsNGC0LXQs9C+0YDQuNGPINC30LXQvNC10LvRjFxudmFyIGRDYXRlZ29yaWVzID0ge1xuICAgICcwMDMwMDEwMDAwMDAnOiAn0JfQtdC80LvQuCDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcwMDMwMDIwMDAwMDAnOiAn0JfQtdC80LvQuCDQvdCw0YHQtdC70ZHQvdC90YvRhSDQv9GD0L3QutGC0L7QsicsXG4gICAgJzAwMzAwMzAwMDAwMCc6ICfQl9C10LzQu9C4INC/0YDQvtC80YvRiNC70LXQvdC90L7RgdGC0LgsINGN0L3QtdGA0LPQtdGC0LjQutC4LCDRgtGA0LDQvdGB0L/QvtGA0YLQsCwg0YHQstGP0LfQuCwg0YDQsNC00LjQvtCy0LXRidCw0L3QuNGPLCDRgtC10LvQtdCy0LjQtNC10L3QuNGPLCDQuNC90YTQvtGA0LzQsNGC0LjQutC4LCDQt9C10LzQu9C4INC00LvRjyDQvtCx0LXRgdC/0LXRh9C10L3QuNGPINC60L7RgdC80LjRh9C10YHQutC+0Lkg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4LCDQt9C10LzQu9C4INC+0LHQvtGA0L7QvdGLLCDQsdC10LfQvtC/0LDRgdC90L7RgdGC0Lgg0Lgg0LfQtdC80LvQuCDQuNC90L7Qs9C+INGB0L/QtdGG0LjQsNC70YzQvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG4gICAgJzAwMzAwNDAwMDAwMCc6ICfQl9C10LzQu9C4INC+0YHQvtCx0L4g0L7RhdGA0LDQvdGP0LXQvNGL0YUg0YLQtdGA0YDQuNGC0L7RgNC40Lkg0Lgg0L7QsdGK0LXQutGC0L7QsicsXG4gICAgJzAwMzAwNTAwMDAwMCc6ICfQl9C10LzQu9C4INC70LXRgdC90L7Qs9C+INGE0L7QvdC00LAnLFxuICAgICcwMDMwMDYwMDAwMDAnOiAn0JfQtdC80LvQuCDQstC+0LTQvdC+0LPQviDRhNC+0L3QtNCwJyxcbiAgICAnMDAzMDA3MDAwMDAwJzogJ9CX0LXQvNC70Lgg0LfQsNC/0LDRgdCwJyxcbiAgICAnMDAzMDA4MDAwMDAwJzogJ9Ca0LDRgtC10LPQvtGA0LjRjyDQvdC1INGD0YHRgtCw0L3QvtCy0LvQtdC90LAnXG59O1xuLy8g0J7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjykg0L/RgNCw0LJcbnZhciBkRW5jdW1icmFuY2VzID0ge1xuXHQnMDIyMDAxMDAwMDAwJzogJ9Ch0LXRgNCy0LjRgtGD0YInLFxuXHQnMDIyMDAxMDAxMDAwJzogJ9Cf0YPQsdC70LjRh9C90YvQuSDRgdC10YDQstC40YLRg9GCJyxcblx0JzAyMjAwMTAwMjAwMCc6ICfQp9Cw0YHRgtC90YvQuSDRgdC10YDQstC40YLRg9GCJyxcblx0JzAyMjAwMjAwMDAwMCc6ICfQkNGA0LXRgdGCJyxcblx0JzAyMjAwMzAwMDAwMCc6ICfQl9Cw0L/RgNC10YnQtdC90LjQtScsXG5cdCcwMjIwMDQwMDAwMDAnOiAn0J7Qs9GA0LDQvdC40YfQtdC90LjRjyDQv9GA0LDQsiDQvdCwINC30LXQvNC10LvRjNC90YvQuSDRg9GH0LDRgdGC0L7Quiwg0L/RgNC10LTRg9GB0LzQvtGC0YDQtdC90L3Ri9C1INGB0YLQsNGC0YzRj9C80LggNTYsIDU2LjEg0JfQtdC80LXQu9GM0L3QvtCz0L4g0LrQvtC00LXQutGB0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzAyMjAwNTAwMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC40LfRitGP0YLQuNC4INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwLCDQttC40LvQvtCz0L4g0L/QvtC80LXRidC10L3QuNGPJyxcblx0JzAyMjAwNjAwMDAwMCc6ICfQkNGA0LXQvdC00LAgKNCyINGC0L7QvCDRh9C40YHQu9C1LCDRgdGD0LHQsNGA0LXQvdC00LApJyxcblx0JzAyMjAwNzAwMDAwMCc6ICfQmNC/0L7RgtC10LrQsCcsXG5cdCcwMjIwMDgwMDAwMDAnOiAn0JjQv9C+0YLQtdC60LAg0LIg0YHQuNC70YMg0LfQsNC60L7QvdCwJyxcblx0JzAyMjAwOTAwMDAwMCc6ICfQkdC10LfQstC+0LfQvNC10LfQtNC90L7QtSAo0YHRgNC+0YfQvdC+0LUpINC/0L7Qu9GM0LfQvtCy0LDQvdC40LUg0LfQtdC80LXQu9GM0L3Ri9C8L9C70LXRgdC90YvQvCDRg9GH0LDRgdGC0LrQvtC8Jyxcblx0JzAyMjAxMDAwMDAwMCc6ICfQlNC+0LLQtdGA0LjRgtC10LvRjNC90L7QtSDRg9C/0YDQsNCy0LvQtdC90LjQtScsXG5cdCcwMjIwMTEwMDAwMDAnOiAn0KDQtdC90YLQsCcsXG5cdCcwMjIwMTIwMDAwMDAnOiAn0JfQsNC/0YDQtdGCINC90LAg0YHQvtCy0LXRgNGI0LXQvdC40LUg0LTQtdC50YHRgtCy0LjQuSDQsiDRgdGE0LXRgNC1INCT0JrQoyDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0J7QnScsXG5cdCcwMjIwOTkwMDAwMDAnOiAn0JjQvdGL0LUg0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjykg0L/RgNCw0LInXG59O1xuLy8g0JXQtNC40L3QuNGG0Ysg0LjQt9C80LXRgNC10L3QuNC5XG52YXIgZFVuaXRzID0ge1xuXHQnMDAzJzogJ9Cc0LjQu9C70LjQvNC10YLRgCcsXG5cdCcwMDQnOiAn0KHQsNC90YLQuNC80LXRgtGAJyxcblx0JzAwNSc6ICfQlNC10YbQuNC80LXRgtGAJyxcblx0JzAwNic6ICfQnNC10YLRgCcsXG5cdCcwMDgnOiAn0JrQuNC70L7QvNC10YLRgCcsXG5cdCcwMDknOiAn0JzQtdCz0LDQvNC10YLRgCcsXG5cdCcwNDcnOiAn0JzQvtGA0YHQutCw0Y8g0LzQuNC70Y8nLFxuXHQnMDUwJzogJ9Ca0LLQsNC00YDQsNGC0L3Ri9C5INC80LjQu9C70LjQvNC10YLRgCcsXG5cdCcwNTEnOiAn0JrQstCw0LTRgNCw0YLQvdGL0Lkg0YHQsNC90YLQuNC80LXRgtGAJyxcblx0JzA1Myc6ICfQmtCy0LDQtNGA0LDRgtC90YvQuSDQtNC10YbQuNC80LXRgtGAJyxcblx0JzA1NSc6ICfQmtCy0LDQtNGA0LDRgtC90YvQuSDQvNC10YLRgCcsXG5cdCcwNTgnOiAn0KLRi9GB0Y/Rh9CwINC60LLQsNC00YDQsNGC0L3Ri9GFINC80LXRgtGA0L7QsicsXG5cdCcwNTknOiAn0JPQtdC60YLQsNGAJyxcblx0JzA2MSc6ICfQmtCy0LDQtNGA0LDRgtC90YvQuSDQutC40LvQvtC80LXRgtGAJyxcblx0JzEwOSc6ICfQkNGAICgxMDAg0LwyKScsXG5cdCczNTknOiAn0KHRg9GC0LrQuCcsXG5cdCczNjAnOiAn0J3QtdC00LXQu9GPJyxcblx0JzM2MSc6ICfQlNC10LrQsNC00LAnLFxuXHQnMzYyJzogJ9Cc0LXRgdGP0YYnLFxuXHQnMzY0JzogJ9Ca0LLQsNGA0YLQsNC7Jyxcblx0JzM2NSc6ICfQn9C+0LvRg9Cz0L7QtNC40LUnLFxuXHQnMzU2JzogJ9Cn0LDRgScsXG5cdCczNTUnOiAn0JzQuNC90YPRgtCwICcsXG5cdCczNjYnOiAn0JPQvtC0Jyxcblx0JzM4Myc6ICfQoNGD0LHQu9GMJyxcblx0JzM4NCc6ICfQotGL0YHRj9GH0LAg0YDRg9Cx0LvQtdC5Jyxcblx0JzM4NSc6ICfQnNC40LvQu9C40L7QvSDRgNGD0LHQu9C10LknLFxuXHQnMzg2JzogJ9Cc0LjQu9C70LjQsNGA0LQg0YDRg9Cx0LvQtdC5Jyxcblx0JzEwMDAnOiAn0J3QtdC+0L/RgNC10LTQtdC70LXQvdC+Jyxcblx0JzEwMDEnOiAn0JfQvdCw0YfQtdC90LjQtSDQvtGC0YHRg9GC0YHRgtCy0YPQtdGCJyxcblx0JzEwMDInOiAn0KDRg9Cx0LvQtdC5INC30LAg0LrQsi4g0LzQtdGC0YAnLFxuXHQnMTAwMyc6ICfQoNGD0LHQu9C10Lkg0LfQsCDQsNGAJyxcblx0JzEwMDQnOiAn0KDRg9Cx0LvQtdC5ICDQt9CwINCz0LXQutGC0LDRgCcsXG5cdCcxMDA1JzogJ9CY0L3Ri9C1Jyxcblx0JzEwMDYnOiAn0KDRg9Cx0LvQtdC5INC30LAg0LrQsi4g0LrQvCcsXG5cdCcxMDA3JzogJ9Cg0LDQsdC+0YfQuNC5INC00LXQvdGMJ1xufTtcbi8vINCS0YHQtSDQtNC+0LrRg9C80LXQvdGC0YsgKNCh0LHQvtGA0L3QuNC6INC60LvQsNGB0YHQuNGE0LjQutCw0YLQvtGA0L7Qsiwg0LrQvtC00YsgOC4xLCA4LjIsIDU1NSwgNTU4LjEsIDU1OC4yLCA1NTguMywgNTU4LjQsIDU1OC41LCA1NTguNilcbnZhciBkQWxsRG9jdW1lbnRzID0ge1xuXHQnMDA4MDAxMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0YPQtNC+0YHRgtC+0LLQtdGA0Y/RjtGJ0LjQtSDQu9C40YfQvdC+0YHRgtGMINGE0LjQt9C40YfQtdGB0LrQvtCz0L4g0LvQuNGG0LAnLFxuXHQnMDA4MDAxMDAxMDAwJzogJ9Cf0LDRgdC/0L7RgNGCINCz0YDQsNC20LTQsNC90LjQvdCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCcwMDgwMDEwMDIwMDAnOiAn0J/QsNGB0L/QvtGA0YIg0LPRgNCw0LbQtNCw0L3QuNC90LAg0KHQodCh0KAnLFxuXHQnMDA4MDAxMDAzMDAwJzogJ9Cf0LDRgdC/0L7RgNGCINCz0YDQsNC20LTQsNC90LjQvdCwINC40L3QvtGB0YLRgNCw0L3QvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstCwJyxcblx0JzAwODAwMTAwNDAwMCc6ICfQntCx0YnQtdCz0YDQsNC20LTQsNC90YHQutC40Lkg0LfQsNCz0YDQsNC90LjRh9C90YvQuSDQv9Cw0YHQv9C+0YDRgicsXG5cdCcwMDgwMDEwMDUwMDAnOiAn0JfQsNCz0YDQsNC90LjRh9C90YvQuSDQv9Cw0YHQv9C+0YDRgiDQnNC40L3QuNGB0YLQtdGA0YHRgtCy0LAg0LzQvtGA0YHQutC+0LPQviDRhNC70L7RgtCwJyxcblx0JzAwODAwMTAwNjAwMCc6ICfQlNC40L/Qu9C+0LzQsNGC0LjRh9C10YHQutC40Lkg0L/QsNGB0L/QvtGA0YInLFxuXHQnMDA4MDAxMDA3MDAwJzogJ9Cf0LDRgdC/0L7RgNGCINC80L7RgNGP0LrQsCAo0YPQtNC+0YHRgtC+0LLQtdGA0LXQvdC40LUg0LvQuNGH0L3QvtGB0YLQuCDQvNC+0YDRj9C60LApJyxcblx0JzAwODAwMTAwODAwMCc6ICfQktC+0LXQvdC90YvQuSDQsdC40LvQtdGCINCy0L7QtdC90L3QvtGB0LvRg9C20LDRidC10LPQvicsXG5cdCcwMDgwMDEwMDkwMDAnOiAn0JLRgNC10LzQtdC90L3QvtC1INGD0LTQvtGB0YLQvtCy0LXRgNC10L3QuNC1LCDQstGL0LTQsNC90L3QvtC1INCy0LfQsNC80LXQvSDQstC+0LXQvdC90L7Qs9C+INCx0LjQu9C10YLQsCcsXG5cdCcwMDgwMDEwMTAwMDAnOiAn0KPQtNC+0YHRgtC+0LLQtdGA0LXQvdC40LUg0LvQuNGH0L3QvtGB0YLQuCDQvtGE0LjRhtC10YDQsCDQnNC40L3QuNGB0YLQtdGA0YHRgtCy0LAg0L7QsdC+0YDQvtC90Ysg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4LCDQnNC40L3QuNGB0YLQtdGA0YHRgtCy0LAg0LLQvdGD0YLRgNC10L3QvdC40YUg0LTQtdC7INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQuCDQtNGA0YPQs9C40YUg0LLQvtC40L3RgdC60LjRhSDRhNC+0YDQvNC40YDQvtCy0LDQvdC40Lkg0YEg0L/RgNC40LvQvtC20LXQvdC40LXQvCDRgdC/0YDQsNCy0LrQuCDQviDQv9GA0L7Qv9C40YHQutC1ICjRgNC10LPQuNGB0YLRgNCw0YbQuNC4KSDQpC0zMycsXG5cdCcwMDgwMDEwMTEwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0YDQvtC20LTQtdC90LjQuCcsXG5cdCcwMDgwMDEwMTIwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0YDQsNGB0YHQvNC+0YLRgNC10L3QuNC4INGF0L7QtNCw0YLQsNC50YHRgtCy0LAg0L4g0L/RgNC40LfQvdCw0L3QuNC4INCx0LXQttC10L3RhtC10Lwg0L3QsCDRgtC10YDRgNC40YLQvtGA0LjQuCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0L/QviDRgdGD0YnQtdGB0YLQstGDJyxcblx0JzAwODAwMTAxMzAwMCc6ICfQktC40LQg0L3QsCDQttC40YLQtdC70YzRgdGC0LLQviDQuNC90L7RgdGC0YDQsNC90L3QvtCz0L4g0LPRgNCw0LbQtNCw0L3QuNC90LAg0LjQu9C4INC70LjRhtCwINCx0LXQtyDQs9GA0LDQttC00LDQvdGB0YLQstCwJyxcblx0JzAwODAwMTAxNDAwMCc6ICfQodC/0YDQsNCy0LrQsCDQvtCxINC+0YHQstC+0LHQvtC20LTQtdC90LjQuCDQuNC3INC80LXRgdGCINC70LjRiNC10L3QuNGPINGB0LLQvtCx0L7QtNGLJyxcblx0JzAwODAwMTAxNTAwMCc6ICfQktGA0LXQvNC10L3QvdC+0LUg0YPQtNC+0YHRgtC+0LLQtdGA0LXQvdC40LUg0LvQuNGH0L3QvtGB0YLQuCDQs9GA0LDQttC00LDQvdC40L3QsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnMDA4MDAxMDE2MDAwJzogJ9Cj0LTQvtGB0YLQvtCy0LXRgNC10L3QuNC1INCy0YvQvdGD0LbQtNC10L3QvdC+0LPQviDQv9C10YDQtdGB0LXQu9C10L3RhtCwJyxcblx0JzAwODAwMTAxNzAwMCc6ICfQoNCw0LfRgNC10YjQtdC90LjQtSDQvdCwINCy0YDQtdC80LXQvdC90L7QtSDQv9GA0L7QttC40LLQsNC90LjQtSDQsiDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnMDA4MDAxMDE4MDAwJzogJ9Cj0LTQvtGB0YLQvtCy0LXRgNC10L3QuNC1INCx0LXQttC10L3RhtCwINCyINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCcwMDgwMDEwMTkwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0YDQsNGB0YHQvNC+0YLRgNC10L3QuNC4INGF0L7QtNCw0YLQsNC50YHRgtCy0LAg0L4g0L/RgNC40LfQvdCw0L3QuNC4INC70LjRhtCwINCy0YvQvdGD0LbQtNC10L3QvdGL0Lwg0L/QtdGA0LXRgdC10LvQtdC90YbQtdC8Jyxcblx0JzAwODAwMTAyMDAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INCy0YDQtdC80LXQvdC90L7Qs9C+INGD0LHQtdC20LjRidCwINC90LAg0YLQtdGA0YDQuNGC0L7RgNC40Lgg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzAwODAwMTA5OTAwMCc6ICfQmNC90YvQtSDQtNC+0LrRg9C80LXQvdGC0YssINC/0YDQtdC00YPRgdC80L7RgtGA0LXQvdC90YvQtSDQt9Cw0LrQvtC90L7QtNCw0YLQtdC70YzRgdGC0LLQvtC8INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQuNC70Lgg0L/RgNC40LfQvdCw0LLQsNC10LzRi9C1INCyINGB0L7QvtGC0LLQtdGC0YHRgtCy0LjQuCDRgSDQvNC10LbQtNGD0L3QsNGA0L7QtNC90YvQvCDQtNC+0LPQvtCy0L7RgNC+0Lwg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INCyINC60LDRh9C10YHRgtCy0LUg0LTQvtC60YPQvNC10L3RgtC+0LIsINGD0LTQvtGB0YLQvtCy0LXRgNGP0Y7RidC40YUg0LvQuNGH0L3QvtGB0YLRjCcsXG5cdCcwMDgwMDIwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLLCDQuNC00LXQvdGC0LjRhNC40YbQuNGA0YPRjtGJ0LjQtSDRjtGA0LjQtNC40YfQtdGB0LrQvtC1INC70LjRhtC+Jyxcblx0JzAwODAwMjAwMTAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDRjtGA0LjQtNC40YfQtdGB0LrQvtCz0L4g0LvQuNGG0LAnLFxuXHQnMDA4MDAyMDAyMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INCy0L3QtdGB0LXQvdC40Lgg0LfQsNC/0LjRgdC10Lkg0LIg0JXQk9Cg0K7QmycsXG5cdCcwMDgwMDIwMDQwMDAnOiAn0KPRgdGC0LDQsicsXG5cdCcwMDgwMDIwMDUwMDAnOiAn0KPRh9GA0LXQtNC40YLQtdC70YzQvdGL0Lkg0LTQvtCz0L7QstC+0YAnLFxuXHQnMDA4MDAyMDA2MDAwJzogJ9Cf0L7Qu9C+0LbQtdC90LjQtSAo0L7QsdGJ0LXQtSDQv9C+0LvQvtC20LXQvdC40LUg0L7QsSDQvtGA0LPQsNC90LjQt9Cw0YbQuNC4KScsXG5cdCcwMDgwMDIwMDcwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4gKNC40LvQuCDRg9Cy0LXQtNC+0LzQu9C10L3QuNC1KSDQviDQv9C+0YHRgtCw0L3QvtCy0LrQtSDQvdCwINGD0YfRkdGCINCyINC90LDQu9C+0LPQvtCy0L7QvCDQvtGA0LPQsNC90LUg0YEg0YPQutCw0LfQsNC90LjQtdC8INCY0J3QnScsXG5cdCcwMDgwMDIwMDgwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQldCT0KDQrtCbJyxcblx0JzAwODAwMjA5OTAwMCc6ICfQmNC90L7QuSDQtNC+0LrRg9C80LXQvdGCJyxcblx0JzU1NTAwMTAwMDAwMCc6ICfQmtCy0LjRgtCw0L3RhtC40Y8nLFxuXHQnNTU1MDAyMDAwMDAwJzogJ9Cf0LvQsNGC0ZHQttC90L7QtSDQv9C+0YDRg9GH0LXQvdC40LUnLFxuXHQnNTU1MDAzMDAwMDAwJzogJ9Cn0LXQuicsXG5cdCc1NTUwMDQwMDAwMDAnOiAn0J/QvtC00YLQstC10YDQttC00LXQvdC40LUg0Y3Qu9C10LrRgtGA0L7QvdC90L7Qs9C+INC/0LvQsNGC0LXQttCwJyxcblx0JzU1NTAwNTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC/0YDQsNCy0L4g0LfQsNGP0LLQuNGC0LXQu9GPINC90LAg0LHQtdC30LLQvtC30LzQtdC30LTQvdC+0LUg0L/QvtC70YPRh9C10L3QuNC1INGB0LLQtdC00LXQvdC40LknLFxuXHQnNTU4MTAwMDAwMDAwJzogJ9CX0JDQr9CS0JvQldCd0JjQrycsXG5cdCc1NTgxMDEwMDAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNGPINC4INC30LDQv9GA0L7RgdGLLCDRgdCy0Y/Qt9Cw0L3QvdGL0LUg0YEg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C8INC60LDQtNCw0YHRgtGA0L7QstGL0Lwg0YPRh9GR0YLQvtC8Jyxcblx0JzU1ODEwMTAxMDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5LCDQstC90LXRgdGR0L3QvdGL0YUg0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGAINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCwg0LIg0LLQuNC00LUg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQstGL0L/QuNGB0LrQuCDQvtCxINC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtGB0YLQuCwg0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INC/0LDRgdC/0L7RgNGC0LAg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INC4INC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDQv9C70LDQvdCwINGC0LXRgNGA0LjRgtC+0YDQuNC4LCDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INGB0L/RgNCw0LLQutC4INC+INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0YHRgtC+0LjQvNC+0YHRgtC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgxMDEwMjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0L7RgdGC0LDQvdC+0LLQutC1INC90LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGA0L7QstGL0Lkg0YPRh9GR0YIg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODEwMTAzMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC8INC60LDQtNCw0YHRgtGA0L7QstC+0Lwg0YPRh9GR0YLQtSDQuNC30LzQtdC90LXQvdC40Lkg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODEwMTA0MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQsiDQldC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCDQvtCx0YrQtdC60YLQvtCyINC60LDQv9C40YLQsNC70YzQvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCAo0JXQk9Cg0J7QmtChKSDRgdCy0LXQtNC10L3QuNC5INC+0LEg0L7QsdGK0LXQutGC0LUg0LrQsNC/0LjRgtCw0LvRjNC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwICjQntCa0KEpJyxcblx0JzU1ODEwMTA1MDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5INC+0LEg0J7QmtChJyxcblx0JzU1ODEwMTA2MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0YHQvdGP0YLQuNC4INGBINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDRg9GH0ZHRgtCwINC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgxMDEwNzAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGAINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDRgdCy0LXQtNC10L3QuNC5INC+INGA0LDQvdC10LUg0YPRh9GC0ZHQvdC90L7QvCDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MTAxMDgwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQvtCxINC40YHQv9GA0LDQstC70LXQvdC40Lgg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQvtGI0LjQsdC60LgnLFxuXHQnNTU4MTAxMDkwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQvtCxINC40YHQv9GA0LDQstC70LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60Lgg0LIg0YHQstC10LTQtdC90LjRj9GFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODEwMTA5MDEwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4INCyINGB0LLQtdC00LXQvdC40Y/RhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQvtCxINC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgxMDEwOTAyMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCDQsiDRgdCy0LXQtNC10L3QuNGP0YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0L4g0L/RgNC+0YXQvtC20LTQtdC90LjQuCDRg9GH0LDRgdGC0LrQsCDQk9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LPRgNCw0L3QuNGG0Ysg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4OyDQviDQs9GA0LDQvdC40YbQsNGFINC80LXQttC00YMg0YHRg9Cx0YrQtdC60YLQsNC80Lgg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4OyDQviDQs9GA0LDQvdC40YbQsNGFINC80YPQvdC40YbQuNC/0LDQu9GM0L3Ri9GFINC+0LHRgNCw0LfQvtCy0LDQvdC40Lk7INC+INCz0YDQsNC90LjRhtCw0YUg0L3QsNGB0LXQu9GR0L3QvdGL0YUg0L/Rg9C90LrRgtC+0LI7INC+INGC0LXRgNGA0LjRgtC+0YDQuNCw0LvRjNC90YvRhSDQt9C+0L3QsNGFINC4INC30L7QvdCw0YUg0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC5OyDQviDQutCw0YDRgtC+0LPRgNCw0YTQuNGH0LXRgdC60L7QuSDQuCDQs9C10L7QtNC10LfQuNGH0LXRgdC60L7QuSDQvtGB0L3QvtCy0LDRhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgxMDExMDAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0YDQtdC00YHRgtCw0LLQu9C10L3QuNC4INC00L7Qv9C+0LvQvdC40YLQtdC70YzQvdGL0YUg0LTQvtC60YPQvNC10L3RgtC+0LIg0L3QsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LrQsNC00LDRgdGC0YDQvtCy0YvQuSDRg9GH0ZHRgicsXG5cdCc1NTgxMDExMTAwMDAnOiAn0JLQvdGD0YLRgNC40LLQtdC00L7QvNGB0YLQstC10L3QvdGL0Lkg0LfQsNC/0YDQvtGBINC40L3RhNC+0YDQvNCw0YbQuNC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODEwMTEyMDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDQutC+0L/QuNC4INC00L7QutGD0LzQtdC90YLQsCwg0L3QsCDQvtGB0L3QvtCy0LDQvdC40Lgg0LrQvtGC0L7RgNC+0LPQviDRgdCy0LXQtNC10L3QuNGPINC+0LEg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCy0L3QtdGB0LXQvdGLINCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MTAxMTMwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGB0LLQtdC00LXQvdC40LksINCy0L3QtdGB0ZHQvdC90YvRhSDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LrQsNC00LDRgdGC0YAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4LCDQv9C+0YHRgNC10LTRgdGC0LLQvtC8INC+0LHQtdGB0L/QtdGH0LXQvdC40Y8g0LTQvtGB0YLRg9C/0LAg0Log0LjQvdGE0L7RgNC80LDRhtC40L7QvdC90L7QvNGDINGA0LXRgdGD0YDRgdGDLCDRgdC+0LTQtdGA0LbQsNGJ0LXQvNGDINGB0LLQtdC00LXQvdC40Y8g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MTAxMTQwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INC/0LXRgNC10YfQvdGPINC+0LHRitC10LrRgtC+0LIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4LCDQv9C+0LTQu9C10LbQsNGJ0LjRhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQvtGG0LXQvdC60LUnLFxuXHQnNTU4MTAxMTUwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9GA0LXQutGA0LDRidC10L3QuNC4INC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDRg9GH0ZHRgtCwJyxcblx0JzU1ODEwMTE2MDAwMCc6ICfQnNC10LbQstC10LTQvtC80YHRgtCy0LXQvdC90YvQuSDQt9Cw0L/RgNC+0YEg0LTQvtC60YPQvNC10L3RgtC+0LIg0LIg0L7RgNCz0LDQvdCw0YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCy0LvQsNGB0YLQuCDQuCDQvtGA0LPQsNC90LDRhSDQvNC10YHRgtC90L7Qs9C+INGB0LDQvNC+0YPQv9GA0LDQstC70LXQvdC40Y8nLFxuXHQnNTU4MTAxMTcwMDAwJzogJ9CX0LDQv9GA0L7RgSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQviDRgNCw0L3QtdC1INGD0YfRgtGR0L3QvdC+0Lwg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCyINC+0YDQs9Cw0L3QsNGFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQstC70LDRgdGC0LgsINC+0YDQs9Cw0L3QsNGFINC80LXRgdGC0L3QvtCz0L4g0YHQsNC80L7Rg9C/0YDQsNCy0LvQtdC90LjRjyDQuNC70Lgg0L7RgNCz0LDQvdCw0YUg0Lgg0L7RgNCz0LDQvdC40LfQsNGG0LjRj9GFINC/0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC80YMg0YLQtdGF0L3QuNGH0LXRgdC60L7QvNGDINGD0YfRkdGC0YMg0LggKNC40LvQuCkg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQuNC90LLQtdC90YLQsNGA0LjQt9Cw0YbQuNC4Jyxcblx0JzU1ODEwMjAwMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40Y8g0Lgg0LfQsNC/0YDQvtGB0YssINGB0LLRj9C30LDQvdC90YvQtSDRgSDRgNC10LPQuNGB0YLRgNCw0YbQuNC10Lkg0L/RgNCw0LInLFxuXHQnNTU4MTAyMDEwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQstCwINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+LCDRgdC00LXQu9C60Lgg0YEg0L3QuNC8LCDQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKSwg0L/QtdGA0LXRhdC+0LTQsCwg0L/RgNC10LrRgNCw0YnQtdC90LjRjyDQv9GA0LDQstCwINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+Jyxcblx0JzU1ODEwMjAyMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNC10LrRgNCw0YnQtdC90LjRjyDQv9GA0LDQstCwICjQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKSDQv9GA0LDQstCwKScsXG5cdCc1NTgxMDIwMzAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LjQt9C80LXQvdC10L3QuNC5INCyINCV0JPQoNCfJyxcblx0JzU1ODEwMjA0MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4Jyxcblx0JzU1ODEwMjA1MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/RgNC10LTRgdGC0LDQstC70LXQvdC40Lgg0LTQvtC/0L7Qu9C90LjRgtC10LvRjNC90YvRhSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQtNC70Y8g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LInLFxuXHQnNTU4MTAyMDYwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9GA0LjQvtGB0YLQsNC90L7QstC70LXQvdC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCcsXG5cdCc1NTgxMDIwNzAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0L7Qt9C+0LHQvdC+0LLQu9C10L3QuNC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4Jyxcblx0JzU1ODEwMjA4MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/RgNC10LrRgNCw0YnQtdC90LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCcsXG5cdCc1NTgxMDIwOTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0L7QstGC0L7RgNC90L7QuSDQstGL0LTQsNGH0LUg0YHQstC40LTQtdGC0LXQu9GM0YHRgtCy0LAg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LLQsCcsXG5cdCc1NTgxMDIxMDAwMDAnOiAn0JfQsNC/0YDQvtGBINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0YHQstC10LTQtdC90LjQuSwg0YHQvtC00LXRgNC20LDRidC40YXRgdGPINCyINCV0LTQuNC90L7QvCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lwg0YDQtdC10YHRgtGA0LUg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCcsXG5cdCc1NTgxMDIxMTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0L7RgdGC0LDQvdC+0LLQutC1INC90LAg0YPRh9GR0YIg0LHQtdGB0YXQvtC30Y/QudC90YvRhSDQvdC10LTQstC40LbQuNC80YvRhSDQstC10YnQtdC5Jyxcblx0JzU1ODEwMjEyMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLRi9C00LDRh9C1INC30LDQutC70LDQtNC90L7QuSAo0L3QvtCy0L7QuSDQt9Cw0LrQu9Cw0LTQvdC+0LksINC00YPQsdC70LjQutCw0YLQsCDQt9Cw0LrQu9Cw0LTQvdC+0LksINCw0L3QvdGD0LvQuNGA0L7QstCw0L3QvdC+0Lkg0LfQsNC60LvQsNC00L3QvtC5KScsXG5cdCc1NTgxMDIxMzAwMDAnOiAn0JfQsNC/0YDQvtGBINC+INCy0YvQtNCw0YfQtSDQutC+0L/QuNC5INC00L7Qs9C+0LLQvtGA0L7QsiDQuCDQuNC90YvRhSDQtNC+0LrRg9C80LXQvdGC0L7Qsiwg0LLRi9GA0LDQttCw0Y7RidC40YUg0YHQvtC00LXRgNC20LDQvdC40LUg0L7QtNC90L7RgdGC0L7RgNC+0L3QvdC40YUg0YHQtNC10LvQvtC6LCDRgdC+0LLQtdGA0YjQtdC90L3Ri9GFINCyINC/0YDQvtGB0YLQvtC5INC/0LjRgdGM0LzQtdC90L3QvtC5INGE0L7RgNC80LUnLFxuXHQnNTU4MTAyMTQwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9GA0LjQvtGB0YLQsNC90L7QstC70LXQvdC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40LgsINCy0L7Qt9Cy0YDQsNGC0LUg0LTQvtC60YPQvNC10L3RgtC+0LIg0LHQtdC3INC/0YDQvtCy0LXQtNC10L3QuNGPINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4LCDQv9GA0LXQtNGB0YLQsNCy0LvQtdC90LjQuCDQtNC+0L/QvtC70L3QuNGC0LXQu9GM0L3Ri9GFINC00L7QutGD0LzQtdC90YLQvtCyLCDQviDQstC+0LfQvtCx0L3QvtCy0LvQtdC90LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCwg0YDQsNC90LXQtSDQv9GA0LjQvtGB0YLQsNC90L7QstC70LXQvdC90L7QuSDQv9C+INC30LDRj9Cy0LvQtdC90LjRjiDQv9GA0LDQstC+0L7QsdC70LDQtNCw0YLQtdC70Y8sINGB0YLQvtGA0L7QvdGLICjRgdGC0L7RgNC+0L0pINGB0LTQtdC70LrQuCwg0LvQuNGG0LAsINGH0YzRkSDQv9GA0LDQstC+INC+0LPRgNCw0L3QuNGH0LjQstCw0LXRgtGB0Y8gKNC+0LHRgNC10LzQtdC90Y/QtdGC0YHRjyksINC70LjRhtCwLCDQsiDQv9C+0LvRjNC30YMg0LrQvtGC0L7RgNC+0LPQviDQv9GA0LDQstC+INC+0LPRgNCw0L3QuNGH0LjQstCw0LXRgtGB0Y8gKNC+0LHRgNC10LzQtdC90Y/QtdGC0YHRjyksINC30LDQutC+0L3QvdC+0LPQviDQstC70LDQtNC10LvRjNGG0LAg0LfQsNC60LvQsNC00L3QvtC5ICjQuNGFINC/0YDQtdC00YHRgtCw0LLQuNGC0LXQu9GPKScsXG5cdCc1NTgxMDIxNTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0L7QstGC0L7RgNC90L7QuSDQstGL0LTQsNGH0LUg0L3QvtCy0L7Qs9C+INGB0LLQuNC00LXRgtC10LvRjNGB0YLQstCwINC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCy0LAsINCy0YvQtNCw0YfQtSDQt9Cw0LrQu9Cw0LTQvdC+0LksINCy0L3QtdGB0LXQvdC40Lgg0LjQt9C80LXQvdC10L3QuNC5INCyINC30LDQv9C40YHRjCDQldC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8LCDQv9C+0LPQsNGI0LXQvdC40Lgg0YDQtdCz0LjRgdGC0YDQsNGG0LjQvtC90L3QvtC5INC30LDQv9C40YHQuCDQvtCxINC40L/QvtGC0LXQutC1Jyxcblx0JzU1ODEwMjE2MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/RgNC40L3Rj9GC0LjQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCDQstC90L7QstGMINCy0L4g0LLQu9Cw0LTQtdC90LjQtSwg0L/QvtC70YzQt9C+0LLQsNC90LjQtSDQuCDRgNCw0YHQv9C+0YDRj9C20LXQvdC40LUgKNCyINGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtGMKScsXG5cdCc1NTgxMDIxNzAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LIg0JXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCDQvtGC0LzQtdGC0LrQuCDQviDQvdCw0LvQuNGH0LjQuCDRgdGD0LTQtdCx0L3QvtCz0L4g0YHQv9C+0YDQsCDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LfQsNGA0LXQs9C40YHRgtGA0LjRgNC+0LLQsNC90L3QvtCz0L4g0L/RgNCw0LLQsCcsXG5cdCc1NTgxMDIxODAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCDQsiDQt9Cw0L/QuNGB0Y/RhSDQldC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8LCDQviDQvdCw0LvQuNGH0LjQuCDQstC+0LfRgNCw0LbQtdC90LjRjyDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LfQsNGA0LXQs9C40YHRgtGA0LjRgNC+0LLQsNC90L3QvtCz0L4g0L/RgNCw0LLQsCDQvdCwINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7RgdGC0LgsINC+INC/0L7Qs9Cw0YjQtdC90LjQuCDQt9Cw0L/QuNGB0Lgg0LIg0JXQtNC40L3QvtC8INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDRgNC10LXRgdGC0YDQtSDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8INC+INC90LDQu9C40YfQuNC4INCy0L7Qt9GA0LDQttC10L3QuNGPINCyINC+0YLQvdC+0YjQtdC90LjQuCDQt9Cw0YDQtdCz0LjRgdGC0YDQuNGA0L7QstCw0L3QvdC+0LPQviDQv9GA0LDQstCwINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCwg0L4g0L3QtdCy0L7Qt9C80L7QttC90L7RgdGC0Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/QtdGA0LXRhdC+0LTQsCwg0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjyksINC/0YDQtdC60YDQsNGJ0LXQvdC40Y8g0L/RgNCw0LLQsCDQvdCwINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LHQtdC3INC70LjRh9C90L7Qs9C+INGD0YfQsNGB0YLQuNGPINGB0L7QsdGB0YLQstC10L3QvdC40LrQsCAo0LXQs9C+INC30LDQutC+0L3QvdC+0LPQviDQv9GA0LXQtNGB0YLQsNCy0LjRgtC10LvRjyksINC+0LEg0L7RgtC30YvQstC1INGA0LDQvdC10LUg0L/RgNC10LTRgdGC0LDQstC70LXQvdC90L7Qs9C+INC30LDRj9Cy0LvQtdC90LjRjyDQviDQvdC10LLQvtC30LzQvtC20L3QvtGB0YLQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9C10YDQtdGF0L7QtNCwLCDQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKSwg0L/RgNC10LrRgNCw0YnQtdC90LjRjyDQv9GA0LDQstCwINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQsdC10Lcg0LvQuNGH0L3QvtCz0L4g0YPRh9Cw0YHRgtC40Y8g0YHQvtCx0YHRgtCy0LXQvdC90LjQutCwICjQtdCz0L4g0LfQsNC60L7QvdC90L7Qs9C+INC/0YDQtdC00YHRgtCw0LLQuNGC0LXQu9GPKScsXG5cdCc1NTgxMDIxOTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INGB0LrRgNC10L/Qu9C10L3QuNC4INC00L7QsdCw0LLQvtGH0L3QvtCz0L4g0LvQuNGB0YLQsCAo0LTQvtCx0LDQstC+0YfQvdGL0YUg0LvQuNGB0YLQvtCyKSDRgSDQt9Cw0LrQu9Cw0LTQvdC+0LknLFxuXHQnNTU4MTAyMjAwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGB0LLQtdC00LXQvdC40LksINGB0L7QtNC10YDQttCw0YnQuNGF0YHRjyDQsiDQldC00LjQvdC+0Lwg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC8INGA0LXQtdGB0YLRgNC1INC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwsINC/0L7RgdGA0LXQtNGB0YLQstC+0Lwg0L7QsdC10YHQv9C10YfQtdC90LjRjyDQtNC+0YHRgtGD0L/QsCDQuiDQuNC90YTQvtGA0LzQsNGG0LjQvtC90L3QvtC80YMg0YDQtdGB0YPRgNGB0YMsINGB0L7QtNC10YDQttCw0YnQtdC80YMg0YHQstC10LTQtdC90LjRjyDQldC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8Jyxcblx0JzU1ODEwMjIxMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0LfQsNC60L7QvdC90L7Qs9C+INCy0LvQsNC00LXQu9GM0YbQsCDQt9Cw0LrQu9Cw0LTQvdC+0LknLFxuXHQnNTU4MTAyMjIwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INC40LfQvNC10L3QtdC90LjQuSDQsiDQt9Cw0L/QuNGB0Ywg0JXQtNC40L3QvtCz0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YDQtdC10YHRgtGA0LAg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCwg0L/QvtCz0LDRiNC10L3QuNC4INGA0LXQs9C40YHRgtGA0LDRhtC40L7QvdC90L7QuSDQt9Cw0L/QuNGB0Lgg0L7QsSDQuNC/0L7RgtC10LrQtScsXG5cdCc1NTgxMDMwMDAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNGPINC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDRg9GH0ZHRgtC1INC30LTQsNC90LjQuSwg0YHQvtC+0YDRg9C20LXQvdC40LksINC/0L7QvNC10YnQtdC90LjQuSwg0L7QsdGK0LXQutGC0L7QsiDQvdC10LfQsNCy0LXRgNGI0ZHQvdC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwICjQvtCx0YrQtdC60YLQvtCyINGD0YfRkdGC0LApINC4INC30LDQv9GA0L7RgdGLINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0YHQstC10LTQtdC90LjQuSwg0LLQvdC10YHRkdC90L3Ri9GFINCyINCV0LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAJyxcblx0JzU1ODEwMzAxMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/QvtGB0YLQsNC90L7QstC60LUg0L3QsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YPRh9GR0YIg0L7QsdGK0LXQutGC0LAg0YPRh9GR0YLQsCcsXG5cdCc1NTgxMDMwMjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LIg0JXQk9Cg0J7QmtChINGB0LLQtdC00LXQvdC40Lkg0L4g0YDQsNC90LXQtSDRg9GH0YLRkdC90L3QvtC8INC+0LHRitC10LrRgtC1INC60LDQv9C40YLQsNC70YzQvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCcsXG5cdCc1NTgxMDMwMzAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDRg9GH0ZHRgtC1INC40LfQvNC10L3QtdC90LjQuSDQvtCx0YrQtdC60YLQsCDRg9GH0ZHRgtCwJyxcblx0JzU1ODEwMzA0MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0YHQvdGP0YLQuNC4INGBINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGD0YfRkdGC0LAg0L7QsdGK0LXQutGC0LAg0YPRh9GR0YLQsCcsXG5cdCc1NTgxMDMwNTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCcsXG5cdCc1NTgxMDMwNjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC60LvRjtGH0LXQvdC40Lgg0YHQstC10LTQtdC90LjQuSDQuNC3INCV0JPQoNCe0JrQoSwg0L3QvtGB0Y/RidC40YUg0LLRgNC10LzQtdC90L3Ri9C5INGF0LDRgNCw0LrRgtC10YAnLFxuXHQnNTU4MTAzMDcwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INC60L7Qv9C40Lgg0LTQvtC60YPQvNC10L3RgtCwLCDQvdCwINC+0YHQvdC+0LLQsNC90LjQuCDQutC+0YLQvtGA0L7Qs9C+INGB0LLQtdC00LXQvdC40Y8g0L7QsSDQvtCx0YrQtdC60YLQtSDQstC90LXRgdC10L3RiyDQsiDQldC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCcsXG5cdCc1NTgxMDMwODAwMDAnOiAn0JfQsNC/0YDQvtGBINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0YHQstC10LTQtdC90LjQuSwg0LLQvdC10YHQtdC90L3Ri9GFINCyINCV0LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAJyxcblx0JzU1ODEwMzA5MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/RgNC10LTRgdGC0LDQstC70LXQvdC40Lgg0LTQvtC/0L7Qu9C90LjRgtC10LvRjNC90YvRhSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRg9GH0ZHRgicsXG5cdCc1NTgxMDQwMDAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0L7Qt9Cy0YDQsNGC0LUg0L/Qu9Cw0YLQtdC20LAnLFxuXHQnNTU4MTk5MDAwMDAwJzogJ9CY0L3QvtC1INC30LDRj9Cy0LvQtdC90LjQtScsXG5cdCc1NTgyMDAwMDAwMDAnOiAn0JTQntCa0KPQnNCV0J3QotCrLCDQodCe0JTQldCg0JbQkNCp0JjQlSDQntCf0JjQodCQ0J3QmNCVINCe0JHQqtCV0JrQotCQJyxcblx0JzU1ODIwMTAwMDAwMCc6ICfQntC/0LjRgdCw0L3QuNC1INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcblx0JzU1ODIwMjAwMDAwMCc6ICfQl9C10LzQu9C10YPRgdGC0YDQvtC40YLQtdC70YzQvdC+0LUg0LTQtdC70L4nLFxuXHQnNTU4MjAzMDAwMDAwJzogJ9Cc0LXQttC10LLQvtC5INC/0LvQsNC9Jyxcblx0JzU1ODIwNDAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCICjQutC+0L/QuNGPKSwg0L3QsCDQvtGB0L3QvtCy0LDQvdC40Lgg0LrQvtGC0L7RgNC+0LPQviDRgdCy0LXQtNC10L3QuNGPINC+0LEg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCy0L3QtdGB0LXQvdGLINCyINCT0JrQnScsXG5cdCc1NTgyMDUwMDAwMDAnOiAn0KLQtdGF0L3QuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgiDQvtCx0YrQtdC60YLQsCDRg9GH0ZHRgtCwJyxcblx0JzU1ODIwNTAxMDAwMCc6ICfQotC10YXQvdC40YfQtdGB0LrQuNC5INC/0LDRgdC/0L7RgNGCINC00L7QvNC+0LLQu9Cw0LTQtdC90LjRjycsXG5cdCc1NTgyMDUwMjAwMDAnOiAn0KLQtdGF0L3QuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgiDQt9C00LDQvdC40Y8gKNGB0YLRgNC+0LXQvdC40Y8pJyxcblx0JzU1ODIwNTAzMDAwMCc6ICfQotC10YXQvdC40YfQtdGB0LrQuNC5INC/0LDRgdC/0L7RgNGCINC20LjQu9C+0LPQviDQv9C+0LzQtdGJ0LXQvdC40Y8gKNC60LLQsNGA0YLQuNGA0YspJyxcblx0JzU1ODIwNTA0MDAwMCc6ICfQotC10YXQvdC40YfQtdGB0LrQuNC5INC/0LDRgdC/0L7RgNGCINC+0LHRitC10LrRgtCwINC40L3QtNC40LLQuNC00YPQsNC70YzQvdC+0LPQviDQttC40LvQuNGJ0L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAnLFxuXHQnNTU4MjA1MDUwMDAwJzogJ9Ci0LXRhdC90LjRh9C10YHQutC40Lkg0L/QsNGB0L/QvtGA0YIg0YHQvtC+0YDRg9C20LXQvdC40Y8nLFxuXHQnNTU4MjA1MDYwMDAwJzogJ9Ci0LXRhdC90LjRh9C10YHQutC40Lkg0L/QsNGB0L/QvtGA0YIg0L7QsdGK0LXQutGC0LAg0L3QtdC30LDQstC10YDRiNGR0L3QvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCcsXG5cdCc1NTgyMDYwMDAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDRgtC10YXQvdC40YfQtdGB0LrQvtCz0L4g0L/QsNGB0L/QvtGA0YLQsCcsXG5cdCc1NTgyMDYwMTAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDRgtC10YXQvdC40YfQtdGB0LrQvtCz0L4g0L/QsNGB0L/QvtGA0YLQsCDQvdCwINC30LTQsNC90LjQtSAo0YHRgtGA0L7QtdC90LjQtSknLFxuXHQnNTU4MjA2MDIwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0YLQtdGF0L3QuNGH0LXRgdC60L7Qs9C+INC/0LDRgdC/0L7RgNGC0LAg0JHQotCYJyxcblx0JzU1ODIwNzAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCICjQutC+0L/QuNGPKSwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDRgNCw0LfRgNC10YjQtdC90LjQtSDQt9C10LzQtdC70YzQvdC+0LPQviDRgdC/0L7RgNCwINC+INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQuCDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNGPINCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG5cdCc1NTgyMDgwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgiAo0LrQvtC/0LjRjyksINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0L/RgNC40L3QsNC00LvQtdC20L3QvtGB0YLRjCDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDQuiDQvtC/0YDQtdC00LXQu9C10L3QvdC+0Lkg0LrQsNGC0LXQs9C+0YDQuNC4INC30LXQvNC10LvRjCcsXG5cdCc1NTgyMDkwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgiAo0LrQvtC/0LjRjyksINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0YPRgdGC0LDQvdC+0LLQu9C10L3QvdC+0LUg0YDQsNC30YDQtdGI0LXQvdC90L7QtSDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjQtSDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG5cdCc1NTgyMTAwMDAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQv9C70LDQvSDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCAo0LLRi9C/0LjRgdC60LAg0LjQtyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQt9C10LzQtdC70YzQvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwKScsXG5cdCc1NTgyMTEwMDAwMDAnOiAn0J/Qu9Cw0L3RiyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgyMTEwMTAwMDAnOiAn0KLQtdGF0L3QuNGH0LXRgdC60LjQuSDQv9C70LDQvSDQt9C00LDQvdC40Y8sINGB0L7QvtGA0YPQttC10L3QuNGPLCDQv9C+0LzQtdGJ0LXQvdC40Y8g0LvQuNCx0L4g0L7QsdGK0LXQutGC0LAg0L3QtdC30LDQstC10YDRiNGR0L3QvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCcsXG5cdCc1NTgyMTEwMjAwMDAnOiAn0J/Qu9Cw0L0g0YPRh9Cw0YHRgtC60LAg0LvQtdGB0L3QvtCz0L4g0YTQvtC90LTQsCcsXG5cdCc1NTgyMTEwMzAwMDAnOiAn0J/Qu9Cw0L0g0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODIxMTA0MDAwMCc6ICfQrdC60YHQv9C70LjQutCw0YbQuNGPINC6INC/0L7RjdGC0LDQttC90L7QvNGDINC/0LvQsNC90YMnLFxuXHQnNTU4MjEyMDAwMDAwJzogJ9CU0LXQutC70LDRgNCw0YbQuNGPINC+0LEg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODIxMzAwMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC/0LDRgdC/0L7RgNGCINC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgyMTMwMTAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQv9Cw0YHQv9C+0YDRgiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG5cdCc1NTgyMTMwMjAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQv9Cw0YHQv9C+0YDRgiDQv9C+0LzQtdGJ0LXQvdC40Y8gKNCy0YvQv9C40YHQutCwINC40Lcg0JPQmtCdKScsXG5cdCc1NTgyMTMwMzAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQv9Cw0YHQv9C+0YDRgiDQt9C00LDQvdC40Y8sINGB0L7QvtGA0YPQttC10L3QuNGPLCDQvtCx0YrQtdC60YLQsCDQvdC10LfQsNCy0LXRgNGI0ZHQvdC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwJyxcblx0JzU1ODIxNDAwMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLQsNGPINCy0YvQv9C40YHQutCwINC+0LEg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODIxNDAxMDAwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLQsNGPINCy0YvQv9C40YHQutCwINC+INC30LXQvNC10LvRjNC90L7QvCDRg9GH0LDRgdGC0LrQtScsXG5cdCc1NTgyMTQwMjAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0LDRjyDQstGL0L/QuNGB0LrQsCDQviDQt9C00LDQvdC40LgsINGB0L7QvtGA0YPQttC10L3QuNC4LCDQvtCx0YrQtdC60YLQtSDQvdC10LfQsNCy0LXRgNGI0ZHQvdC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwJyxcblx0JzU1ODIxNjAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC40LfQvNC10L3QtdC90LjQtSDQvdCw0LfQvdCw0YfQtdC90LjRjyDQt9C00LDQvdC40Y8sINC/0L7QvNC10YnQtdC90LjRjyDQuNC70Lgg0YHQvtC+0YDRg9C20LXQvdC40Y8sINC90LDQuNC80LXQvdC+0LLQsNC90LjRjyDRgdC+0L7RgNGD0LbQtdC90LjRjycsXG5cdCc1NTgyMTcwMDAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQv9C70LDQvSDRgtC10YDRgNC40YLQvtGA0LjQuCcsXG5cdCc1NTgyMTgwMDAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0LDRjyDRgdC/0YDQsNCy0LrQsCDQviDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INGB0YLQvtC40LzQvtGB0YLQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MjE5MDAwMDAwJzogJ9CQ0LrRgiDQvtCx0YHQu9C10LTQvtCy0LDQvdC40Y8sINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0L/RgNC10LrRgNCw0YnQtdC90LjQtSDRgdGD0YnQtdGB0YLQstC+0LLQsNC90LjRjyDQvtCx0YrQtdC60YLQsCDRg9GH0ZHRgtCwJyxcblx0JzU1ODIyMDAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0YssINCyINCy0LjQtNC1INC60L7RgtC+0YDRi9GFINC/0YDQtdC00L7RgdGC0LDQstC70Y/RjtGC0YHRjyDRgdCy0LXQtNC10L3QuNGPINCV0LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwJyxcblx0JzU1ODIyMDAxMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INCg0LXQtdGB0YLRgNCwLCDRgdC+0LTQtdGA0LbQsNGJ0LDRjyDQvtGC0L3QvtGB0Y/RidC40LXRgdGPINC6INC40L3RhNC+0YDQvNCw0YbQuNC4INC+0LPRgNCw0L3QuNGH0LXQvdC90L7Qs9C+INC00L7RgdGC0YPQv9CwINGB0LLQtdC00LXQvdC40Y8g0L7QsSDQvtCx0YrQtdC60YLQtSDRg9GH0LXRgtCwJyxcblx0JzU1ODIyMDAyMDAwMCc6ICfQodC/0YDQsNCy0LrQsCwg0YHQvtC00LXRgNC20LDRidCw0Y8sINCy0L3QtdGB0ZHQvdC90YvQtSDQsiDQldC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCDRgdCy0LXQtNC10L3QuNGPINC+INC/0YDQtdC60YDQsNGJ0LXQvdC40Lgg0YHRg9GJ0LXRgdGC0LLQvtCy0LDQvdC40Y8g0L7QsdGK0LXQutGC0LAg0YPRh9GR0YLQsCcsXG5cdCc1NTgyMjAwMzAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQoNC10LXRgdGC0YDQsCwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LDRjyDRhNCw0LrRgiDQvtGC0YHRg9GC0YHRgtCy0LjRjyDQsiDQoNC10LXRgdGC0YDQtSDRgdCy0LXQtNC10L3QuNC5INC+0LEg0L7QsdGK0LXQutGC0LUg0YPRh9C10YLQsCcsXG5cdCc1NTgyMjEwMDAwMDAnOiAn0J/QoNCe0KfQmNCVJyxcblx0JzU1ODIyMTAxMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQvdC10L7QsdGF0L7QtNC40LzQvtGB0YLQuCDRg9GB0YLRgNCw0L3QtdC90LjRjyDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INC+0YjQuNCx0LrQuCcsXG5cdCc1NTgyMjEwMjAwMDAnOiAn0JzQtdC20LTRg9C90LDRgNC+0LTQvdGL0Lkg0LTQvtCz0L7QstC+0YAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4LCDQsiDRgdC+0L7RgtCy0LXRgtGB0YLQstC40Lgg0YEg0LrQvtGC0L7RgNGL0Lwg0YPRgdGC0LDQvdC+0LLQu9C10L3QviDQuNC70Lgg0LjQt9C80LXQvdC10L3QviDQv9GA0L7RhdC+0LbQtNC10L3QuNC1INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQs9GA0LDQvdC40YbRiyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnNTU4MjIxMDMwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINGB0L7QtNC10YDQttCw0YnQuNC5INC90LXQvtCx0YXQvtC00LjQvNGL0LUg0LTQu9GPINCy0L3QtdGB0LXQvdC40Y8g0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGAINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDRgdCy0LXQtNC10L3QuNGPINC+INCz0YDQsNC90LjRhtCw0YUg0LzQtdC20LTRgyDRgdGD0LHRitC10LrRgtCw0LzQuCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgsINCz0YDQsNC90LjRhtCw0YUg0LzRg9C90LjRhtC40L/QsNC70YzQvdC+0LPQviDQvtCx0YDQsNC30L7QstCw0L3QuNGPLCDQs9GA0LDQvdC40YbQsNGFINC90LDRgdC10LvRkdC90L3QvtCz0L4g0L/Rg9C90LrRgtCwJyxcblx0JzU1ODIyMTA0MDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDRgdC+0LTQtdGA0LbQsNGJ0LjQuSDQvdC10L7QsdGF0L7QtNC40LzRi9C1INC00LvRjyDQstC90LXRgdC10L3QuNGPINCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0YHQstC10LTQtdC90LjRjyDQvtCxINGD0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQuNC70Lgg0LjQt9C80LXQvdC10L3QuNC4INGC0LXRgNGA0LjRgtC+0YDQuNCw0LvRjNC90L7QuSDQt9C+0L3RiyDQuNC70Lgg0LfQvtC90Ysg0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC5LCDQu9C40LHQviDQvtCxINC+0YLQvNC10L3QtSDRg9GB0YLQsNC90L7QstC70LXQvdC40Y8g0YLQsNC60L7QuSDQt9C+0L3RiycsXG5cdCc1NTgyMjEwNTAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0L/RgNC40YHQstC+0LXQvdC40LgsINC40LfQvNC10L3QtdC90LjQuCDQsNC00YDQtdGB0LAnLFxuXHQnNTU4MjIxMDYwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiyDQvtGA0LPQsNC90L7Qsiwg0L7RgdGD0YnQtdGB0YLQstC70Y/RjtGJ0LjRhSDQstC10LTQtdC90LjQtSDQu9C10YHQvdC+0LPQviDQuCDQstC+0LTQvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtSDRgdCy0LXQtNC10L3QuNGPINC+INC/0YDQuNGA0L7QtNC90YvRhSDQvtCx0YrQtdC60YLQsNGFJyxcblx0JzU1ODIyMTA3MDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDRgdC+0LTQtdGA0LbQsNGJ0LjQuSDRgdCy0LXQtNC10L3QuNGPINC+0LEg0LDQtNGA0LXRgdC1INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgyMjEwODAwMDAnOiAn0JDQutGCINC+0LEg0YPRgtCy0LXRgNC20LTQtdC90LjQuCDRgNC10LfRg9C70YzRgtCw0YLQvtCyINC+0L/RgNC10LTQtdC70LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDRgdGC0L7QuNC80L7RgdGC0LgnLFxuXHQnNTU4MjIxOTkwMDAwJzogJ9CY0L3QvtC5INC00L7QutGD0LzQtdC90YIsINGB0L7QtNC10YDQttCw0YnQuNC5INC+0L/QuNGB0LDQvdC40LUg0L7QsdGK0LXQutGC0LAnLFxuXHQnNTU4MjIyMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0LzQtdC20LTRg9C90LDRgNC+0LTQvdC+0Lwg0LTQvtCz0L7QstC+0YDQtSDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgsINCyINGB0L7QvtGC0LLQtdGC0YHRgtCy0LjQuCDRgSDQutC+0YLQvtGA0YvQvCDRg9GB0YLQsNC90L7QstC70LXQvdC+INC40LvQuCDQuNC30LzQtdC90LXQvdC+INC/0YDQvtGF0L7QttC00LXQvdC40LUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCz0YDQsNC90LjRhtGLINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCwg0LAg0YLQsNC60LbQtSDRgdCy0LXQtNC10L3QuNGPINC+INGE0LXQtNC10YDQsNC70YzQvdC+0Lwg0LfQsNC60L7QvdC1LCDQutC+0YLQvtGA0YvQvCDRgNCw0YLQuNGE0LjRhtC40YDQvtCy0LDQvSDQvNC10LbQtNGD0L3QsNGA0L7QtNC90YvQuSDQtNC+0LPQvtCy0L7RgCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgsINC4INC+0LEg0L7RhNC40YbQuNCw0LvRjNC90L7QvCDQvtC/0YPQsdC70LjQutC+0LLQsNC90LjQuCDRgtCw0LrQvtCz0L4g0YTQtdC00LXRgNCw0LvRjNC90L7Qs9C+INC30LDQutC+0L3QsCcsXG5cdCc1NTgyMjMwMDAwMDAnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDQuNC30LzQtdC90LXQvdC40Lgg0LPRgNCw0L3QuNGGINC80LXQttC00YMg0YHRg9Cx0YrQtdC60YLQsNC80Lgg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzU1ODIyNDAwMDAwMCc6ICfQl9Cw0LrQvtC9INGB0YPQsdGK0LXQutGC0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INC40LvQuCDQuNC30LzQtdC90LXQvdC40Lgg0LPRgNCw0L3QuNGGINC80YPQvdC40YbQuNC/0LDQu9GM0L3Ri9GFINC+0LHRgNCw0LfQvtCy0LDQvdC40Lkg0LvQuNCx0L4g0L4g0L/RgNC10L7QsdGA0LDQt9C+0LLQsNC90LjQuCDQvNGD0L3QuNGG0LjQv9Cw0LvRjNC90YvRhSDQvtCx0YDQsNC30L7QstCw0L3QuNC5Jyxcblx0JzU1ODIyNTAwMDAwMCc6ICfQkNC60YIg0YPQv9C+0LvQvdC+0LzQvtGH0LXQvdC90L7Qs9C+INC+0YDQs9Cw0L3QsCDQvtCxINGD0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQuNC70Lgg0LjQt9C80LXQvdC10L3QuNC4INCz0YDQsNC90LjRhiDQvdCw0YHQtdC70ZHQvdC90YvRhSDQv9GD0L3QutGC0L7QsicsXG5cdCc1NTgyMjYwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INC90LXQvtCx0YXQvtC00LjQvNGL0LUg0LTQu9GPINCy0L3QtdGB0LXQvdC40Y8g0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGAINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDRgdCy0LXQtNC10L3QuNGPINC+INCz0YDQsNC90LjRhtCw0YUg0LzQtdC20LTRgyDRgdGD0LHRitC10LrRgtCw0LzQuCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgsINCz0YDQsNC90LjRhtCw0YUg0LzRg9C90LjRhtC40L/QsNC70YzQvdC+0LPQviDQvtCx0YDQsNC30L7QstCw0L3QuNGPLCDQs9GA0LDQvdC40YbQsNGFINC90LDRgdC10LvRkdC90L3QvtCz0L4g0L/Rg9C90LrRgtCwLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0YPRgtCy0LXRgNC20LTRkdC90L3Ri9GFINC+0YDQs9Cw0L3QsNC80Lgg0LLQu9Cw0YHRgtC4INC00L7QutGD0LzQtdC90YLQsNGFJyxcblx0JzU1ODIyNzAwMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINGD0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQuNC70Lgg0LjQt9C80LXQvdC10L3QuNC4INCz0YDQsNC90LjRhiDQt9C+0L0g0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC5Jyxcblx0JzU1ODIyODAwMDAwMCc6ICfQn9GA0LDQstC+0LLQvtC5INCw0LrRgiwg0LrQvtGC0L7RgNGL0Lwg0YPRgtCy0LXRgNC20LTQtdC90Ysg0LjQu9C4INC40LfQvNC10L3QtdC90Ysg0L/RgNCw0LLQuNC70LAg0LfQtdC80LvQtdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0Lgg0LfQsNGB0YLRgNC+0LnQutC4Jyxcblx0JzU1ODIyOTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC40LfQvNC10L3QtdC90LjQtSDQvdCw0LfQvdCw0YfQtdC90LjRjyDQv9C+0LzQtdGJ0LXQvdC40Y8nLFxuXHQnNTU4MjMwMDAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC/0LXRgNC10LLQvtC00LUg0LbQuNC70L7Qs9C+INC/0L7QvNC10YnQtdC90LjRjyDQsiDQvdC10LbQuNC70L7QtSDQv9C+0LzQtdGJ0LXQvdC40LUsINC90LXQttC40LvQvtCz0L4g0L/QvtC80LXRidC10L3QuNGPINCyINC20LjQu9C+0LUg0L/QvtC80LXRidC10L3QuNC1Jyxcblx0JzU1ODIzMTAwMDAwMCc6ICfQkNC60YIg0L/RgNC40LXQvNC+0YfQvdC+0Lkg0LrQvtC80LjRgdGB0LjQuCwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQt9Cw0LLQtdGA0YjQtdC90LjQtSDQv9C10YDQtdGD0YHRgtGA0L7QudGB0YLQstCwINC4ICjQuNC70LgpINC/0LXRgNC10L/Qu9Cw0L3QuNGA0L7QstC60Lgg0LggKNC40LvQuCkg0LjQvdGL0YUg0YDQsNCx0L7RgicsXG5cdCc1NTgyMzIwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40LUg0YHQstC10LTQtdC90LjRjyDQvtCxINC40LfQvNC10L3QtdC90LjQuCDQvdCw0LfQvdCw0YfQtdC90LjRjyDQv9C+0LzQtdGJ0LXQvdC40Y8nLFxuXHQnNTU4MjMzMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0YDQtdGI0LXQvdC40Lgg0L4g0L/QtdGA0LXQstC+0LTQtSDQttC40LvQvtCz0L4g0L/QvtC80LXRidC10L3QuNGPINCyINC90LXQttC40LvQvtC1INC/0L7QvNC10YnQtdC90LjQtSwg0L3QtdC20LjQu9C+0LPQviDQv9C+0LzQtdGJ0LXQvdC40Y8g0LIg0LbQuNC70L7QtSDQv9C+0LzQtdGJ0LXQvdC40LUnLFxuXHQnNTU4MjM0MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0LDQutGC0LUg0L/RgNC40LXQvNC+0YfQvdC+0Lkg0LrQvtC80LjRgdGB0LjQuCwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LXQvCDQt9Cw0LLQtdGA0YjQtdC90LjQtSDQv9C10YDQtdGD0YHRgtGA0L7QudGB0YLQstCwINC4ICjQuNC70LgpINC/0LXRgNC10L/Qu9Cw0L3QuNGA0L7QstC60Lgg0LggKNC40LvQuCkg0LjQvdGL0YUg0YDQsNCx0L7RgicsXG5cdCc1NTgyMzUwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQuNC30LzQtdC90LXQvdC40LUg0L3QsNC30L3QsNGH0LXQvdC40Y8g0LfQtNCw0L3QuNGPJyxcblx0JzU1ODIzNjAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC40LfQvNC10L3QtdC90LjQtSDQvdCw0LfQvdCw0YfQtdC90LjRjyDRgdC+0L7RgNGD0LbQtdC90LjRjycsXG5cdCc1NTgyMzcwMDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgNCw0LfRgNC10YjQtdC90LjRjyDQvdCwINGD0YHQu9C+0LLQvdC+INGA0LDQt9GA0LXRiNC10L3QvdGL0Lkg0LLQuNC0INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPJyxcblx0JzU1ODIzODAwMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0L/RgNC10LTQtdC70LXQvdC40LggKNC40LfQvNC10L3QtdC90LjQuCkg0LLQuNC00LAg0YDQsNC30YDQtdGI0LXQvdC90L7Qs9C+INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPJyxcblx0JzU1ODIzOTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCICjQutC+0L/QuNGPKSwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8g0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgNCw0LfRgNC10YjQtdC90LjRjyDQvdCwINGD0YHQu9C+0LLQvdC+INGA0LDQt9GA0LXRiNC10L3QvdGL0Lkg0LLQuNC0INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPLCDQvtCxINC+0L/RgNC10LTQtdC70LXQvdC40LggKNC40LfQvNC10L3QtdC90LjQuCkg0LLQuNC00LAg0YDQsNC30YDQtdGI0LXQvdC90L7Qs9C+INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPJyxcblx0JzU1ODI0MDAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjywg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINGA0LXRiNC10L3QuNC4INC+INC/0YDQuNGB0LLQvtC10L3QuNC4LCDQuNC30LzQtdC90LXQvdC40Lgg0LDQtNGA0LXRgdCwJyxcblx0JzU1ODI0MTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINGA0LDQt9GA0LXRiNC10L3QuNC4INC90LAg0LLQstC+0LQg0L7QsdGK0LXQutGC0LAg0LrQsNC/0LjRgtCw0LvRjNC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwINCyINGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjRjiDRgdCy0LXQtNC10L3QuNGPJyxcblx0JzU1ODI0MjAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjywg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINGA0LXQtdGB0YLRgNC1INC+0LHRitC10LrRgtC+0LIg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPICjQv9Cw0LzRj9GC0L3QuNC60L7QsiDQuNGB0YLQvtGA0LjQuCDQuCDQutGD0LvRjNGC0YPRgNGLKSDQvdCw0YDQvtC00L7QsiDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnNTU4MjQzMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0LDQutGC0LUg0J/RgNCw0LLQuNGC0LXQu9GM0YHRgtCy0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC+0LEg0LjRgdC60LvRjtGH0LXQvdC40Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INC40Lcg0LXQtNC40L3QvtCz0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YDQtdC10YHRgtGA0LAg0L7QsdGK0LXQutGC0L7QsiDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8gKNC/0LDQvNGP0YLQvdC40LrQvtCyINC40YHRgtC+0YDQuNC4INC4INC60YPQu9GM0YLRg9GA0YspINC90LDRgNC+0LTQvtCyINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCc1NTgyNDQwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0YHQvtC00LXRgNC20LDRidC40Lkg0YHQstC10LTQtdC90LjRjyDQviDQtNCw0YLQtSDQv9C+0YHRgtGD0L/Qu9C10L3QuNGPINC00L7QutGD0LzQtdC90YLQvtCyLCDQv9GA0LXQtNGD0YHQvNC+0YLRgNC10L3QvdGL0YUg0YHRgtCw0YLRjNC10LkgMTcg0KTQtdC00LXRgNCw0LvRjNC90L7Qs9C+INC30LDQutC+0L3QsCBcItCe0LEg0L7QsdGK0LXQutGC0LDRhSDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8gKNC/0LDQvNGP0YLQvdC40LrQsNGFINC40YHRgtC+0YDQuNC4INC4INC60YPQu9GM0YLRg9GA0YspINC90LDRgNC+0LTQvtCyINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuFwiLCDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODI0NTAwMDAwMCc6ICfQoNC10YjQtdC90LjQtSAo0LrQvtC/0LjRjyDRgNC10YjQtdC90LjRjykg0YHQvtC+0YLQstC10YLRgdGC0LLRg9GO0YnQtdCz0L4g0L7RgNCz0LDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQstC70LDRgdGC0Lgg0L7QsSDQvtGC0LrQsNC30LUg0LLQutC70Y7Rh9C40YLRjCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCyINC10LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAINC+0LHRitC10LrRgtC+0LIg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPICjQv9Cw0LzRj9GC0L3QuNC60L7QsiDQuNGB0YLQvtGA0LjQuCDQuCDQutGD0LvRjNGC0YPRgNGLKSDQvdCw0YDQvtC00L7QsiDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnNTU4MjQ2MDAwMDAwJzogJ9CQ0LrRgiDQn9GA0LDQstC40YLQtdC70YzRgdGC0LLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0L7QsSDQuNGB0LrQu9GO0YfQtdC90LjQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LjQtyDQtdC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQvtCx0YrQtdC60YLQvtCyINC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNGB0LvQtdC00LjRjycsXG5cdCc1NTgyNDcwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8g0L4g0L3QsNC40LzQtdC90L7QstCw0L3QuNC4INCy0L7QtNC90L7Qs9C+INC+0LHRitC10LrRgtCwINC4INGD0YHRgtCw0L3QvtCy0LvQtdC90L3Ri9GFINC/0LDRgNCw0LzQtdGC0YDQsNGFINCy0L7QtNC+0L7RhdGA0LDQvdC90YvRhSDQt9C+0L0g0Lgg0L/RgNC40LHRgNC10LbQvdGL0YUg0LfQsNGJ0LjRgtC90YvRhSDQv9C+0LvQvtGBLCDQt9C+0L0g0LfQsNGC0L7Qv9C70LXQvdC40Y8sINC/0L7QtNGC0L7Qv9C70LXQvdC40Y8g0Lgg0LTRgNGD0LPQuNGFINC30L7QvSDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRhSDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjycsXG5cdCc1NTgyNDgwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lwg0LvQtdGB0L3QvtC8INGA0LXQtdGB0YLRgNC1INGB0LLQtdC00LXQvdC40Y8g0LIg0L7RgtC90L7RiNC10L3QuNC4INC70LXRgdC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcblx0JzU1ODI0OTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjywg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCy0L4g0LLRgdGC0YPQv9C40LLRiNC10Lwg0LIg0YHQuNC70YMg0LDQutGC0LUg0L7QsSDRg9GC0LLQtdGA0LbQtNC10L3QuNC4INGA0LXQt9GD0LvRjNGC0LDRgtC+0LIg0L7Qv9GA0LXQtNC10LvQtdC90LjRjyDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INGB0YLQvtC40LzQvtGB0YLQuCcsXG5cdCc1NTgyNTAwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDRgNC10YjQtdC90LjQuCDQvtCxINGD0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQuNC70Lgg0LjQt9C80LXQvdC10L3QuNC4INCz0YDQsNC90LjRhiDQt9C+0L0g0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC5Jyxcblx0JzU1ODI1MTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjywg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINC/0YDQsNCy0L7QstC+0Lwg0LDQutGC0LUsINC60L7RgtC+0YDRi9C8INGD0YLQstC10YDQttC00LXQvdGLINC40LvQuCDQuNC30LzQtdC90LXQvdGLINC/0YDQsNCy0LjQu9CwINC30LXQvNC70LXQv9C+0LvRjNC30L7QstCw0L3QuNGPINC4INC30LDRgdGC0YDQvtC50LrQuCwg0LLQutC70Y7Rh9Cw0Y8g0YHQstC10LTQtdC90LjRjyDQviDRgtC10YDRgNC40YLQvtGA0LjQsNC70YzQvdGL0YUg0LfQvtC90LDRhScsXG5cdCc1NTgyNTIwMDAwMDAnOiAn0JrQsNGA0YLQsCAo0L/Qu9Cw0L0pINC+0LHRitC10LrRgtCwINC30LXQvNC70LXRg9GB0YLRgNC+0LnRgdGC0LLQsCcsXG5cdCc1NTgyNTMwMDAwMDAnOiAn0JTQtdC60LvQsNGA0LDRhtC40Y8g0LfQsNC40L3RgtC10YDQtdGB0L7QstCw0L3QvdC+0LPQviDQu9C40YbQsCDQviDQstGL0LHRgNCw0L3QvdC+0Lwg0LLQuNC00LUg0YDQsNC30YDQtdGI0LXQvdC90L7Qs9C+INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcblx0JzU1ODI1NDAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0YssINC+0L/RgNC10LTQtdC70Y/RjtGJ0LjQtSAo0L7Qv9GA0LXQtNC10LvRj9Cy0YjQuNC1KSDQsiDRgdC+0L7RgtCy0LXRgtGB0YLQstC40Lgg0YEg0LfQsNC60L7QvdC+0LTQsNGC0LXQu9GM0YHRgtCy0L7QvCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjQtSDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAgKNC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyKScsXG5cdCc1NTgyNTQwMTAwMDAnOiAn0JfQtdC80LvQtdGD0YHRgtGA0L7QuNGC0LXQu9GM0L3QsNGPINC00L7QutGD0LzQtdC90YLQsNGG0LjRjycsXG5cdCc1NTgyNTQwMjAwMDAnOiAn0JvQtdGB0L7Rg9GB0YLRgNC+0LjRgtC10LvRjNC90LDRjyDQtNC+0LrRg9C80LXQvdGC0LDRhtC40Y8nLFxuXHQnNTU4MjU0MDMwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiyDQs9GA0LDQtNC+0YHRgtGA0L7QuNGC0LXQu9GM0L3QvtCz0L4g0LfQvtC90LjRgNC+0LLQsNC90LjRjyAo0J/RgNCw0LLQuNC70LAg0LfQtdC80LvQtdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0Lgg0LfQsNGB0YLRgNC+0LnQutC4KScsXG5cdCc1NTgyNTQwNDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtCw0YbQuNGPINC/0L4g0L/Qu9Cw0L3QuNGA0L7QstC60LUg0YLQtdGA0YDQuNGC0L7RgNC40LggKNC/0YDQvtC10LrRgtGLINC80LXQttC10LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuSksINCyINGCLtGHLiDQtNC+0LrRg9C80LXQvdGCINC/0L4g0L/Qu9Cw0L3QuNGA0L7QstC60LUg0YLQtdGA0YDQuNGC0L7RgNC40Lgg0LIg0L/Qu9Cw0L3QuNGA0YPQtdC80YvRhSDQs9GA0LDQvdC40YbQsNGFINC40YHQutGD0YHRgdGC0LLQtdC90L3QvtCz0L4g0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuXHQnNTU4MjU0MDUwMDAwJzogJ9Ca0L7Qv9C40Y8g0L/RgNC+0LXQutGC0LAg0LzQtdC20LXQstCw0L3QuNGPINC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcblx0JzU1ODI1NDA2MDAwMCc6ICfQkNC60YIg0L7RgtCy0L7QtNCwINC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyINCyINC90LDRgtGD0YDQtScsXG5cdCc1NTgyNTQwNzAwMDAnOiAn0J/RgNC+0LXQutGCINCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG5cdCc1NTgyNTQwODAwMDAnOiAn0J/RgNC+0LXQutGCICjQutC+0L/QuNC4INC+0YLQtNC10LvRjNC90YvRhSDRgdC+0YHRgtCw0LLQvdGL0YUg0YfQsNGB0YLQtdC5KSDQvtGA0LPQsNC90LjQt9Cw0YbQuNC4INC4INC30LDRgdGC0YDQvtC50LrQuCDRgtC10YDRgNC40YLQvtGA0LjQuSDRgdCw0LTQvtCy0L7QtNGH0LXRgdC60LjRhSwg0L7Qs9C+0YDQvtC00L3QuNGH0LXRgdC60LjRhSDQuNC70Lgg0LTQsNGH0L3Ri9GFINC90LXQutC+0LzQvNC10YDRh9C10YHQutC40YUg0L7QsdGK0LXQtNC40L3QtdC90LjQuSDQs9GA0LDQttC00LDQvScsXG5cdCc1NTgyNTQwOTAwMDAnOiAn0J/RgNC+0LXQutGCICjQutC+0L/QuNC4INC+0YLQtNC10LvRjNC90YvRhSDRgdC+0YHRgtCw0LLQvdGL0YUg0YfQsNGB0YLQtdC5KSDQv9C10YDQtdGA0LDRgdC/0YDQtdC00LXQu9C10L3QuNGPINGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdGL0YUg0YPQs9C+0LTQuNC5INC4INC40L3Ri9GFINC30LXQvNC10LvRjCDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnNTU4MjU0MTAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC/0YDQtdC00LLQsNGA0LjRgtC10LvRjNC90L7QvCDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40Lgg0LzQtdGB0YIg0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsicsXG5cdCc1NTgyNTQxMTAwMDAnOiAn0JrQvtC/0LjRjyDRgNC10YjQtdC90LjRjyDQvtCx0YnQtdCz0L4g0YHQvtCx0YDQsNC90LjRjyDRg9GH0LDRgdGC0L3QuNC60L7QsiDQtNC+0LvQtdCy0L7QuSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDQvdCwINC30LXQvNC10LvRjNC90YvQuSDRg9GH0LDRgdGC0L7QuiDQuNC3INC30LXQvNC10LvRjCDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8g0L7QsSDRg9GC0LLQtdGA0LbQtNC10L3QuNC4INC/0YDQvtC10LrRgtCwINC80LXQttC10LLQsNC90LjRjyDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG5cdCc1NTgyNTQxMjAwMDAnOiAn0JrQvtC/0LjRjyDQtNC+0LrRg9C80LXQvdGC0LAsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC10LPQviDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40LUg0L/RgNC+0LXQutGC0LAg0LzQtdC20LXQstCw0L3QuNGPINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcblx0JzU1ODI1NDEzMDAwMCc6ICfQktC+0LfRgNCw0LbQtdC90LjRjyDQt9Cw0LjQvdGC0LXRgNC10YHQvtCy0LDQvdC90YvRhSDQu9C40YYg0L/QviDQv9C+0LLQvtC00YMg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjRjyDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuXHQnNTU4MjU0MTQwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINGB0LLQuNC00LXRgtC10LvRjNGB0YLQstGD0Y7RidC40Lkg0L4g0YHQvdGP0YLQuNC4INCy0L7Qt9GA0LDQttC10L3QuNC5INC30LDQuNC90YLQtdGA0LXRgdC+0LLQsNC90L3Ri9GFINC70LjRhiDQv9C+INC/0L7QstC+0LTRgyDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNGPINCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG5cdCc1NTgyNTQxNTAwMDAnOiAn0KHRhdC10LzQsCDRgNCw0YHQv9C+0LvQvtC20LXQvdC40Y8g0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LIg0L3QsCDQutCw0LTQsNGB0YLRgNC+0LLRi9GFINC/0LvQsNC90LDRhSDQuNC70Lgg0LrQsNC00LDRgdGC0YDQvtCy0YvRhSDQutCw0YDRgtCw0YUg0YHQvtC+0YLQstC10YLRgdGC0LLRg9GO0YnQuNGFINGC0LXRgNGA0LjRgtC+0YDQuNC5Jyxcblx0JzU1ODI1NDk5MDAwMCc6ICfQn9GA0L7Rh9C40LUg0LTQvtC60YPQvNC10L3RgtGLLCDQvtC/0YDQtdC00LXQu9GP0Y7RidC40LUgKNC+0L/RgNC10LTQtdC70Y/QstGI0LjQtSkg0LIg0YHQvtC+0YLQstC10YLRgdGC0LLQuNC4INGBINC30LDQutC+0L3QvtC00LDRgtC10LvRjNGB0YLQstC+0Lwg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC80LXRgdGC0L7Qv9C+0LvQvtC20LXQvdC40LUg0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwICjQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsiknLFxuXHQnNTU4MjU1MDAwMDAwJzogJ9Ca0LDRgNGC0L7Qs9GA0LDRhNC40YfQtdGB0LrQuNC1INC80LDRgtC10YDQuNCw0LvRiycsXG5cdCc1NTgyNTYwMDAwMDAnOiAn0JzQsNGC0LXRgNC40LDQu9GLINC60LDRgNGC0L7Qs9GA0LDRhNC+LdCz0LXQvtC00LXQt9C40YfQtdGB0LrQvtCz0L4g0YTQvtC90LTQsCcsXG5cdCc1NTgyNTcwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLLCDRg9GB0YLQsNC90LDQstC70LjQstCw0Y7RidC40LUg0L/RgNC10LTQtdC70YzQvdGL0LUg0LzQuNC90LjQvNCw0LvRjNC90YvQtSDQuCDQvNCw0LrRgdC40LzQsNC70YzQvdGL0LUg0YDQsNC30LzQtdGA0YssINGB0L7QvtGC0LLQtdGC0YHRgtCy0YPRjtGJ0LjQtSDQstC40LTRgyDRgNCw0LfRgNC10YjQtdC90L3QvtCz0L4g0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuXHQnNTU4MjU3MDEwMDAwJzogJ9Ck0LXQtNC10YDQsNC70YzQvdGL0Lkg0LfQsNC60L7QvScsXG5cdCc1NTgyNTcwMjAwMDAnOiAn0JfQsNC60L7QvSDRgdGD0LHRitC10LrRgtCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCc1NTgyNTcwMzAwMDAnOiAn0J3QvtGA0LzQsNGC0LjQstC90YvQuSDQv9GA0LDQstC+0LLQvtC5INCw0LrRgiDQvtGA0LPQsNC90LAg0LzQtdGB0YLQvdC+0LPQviDRgdCw0LzQvtGD0L/RgNCw0LLQu9C10L3QuNGPJyxcblx0JzU1ODI1ODAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDRgdC+0LTQtdGA0LbQsNGJ0LjQuSDQuNC90YTQvtGA0LzQsNGG0LjRjiDQviDRgNCw0L3QtdC1INC/0YDQuNGB0LLQvtC10L3QvdGL0YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9GFINGD0YfQtdGC0L3Ri9GFINC90L7QvNC10YDQsNGFINC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgyNTkwMDAwMDAnOiAn0J/RgNC+0YLQvtC60L7QuyDQvtCx0YDQsNC30L7QstCw0L3QuNGPINC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcblx0JzU1ODI2MDAwMDAwMCc6ICfQp9C10YDRgtC10LYgKNCw0LHRgNC40YEpINC/0L7QvNC10YnQtdC90LjRjycsXG5cdCc1NTgyNjEwMDAwMDAnOiAn0J/RgNC+0LXQutGC0L3QsNGPINC00L7QutGD0LzQtdC90YLQsNGG0LjRjyDQt9C00LDQvdC40Y8nLFxuXHQnNTU4MjYyMDAwMDAwJzogJ9Cf0YDQvtC10LrRgtC90LDRjyDQtNC+0LrRg9C80LXQvdGC0LDRhtC40Y8g0YHQvtC+0YDRg9C20LXQvdC40Y8nLFxuXHQnNTU4MjYzMDAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC60L7QvNC40YHRgdC40Lgg0L/QviDRgNCw0YHRgdC80L7RgtGA0LXQvdC40Y4g0YHQv9C+0YDQvtCyINC+INGA0LXQt9GD0LvRjNGC0LDRgtCw0YUg0L7Qv9GA0LXQtNC10LvQtdC90LjRjyDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INGB0YLQvtC40LzQvtGB0YLQuCcsXG5cdCc1NTgyNjQwMDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0YHRg9C00LAnLFxuXHQnNTU4Mjk5MDAwMDAwJzogJ9CY0L3QvtC5INC00L7QutGD0LzQtdC90YIsINGB0L7QtNC10YDQttCw0YnQuNC5INC+0L/QuNGB0LDQvdC40LUg0L7QsdGK0LXQutGC0LAnLFxuXHQnNTU4MzAwMDAwMDAwJzogJ9CU0J7QmtCj0JzQldCd0KLQqywg0KHQntCU0JXQoNCW0JDQqdCY0JUg0J7Qn9CY0KHQkNCd0JjQlSDQl9CQ0K/QktCY0KLQldCb0K8g0JjQm9CYINCV0JPQniDQn9Cg0JXQlNCh0KLQkNCS0JjQotCV0JvQrycsXG5cdCc1NTgzMDEwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC1INC/0L7Qu9C90L7QvNC+0YfQuNGPINC/0YDQtdC00YHRgtCw0LLQuNGC0LXQu9GPJyxcblx0JzU1ODMwMTAxMDAwMCc6ICfQlNC+0LLQtdGA0LXQvdC90L7RgdGC0YwnLFxuXHQnNTU4MzAxMDIwMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INGA0L7QttC00LXQvdC40LgnLFxuXHQnNTU4MzAxMDMwMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+0LEg0YPRgdGL0L3QvtCy0LvQtdC90LjQuCcsXG5cdCc1NTgzMDEwNDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0YHRg9C00LAnLFxuXHQnNTU4MzAxMDUwMDAwJzogJ9Ce0L/RgNC10LTQtdC70LXQvdC40LUg0YHRg9C00LAnLFxuXHQnNTU4MzAxMDYwMDAwJzogJ9Cf0YDQvtGC0L7QutC+0Lsg0L7QsSDQuNC30LHRgNCw0L3QuNC4ICjQtdC00LjQvdC+0LvQuNGH0L3QvtCz0L4g0LjRgdC/0L7Qu9C90LjRgtC10LvRjNC90L7Qs9C+INC+0YDQs9Cw0L3QsCDRjtGA0LjQtNC40YfQtdGB0LrQvtCz0L4g0LvQuNGG0LApJyxcblx0JzU1ODMwMTA3MDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INC/0YDQvtGC0L7QutC+0LvQsCDQvtCxINC40LfQsdGA0LDQvdC40LggKNC10LTQuNC90L7Qu9C40YfQvdC+0LPQviDQuNGB0L/QvtC70L3QuNGC0LXQu9GM0L3QvtCz0L4g0L7RgNCz0LDQvdCwINGO0YDQuNC00LjRh9C10YHQutC+0LPQviDQu9C40YbQsCknLFxuXHQnNTU4MzAxMDgwMDAwJzogJ9Cf0YDQuNC60LDQtyDQviDQvdCw0LfQvdCw0YfQtdC90LjQuCAo0YDRg9C60L7QstC+0LTQuNGC0LXQu9GPINC40LvQuCDQuNC90L7Qs9C+INGD0L/QvtC70L3QvtC80L7Rh9C10L3QvdC+0LPQviDQu9C40YbQsCknLFxuXHQnNTU4MzAxMDkwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0YDQs9Cw0L3QvtCyINC+0L/QtdC60Lgg0Lgg0L/QvtC/0LXRh9C40YLQtdC70YzRgdGC0LLQsCcsXG5cdCc1NTgzMDExMDAwMDAnOiAn0JTQvtCz0L7QstC+0YAg0LrQvtC80LzQtdGA0YfQtdGB0LrQvtCz0L4g0L/RgNC10LTRgdGC0LDQstC40YLQtdC70YzRgdGC0LLQsCcsXG5cdCc1NTgzMDExMTAwMDAnOiAn0JTQvtCz0L7QstC+0YAg0LTQvtCy0LXRgNC40YLQtdC70YzQvdC+0LPQviDRg9C/0YDQsNCy0LvQtdC90LjRjycsXG5cdCc1NTgzMDExMjAwMDAnOiAn0J/QvtGB0YLQsNC90L7QstC70LXQvdC40LUg0YHRg9C00LXQsdC90L7Qs9C+INC/0YDQuNGB0YLQsNCy0LAt0LjRgdC/0L7Qu9C90LjRgtC10LvRjycsXG5cdCc1NTgzMDExMzAwMDAnOiAn0J/RgNC+0YLQvtC60L7QuyDQvtCx0YnQtdCz0L4g0YHQvtCx0YDQsNC90LjRjycsXG5cdCc1NTgzMDExNDAwMDAnOiAn0JDQutGCINC+0YDQs9Cw0L3QsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LLQu9Cw0YHRgtC4INC40LvQuCDQvtGA0LPQsNC90LAg0LzQtdGB0YLQvdC+0LPQviDRgdCw0LzQvtGD0L/RgNCw0LLQu9C10L3QuNGPLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC/0L7Qu9C90L7QvNC+0YfQuNGPINC/0YDQtdC00YHRgtCw0LLQuNGC0LXQu9GPINC30LDRj9Cy0LjRgtC10LvRjycsXG5cdCc1NTgzMDE5OTAwMDAnOiAn0JjQvdC+0Lkg0LTQvtC60YPQvNC10L3RgicsXG5cdCc1NTg0MDAwMDAwMDAnOiAn0JTQntCa0KPQnNCV0J3QotCrINCeINCf0KDQkNCS0JDQpSwg0KHQlNCV0JvQmtCQ0KUsINCe0JPQoNCQ0J3QmNCn0JXQndCY0K/QpSAo0J7QkdCg0JXQnNCV0J3QldCd0JjQr9ClKScsXG5cdCc1NTg0MDEwMDAwMDAnOiAn0J/RgNCw0LLQvtGD0YHRgtCw0L3QsNCy0LvQuNCy0LDRjtGJ0LjQtSDQuCDQv9GA0LDQstC+0YPQtNC+0YHRgtC+0LLQtdGA0Y/RjtGJ0LjQtSDQtNC+0LrRg9C80LXQvdGC0YsnLFxuXHQnNTU4NDAxMDEwMDAwJzogJ9CU0L7Qs9C+0LLQvtGA0YsgLyDRgdC+0LPQu9Cw0YjQtdC90LjRjycsXG5cdCc1NTg0MDEwMTAxMDAnOiAn0KHQtNC10LvQutC4INC+0LEg0L7RgtGH0YPQttC00LXQvdC40LgnLFxuXHQnNTU4NDAxMDEwMTAxJzogJ9CU0L7Qs9C+0LLQvtGAINC60YPQv9C70Lgt0L/RgNC+0LTQsNC20LgnLFxuXHQnNTU4NDAxMDEwMTAyJzogJ9CU0L7Qs9C+0LLQvtGAINC80LXQvdGLJyxcblx0JzU1ODQwMTAxMDEwMyc6ICfQlNC+0LPQvtCy0L7RgCDQtNCw0YDQtdC90LjRjycsXG5cdCc1NTg0MDEwMTAxMDQnOiAn0JTQvtCz0L7QstC+0YAg0YDQtdC90YLRiycsXG5cdCc1NTg0MDEwMTAxMDUnOiAn0JTQvtCz0L7QstC+0YAg0L/QvtC20LjQt9C90LXQvdC90L7Qs9C+INGB0L7QtNC10YDQttCw0L3QuNGPINGBINC40LbQtNC40LLQtdC90LjQtdC8Jyxcblx0JzU1ODQwMTAxMDEwNic6ICfQlNC+0LPQvtCy0L7RgCDQv9GA0LjQstCw0YLQuNC30LDRhtC40LggKNC00L7Qs9C+0LLQvtGAINC/0LXRgNC10LTQsNGH0Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCyINGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtGMKScsXG5cdCc1NTg0MDEwMTAyMDAnOiAn0JTRgNGD0LPQuNC1INGB0LTQtdC70LrQuCcsXG5cdCc1NTg0MDEwMTAyMDEnOiAn0JTQvtCz0L7QstC+0YAg0YPRh9Cw0YHRgtC40Y8g0LIg0LTQvtC70LXQstC+0Lwg0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LUnLFxuXHQnNTU4NDAxMDEwMjAyJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0L7Qv9GA0LXQtNC10LvQtdC90LjQuCAo0L/QtdGA0LXRgNCw0YHQv9GA0LXQtNC10LvQtdC90LjQuCkg0LTQvtC70LXQuSDQsiDQv9GA0LDQstC1INC+0LHRidC10Lkg0LTQvtC70LXQstC+0Lkg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0LgnLFxuXHQnNTU4NDAxMDEwMjAzJzogJ9CR0YDQsNGH0L3Ri9C5INC00L7Qs9C+0LLQvtGAJyxcblx0JzU1ODQwMTAxMDIwNCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINC+0YLRgdGC0YPQv9C90L7QvCcsXG5cdCc1NTg0MDEwMTAyMDUnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L4g0YDQsNC30LTQtdC70LUg0LjQvNGD0YnQtdGB0YLQstCwJyxcblx0JzU1ODQwMTAxMDIwNic6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQviDQstGL0LTQtdC70LUg0LTQvtC70LgnLFxuXHQnNTU4NDAxMDEwMjA3JzogJ9CY0L3QstC10YHRgtC40YbQuNC+0L3QvdGL0Lkg0LTQvtCz0L7QstC+0YAgKNC00L7Qs9C+0LLQvtGAINC+0LEg0LjQvdCy0LXRgdGC0LjRgNC+0LLQsNC90LjQuCknLFxuXHQnNTU4NDAxMDEwMjA4JzogJ9Cc0LjRgNC+0LLQvtC1INGB0L7Qs9C70LDRiNC10L3QuNC1Jyxcblx0JzU1ODQwMTAxMDIwOSc6ICfQlNC+0LPQvtCy0L7RgCDQsNGA0LXQvdC00YsgKNGB0YPQsdCw0YDQtdC90LTRiyknLFxuXHQnNTU4NDAxMDEwMjEwJzogJ9CU0L7Qs9C+0LLQvtGAINC+0LEg0LjQv9C+0YLQtdC60LUnLFxuXHQnNTU4NDAxMDEwMjExJzogJ9CU0L7Qs9C+0LLQvtGAINCx0LXQt9Cy0L7Qt9C80LXQt9C00L3QvtCz0L4g0YHRgNC+0YfQvdC+0LPQviDQv9C+0LvRjNC30L7QstCw0L3QuNGPINC30LXQvNC10LvRjNC90YvQvCDRg9GH0LDRgdGC0LrQvtC8Jyxcblx0JzU1ODQwMTAxMDIxMic6ICfQmtGA0LXQtNC40YLQvdGL0Lkg0LTQvtCz0L7QstC+0YAnLFxuXHQnNTU4NDAxMDEwMjEzJzogJ9CU0L7Qs9C+0LLQvtGAINC30LDQudC80LAnLFxuXHQnNTU4NDAxMDEwMjE0JzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INGB0LXRgNCy0LjRgtGD0YLQsCcsXG5cdCc1NTg0MDEwMTAyMTUnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDQuNC30LzQtdC90LXQvdC40Lgg0YHQvtC00LXRgNC20LDQvdC40Y8g0LfQsNC60LvQsNC00L3QvtC5Jyxcblx0JzU1ODQwMTAxMDIxNic6ICfQlNC+0L/QvtC70L3QuNGC0LXQu9GM0L3QvtC1INGB0L7Qs9C70LDRiNC10L3QuNC1ICjRgdC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINC40LfQvNC10L3QtdC90LjQuCDRg9GB0LvQvtCy0LjQuSDQtNC+0LPQvtCy0L7RgNCwKSDQuiDQtNC+0LPQvtCy0L7RgNGDJyxcblx0JzU1ODQwMTAxMDIxNyc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQviDRgNCw0YHRgtC+0YDQttC10L3QuNC4INC00L7Qs9C+0LLQvtGA0LAnLFxuXHQnNTU4NDAxMDEwMjE4JzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0YPRgdGC0YPQv9C60LUg0L/RgNCw0LIg0YLRgNC10LHQvtCy0LDQvdC40Y8g0L/QviDQtNC+0LPQvtCy0L7RgNGDICjQtNC+0LPQvtCy0L7RgCDQviDQv9C10YDQtdC00LDRh9C1INC/0YDQsNCyINC4INC+0LHRj9C30LDQvdC90L7RgdGC0LXQuSknLFxuXHQnNTU4NDAxMDEwMjE5JzogJ9CU0L7Qs9C+0LLQvtGAINC/0YDQvtGB0YLQvtCz0L4g0YLQvtCy0LDRgNC40YnQtdGB0YLQstCwICjQtNC+0LPQvtCy0L7RgCDQviDRgdC+0LLQvNC10YHRgtC90L7QuSDQtNC10Y/RgtC10LvRjNC90L7RgdGC0LgpJyxcblx0JzU1ODQwMTAxMDIyMCc6ICfQk9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LrQvtC90YLRgNCw0LrRgicsXG5cdCc1NTg0MDEwMTAyOTknOiAn0JjQvdCw0Y8g0YHQtNC10LvQutCwJyxcblx0JzU1ODQwMTAyMDAwMCc6ICfQkNC60YLRiyDQvtGA0LPQsNC90L7QsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LLQu9Cw0YHRgtC4INC40LvQuCDQvtGA0LPQsNC90L7QsiDQvNC10YHRgtC90L7Qs9C+INGB0LDQvNC+0YPQv9GA0LDQstC70LXQvdC40Y8nLFxuXHQnNTU4NDAxMDIwMTAwJzogJ9Ck0LXQtNC10YDQsNC70YzQvdGL0Lkg0LfQsNC60L7QvScsXG5cdCc1NTg0MDEwMjAyMDAnOiAn0KPQutCw0Lcg0J/RgNC10LfQuNC00LXQvdGC0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzU1ODQwMTAyMDMwMCc6ICfQn9C+0YHRgtCw0L3QvtCy0LvQtdC90LjQtSDQn9GA0LDQstC40YLQtdC70YzRgdGC0LLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnNTU4NDAxMDIwNDAwJzogJ9CX0LDQutC+0L0gKNC30LDQutC+0L3RiyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgsINGB0YPQsdGK0LXQutGC0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4KScsXG5cdCc1NTg0MDEwMjA1MDAnOiAn0JTQvtC60YPQvNC10L3RgiDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcblx0JzU1ODQwMTAyMDYwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0LHRgNCw0LfQvtCy0LDQvdC40Lgg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuXHQnNTU4NDAxMDIwNzAwJzogJ9CQ0LrRgiDQvtCxINGD0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDRgdC10YDQstC40YLRg9GC0LAnLFxuXHQnNTU4NDAxMDIwODAwJzogJ9CQ0LrRgiDQvtCxINGD0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKScsXG5cdCc1NTg0MDEwMjk5MDAnOiAn0JjQvdGL0LUg0LDQutGC0Ysg0L7RgNCz0LDQvdC+0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCy0LvQsNGB0YLQuCDQuNC70Lgg0L7RgNCz0LDQvdC+0LIg0LzQtdGB0YLQvdC+0LPQviDRgdCw0LzQvtGD0L/RgNCw0LLQu9C10L3QuNGPJyxcblx0JzU1ODQwMTAzMDAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQv9GA0LDQstC1INC90LAg0L3QsNGB0LvQtdC00YHRgtCy0L4nLFxuXHQnNTU4NDAxMDMwMTAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INC/0YDQsNCy0LUg0L3QsCDQvdCw0YHQu9C10LTRgdGC0LLQviDQv9C+INC30LDQutC+0L3RgycsXG5cdCc1NTg0MDEwMzAyMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0L/RgNCw0LLQtSDQvdCwINC90LDRgdC70LXQtNGB0YLQstC+INC/0L4g0LfQsNCy0LXRidCw0L3QuNGOJyxcblx0JzU1ODQwMTA0MDAwMCc6ICfQktGB0YLRg9C/0LjQstGI0LjQtSDQsiDRgdC40LvRgyDRgdGD0LTQtdCx0L3Ri9C1INCw0LrRgtGLJyxcblx0JzU1ODQwMTA0MDEwMCc6ICfQodGD0LTQtdCx0L3Ri9C5INCw0LrRgiwg0YPRgdGC0LDQvdCw0LLQu9C40LLQsNGO0YnQuNC5INC30LDQv9GA0LXRgiDQvdCwINGB0L7QstC10YDRiNC10L3QuNC1INC00LXQudGB0YLQstC40Lkg0LIg0YHRhNC10YDQtSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0YPRh9C10YLQsCDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODQwMTA0MDIwMCc6ICfQodGD0LTQtdCx0L3Ri9C5INCw0LrRgiDQviDQstC+0YHRgdGC0LDQvdC+0LLQu9C10L3QuNC4INCw0L3QvdGD0LvQuNGA0L7QstCw0L3QvdGL0YUg0Lgg0LjRgdC60LvRjtGH0LXQvdC90YvRhSDQuNC3INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INGB0LLQtdC00LXQvdC40Lkg0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4NDAxMDQwMzAwJzogJ9Ch0YPQtNC10LHQvdGL0Lkg0LDQutGCINC+0LEg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNC4INC+0LHRgNC10LzQtdC90LXQvdC40Y8gKNC+0LPRgNCw0L3QuNGH0LXQvdC40LgpINCyINC40YHQv9C+0LvRjNC30L7QstCw0L3QuNC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCAgKNGH0LDRgdGC0Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4KScsXG5cdCc1NTg0MDEwNDk5MDAnOiAn0JjQvdGL0LUg0L/RgNC10LTRg9GB0LzQvtGC0YDQtdC90L3Ri9C1INC30LDQutC+0L3QvtC00LDRgtC10LvRjNGB0YLQstC+0Lwg0YHRg9C00LXQsdC90YvQtSDQsNC60YLRiycsXG5cdCc1NTg0MDEwNTAwMDAnOiAn0JDQutGC0YsgKNGB0LLQuNC00LXRgtC10LvRjNGB0YLQstCwKSDQviDQv9GA0LDQstCw0YUg0L3QsCDQvtCx0YrQtdC60YLRiyDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4NDAxMDUwMTAwJzogJ9Cg0LXQs9C40YHRgtGA0LDRhtC40L7QvdC90L7QtSDRg9C00L7RgdGC0L7QstC10YDQtdC90LjQtScsXG5cdCc1NTg0MDEwNTAyMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0L/RgNCw0LLQtSDQvdCwINC30LXQvNC70Y4nLFxuXHQnNTU4NDAxMDUwMzAwJzogJ9CT0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQsNC60YIg0L4g0L/RgNCw0LLQtSDQvdCwINC30LXQvNC70Y4nLFxuXHQnNTU4NDAxMDUwNDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INC/0YDQsNCy0LUg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0LgnLFxuXHQnNTU4NDAxMDU5OTAwJzogJ9CY0L3Ri9C1INCw0LrRgtGLLCDRgdCy0LjQtNC10YLQtdC70YzRgdGC0LLQsCDQviDQv9GA0LDQstCw0YUg0L3QsCDQvtCx0YrQtdC60YLRiyDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4NDAxMDYwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiyDQvdCwINCy0L3QvtCy0Ywg0LLQvtC30LLQtdC00LXQvdC90YvQuSAo0YDQtdC60L7QvdGB0YLRgNGD0LjRgNC+0LLQsNC90L3Ri9C5KSDQvtCx0YrQtdC60YInLFxuXHQnNTU4NDAxMDYwMTAwJzogJ9Cg0LDQt9GA0LXRiNC10L3QuNC1INC90LAg0LLQstC+0LQg0L7QsdGK0LXQutGC0LAg0LIg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNGOJyxcblx0JzU1ODQwMTA2MDIwMCc6ICfQoNCw0LfRgNC10YjQtdC90LjQtSDQvdCwINGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstC+Jyxcblx0JzU1ODQwMTA2MDMwMCc6ICfQkNC60YIg0LLQstC+0LTQsCDQsiDRjdC60YHQv9C70YPQsNGC0LDRhtC40Y4nLFxuXHQnNTU4NDAxMDYwNDAwJzogJ9Ca0L7Qv9C40Y8g0YDQtdGI0LXQvdC40Y8g0L4g0YHQvtC30LTQsNC90LjQuCDQuNGB0LrRg9GB0YHRgtCy0LXQvdC90L7Qs9C+INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcblx0JzU1ODQwMTA3MDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0Ysg0L/RgNC4INGD0L/RgNC+0YnQtdC90L3QvtC8INC/0L7RgNGP0LTQutC1INC+0YTQvtGA0LzQu9C10L3QuNGPINC/0YDQsNCyINCz0YDQsNC20LTQsNC9INC90LAg0L7RgtC00LXQu9GM0L3Ri9C1INC+0LHRitC10LrRgtGLINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcblx0JzU1ODQwMTA3MDEwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INC/0L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7QuSDQutC90LjQs9C4INC+INC90LDQu9C40YfQuNC4INGDINCz0YDQsNC20LTQsNC90LjQvdCwINC/0YDQsNCy0LAg0L3QsCDQt9C10LzQtdC70YzQvdGL0Lkg0YPRh9Cw0YHRgtC+0LonLFxuXHQnNTU4NDAxMDcwMjAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L/QsNGB0L/QvtGA0YIg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODQwMTA3MDMwMCc6ICfQlNC10LrQu9Cw0YDQsNGG0LjRjyDQvtCxINC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcblx0JzU1ODQwMTA4MDAwMCc6ICfQn9GA0L7Rh9C40LUg0L/RgNCw0LLQvtGD0YHRgtCw0L3QsNCy0LvQuNCy0LDRjtGJ0LjQtSDQtNC+0LrRg9C80LXQvdGC0YsnLFxuXHQnNTU4NDAxMDgwMTAwJzogJ9Cf0LXRgNC10LTQsNGC0L7Rh9C90YvQuSDQsNC60YInLFxuXHQnNTU4NDAxMDgwMjAwJzogJ9Cg0LDQt9C00LXQu9C40YLQtdC70YzQvdGL0Lkg0LHQsNC70LDQvdGBJyxcblx0JzU1ODQwMTA4MDMwMCc6ICfQn9C70LDQvSDQv9GA0LjQstCw0YLQuNC30LDRhtC40LgnLFxuXHQnNTU4NDAxMDgwNDAwJzogJ9Cf0YDQsNCy0LjQu9CwINC00L7QstC10YDQuNGC0LXQu9GM0L3QvtCz0L4g0YPQv9GA0LDQstC70LXQvdC40Y8nLFxuXHQnNTU4NDAxMDgwNTAwJzogJ9CQ0LrRgiDQvtC/0LjRgdC4INC4INCw0YDQtdGB0YLQsCDQuNC80YPRidC10YHRgtCy0LAnLFxuXHQnNTU4NDAxMDgwNjAwJzogJ9Cf0YDQvtGC0L7QutC+0Lsg0L4g0LLRi9C00LXQu9C1INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwINCyINGB0YfQtdGCINC30LXQvNC10LvRjNC90L7QuSDQtNC+0LvQuCcsXG5cdCc1NTg0MDEwODA3MDAnOiAn0J/RgNC+0YLQvtC60L7QuyDQvtCx0YnQtdCz0L4g0YHQvtCx0YDQsNC90LjRjyDRgdC+0LHRgdGC0LLQtdC90L3QuNC60L7QsiDQv9C+0LzQtdGJ0LXQvdC40Lkg0LIg0LzQvdC+0LPQvtC60LLQsNGA0YLQuNGA0L3QvtC8INC00L7QvNC1Jyxcblx0JzU1ODQwMTA4MDgwMCc6ICfQntGC0LrQsNC3INC+0LTQsNGA0Y/QtdC80L7Qs9C+INC/0YDQuNC90Y/RgtGMINC00LDRgCAo0L7RgtC60LDQtyDQvtGCINC00LDRgNCwKScsXG5cdCc1NTg0MDEwODA5MDAnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L4g0L3QvtCy0LDRhtC40LgnLFxuXHQnNTU4NDAxMDgxMDAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+INGA0LDQt9C00LXQu9C1INC90LDRgdC70LXQtNGB0YLQstC10L3QvdC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuXHQnNTU4NDAxMDgxMTAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0YPQv9C70LDRgtC1INCw0LvQuNC80LXQvdGC0L7QsicsXG5cdCc1NTg0MDEwODEyMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQvdCw0LvQuNGH0LjQtSwg0LLQvtC30L3QuNC60L3QvtCy0LXQvdC40LUsINC/0LXRgNC10YXQvtC0INC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pINCy0LXRidC90L7Qs9C+INC/0YDQsNCy0LAg0L3QsCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCyINC/0L7Qu9GM0LfRgyDQt9Cw0Y/QstC40YLQtdC70Y8nLFxuXHQnNTU4NDAxMDg5OTAwJzogJ9CY0L3QvtC5INC00L7QutGD0LzQtdC90YInLFxuXHQnNTU4NDAyMDAwMDAwJzogJ9Ch0J7Qn9Cj0KLQodCi0JLQo9Cu0KnQmNCVINCYINCU0J7Qn9Ce0JvQndCY0KLQldCb0KzQndCr0JUg0JTQntCa0KPQnNCV0J3QotCrJyxcblx0JzU1ODQwMjAxMDAwMCc6ICfQodC+0LPQu9Cw0YHQuNC1INGB0YPQv9GA0YPQs9CwINC90LAg0YHQvtCy0LXRgNGI0LXQvdC40LUg0YHQtNC10LvQutC4Jyxcblx0JzU1ODQwMjAyMDAwMCc6ICfQodC+0LPQu9Cw0YHQuNC1INC+0YDQs9Cw0L3QvtCyINC+0L/QtdC60Lgg0Lgg0L/QvtC/0LXRh9C40YLQtdC70YzRgdGC0LLQsCcsXG5cdCc1NTg0MDIwMzAwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0LfQsNC60LvRjtGH0LXQvdC40Lgg0LHRgNCw0LrQsCcsXG5cdCc1NTg0MDIwNDAwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0YDQsNGB0YLQvtGA0LbQtdC90LjQuCDQsdGA0LDQutCwJyxcblx0JzU1ODQwMjA1MDAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0LTQvtCx0YDQtdC90LjQuCAo0L4g0YHQvtCy0LXRgNGI0LXQvdC40LgpINGB0LTQtdC70LrQuCcsXG5cdCc1NTg0MDIwNjAwMDAnOiAn0KHQv9GA0LDQstC60LAg0L4g0YHRgtC+0LjQvNC+0YHRgtC4ICjRgdC/0YDQsNCy0LrQsCDQviDRgdC+0L7RgtC90L7RiNC10L3QuNC4INGB0YLQvtC40LzQvtGB0YLQuCDQvtGC0YfRg9C20LTQsNC10LzQvtCz0L4g0L7QsdGK0LXQutGC0LAg0Lgg0LHQsNC70LDQvdGB0L7QstC+0Lkg0YHRgtC+0LjQvNC+0YHRgtC4INC40LzRg9GJ0LXRgdGC0LLQsCDQuNC70Lgg0LDQutGC0LjQstC+0LIg0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0LPQviDQvtCx0YnQtdGB0YLQstCwKScsXG5cdCc1NTg0MDIwNzAwMDAnOiAn0KHQv9GA0LDQstC60LAg0L4g0LfQsNC40L3RgtC10YDQtdGB0L7QstCw0L3QvdGL0YUg0LvQuNGG0LDRhSDQsiDRgdC00LXQu9C60LUnLFxuXHQnNTU4NDAyMDgwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0LTQvtC80L7QstC+0Lkg0LrQvdC40LPQuCAo0YHQstC10LTQtdC90LjRjyDQviDQu9C40YbQsNGFLCDRgdC+0YXRgNCw0L3Rj9GO0YnQuNGFINC/0YDQsNCy0L4g0L/RgNC+0LbQuNCy0LDQvdC40Y8g0LIg0LbQuNC70L7QvCDQv9C+0LzQtdGJ0LXQvdC40Lgg0L/QvtGB0LvQtSDQv9C10YDQtdGF0L7QtNCwINC/0YDQsNCy0LAg0L3QsCDQvdC10LPQviknLFxuXHQnNTU4NDAyMDkwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0LvQuNGG0LXQstC+0LPQviDRgdGH0LXRgtCwICjRgdCy0LXQtNC10L3QuNGPINC+INC70LjRhtCw0YUsINGB0L7RhdGA0LDQvdGP0Y7RidC40YUg0L/RgNCw0LLQviDQv9GA0L7QttC40LLQsNC90LjRjyDQsiDQttC40LvQvtC8INC/0L7QvNC10YnQtdC90LjQuCDQv9C+0YHQu9C1INC/0LXRgNC10YXQvtC00LAg0L/RgNCw0LLQsCDQvdCwINC90LXQs9C+KScsXG5cdCc1NTg0MDIxMDAwMDAnOiAn0J/RgNC+0YLQvtC60L7QuyDQviDRgNC10LfRg9C70YzRgtCw0YLQsNGFINGC0L7RgNCz0L7QsicsXG5cdCc1NTg0MDIxMTAwMDAnOiAn0JvQuNGG0LXQvdC30LjRjyAo0LvQuNGG0LXQvdC30LjRjyDQvdCwINC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNC1INC+0L/RgNC10LTQtdC70LXQvdC90YvRhSDQstC40LTQvtCyINC00LXRj9GC0LXQu9GM0L3QvtGB0YLQuCknLFxuXHQnNTU4NDAyMTIwMDAwJzogJ9Cf0YDQvtC10LrRgtC90LDRjyDQtNC10LrQu9Cw0YDQsNGG0LjRjycsXG5cdCc1NTg0MDIxMzAwMDAnOiAn0J7RgtC60LDQtyDQvtGCINC/0YDQtdC40LzRg9GJ0LXRgdGC0LLQtdC90L3QvtCz0L4g0L/RgNCw0LLQsCDQv9C+0LrRg9C/0LrQuCAo0LTQu9GPINGD0YfQsNGB0YLQvdC40LrQvtCyINC00L7Qu9C10LLQvtC5INGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4LCDQtNC70Y8g0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0L/RgNC4INC/0YDQvtC00LDQttC1INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwINC40Lcg0YHQvtGB0YLQsNCy0LAg0LfQtdC80LXQu9GMINGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjyknLFxuXHQnNTU4NDAyMTQwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INGB0L7Qt9C00LDQvdC40Lgg0Y7RgNC40LTQuNGH0LXRgdC60L7Qs9C+INC70LjRhtCwJyxcblx0JzU1ODQwMjE1MDAwMCc6ICfQoNC10YjQtdC90LjQtSDQviDRgNC10L7RgNCz0LDQvdC40LfQsNGG0LjQuCDRjtGA0LjQtNC40YfQtdGB0LrQvtCz0L4g0LvQuNGG0LAnLFxuXHQnNTU4NDAyMTYwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC70LjQutCy0LjQtNCw0YbQuNC4INGO0YDQuNC00LjRh9C10YHQutC+0LPQviDQu9C40YbQsCcsXG5cdCc1NTg0MDIxNzAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDRg9GC0LLQtdGA0LbQtNC10L3QuNC4INC+0YbQtdC90LrQuCDQuNC80YPRidC10YHRgtCy0LAgKNGA0LXRiNC10L3QuNC1INC+0LEg0YPRgtCy0LXRgNC20LTQtdC90LjQuCDQvtGG0LXQvdC60Lgg0L3QtdC00LXQvdC10LbQvdGL0YUg0LLQutC70LDQtNC+0LIg0LIg0YPRgdGC0LDQstC90YvQuSDQutCw0L/QuNGC0LDQuyDQvtCx0YnQtdGB0YLQstCwKScsXG5cdCc1NTg0MDIxODAwMDAnOiAn0JjRgdC/0L7Qu9C90LjRgtC10LvRjNC90YvQuSDQu9C40YHRgicsXG5cdCc1NTg0MDIxOTAwMDAnOiAn0JTQvtCz0L7QstC+0YAg0L/QvtGA0YPRh9C10L3QuNGPJyxcblx0JzU1ODQwMjIwMDAwMCc6ICfQkdGD0YXQs9Cw0LvRgtC10YDRgdC60LjQuSDQsdCw0LvQsNC90YEnLFxuXHQnNTU4NDAyMjEwMDAwJzogJ9CX0LDQutC70LDQtNC90LDRjycsXG5cdCc1NTg0MDIyMjAwMDAnOiAn0JTQvtCx0LDQstC+0YfQvdGL0Lkg0LvQuNGB0YIg0Log0LfQsNC60LvQsNC00L3QvtC5Jyxcblx0JzU1ODQwMjIzMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INGA0LXQtdGB0YLRgNCwINC80YPQvdC40YbQuNC/0LDQu9GM0L3QvtC5INGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4Jyxcblx0JzU1ODQwMjI0MDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INGA0LXQtdGB0YLRgNCwINGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4INGB0YPQsdGK0LXQutGC0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzU1ODQwMjI1MDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INGA0LXQtdGB0YLRgNCwINGE0LXQtNC10YDQsNC70YzQvdC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuXHQnNTU4NDAyMjYwMDAwJzogJ9CW0LjQu9C40YnQvdGL0Lkg0YHQtdGA0YLQuNGE0LjQutCw0YInLFxuXHQnNTU4NDAyMjcwMDAwJzogJ9CQ0YPQtNC40YLQvtGA0YHQutC+0LUg0LfQsNC60LvRjtGH0LXQvdC40LUnLFxuXHQnNTU4NDAyMjgwMDAwJzogJ9Ce0YLRh9C10YIg0L4g0L/RgNC+0LLQtdC00LXQvdC40Lgg0L3QtdC30LDQstC40YHQuNC80L7QuSDQvtGG0LXQvdC60LggKNCw0LrRgiDQvtGG0LXQvdC60LgpJyxcblx0JzU1ODQwMjM5MDAwMCc6ICfQkNC60YIg0LjQvdCy0LXQvdGC0LDRgNC40LfQsNGG0LjQuCcsXG5cdCc1NTg0MDI0MDAwMDAnOiAn0J7RhdGA0LDQvdC90L7QtSDQvtCx0Y/Qt9Cw0YLQtdC70YzRgdGC0LLQviDRgdC+0LHRgdGC0LLQtdC90L3QuNC60LAg0L7QsdGK0LXQutGC0LAg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPJyxcblx0JzU1ODQwMjk5MDAwMCc6ICfQmNC90L7QuSDQtNC+0LrRg9C80LXQvdGCJyxcblx0JzU1ODQwMzAwMDAwMCc6ICfQlNCe0JrQo9Cc0JXQndCi0KssINCh0J7QlNCV0KDQltCQ0KnQmNCVINCh0JLQldCU0JXQndCY0K8g0JXQk9Cg0J8nLFxuXHQnNTU4NDAzMDEwMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCy0LAnLFxuXHQnNTU4NDAzMDIwMDAwJzogJ9CS0YvQv9C40YHQutCwINC+INC/0YDQsNCy0LDRhSDQvdCwINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG5cdCc1NTg0MDMwMzAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0L4g0L/QtdGA0LXRhdC+0LTQtSDQv9GA0LDQsiDQvdCwINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG5cdCc1NTg0MDMwNDAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0L4g0L/RgNCw0LLQsNGFINC+0YLQtNC10LvRjNC90L7Qs9C+INC70LjRhtCwINC90LAg0LjQvNC10Y7RidC40LXRgdGPINGDINC90LXQs9C+INC+0LHRitC10LrRgtGLINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcblx0JzU1ODQwMzA1MDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQviDQv9GA0LjQt9C90LDQvdC40Lgg0L/RgNCw0LLQvtC+0LHQu9Cw0LTQsNGC0LXQu9GPINC90LXQtNC10LXRgdC/0L7RgdC+0LHQvdGL0Lwg0LjQu9C4INC+0LPRgNCw0L3QuNGH0LXQvdC90L4g0LTQtdC10YHQv9C+0YHQvtCx0L3Ri9C8Jyxcblx0JzU1ODQwMzA2MDAwMCc6ICfQodC/0YDQsNCy0LrQsCDQviDRgdC+0LTQtdGA0LbQsNC90LjQuCDQv9GA0LDQstC+0YPRgdGC0LDQvdCw0LLQu9C40LLQsNGO0YnQuNGFINC00L7QutGD0LzQtdC90YLQvtCyINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcblx0JzU1ODQwMzA3MDAwMCc6ICfQodC/0YDQsNCy0LrQsCDQviDQu9C40YbQsNGFLCDQv9C+0LvRg9GH0LjQstGI0LjRhSDRgdCy0LXQtNC10L3QuNGPINC+0LEg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuXHQnNTU4NDAzMDgwMDAwJzogJ9Ca0L7Qv9C40Lgg0LTQvtCz0L7QstC+0YDQvtCyINC4INC40L3Ri9GFINC00L7QutGD0LzQtdC90YLQvtCyLCDQstGL0YDQsNC20LDRjtGJ0LjRhSDRgdC+0LTQtdGA0LbQsNC90LjQtSDQvtC00L3QvtGB0YLQvtGA0L7QvdC90LjRhSDRgdC00LXQu9C+0LosINGB0L7QstC10YDRiNC10L3QvdGL0YUg0LIg0L/RgNC+0YHRgtC+0Lkg0L/QuNGB0YzQvNC10L3QvdC+0Lkg0YTQvtGA0LzQtScsXG5cdCc1NTg0MDMwOTAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQldCT0KDQnyDQviDQv9GA0LjQvdGP0YLQuNC4INC90LAg0YPRh9GR0YIg0LHQtdGB0YXQvtC30Y/QudC90L7Qs9C+INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcblx0JzU1ODQwMzEwMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INCV0JPQoNCfINC+INC/0YDQuNC90Y/RgtC40Lgg0L3QsCDRg9GH0ZHRgiDQsdC10YHRhdC+0LfRj9C50L3QvtCz0L4g0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAsINC+0YIg0L/RgNCw0LLQsCDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDQvdCwINC60L7RgtC+0YDRi9C5INGB0L7QsdGB0YLQstC10L3QvdC40Log0L7RgtC60LDQt9Cw0LvRgdGPJyxcblx0JzU1ODQwMzExMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INCV0JPQoNCfINC+INCx0LXRgdGF0L7Qt9GP0LnQvdC+0Lwg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAsINC/0YDQuNC90Y/RgtC+0Lwg0L3QsCDRg9GH0ZHRgicsXG5cdCc1NTg0MDMxMjAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQtdC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8LCDRg9C00L7RgdGC0L7QstC10YDRj9GO0YnQsNGPINC/0YDQvtCy0LXQtNC10L3QuNC1INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INCy0L7Qt9C90LjQutC90L7QstC10L3QuNGPINC4ICjQuNC70LgpINC/0LXRgNC10YXQvtC00LAg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4nLFxuXHQnNTU4NDAzOTkwMDAwJzogJ9CY0L3QvtC5INC00L7QutGD0LzQtdC90YInLFxuXHQnNTU4NDA0MDAwMDAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNGPINC4INGB0L7Qs9C70LDRgdC40Y8g0L7QsSDQvtCx0YDQsNC30L7QstCw0L3QuNC4INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcblx0JzU1ODQwNDAxMDAwMCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQviDRgNCw0LfQtNC10LvQtSwg0L7QsSDQvtCx0YrQtdC00LjQvdC10L3QuNC4LCDQviDQv9C10YDQtdGA0LDRgdC/0YDQtdC00LXQu9C10L3QuNC4INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyINC40LvQuCDQviDQstGL0LTQtdC70LUg0LjQtyDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG5cdCc1NTg0MDQwMjAwMDAnOiAn0KHQvtCz0LvQsNGB0LjQtSDQvdCwINC+0LHRgNCw0LfQvtCy0LDQvdC40LUg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuXHQnNTU4NDA0MDMwMDAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0L7QsdGA0LDQt9C+0LLQsNC90LjQuCDQvtCx0YnQtdC5INC00L7Qu9C10LLQvtC5INGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4INC90LAg0LfQtdC80LXQu9GM0L3Ri9C5INGD0YfQsNGB0YLQvtC6LCDQvtCx0YDQsNC30YPQtdC80YvQuSDQv9GA0Lgg0LLRi9C00LXQu9C1INC10LPQviDQsiDRgdGH0LXRgiDQt9C10LzQtdC70YzQvdC+0Lkg0LTQvtC70Lgg0LjQu9C4INC30LXQvNC10LvRjNC90YvRhSDQtNC+0LvQtdC5Jyxcblx0JzU1ODQwNDA0MDAwMCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINC+0LHRgNCw0LfQvtCy0LDQvdC40Lgg0L7QsdGJ0LXQuSDRgdC+0LLQvNC10YHRgtC90L7QuSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDQvdCwINC30LXQvNC10LvRjNC90YvQuSDRg9GH0LDRgdGC0L7Quiwg0L7QsdGA0LDQt9GD0LXQvNGL0Lkg0L/RgNC4INCy0YvQtNC10LvQtSDQtdCz0L4g0LIg0YHRh9C10YIg0LfQtdC80LXQu9GM0L3QvtC5INC00L7Qu9C4INC40LvQuCDQt9C10LzQtdC70YzQvdGL0YUg0LTQvtC70LXQuScsXG5cdCc1NTg0MDUwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC1INCy0L7Qt9C90LjQutC90L7QstC10L3QuNC1INC/0YDQsNCy0LAg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Lgg0LIg0L7RgtC90L7RiNC10L3QuNC4INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwINCyINGB0LjQu9GDINGE0LXQtNC10YDQsNC70YzQvdC+0LPQviDQt9Cw0LrQvtC90LAg0LLQvdC1INC30LDQstC40YHQuNC80L7RgdGC0Lgg0L7RgiDQvNC+0LzQtdC90YLQsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDRjdGC0L7Qs9C+INC/0YDQsNCy0LAg0LIg0JXQk9Cg0J8nLFxuXHQnNTU4NDA1MDEwMDAwJzogJ9Ca0L7Qv9C40Y8g0YDQtdGI0LXQvdC40Y8g0L4g0LHQtdC30LLQvtC30LzQtdC30LTQvdC+0Lkg0L/QtdGA0LXQtNCw0YfQtSDQstC+0LXQvdC90L7Qs9C+INC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwINC40Lcg0YTQtdC00LXRgNCw0LvRjNC90L7QuSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDQsiDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLRjCDRgdGD0LHRitC10LrRgtCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCAtINCz0L7RgNC+0LTQsCDRhNC10LTQtdGA0LDQu9GM0L3QvtCz0L4g0LfQvdCw0YfQtdC90LjRjyDQnNC+0YHQutCy0Ysg0LjQu9C4INCh0LDQvdC60YIt0J/QtdGC0LXRgNCx0YPRgNCz0LAg0LvQuNCx0L4g0LzRg9C90LjRhtC40L/QsNC70YzQvdGD0Y4g0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0YwnLFxuXHQnNTU4NDA1MDIwMDAwJzogJ9Cf0L7QtNC70LjQvdC90LjQuiDQuNC70Lgg0LrQvtC/0LjRjyDQv9C40YHRjNC80LAg0L7RgNCz0LDQvdCwINC40YHQv9C+0LvQvdC40YLQtdC70YzQvdC+0Lkg0LLQu9Cw0YHRgtC4INGB0YPQsdGK0LXQutGC0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4IC0g0LPQvtGA0L7QtNCwINGE0LXQtNC10YDQsNC70YzQvdC+0LPQviDQt9C90LDRh9C10L3QuNGPINCc0L7RgdC60LLRiyDQuNC70Lgg0KHQsNC90LrRgi3Qn9C10YLQtdGA0LHRg9GA0LPQsCDQu9C40LHQviDQvtGA0LPQsNC90LAg0LzQtdGB0YLQvdC+0LPQviDRgdCw0LzQvtGD0L/RgNCw0LLQu9C10L3QuNGPINC80YPQvdC40YbQuNC/0LDQu9GM0L3QvtCz0L4g0L7QsdGA0LDQt9C+0LLQsNC90LjRjyDQviDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40Lgg0LPRgNCw0L3QuNGGINC+0LHRgNCw0LfRg9C10LzQvtCz0L4g0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAg0YEg0L/RgNC40LvQvtC20LXQvdC40LXQvCDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC90L7Qs9C+INC/0YDQvtC10LrRgtCwINCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDQsiDRgdC70YPRh9Cw0LUsINC10YHQu9C4INCw0LrRgiDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40Y8g0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwINC90LUg0LfQsNCy0LXRgNC10L0g0L/QvtC00L/QuNGB0YzRjiDRg9C/0L7Qu9C90L7QvNC+0YfQtdC90L3QvtCz0L4g0LTQvtC70LbQvdC+0YHRgtC90L7Qs9C+INC70LjRhtCwINGB0L7QvtGC0LLQtdGC0YHRgtCy0YPRjtGJ0LXQs9C+INC+0YDQs9Cw0L3QsCcsXG5cdCc1NTg0MDUwMzAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQuNC30YrRj9GC0LjQuCDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsiDQuCAo0LjQu9C4KSDRgNCw0YHQv9C+0LvQvtC20LXQvdC90YvRhSDQvdCwINC90LjRhSDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwINCyINGG0LXQu9GP0YUg0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7Qu9C40LzQv9C40LnRgdC60LjRhSDQvtCx0YrQtdC60YLQvtCyJyxcblx0JzU1ODQwNTA0MDAwMCc6ICfQmtC+0L/QuNGPINCw0LrRgtCwINC/0YDQuNC10LzQsC3Qv9C10YDQtdC00LDRh9C4INC+0LHRitC10LrRgtC+0LIg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAsINCyINC+0YLQvdC+0YjQtdC90LjQuCDQutC+0YLQvtGA0YvRhSDQv9GA0LjQvdGP0YLQviDRgNC10YjQtdC90LjQtSDQvtCxINC40LfRitGP0YLQuNC4INCyINGG0LXQu9GP0YUg0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7Qu9C40LzQv9C40LnRgdC60LjRhSDQvtCx0YrQtdC60YLQvtCyJyxcblx0JzU1ODQwNTk5MDAwMCc6ICfQmNC90YvQtSDQtNC+0LrRg9C80LXQvdGC0YssINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40LUg0LLQvtC30L3QuNC60L3QvtCy0LXQvdC40LUg0L/RgNCw0LLQsCDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAg0LIg0YHQuNC70YMg0YTQtdC00LXRgNCw0LvRjNC90L7Qs9C+INC30LDQutC+0L3QsCDQstC90LUg0LfQsNCy0LjRgdC40LzQvtGB0YLQuCDQvtGCINC80L7QvNC10L3RgtCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INGN0YLQvtCz0L4g0L/RgNCw0LLQsCDQsiDQldCT0KDQnycsXG5cdCc1NTg1MDAwMDAwMDAnOiAn0KDQtdGI0LXQvdC40Y8sINGD0LLQtdC00L7QvNC70LXQvdC40Y8sINGA0LDRgdC/0LjRgdC60LgnLFxuXHQnNTU4NTAxMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiyDQviDRgNC10LfRg9C70YzRgtCw0YLQsNGFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDRg9GH0ZHRgtCwJyxcblx0JzU1ODUwMTAxMDAwMCc6ICfQoNCV0KjQldCd0JjQrycsXG5cdCc1NTg1MDEwMTAxMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDQt9Cw0L/RgNCw0YjQuNCy0LDQtdC80YvRhSDRgdCy0LXQtNC10L3QuNC5Jyxcblx0JzU1ODUwMTAxMDIwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L7RiNC40LHQutC4Jyxcblx0JzU1ODUwMTAxMDMwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4Jyxcblx0JzU1ODUwMTAxMDQwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC40YHQv9GA0LDQstC70LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQuCDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INC+0YjQuNCx0L7QuicsXG5cdCc1NTg1MDEwMTA1MDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40Lgg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQv9GA0L7RhtC10LTRg9GA0YsnLFxuXHQnNTU4NTAxMDEwNjAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC/0YDQuNC+0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQvtGB0YPRidC10YHRgtCy0LvQtdC90LjRjyDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INC/0YDQvtGG0LXQtNGD0YDRiycsXG5cdCc1NTg1MDEwMTA3MDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0YHQvdGP0YLQuNC4INC/0YDQuNC+0YHRgtCw0L3QvtCy0LvQtdC90LjRjycsXG5cdCc1NTg1MDEwMTA4MDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0YHQvdGP0YLQuNC4INGBINC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDRg9GH0ZHRgtCwINC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyINGB0L4g0YHRgtCw0YLRg9GB0L7QvCDCq9Cy0YDQtdC80LXQvdC90YvQtcK7INC/0L4g0LfQsNGP0LLQu9C10L3QuNGOINC30LDQuNC90YLQtdGA0LXRgdC+0LLQsNC90L3QvtCz0L4g0LvQuNGG0LAnLFxuXHQnNTU4NTAxMDEwOTAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINCy0YvQtNCw0YfQtSDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0L/QsNGB0L/QvtGA0YLQsCcsXG5cdCc1NTg1MDEwMTEwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtGB0YPRidC10YHRgtCy0LvQtdC90LjQuCDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INC/0YDQvtGG0LXQtNGD0YDRiycsXG5cdCc1NTg1MDEwMTExMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQsNC90L3Rg9C70LjRgNC+0LLQsNC90LjQuCDQutCw0LTQsNGB0YLRgNC+0LLRi9GFINGB0LLQtdC00LXQvdC40LknLFxuXHQnNTU4NTAxMDExMjAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgtC60LvQvtC90LXQvdC40Lgg0LfQsNGP0LLQu9C10L3QuNGPINC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCcsXG5cdCc1NTg1MDEwMTEzMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQt9Cw0L/QuNGB0Lgg0L4g0L3QsNC70LjRh9C40Lgg0LLQvtC30YDQsNC20LXQvdC40Y8nLFxuXHQnNTU4NTAxMDExNDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC/0L7Qs9Cw0YjQtdC90LjQuCDQt9Cw0L/QuNGB0Lgg0L4g0L3QsNC70LjRh9C40Lgg0LLQvtC30YDQsNC20LXQvdC40Y8nLFxuXHQnNTU4NTAxMDExNTAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LfQsNC/0LjRgdC4INC+INC30LDRj9Cy0LvQtdC90LjQuCDQviDQvdC10LLQvtC30LzQvtC20L3QvtGB0YLQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCcsXG5cdCc1NTg1MDEwMTE2MDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0L/QvtCz0LDRiNC10L3QuNC4INC30LDQv9C40YHQuCDQviDQt9Cw0Y/QstC70LXQvdC40Lgg0L4g0L3QtdCy0L7Qt9C80L7QttC90L7RgdGC0Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40LgnLFxuXHQnNTU4NTAxMDIwMDAwJzogJ9Cj0JLQldCU0J7QnNCb0JXQndCY0K8nLFxuXHQnNTU4NTAxMDIwMTAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQvtGC0YHRg9GC0YHRgtCy0LjQuCDQsiDQk9Ca0J0g0LfQsNC/0YDQsNGI0LjQstCw0LXQvNGL0YUg0YHQstC10LTQtdC90LjQuScsXG5cdCc1NTg1MDEwMjAyMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINC+0YHRg9GJ0LXRgdGC0LLQu9GR0L3QvdC+0Lwg0LrQsNC00LDRgdGC0YDQvtCy0L7QvCDRg9GH0ZHRgtC1Jyxcblx0JzU1ODUwMTAyMDMwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC/0YDQuNC10LzQtSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQtNC70Y8g0LLQvdC10YHQtdC90LjRjyDQsiDQldC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCDQvtCx0YrQtdC60YLQvtCyINC60LDQv9C40YLQsNC70YzQvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCAo0LTQsNC70LXQtSAtINCV0LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAKSDRgdCy0LXQtNC10L3QuNC5INC+0LEg0J7QmtChJyxcblx0JzU1ODUwMTAyMDQwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC/0YDQuNC10LzQtSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQtNC70Y8g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjRjyDQuNC3INCV0LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINGB0LLQtdC00LXQvdC40Lkg0L7QsSDQntCa0KEnLFxuXHQnNTU4NTAxMDIwNTAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDRg9GB0YLRgNCw0L3QtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCDQsiDRgdCy0LXQtNC10L3QuNGP0YUg0JPQmtCdJyxcblx0JzU1ODUwMTAyMDYwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINCy0YvQtNCw0YfQtSDRgdCy0LXQtNC10L3QuNC5INC+0LEg0J7QmtChJyxcblx0JzU1ODUwMTAyMDcwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INC/0YDQuNC+0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQvtGB0YPRidC10YHRgtCy0LvQtdC90LjRjyDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INC/0YDQvtGG0LXQtNGD0YDRiycsXG5cdCc1NTg1MDEwMjA4MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQvtGB0YPRidC10YHRgtCy0LvQtdC90LjQuCDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INC/0YDQvtGG0LXQtNGD0YDRiycsXG5cdCc1NTg1MDEwMjA5MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCy0LAnLFxuXHQnNTU4NTAxMDIxMDAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QuNC4INC/0YDQuNC90Y/RgtC40Y8g0L3QsCDRg9GH0ZHRgiDQuNC80YPRidC10YHRgtCy0LAg0LIg0LrQsNGH0LXRgdGC0LLQtSDQsdC10YHRhdC+0LfRj9C50L3QvtCz0L4nLFxuXHQnNTU4NTAxMDIxMTAwJzogJ9Ch0L7QvtCx0YnQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQv9GA0LjQvdGP0YLQuNC4INC90LAg0YPRh9GR0YIg0LjQvNGD0YnQtdGB0YLQstCwINCyINC60LDRh9C10YHRgtCy0LUg0LHQtdGB0YXQvtC30Y/QudC90L7Qs9C+Jyxcblx0JzU1ODUwMTAyMTIwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INGB0L3Rj9GC0LjQuCDRgSDRg9GH0ZHRgtCwINC40LzRg9GJ0LXRgdGC0LLQsCDQsiDQutCw0YfQtdGB0YLQstC1INCx0LXRgdGF0L7Qt9GP0LnQvdC+0LPQvicsXG5cdCc1NTg1MDEwMjEzMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQstC+0LfQstGA0LDRgtC1INC30LDRj9Cy0LvQtdC90LjRjyDQviDQvdCw0LvQuNGH0LjQuCDQstC+0LfRgNCw0LbQtdC90LjRjyDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LfQsNGA0LXQs9C40YHRgtGA0LjRgNC+0LLQsNC90L3QvtCz0L4g0L/RgNCw0LLQsCDQvdCwINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LHQtdC3INGA0LDRgdGB0LzQvtGC0YDQtdC90LjRjycsXG5cdCc1NTg1MDEwMzAwMDAnOiAn0J/QoNCe0KfQmNCVJyxcblx0JzU1ODUwMTAzMDEwMCc6ICfQoNCw0YHQv9C40YHQutCwINCyINC/0L7Qu9GD0YfQtdC90LjQuCDRgdC+0L7RgtCy0LXRgtGB0YLQstGD0Y7RidC40YUg0LTQvtC60YPQvNC10L3RgtC+0LIg0LTQu9GPINC/0YDQvtCy0LXQtNC10L3QuNGPINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDRg9GH0ZHRgtCwJyxcblx0JzU1ODUwMTAzMDIwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INC/0YDQvtCy0LXRgNC60Lgg0LTQvtC60YPQvNC10L3RgtC+0LInLFxuXHQnNTU4NTAxMDMwMzAwJzogJ9CQ0LrRgiDQvtC/0YDQtdC00LXQu9C10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0YHRgtC+0LjQvNC+0YHRgtC4INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcblx0JzU1ODUwMTAzMDQwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INCy0YvRj9Cy0LvQtdC90LjRjyDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCcsXG5cdCc1NTg1MDEwMzA1MDAnOiAn0JDQutGCINC+0L/RgNC10LTQtdC70LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDRgdGC0L7QuNC80L7RgdGC0Lgg0L7QsdGK0LXQutGC0L7QsiDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4NTAxMDM5OTAwJzogJ9CY0L3Ri9C1INC00L7QutGD0LzQtdC90YLRiycsXG5cdCc1NTg1MDIwMDAwMDAnOiAn0JTQntCa0KPQnNCV0J3QotCrINCeINCg0JXQl9Cj0JvQrNCi0JDQotCQ0KUg0KDQldCT0JjQodCi0KDQkNCm0JjQmCDQn9Cg0JDQkicsXG5cdCc1NTg1MDIwMTAwMDAnOiAn0KPQktCV0JTQntCc0JvQldCd0JjQrywg0KHQntCe0JHQqdCV0J3QmNCvJyxcblx0JzU1ODUwMjAxMDEwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INC/0YDQuNC+0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQsicsXG5cdCc1NTg1MDIwMTAyMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQv9GA0LXQutGA0LDRidC10L3QuNC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCyJyxcblx0JzU1ODUwMjAxMDMwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INC30LDRgNC10LPQuNGB0YLRgNC40YDQvtCy0LDQvdC90YvRhSDQvtCz0YDQsNC90LjRh9C10L3QuNGP0YUgKNC+0LHRgNC10LzQtdC90LXQvdC40Y/RhSkg0L/RgNCw0LInLFxuXHQnNTU4NTAyMDEwNDAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQuNC30LzQtdC90LXQvdC40Lkg0LIg0JXQk9Cg0J8nLFxuXHQnNTU4NTAyMDEwNTAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4INCyINC30LDQv9C40YHRj9GFINC10LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwnLFxuXHQnNTU4NTAyMDEwNjAwJzogJ9Ch0L7QvtCx0YnQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQsicsXG5cdCc1NTg1MDIwMTA3MDAnOiAn0KHQvtC+0LHRidC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0YHQstC10LTQtdC90LjQuSDQuNC3INCV0JPQoNCfJyxcblx0JzU1ODUwMjAxMDgwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgtGB0YPRgtGB0YLQstC40Lgg0LIg0JXQk9Cg0J8g0LfQsNC/0YDQsNGI0LjQstCw0LXQvNGL0YUg0YHQstC10LTQtdC90LjQuScsXG5cdCc1NTg1MDIwMTA5MDAnOiAn0KHQvtC+0LHRidC10L3QuNC1INC+INC/0YDQuNGR0LzQtSDQt9Cw0Y/QstC70LXQvdC40Y8g0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LLQsCwg0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjykg0L/RgNCw0LLQsCDQvdCwINC/0YDQtdC00L/RgNC40Y/RgtC40LUsINGB0LTQtdC70LrQuCDRgSDQvdC40LwnLFxuXHQnNTU4NTAyMDExMDAwJzogJ9Ch0L7QvtCx0YnQtdC90LjQtSDQviDQv9C+0YHRgtGD0L/Qu9C10L3QuNC4INC00L7QutGD0LzQtdC90YLQvtCyINC90LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Rg9GOINGA0LXQs9C40YHRgtGA0LDRhtC40Y4g0LTQvtCz0L7QstC+0YDQvtCyINC80LXQvdGLINC4ICjQuNC70LgpINC/0LXRgNC10YXQvtC00LAg0L/RgNCw0LLQsCcsXG5cdCc1NTg1MDIwMTExMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQstC+0LfQstGA0LDRgtC1INC/0YDQuNC70L7QttC10L3QvdGL0YUg0Log0LfQsNGP0LLQu9C10L3QuNGOINC00L7QutGD0LzQtdC90YLQvtCyINCx0LXQtyDRgNCw0YHRgdC80L7RgtGA0LXQvdC40Y8nLFxuXHQnNTU4NTAyMDExMjAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNC10LrRgNCw0YnQtdC90LjRjyDQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKScsXG5cdCc1NTg1MDIwMTEzMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINC+0YLRgdGD0YLRgdGC0LLQuNC4INGB0LLQtdC00LXQvdC40Lkg0L4g0LvQuNGG0LDRhSwg0L/QvtC70YPRh9C40LLRiNC40YUg0YHQstC10LTQtdC90LjRjyDQvtCxINC+0LHRitC10LrRgtCw0YUg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuXHQnNTU4NTAyMDExNDAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LLQsCDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDRgdGD0LHRitC10LrRgtCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQuNC70Lgg0LzRg9C90LjRhtC40L/QsNC70YzQvdC+0LPQviDQvtCx0YDQsNC30L7QstCw0L3QuNGPINC90LAg0LfQtdC80LXQu9GM0L3Ri9C5INGD0YfQsNGB0YLQvtC6INC40LvQuCDQt9C10LzQtdC70YzQvdGD0Y4g0LTQvtC70Y4g0LLRgdC70LXQtNGB0YLQstC40LUg0L7RgtC60LDQt9CwINC+0YIg0YHQvtC+0YLQstC10YLRgdGC0LLRg9GO0YnQtdCz0L4g0L/RgNCw0LLQsCDQv9GA0LDQstC+0L7QsdC70LDQtNCw0YLQtdC70LXQvCcsXG5cdCc1NTg1MDIwMTE1MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQv9C+0YHRgtGD0L/Qu9C10L3QuNC4INGA0LXRiNC10L3QuNGPINGB0YPQtNCwLCDQstGB0YLRg9C/0LjQstGI0LXQs9C+INCyINC30LDQutC+0L3QvdGD0Y4g0YHQuNC70YMsINGBINGD0LrQsNC30LDQvdC40LXQvCDRgdGA0L7QutCwINC+0LrQvtC90YfQsNC90LjRjyDQvtGB0YPRidC10YHRgtCy0LvQtdC90LjRjyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQsiwg0LIg0YHQu9GD0YfQsNC1INC10YHQu9C4INC+0YLQutCw0Lcg0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LIg0L/RgNC40LfQvdCw0L0g0YHRg9C00L7QvCDQvdC10L7QsdC+0YHQvdC+0LLQsNC90L3Ri9C8Jyxcblx0JzU1ODUwMjAxMTYwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LjQt9C80LXQvdC10L3QuNC5INCyINC10LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40Lwg0LIg0YHQstGP0LfQuCDRgSDQuNC30LzQtdC90LXQvdC40LXQvCDRgdC+0LTQtdGA0LbQsNGJ0LjRhdGB0Y8g0LIg0LHQsNC30L7QstGL0YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9GFINC40L3RhNC+0YDQvNCw0YbQuNC+0L3QvdGL0YUg0YDQtdGB0YPRgNGB0LDRhSDRgdCy0LXQtNC10L3QuNC5INC+INC/0YDQsNCy0L7QvtCx0LvQsNC00LDRgtC10LvQtSAo0L/RgNCw0LLQvtC+0LHQu9Cw0LTQsNGC0LXQu9GP0YUpJyxcblx0JzU1ODUwMjAxMTcwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INCy0L7Qt9Cy0YDQsNGC0LUg0LTQvtC60YPQvNC10L3RgtC+0LIg0LHQtdC3INGA0LDRgdGB0LzQvtGC0YDQtdC90LjRjyDQv9GA0Lgg0L7RgtC60LDQt9C1INCyINC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDRg9GH0LXRgtCwJyxcblx0JzU1ODUwMjAyMDAwMCc6ICfQn9Cg0J7Qp9CY0JUnLFxuXHQnNTU4NTAyMDIwMTAwJzogJ9Cg0LDRgdC/0LjRgdC60LAg0LIg0L/QvtC70YPRh9C10L3QuNC4INC00L7QutGD0LzQtdC90YLQvtCyINC90LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Rg9GOINGA0LXQs9C40YHRgtGA0LDRhtC40Y4g0L/RgNCw0LInLFxuXHQnNTU4NTAyMDI5OTAwJzogJ9CY0L3QvtC5INC00L7QutGD0LzQtdC90YInLFxuXHQnNTU4NjAxMDAwMDAwJzogJ9Cg0LDRgdC/0LjRgdC60LAg0LIg0L/QvtC70YPRh9C10L3QuNC4INC40LfQstC10YnQtdC90LjQuSDQviDQv9GA0L7QstC10LTQtdC90LjQuCDRgdC+0LHRgNCw0L3QuNGPINC+INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQuCDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNGPINCz0YDQsNC90LjRhicsXG5cdCc1NTg2MDIwMDAwMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQstGA0YPRh9C10L3QuNC4INC40LfQstC10YnQtdC90LjRjyDQviDQv9GA0L7QstC10LTQtdC90LjQuCDRgdC+0LHRgNCw0L3QuNGPINC+INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQuCDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNGPINCz0YDQsNC90LjRhicsXG5cdCc1NTg2MDMwMDAwMDAnOiAn0JrQvtC/0LjRjyDRgdGC0YDQsNC90LjRhtGLINC/0LXRh9Cw0YLQvdC+0LPQviDQuNC30LTQsNC90LjRjywg0YHQvtC00LXRgNC20LDRidC10Lkg0LjQt9Cy0LXRidC10L3QuNC1INC+INC/0YDQvtCy0LXQtNC10L3QuNC4INGB0L7QsdGA0LDQvdC40Y8g0L4g0YHQvtCz0LvQsNGB0L7QstCw0L3QuNC4INC80LXRgdGC0L7Qv9C+0LvQvtC20LXQvdC40Y8g0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwLCDQstC60LvRjtGH0LDRjyDQv9C10YDQstGL0Lkg0LvQuNGB0YIsINGB0L7QtNC10YDQttCw0YnQtdCz0L4g0YDQtdC60LLQuNC30LjRgtGLINGC0LDQutC+0LPQviDQv9C10YfQsNGC0L3QvtCz0L4g0LjQt9C00LDQvdC40Y8nLFxuXHQnNTU4Njk5MDAwMDAwJzogJ9CY0L3Ri9C1INC00L7QutGD0LzQtdC90YLRiywg0YHQstC40LTQtdGC0LXQu9GM0YHRgtCy0YPRjtGJ0LjQtSDQviDRgdC+0LHQu9GO0LTQtdC90LjQuCDRg9GB0YLQsNC90L7QstC70LXQvdC90L7Qs9C+INC/0L7RgNGP0LTQutCwINC40LfQstC10YnQtdC90LjRjyDQt9Cw0LjQvdGC0LXRgNC10YHQvtCy0LDQvdC90YvRhSDQu9C40YYg0L4g0L/RgNC+0LLQtdC00LXQvdC40Lgg0YHQvtCx0YDQsNC90LjRjyDQviDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40Lgg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjRjyDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnXG59O1xuLy/QotC10YDRgNC40YLQvtGA0LjQsNC70YzQvdGL0LUg0LfQvtC90Ysg0Lgg0LfQvtC90Ysg0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC5XG52YXIgZFpvbmUgPSB7XG5cdCcyMTgwMTAwMDAwMDAnOiAn0KLQtdGA0YDQuNGC0L7RgNC40LDQu9GM0L3Ri9C1INC30L7QvdGLJyxcblx0JzIxODAxMDAxMDAwMCc6ICfQltC40LvQsNGPINC30L7QvdCwJyxcblx0JzIxODAxMDAyMDAwMCc6ICfQntCx0YnQtdGB0YLQstC10L3QvdC+LdC00LXQu9C+0LLQsNGPINC30L7QvdCwJyxcblx0JzIxODAxMDAzMDAwMCc6ICfQn9GA0L7QuNC30LLQvtC00YHRgtCy0LXQvdC90LDRjyDQt9C+0L3QsCwg0LfQvtC90LAg0LjQvdC20LXQvdC10YDQvdC+0Lkg0Lgg0YLRgNCw0L3RgdC/0L7RgNGC0L3QvtC5INC40L3RhNGA0LDRgdGC0YDRg9C60YLRg9GAJyxcblx0JzIxODAxMDA0MDAwMCc6ICfQl9C+0L3QsCDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8nLFxuXHQnMjE4MDEwMDUwMDAwJzogJ9CX0L7QvdCwINGA0LXQutGA0LXQsNGG0LjQvtC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMjE4MDEwMDYwMDAwJzogJ9CX0L7QvdCwINC+0YHQvtCx0L4g0L7RhdGA0LDQvdGP0LXQvNGL0YUg0YLQtdGA0YDQuNGC0L7RgNC40LknLFxuXHQnMjE4MDEwMDcwMDAwJzogJ9CX0L7QvdCwINGB0L/QtdGG0LjQsNC70YzQvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCcyMTgwMTAwODAwMDAnOiAn0JfQvtC90LAg0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LLQvtC10L3QvdGL0YUg0L7QsdGK0LXQutGC0L7QsicsXG5cdCcyMTgwMTAwOTAwMDAnOiAn0JjQvdCw0Y8g0LfQvtC90LAnLFxuXHQnMjE4MDIwMDAwMDAwJzogJ9CX0L7QvdGLINGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuCcsXG5cdCcyMTgwMjAwMTAwMDAnOiAn0JfQvtC90Ysg0L7RhdGA0LDQvdGLINC/0YDQuNGA0L7QtNC90YvRhSDQvtCx0YrQtdC60YLQvtCyJyxcblx0JzIxODAyMDAxMDAwMSc6ICfQotC10YDRgNC40YLQvtGA0LjRjyDQvtGB0L7QsdC+INC+0YXRgNCw0L3Rj9C10LzQvtCz0L4g0L/RgNC40YDQvtC00L3QvtCz0L4g0L7QsdGK0LXQutGC0LAnLFxuXHQnMjE4MDIwMDEwMDAyJzogJ9Ce0YXRgNCw0L3QvdCw0Y8g0LfQvtC90LAg0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80L7Qs9C+INC/0YDQuNGA0L7QtNC90L7Qs9C+INC+0LHRitC10LrRgtCwJyxcblx0JzIxODAyMDAxMDAwMyc6ICfQktC+0LTQvtC+0YXRgNCw0L3QvdCw0Y8g0LfQvtC90LAnLFxuXHQnMjE4MDIwMDEwMDA0JzogJ9Cf0YDQuNCx0YDQtdC20L3QsNGPINC30LDRidC40YLQvdCw0Y8g0L/QvtC70L7RgdCwJyxcblx0JzIxODAyMDAxMDAwNSc6ICfQl9C+0L3QsCDRgdCw0L3QuNGC0LDRgNC90L7QuSDQvtGF0YDQsNC90Ysg0LjRgdGC0L7Rh9C90LjQutC+0LIg0LLQvtC00L7RgdC90LDQsdC20LXQvdC40Y8g0Lgg0LLQvtC00L7Qv9GA0L7QstC+0LTQvtCyINC/0LjRgtGM0LXQstC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCcyMTgwMjAwMTAwMDYnOiAn0J7RgdC+0LHQviDRhtC10L3QvdGL0LUg0LfQtdC80LvQuCcsXG5cdCcyMTgwMjAwMjAwMDAnOiAn0JfQvtC90Ysg0L7RhdGA0LDQvdGLINC40YHQutGD0YHRgdGC0LLQtdC90L3Ri9GFINC+0LHRitC10LrRgtC+0LInLFxuXHQnMjE4MDIwMDIwMDAxJzogJ9Ci0LXRgNGA0LjRgtC+0YDQuNGPINC+0LHRitC10LrRgtCwINC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNGB0LvQtdC00LjRjycsXG5cdCcyMTgwMjAwMjAwMDInOiAn0JfQvtC90LAg0L7RhdGA0LDQvdGLINC+0LHRitC10LrRgtCwINC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNGB0LvQtdC00LjRjycsXG5cdCcyMTgwMjAwMjAwMDMnOiAn0J7RhdGA0LDQvdC90LDRjyDQt9C+0L3QsCDQs9C10L7QtNC10LfQuNGH0LXRgdC60L7Qs9C+INC/0YPQvdC60YLQsCcsXG5cdCcyMTgwMjAwMjAwMDQnOiAn0J7RhdGA0LDQvdC90LDRjyDQt9C+0L3QsCDRgdGC0LDRhtC40L7QvdCw0YDQvdC+0LPQviDQv9GD0L3QutGC0LAg0L3QsNCx0LvRjtC00LXQvdC40Lkg0LfQsCDRgdC+0YHRgtC+0Y/QvdC40LXQvCDQvtC60YDRg9C20LDRjtGJ0LXQuSDQv9GA0LjRgNC+0LTQvdC+0Lkg0YHRgNC10LTRiycsXG5cdCcyMTgwMjAwMjAwMDUnOiAn0J7RhdGA0LDQvdC90LDRjyDQt9C+0L3QsCDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG5cdCcyMTgwMjAwMjAwMDYnOiAn0J7RhdGA0LDQvdC90LDRjyDQt9C+0L3QsCDQuNC90LbQtdC90LXRgNC90YvRhSDQutC+0LzQvNGD0L3QuNC60LDRhtC40LknLFxuXHQnMjE4MDIwMDIwMDA3JzogJ9Ce0YXRgNCw0L3QvdCw0Y8g0LfQvtC90LAg0LvQuNC90LjQuSDQuCDRgdC+0L7RgNGD0LbQtdC90LjQuSDRgdCy0Y/Qt9C4INC4INC70LjQvdC40Lkg0Lgg0YHQvtC+0YDRg9C20LXQvdC40Lkg0YDQsNC00LjQvtGE0LjQutCw0YbQuNC4Jyxcblx0JzIxODAyMDAyMDAwOCc6ICfQn9GA0LjQtNC+0YDQvtC20L3QsNGPINC/0L7Qu9C+0YHQsCcsXG5cdCcyMTgwMjAwMzAwMDAnOiAn0JfQvtC90Ysg0LfQsNGJ0LjRgtGLINC90LDRgdC10LvQtdC90LjRjycsXG5cdCcyMTgwMjAwMzAwMDEnOiAn0JfQsNC/0YDQtdGC0L3QsNGPINC30L7QvdCwINC/0YDQuCDQstC+0LXQvdC90L7QvCDRgdC60LvQsNC00LUnLFxuXHQnMjE4MDIwMDMwMDAyJzogJ9CX0LDQv9GA0LXRgtC90YvQuSDRgNCw0LnQvtC9INC/0YDQuCDQstC+0LXQvdC90L7QvCDRgdC60LvQsNC00LUnLFxuXHQnMjE4MDIwMDMwMDAzJzogJ9CX0LDQs9GA0Y/Qt9C90LXQvdC90YvQtSDQt9C10LzQu9C4Jyxcblx0JzIxODAyMDAzMDAwNCc6ICfQntGF0YDQsNC90L3QsNGPINC30L7QvdCwINC30LDQs9GA0Y/Qt9C90LXQvdC90YvRhSDQt9C10LzQtdC70YwnLFxuXHQnMjE4MDIwMDMwMDA1JzogJ9Ch0LDQvdC40YLQsNGA0L3Qvi3Qt9Cw0YnQuNGC0L3QsNGPINC30L7QvdCwINC/0YDQtdC00L/RgNC40Y/RgtC40LksINGB0L7QvtGA0YPQttC10L3QuNC5INC4INC40L3Ri9GFINC+0LHRitC10LrRgtC+0LInLFxuXHQnMjE4MDIwMDMwMDA2JzogJ9Ch0LDQvdC40YLQsNGA0L3Ri9C5INGA0LDQt9GA0YvQsiAo0YHQsNC90LjRgtCw0YDQvdCw0Y8g0L/QvtC70L7RgdCwINC+0YLRh9GD0LbQtNC10L3QuNGPKScsXG5cdCcyMTgwMjAwMzAwMDcnOiAn0JfQvtC90LAg0L7Qs9GA0LDQvdC40YfQtdC90LjRjyDQvtGCINC/0LXRgNC10LTQsNGO0YnQtdCz0L4g0YDQsNC00LjQvtGC0LXRhdC90LjRh9C10YHQutC+0LPQviDQvtCx0YrQtdC60YLQsCcsXG5cdCcyMTgwMjAwMzAwMDgnOiAn0KDQsNC50L7QvSDQv9Cw0LTQtdC90LjRjyDQvtGC0LTQtdC70Y/RjtGJ0LjRhdGB0Y8g0YfQsNGB0YLQtdC5INGA0LDQutC10YInLFxuXHQnMjE4MDIwMDQwMDAwJzogJ9Cf0YDQvtGH0LjQtSDQt9C+0L3RiyDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LgnLFxuXHQnMjE4MDIwMDQwMDAxJzogJ9CX0L7QvdCwINC/0YPQsdC70LjRh9C90L7Qs9C+INGB0LXRgNCy0LjRgtGD0YLQsCcsXG5cdCcyMTgwMjAwNDAwMDInOiAn0JfQvtC90LAg0YDQtdC30LXRgNCy0LjRgNC+0LLQsNC90LjRjyDQt9C10LzQtdC70YwnLFxuXHQnMjE4MDIwMDQwMDAzJzogJ9CT0L7RgNC90YvQuSDQvtGC0LLQvtC0Jyxcblx0JzIxODAyMDA0MDAwNCc6ICfQn9GA0LjQs9C+0YDQvtC00L3QsNGPINC30L7QvdCwJyxcblx0JzIxODAyMDA0MDAwNSc6ICfQl9C10LvQtdC90LDRjyDQt9C+0L3QsCcsXG5cdCcyMTgwMjAwNDAwMDYnOiAn0J7RgdC+0LHQsNGPINGN0LrQvtC90L7QvNC40YfQtdGB0LrQsNGPINC30L7QvdCwJyxcblx0JzIxODAyMDA0MDAwNyc6ICfQn9C+0LPRgNCw0L3QuNGH0L3QsNGPINC30L7QvdCwJyxcblx0JzIxODAyMDA0MDAwOCc6ICfQotC10YDRgNC40YLQvtGA0LjRjyDRgtGA0LDQtNC40YbQuNC+0L3QvdC+0LPQviDQv9GA0LjRgNC+0LTQvtC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8nLFxuXHQnMjE4MDIwMDUwMDAwJzogJ9CY0L3Ri9C1INC30L7QvdGLINGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuCcsXG5cdCcyMTgwMjAwNTAwMDEnOiAn0JjQvdCw0Y8g0LfQvtC90LAg0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC4J1x0XHRcbn07XG4vLyDQmtC70LDRgdGB0LjRhNC40LrQsNGC0L7RgCDQstC40LTQvtCyINC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINC30LXQvNC10LvRjFxudmFyIGRVdGlsaXphdGlvbnMgPSB7XG5cdCcxNDEwMDAwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPINC4INGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdGL0YUg0YPQs9C+0LTQuNC5Jyxcblx0JzE0MTAwMTAwMDAwMCc6ICfQlNC70Y8g0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC/0YDQvtC40LfQstC+0LTRgdGC0LLQsCcsXG5cdCcxNDEwMDEwMTAwMDAnOiAn0JTQu9GPINC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINCyINC60LDRh9C10YHRgtCy0LUg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90YvRhSDRg9Cz0L7QtNC40LknLFxuXHQnMTQxMDAxMDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQt9C00LDQvdC40LksINGB0YLRgNC+0LXQvdC40LksINGB0L7QvtGA0YPQttC10L3QuNC5LCDQuNGB0L/QvtC70YzQt9GD0LXQvNGL0YUg0LTQu9GPINC/0YDQvtC40LfQstC+0LTRgdGC0LLQsCwg0YXRgNCw0L3QtdC90LjRjyDQuCDQv9C10YDQstC40YfQvdC+0Lkg0L/QtdGA0LXRgNCw0LHQvtGC0LrQuCDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtC5INC/0YDQvtC00YPQutGG0LjQuCcsXG5cdCcxNDEwMDEwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCy0L3Rg9GC0YDQuNGF0L7Qt9GP0LnRgdGC0LLQtdC90L3Ri9GFINC00L7RgNC+0LMg0Lgg0LrQvtC80LzRg9C90LjQutCw0YbQuNC5Jyxcblx0JzE0MTAwMTA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LLQvtC00L3Ri9GFINC+0LHRitC10LrRgtC+0LInLFxuXHQnMTQxMDAyMDAwMDAwJzogJ9CU0LvRjyDQstC10LTQtdC90LjRjyDQutGA0LXRgdGC0YzRj9C90YHQutC+0LPQviAo0YTQtdGA0LzQtdGA0YHQutC+0LPQvikg0YXQvtC30Y/QudGB0YLQstCwJyxcblx0JzE0MTAwMzAwMDAwMCc6ICfQlNC70Y8g0LLQtdC00LXQvdC40Y8g0LvQuNGH0L3QvtCz0L4g0L/QvtC00YHQvtCx0L3QvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcblx0JzE0MTAwNDAwMDAwMCc6ICfQlNC70Y8g0LLQtdC00LXQvdC40Y8g0LPRgNCw0LbQtNCw0L3QsNC80Lgg0YHQsNC00L7QstC+0LTRgdGC0LLQsCDQuCDQvtCz0L7RgNC+0LTQvdC40YfQtdGB0YLQstCwJyxcblx0JzE0MTAwNTAwMDAwMCc6ICfQlNC70Y8g0LLQtdC00LXQvdC40Y8g0LPRgNCw0LbQtNCw0L3QsNC80Lgg0LbQuNCy0L7RgtC90L7QstC+0LTRgdGC0LLQsCcsXG5cdCcxNDEwMDYwMDAwMDAnOiAn0JTQu9GPINC00LDRh9C90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwJyxcblx0JzE0MTAwNzAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LTRgNC10LLQtdGB0L3Qvi3QutGD0YHRgtCw0YDQvdC40LrQvtCy0L7QuSDRgNCw0YHRgtC40YLQtdC70YzQvdC+0YHRgtC4LCDQv9GA0LXQtNC90LDQt9C90LDRh9C10L3QvdC+0Lkg0LTQu9GPINC30LDRidC40YLRiyDQt9C10LzQtdC70Ywg0L7RgiDQstC+0LfQtNC10LnRgdGC0LLQuNGPINC90LXQs9Cw0YLQuNCy0L3Ri9GFICjQstGA0LXQtNC90YvRhSkg0L/RgNC40YDQvtC00L3Ri9GFLCDQsNC90YLRgNC+0L/QvtCz0LXQvdC90YvRhSDQuCDRgtC10YXQvdC+0LPQtdC90L3Ri9GFINGP0LLQu9C10L3QuNC5Jyxcblx0JzE0MTAwODAwMDAwMCc6ICfQlNC70Y8g0L3QsNGD0YfQvdC+LdC40YHRgdC70LXQtNC+0LLQsNGC0LXQu9GM0YHQutC40YUg0YbQtdC70LXQuScsXG5cdCcxNDEwMDkwMDAwMDAnOiAn0JTQu9GPINGD0YfQtdCx0L3Ri9GFINGG0LXQu9C10LknLFxuXHQnMTQxMDEwMDAwMDAwJzogJ9CU0LvRjyDRgdC10L3QvtC60L7RiNC10L3QuNGPINC4INCy0YvQv9Cw0YHQsCDRgdC60L7RgtCwINCz0YDQsNC20LTQsNC90LDQvNC4Jyxcblx0JzE0MTAxMTAwMDAwMCc6ICfQpNC+0L3QtCDQv9C10YDQtdGA0LDRgdC/0YDQtdC00LXQu9C10L3QuNGPJyxcblx0JzE0MTAxMjAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQvtGF0L7RgtC90LjRh9GM0LXQs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG5cdCcxNDEwMTMwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YDRi9Cx0L3QvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcblx0JzE0MTAxNDAwMDAwMCc6ICfQlNC70Y8g0LjQvdGL0YUg0LLQuNC00L7QsiDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8nLFxuXHQnMTQyMDAwMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyLCDRhdCw0YDQsNC60YLQtdGA0L3Ri9GFINC00LvRjyDQvdCw0YHQtdC70ZHQvdC90YvRhSDQv9GD0L3QutGC0L7QsicsXG5cdCcxNDIwMDEwMDAwMDAnOiAn0JTQu9GPINC+0LHRitC10LrRgtC+0LIg0LbQuNC70L7QuSDQt9Cw0YHRgtGA0L7QudC60LgnLFxuXHQnMTQyMDAxMDEwMDAwJzogJ9CU0LvRjyDQuNC90LTQuNCy0LjQtNGD0LDQu9GM0L3QvtC5INC20LjQu9C+0Lkg0LfQsNGB0YLRgNC+0LnQutC4Jyxcblx0JzE0MjAwMTAyMDAwMCc6ICfQlNC70Y8g0LzQvdC+0LPQvtC60LLQsNGA0YLQuNGA0L3QvtC5INC30LDRgdGC0YDQvtC50LrQuCcsXG5cdCcxNDIwMDEwMjAxMDAnOiAn0JTQu9GPINC80LDQu9C+0Y3RgtCw0LbQvdC+0Lkg0LfQsNGB0YLRgNC+0LnQutC4Jyxcblx0JzE0MjAwMTAyMDIwMCc6ICfQlNC70Y8g0YHRgNC10LTQvdC10Y3RgtCw0LbQvdC+0Lkg0LfQsNGB0YLRgNC+0LnQutC4Jyxcblx0JzE0MjAwMTAyMDMwMCc6ICfQlNC70Y8g0LzQvdC+0LPQvtGN0YLQsNC20L3QvtC5INC30LDRgdGC0YDQvtC50LrQuCcsXG5cdCcxNDIwMDEwMjA0MDAnOiAn0JTQu9GPINC40L3Ri9GFINCy0LjQtNC+0LIg0LbQuNC70L7QuSDQt9Cw0YHRgtGA0L7QudC60LgnLFxuXHQnMTQyMDAxMDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC00L7RiNC60L7Qu9GM0L3QvtCz0L4sINC90LDRh9Cw0LvRjNC90L7Qs9C+LCDQvtCx0YnQtdCz0L4g0Lgg0YHRgNC10LTQvdC10LPQviAo0L/QvtC70L3QvtCz0L4pINC+0LHRidC10LPQviDQvtCx0YDQsNC30L7QstCw0L3QuNGPJyxcblx0JzE0MjAwMTA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7Qsiwg0LTQvtC/0YPRgdGC0LjQvNGL0YUg0LIg0LbQuNC70YvRhSDQt9C+0L3QsNGFINC4INC90LUg0L/QtdGA0LXRh9C40YHQu9C10L3QvdGL0YUg0LIg0LrQu9Cw0YHRgdC40YTQuNC60LDRgtC+0YDQtScsXG5cdCcxNDIwMDIwMDAwMDAnOiAn0JTQu9GPINC+0LHRitC10LrRgtC+0LIg0L7QsdGJ0LXRgdGC0LLQtdC90L3Qvi3QtNC10LvQvtCy0L7Qs9C+INC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMTQyMDAyMDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGB0L7RhtC40LDQu9GM0L3QvtCz0L4g0Lgg0LrQvtC80LzRg9C90LDQu9GM0L3Qvi3QsdGL0YLQvtCy0L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzE0MjAwMjAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQt9C00YDQsNCy0L7QvtGF0YDQsNC90LXQvdC40Y8nLFxuXHQnMTQyMDAyMDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC60YPQu9GM0YLRg9GA0YsnLFxuXHQnMTQyMDAyMDQwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGC0L7RgNCz0L7QstC70LgnLFxuXHQnMTQyMDAyMDQwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGA0L7Qt9C90LjRh9C90L7QuSDRgtC+0YDQs9C+0LLQu9C4Jyxcblx0JzE0MjAwMjA0MDIwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQvtC/0YLQvtCy0L7QuSDRgtC+0YDQs9C+0LLQu9C4Jyxcblx0JzE0MjAwMjA1MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQvtCx0YnQtdGB0YLQstC10L3QvdC+0LPQviDQv9C40YLQsNC90LjRjycsXG5cdCcxNDIwMDIwNjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0L/RgNC10LTQv9GA0LjQvdC40LzQsNGC0LXQu9GM0YHQutC+0Lkg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4Jyxcblx0JzE0MjAwMjA3MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgdGA0LXQtNC90LXQs9C+INC/0YDQvtGE0LXRgdGB0LjQvtC90LDQu9GM0L3QvtCz0L4g0Lgg0LLRi9GB0YjQtdCz0L4g0L/RgNC+0YTQtdGB0YHQuNC+0L3QsNC70YzQvdC+0LPQviDQvtCx0YDQsNC30L7QstCw0L3QuNGPJyxcblx0JzE0MjAwMjA4MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LDQtNC80LjQvdC40YHRgtGA0LDRgtC40LLQvdGL0YUg0LfQtNCw0L3QuNC5Jyxcblx0JzE0MjAwMjA5MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L3QsNGD0YfQvdC+LdC40YHRgdC70LXQtNC+0LLQsNGC0LXQu9GM0YHQutC40YUg0YPRh9GA0LXQttC00LXQvdC40LknLFxuXHQnMTQyMDAyMTAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutGD0LvRjNGC0L7QstGL0YUg0LfQtNCw0L3QuNC5Jyxcblx0JzE0MjAwMjExMDAwMCc6ICfQlNC70Y8g0YHRgtC+0Y/QvdC+0Log0LDQstGC0L7QvNC+0LHQuNC70YzQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG5cdCcxNDIwMDIxMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LTQtdC70L7QstC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjywg0LIg0YLQvtC8INGH0LjRgdC70LUg0L7RhNC40YHQvdGL0YUg0YbQtdC90YLRgNC+0LInLFxuXHQnMTQyMDAyMTMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGE0LjQvdCw0L3RgdC+0LLQvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMTQyMDAyMTQwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQs9C+0YHRgtC40L3QuNGGJyxcblx0JzE0MjAwMjE1MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/QvtC00LfQtdC80L3Ri9GFINC40LvQuCDQvNC90L7Qs9C+0Y3RgtCw0LbQvdGL0YUg0LPQsNGA0LDQttC10LknLFxuXHQnMTQyMDAyMTYwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90LTQuNCy0LjQtNGD0LDQu9GM0L3Ri9GFINCz0LDRgNCw0LbQtdC5Jyxcblx0JzE0MjAwMjE3MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQvtCx0YnQtdGB0YLQstC10L3QvdC+LdC00LXQu9C+0LLQvtCz0L4g0LfQvdCw0YfQtdC90LjRjywg0L7QsdC10YHQv9C10YfQuNCy0LDRjtGJ0LjRhSDQttC40LfQvdGMINCz0YDQsNC20LTQsNC9Jyxcblx0JzE0MjAwMzAwMDAwMCc6ICfQlNC70Y8g0L7QsdGJ0LXQs9C+INC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8gKNGD0LvQuNGH0L3QsNGPINGB0LXRgtGMKScsXG5cdCcxNDIwMDQwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YHQv9C10YbQuNCw0LvRjNC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzE0MjAwNDAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LrQu9Cw0LTQsdC40YknLFxuXHQnMTQyMDA0MDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutGA0LXQvNCw0YLQvtGA0LjQtdCyJyxcblx0JzE0MjAwNDAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YHQutC+0YLQvtC80L7Qs9C40LvRjNC90LjQutC+0LInLFxuXHQnMTQyMDA0MDQwMDAwJzogJ9Cf0L7QtCDQvtCx0YrQtdC60YLQsNC80Lgg0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7RgtGF0L7QtNC+0LIg0L/QvtGC0YDQtdCx0LvQtdC90LjRjycsXG5cdCcxNDIwMDQwNTAwMDAnOiAn0J/QvtC0INC40L3Ri9C80Lgg0L7QsdGK0LXQutGC0LDQvNC4INGB0L/QtdGG0LjQsNC70YzQvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCcxNDIwMDUwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60L7QvNC80YPQvdCw0LvRjNC90YvRhSwg0YHQutC70LDQtNGB0LrQuNGFINC+0LHRitC10LrRgtC+0LInLFxuXHQnMTQyMDA2MDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC20LjQu9C40YnQvdC+LdC60L7QvNC80YPQvdCw0LvRjNC90L7Qs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG5cdCcxNDIwMDcwMDAwMDAnOiAn0JTQu9GPINC40L3Ri9GFINCy0LjQtNC+0LIg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8sINGF0LDRgNCw0LrRgtC10YDQvdGL0YUg0LTQu9GPINC90LDRgdC10LvRkdC90L3Ri9GFINC/0YPQvdC60YLQvtCyJyxcblx0JzE0MzAwMDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQv9GA0L7QvNGL0YjQu9C10L3QvdC+0YHRgtC4LCDRjdC90LXRgNCz0LXRgtC40LrQuCwg0YLRgNCw0L3RgdC/0L7RgNGC0LAsINGB0LLRj9C30LgsINGA0LDQtNC40L7QstC10YnQsNC90LjRjywg0YLQtdC70LXQstC40LTQtdC90LjRjywg0LjQvdGE0L7RgNC80LDRgtC40LrQuCwg0L7QsdC10YHQv9C10YfQtdC90LjRjyDQutC+0YHQvNC40YfQtdGB0LrQvtC5INC00LXRj9GC0LXQu9GM0L3QvtGB0YLQuCwg0L7QsdC+0YDQvtC90YssINCx0LXQt9C+0L/QsNGB0L3QvtGB0YLQuCDQuCDQuNC90L7Qs9C+INGB0L/QtdGG0LjQsNC70YzQvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCcxNDMwMDEwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0YDQvtC80YvRiNC70LXQvdC90YvRhSDQvtCx0YrQtdC60YLQvtCyJyxcblx0JzE0MzAwMTAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/RgNC+0LjQt9Cy0L7QtNGB0YLQstC10L3QvdGL0YUg0Lgg0LDQtNC80LjQvdC40YHRgtGA0LDRgtC40LLQvdGL0YUg0LfQtNCw0L3QuNC5LCDRgdGC0YDQvtC10L3QuNC5LCDRgdC+0L7RgNGD0LbQtdC90LjQuSDQuCDQvtCx0YHQu9GD0LbQuNCy0LDRjtGJ0LjRhSDQuNGFINC+0LHRitC10LrRgtC+0LInLFxuXHQnMTQzMDAxMDEwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9GA0L7QuNC30LLQvtC00YHRgtCy0LXQvdC90YvRhSDQt9C00LDQvdC40LknLFxuXHQnMTQzMDAxMDEwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutC+0LzQvNGD0L3QuNC60LDRhtC40LknLFxuXHQnMTQzMDAxMDEwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9C+0LTRitC10LfQtNC90YvRhSDQv9GD0YLQtdC5Jyxcblx0JzE0MzAwMTAxMDQwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YHQutC70LDQtNGB0LrQuNGFINC/0L7QvNC10YnQtdC90LjQuScsXG5cdCcxNDMwMDEwMTA1MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCw0LTQvNC40L3QuNGB0YLRgNCw0YLQuNCy0L3Ri9GFINC30LTQsNC90LjQuScsXG5cdCcxNDMwMDEwMTA2MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60YPQu9GM0YLRg9GA0L3Qvi3QsdGL0YLQvtCy0YvRhSDQt9C00LDQvdC40LknLFxuXHQnMTQzMDAxMDEwNzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDRgdC+0L7RgNGD0LbQtdC90LjQuSDQv9GA0L7QvNGL0YjQu9C10L3QvdC+0YHRgtC4Jyxcblx0JzE0MzAwMTAyMDAwMCc6ICfQlNC70Y8g0LTQvtCx0YvRh9C4INC4INGA0LDQt9GA0LDQsdC+0YLQutC4INC/0L7Qu9C10LfQvdGL0YUg0LjRgdC60L7Qv9Cw0LXQvNGL0YUnLFxuXHQnMTQzMDAxMDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC/0YDQvtC80YvRiNC70LXQvdC90L7RgdGC0LgnLFxuXHQnMTQzMDAyMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGN0L3QtdGA0LPQtdGC0LjQutC4Jyxcblx0JzE0MzAwMjAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0Y3Qu9C10LrRgtGA0L7RgdGC0LDQvdGG0LjQuSDQuCDQvtCx0YHQu9GD0LbQuNCy0LDRjtGJ0LjRhSDRgdC+0L7RgNGD0LbQtdC90LjQuSDQuCDQvtCx0YrQtdC60YLQvtCyJyxcblx0JzE0MzAwMjAxMDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LPQuNC00YDQvtGN0LvQtdC60YLRgNC+0YHRgtCw0L3RhtC40LknLFxuXHQnMTQzMDAyMDEwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsNGC0L7QvNC90YvRhSDRgdGC0LDQvdGG0LjQuScsXG5cdCcxNDMwMDIwMTAzMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGP0LTQtdGA0L3Ri9GFINGD0YHRgtCw0L3QvtCy0L7QuicsXG5cdCcxNDMwMDIwMTA0MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0YPQvdC60YLQvtCyINGF0YDQsNC90LXQvdC40Y8g0Y/QtNC10YDQvdGL0YUg0LzQsNGC0LXRgNC40LDQu9C+0LIg0Lgg0YDQsNC00LjQvtCw0LrRgtC40LLQvdGL0YUg0LLQtdGJ0LXRgdGC0LIg0Y3QvdC10YDQs9C10YLQuNC60LgnLFxuXHQnMTQzMDAyMDEwNTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRhdGA0LDQvdC40LvQuNGJINGA0LDQtNC40L7QsNC60YLQuNCy0L3Ri9GFINC+0YLRhdC+0LTQvtCyJyxcblx0JzE0MzAwMjAxMDYwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YLQtdC/0LvQvtCy0YvRhSDRgdGC0LDQvdGG0LjQuScsXG5cdCcxNDMwMDIwMTA3MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINGC0LjQv9C+0LIg0Y3Qu9C10LrRgtGA0L7RgdGC0LDQvdGG0LjQuScsXG5cdCcxNDMwMDIwMTA4MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRgdC70YPQttC40LLQsNGO0YnQuNGFINGB0L7QvtGA0YPQttC10L3QuNC5INC4INC+0LHRitC10LrRgtC+0LInLFxuXHQnMTQzMDAyMDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGN0LvQtdC60YLRgNC+0YHQtdGC0LXQstC+0LPQviDRhdC+0LfRj9C50YHRgtCy0LAnLFxuXHQnMTQzMDAyMDIwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQstC+0LfQtNGD0YjQvdGL0YUg0LvQuNC90LjQuSDRjdC70LXQutGC0YDQvtC/0LXRgNC10LTQsNGH0LgnLFxuXHQnMTQzMDAyMDIwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvdCw0LfQtdC80L3Ri9GFINGB0L7QvtGA0YPQttC10L3QuNC5INC60LDQsdC10LvRjNC90YvRhSDQu9C40L3QuNC5INGN0LvQtdC60YLRgNC+0L/QtdGA0LXQtNCw0YfQuCcsXG5cdCcxNDMwMDIwMjAzMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0L7QtNGB0YLQsNC90YbQuNC5Jyxcblx0JzE0MzAwMjAyMDQwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YDQsNGB0L/RgNC10LTQtdC70LjRgtC10LvRjNC90YvRhSDQv9GD0L3QutGC0L7QsicsXG5cdCcxNDMwMDIwMjA1MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC00YDRg9Cz0LjRhSDRgdC+0L7RgNGD0LbQtdC90LjQuSDQuCDQvtCx0YrQtdC60YLQvtCyINGN0LvQtdC60YLRgNC+0YHQtdGC0LXQstC+0LPQviDRhdC+0LfRj9C50YHRgtCy0LAnLFxuXHQnMTQzMDAyMDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINGN0L3QtdGA0LPQtdGC0LjQutC4Jyxcblx0JzE0MzAwMzAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG5cdCcxNDMwMDMwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC4INGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCDQvtCx0YrQtdC60YLQvtCyINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcblx0JzE0MzAwMzAxMDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3Ri9GFINC/0YPRgtC10Lkg0Lgg0LjRhSDQutC+0L3RgdGC0YDRg9C60YLQuNCy0L3Ri9GFINGN0LvQtdC80LXQvdGC0L7QsicsXG5cdCcxNDMwMDMwMTAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0L7Qu9C+0YEg0L7RgtCy0L7QtNCwINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90YvRhSDQv9GD0YLQtdC5Jyxcblx0JzE0MzAwMzAxMDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8sINGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCwg0YDQsNGB0YjQuNGA0LXQvdC40Y8g0Lgg0YDQtdC60L7QvdGB0YLRgNGD0LrRhtC40Lgg0YHRgtGA0L7QtdC90LjQuSwg0LfQtNCw0L3QuNC5LCDRgdC+0L7RgNGD0LbQtdC90LjQuSwg0LIg0YLQvtC8INGH0LjRgdC70LUg0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3Ri9GFINCy0L7QutC30LDQu9C+0LIsINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90YvRhSDRgdGC0LDQvdGG0LjQuSwg0LAg0YLQsNC60LbQtSDRg9GB0YLRgNC+0LnRgdGC0LIg0Lgg0LTRgNGD0LPQuNGFINC+0LHRitC10LrRgtC+0LIsINC90LXQvtCx0YXQvtC00LjQvNGL0YUg0LTQu9GPINGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCwg0YHQvtC00LXRgNC20LDQvdC40Y8sINGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwLCDRgNC10LrQvtC90YHRgtGA0YPQutGG0LjQuCwg0YDQtdC80L7QvdGC0LAsINGA0LDQt9Cy0LjRgtC40Y8g0L3QsNC30LXQvNC90YvRhSDQuCDQv9C+0LTQt9C10LzQvdGL0YUg0LfQtNCw0L3QuNC5LCDRgdGC0YDQvtC10L3QuNC5LCDRgdC+0L7RgNGD0LbQtdC90LjQuSwg0YPRgdGC0YDQvtC50YHRgtCyINC4INC00YDRg9Cz0LjRhSDQvtCx0YrQtdC60YLQvtCyINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcblx0JzE0MzAwMzAxMDMwMSc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3Ri9GFINCy0L7QutC30LDQu9C+0LInLFxuXHQnMTQzMDAzMDEwMzAyJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQttC10LvQtdC30L3QvtC00L7RgNC+0LbQvdGL0YUg0YHRgtCw0L3RhtC40LknLFxuXHQnMTQzMDAzMDEwMzAzJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRg9GB0YLRgNC+0LnRgdGC0LIg0Lgg0LTRgNGD0LPQuNGFINC+0LHRitC10LrRgtC+0LIsINC90LXQvtCx0YXQvtC00LjQvNGL0YUg0LTQu9GPINGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCwg0YHQvtC00LXRgNC20LDQvdC40Y8sINGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwLCDRgNC10LrQvtC90YHRgtGA0YPQutGG0LjQuCwg0YDQtdC80L7QvdGC0LAsINGA0LDQt9Cy0LjRgtC40Y8g0L3QsNC30LXQvNC90YvRhSDQuCDQv9C+0LTQt9C10LzQvdGL0YUg0LfQtNCw0L3QuNC5LCDRgdGC0YDQvtC10L3QuNC5LCDRgdC+0L7RgNGD0LbQtdC90LjQuSwg0YPRgdGC0YDQvtC50YHRgtCyINC4INC00YDRg9Cz0LjRhSDQvtCx0YrQtdC60YLQvtCyINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcblx0JzE0MzAwMzAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0Lgg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4INC+0LHRitC10LrRgtC+0LIg0LDQstGC0L7QvNC+0LHQuNC70YzQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCDQuCDQvtCx0YrQtdC60YLQvtCyINC00L7RgNC+0LbQvdC+0LPQviDRhdC+0LfRj9C50YHRgtCy0LAnLFxuXHQnMTQzMDAzMDIwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsNCy0YLQvtC80L7QsdC40LvRjNC90YvRhSDQtNC+0YDQvtCzINC4INC40YUg0LrQvtC90YHRgtGA0YPQutGC0LjQstC90YvRhSDRjdC70LXQvNC10L3RgtC+0LInLFxuXHQnMTQzMDAzMDIwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9C+0LvQvtGBINC+0YLQstC+0LTQsCcsXG5cdCcxNDMwMDMwMjAzMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LTQvtGA0L7QttC90L7Qs9C+INGB0LXRgNCy0LjRgdCwINCyINC/0L7Qu9C+0YHQsNGFINC+0YLQstC+0LTQsCDQsNCy0YLQvtC80L7QsdC40LvRjNC90YvRhSDQtNC+0YDQvtCzJyxcblx0JzE0MzAwMzAyMDQwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LTQvtGA0L7QttC90YvRhSDRgdC+0L7RgNGD0LbQtdC90LjQuScsXG5cdCcxNDMwMDMwMjA1MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCw0LLRgtC+0LLQvtC60LfQsNC70L7QsiDQuCDQsNCy0YLQvtGB0YLQsNC90YbQuNC5Jyxcblx0JzE0MzAwMzAyMDYwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQsNCy0YLQvtC80L7QsdC40LvRjNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwINC4INC00L7RgNC+0LbQvdC+0LPQviDRhdC+0LfRj9C50YHRgtCy0LAnLFxuXHQnMTQzMDAzMDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuCDRjdC60YHQv9C70YPQsNGC0LDRhtC40Lgg0L7QsdGK0LXQutGC0L7QsiDQvNC+0YDRgdC60L7Qs9C+LCDQstC90YPRgtGA0LXQvdC90LXQs9C+INCy0L7QtNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcblx0JzE0MzAwMzAzMDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjRgdC60YPRgdGB0YLQstC10L3QvdC+INGB0L7Qt9C00LDQvdC90YvRhSDQstC90YPRgtGA0LXQvdC90LjRhSDQstC+0LTQvdGL0YUg0L/Rg9GC0LXQuScsXG5cdCcxNDMwMDMwMzAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC80L7RgNGB0LrQuNGFINC4INGA0LXRh9C90YvRhSDQv9C+0YDRgtC+0LIsINC/0YDQuNGH0LDQu9C+0LIsINC/0YDQuNGB0YLQsNC90LXQuScsXG5cdCcxNDMwMDMwMzAzMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0LzQvtGA0YHQutC+0LPQviwg0LLQvdGD0YLRgNC10L3QvdC10LPQviDQstC+0LTQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG5cdCcxNDMwMDMwMzA0MDAnOiAn0JTQu9GPINCy0YvQtNC10LvQtdC90LjRjyDQsdC10YDQtdCz0L7QstC+0Lkg0L/QvtC70L7RgdGLJyxcblx0JzE0MzAwMzA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0Lgg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4INC+0LHRitC10LrRgtC+0LIg0LLQvtC30LTRg9GI0L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuXHQnMTQzMDAzMDQwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsNGN0YDQvtC/0L7RgNGC0L7QsiDQuCDQsNGN0YDQvtC00YDQvtC80L7QsicsXG5cdCcxNDMwMDMwNDAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCw0Y3RgNC+0LLQvtC60LfQsNC70L7QsicsXG5cdCcxNDMwMDMwNDAzMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCy0LfQu9C10YLQvdC+LdC/0L7RgdCw0LTQvtGH0L3Ri9GFINC/0L7Qu9C+0YEnLFxuXHQnMTQzMDAzMDQwNDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvdCw0LfQtdC80L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0LLQvtC30LTRg9GI0L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuXHQnMTQzMDAzMDUwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuCDRjdC60YHQv9C70YPQsNGC0LDRhtC40Lgg0L7QsdGK0LXQutGC0L7QsiDRgtGA0YPQsdC+0L/RgNC+0LLQvtC00L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuXHQnMTQzMDAzMDUwMTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvdC10YTRgtC10L/RgNC+0LLQvtC00L7QsicsXG5cdCcxNDMwMDMwNTAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCz0LDQt9C+0L/RgNC+0LLQvtC00L7QsicsXG5cdCcxNDMwMDMwNTAzMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINGC0YDRg9Cx0L7Qv9GA0L7QstC+0LTQvtCyJyxcblx0JzE0MzAwMzA1MDQwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDRgtGA0YPQsdC+0L/RgNC+0LLQvtC00L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuXHQnMTQzMDAzMDYwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuCDRjdC60YHQv9C70YPQsNGC0LDRhtC40Lgg0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG5cdCcxNDMwMDQwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YHQstGP0LfQuCwg0YDQsNC00LjQvtCy0LXRidCw0L3QuNGPLCDRgtC10LvQtdCy0LjQtNC10L3QuNGPLCDQuNC90YTQvtGA0LzQsNGC0LjQutC4Jyxcblx0JzE0MzAwNDAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC+0L3QvdGL0YUg0L/RgNC10LTQv9GA0LjRj9GC0LjQuSDRgdCy0Y/Qt9C4INC4INC+0LHRgdC70YPQttC40LLQsNC90LjRjyDQu9C40L3QuNC5INGB0LLRj9C30LgnLFxuXHQnMTQzMDA0MDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutCw0LHQtdC70YzQvdGL0YUsINGA0LDQtNC40L7RgNC10LvQtdC50L3Ri9GFINC4INCy0L7Qt9C00YPRiNC90YvRhSDQu9C40L3QuNC5INGB0LLRj9C30Lgg0Lgg0LvQuNC90LjQuSDRgNCw0LTQuNC+0YTQuNC60LDRhtC40Lgg0L3QsCDRgtGA0LDRgdGB0LDRhSDQutCw0LHQtdC70YzQvdGL0YUg0Lgg0LLQvtC30LTRg9GI0L3Ri9GFINC70LjQvdC40Lkg0YHQstGP0LfQuCDQuCDRgNCw0LTQuNC+0YTQuNC60LDRhtC40Lgg0Lgg0LjRhSDQvtGF0YDQsNC90L3Ri9C1INC30L7QvdGLJyxcblx0JzE0MzAwNDAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/QvtC00LfQtdC80L3Ri9GFINC60LDQsdC10LvRjNC90YvRhSDQuCDQstC+0LfQtNGD0YjQvdGL0YUg0LvQuNC90LjQuSDRgdCy0Y/Qt9C4INC4INGA0LDQtNC40L7RhNC40LrQsNGG0LjQuCDQuCDQuNGFINC+0YXRgNCw0L3QvdGL0LUg0LfQvtC90YsnLFxuXHQnMTQzMDA0MDQwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvdCw0LfQtdC80L3Ri9GFINC4INC/0L7QtNC30LXQvNC90YvRhSDQvdC10L7QsdGB0LvRg9C20LjQstCw0LXQvNGL0YUg0YPRgdC40LvQuNGC0LXQu9GM0L3Ri9GFINC/0YPQvdC60YLQvtCyINC90LAg0LrQsNCx0LXQu9GM0L3Ri9GFINC70LjQvdC40Y/RhSDRgdCy0Y/Qt9C4INC4INC40YUg0L7RhdGA0LDQvdC90YvQtSDQt9C+0L3RiycsXG5cdCcxNDMwMDQwNTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC90LDQt9C10LzQvdGL0YUg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0LjQvdGE0YDQsNGB0YLRgNGD0LrRgtGD0YAg0YHQv9GD0YLQvdC40LrQvtCy0L7QuSDRgdCy0Y/Qt9C4Jyxcblx0JzE0MzAwNDA2MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDRgdCy0Y/Qt9C4LCDRgNCw0LTQuNC+0LLQtdGJ0LDQvdC40Y8sINGC0LXQu9C10LLQuNC00LXQvdC40Y8sINC40L3RhNC+0YDQvNCw0YLQuNC60LgnLFxuXHQnMTQzMDA1MDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyLCDQv9GA0LXQtNC90LDQt9C90LDRh9C10L3QvdGL0YUg0LTQu9GPINC+0LHQtdGB0L/QtdGH0LXQvdC40Y8g0LrQvtGB0LzQuNGH0LXRgdC60L7QuSDQtNC10Y/RgtC10LvRjNC90L7RgdGC0LgnLFxuXHQnMTQzMDA1MDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutC+0YHQvNC+0LTRgNC+0LzQvtCyLCDRgdGC0LDRgNGC0L7QstGL0YUg0LrQvtC80L/Qu9C10LrRgdC+0LIg0Lgg0L/Rg9GB0LrQvtCy0YvRhSDRg9GB0YLQsNC90L7QstC+0LonLFxuXHQnMTQzMDA1MDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutC+0LzQsNC90LTQvdC+LdC40LfQvNC10YDQuNGC0LXQu9GM0L3Ri9GFINC60L7QvNC/0LvQtdC60YHQvtCyLCDRhtC10L3RgtGA0L7QsiDQuCDQv9GD0L3QutGC0L7QsiDRg9C/0YDQsNCy0LvQtdC90LjRjyDQv9C+0LvQtdGC0LDQvNC4INC60L7RgdC80LjRh9C10YHQutC40YUg0L7QsdGK0LXQutGC0L7Qsiwg0L/RgNC40LXQvNCwLCDRhdGA0LDQvdC10L3QuNGPINC4INC/0LXRgNC10YDQsNCx0L7RgtC60Lgg0LjQvdGE0L7RgNC80LDRhtC40LgnLFxuXHQnMTQzMDA1MDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsdCw0Lcg0YXRgNCw0L3QtdC90LjRjyDQutC+0YHQvNC40YfQtdGB0LrQvtC5INGC0LXRhdC90LjQutC4Jyxcblx0JzE0MzAwNTA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/QvtC70LjQs9C+0L3QvtCyINC/0YDQuNC30LXQvNC70LXQvdC40Y8g0LrQvtGB0LzQuNGH0LXRgdC60LjRhSDQvtCx0YrQtdC60YLQvtCyINC4INCy0LfQu9C10YLQvdC+LdC/0L7RgdCw0LTQvtGH0L3Ri9GFINC/0L7Qu9C+0YEnLFxuXHQnMTQzMDA1MDUwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGN0LrRgdC/0LXRgNC40LzQtdC90YLQsNC70YzQvdC+0Lkg0LHQsNC30Ysg0LTQu9GPINC+0YLRgNCw0LHQvtGC0LrQuCDQutC+0YHQvNC40YfQtdGB0LrQvtC5INGC0LXRhdC90LjQutC4Jyxcblx0JzE0MzAwNTA2MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YbQtdC90YLRgNC+0LIg0Lgg0L7QsdC+0YDRg9C00L7QstCw0L3QuNGPINC00LvRjyDQv9C+0LTQs9C+0YLQvtCy0LrQuCDQutC+0YHQvNC+0L3QsNCy0YLQvtCyJyxcblx0JzE0MzAwNTA3MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LTRgNGD0LPQuNGFINC90LDQt9C10LzQvdGL0YUg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0YLQtdGF0L3QuNC60LgsINC40YHQv9C+0LvRjNC30YPQtdC80YvRhSDQv9GA0Lgg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40Lgg0LrQvtGB0LzQuNGH0LXRgdC60L7QuSDQtNC10Y/RgtC10LvRjNC90L7RgdGC0LgnLFxuXHQnMTQzMDA2MDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyLCDQv9GA0LXQtNC90LDQt9C90LDRh9C10L3QvdGL0YUg0LTQu9GPINC+0LHQtdGB0L/QtdGH0LXQvdC40Y8g0L7QsdC+0YDQvtC90Ysg0Lgg0LHQtdC30L7Qv9Cw0YHQvdC+0YHRgtC4Jyxcblx0JzE0MzAwNjAxMDAwMCc6ICfQlNC70Y8g0L7QsdC10YHQv9C10YfQtdC90LjRjyDQt9Cw0LTQsNGHINC+0LHQvtGA0L7QvdGLJyxcblx0JzE0MzAwNjAxMDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LLQvtC10L3QvdGL0YUg0L7RgNCz0LDQvdC40LfQsNGG0LjQuSwg0YPRh9GA0LXQttC00LXQvdC40Lkg0Lgg0LTRgNGD0LPQuNGFINC+0LHRitC10LrRgtC+0LInLFxuXHQnMTQzMDA2MDEwMjAwJzogJ9CU0LvRjyDQtNC40YHQu9C+0LrQsNGG0LjQuCDQstC+0LnRgdC6INC4INGB0LjQuyDRhNC70L7RgtCwJyxcblx0JzE0MzAwNjAxMDMwMCc6ICfQlNC70Y8g0L/RgNC+0LLQtdC00LXQvdC40Y8g0YPRh9C10L3QuNC5INC4INC40L3Ri9GFINC80LXRgNC+0L/RgNC40Y/RgtC40LknLFxuXHQnMTQzMDA2MDEwNDAwJzogJ9CU0LvRjyDQuNGB0L/Ri9GC0LDRgtC10LvRjNC90YvRhSDQv9C+0LvQuNCz0L7QvdC+0LInLFxuXHQnMTQzMDA2MDEwNTAwJzogJ9CU0LvRjyDQvNC10YHRgiDRg9C90LjRh9GC0L7QttC10L3QuNGPINC+0YDRg9C20LjRjyDQuCDQt9Cw0YXQvtGA0L7QvdC10L3QuNGPINC+0YLRhdC+0LTQvtCyJyxcblx0JzE0MzAwNjAxMDYwMCc6ICfQlNC70Y8g0YHQvtC30LTQsNC90LjRjyDQt9Cw0L/QsNGB0L7QsiDQvNCw0YLQtdGA0LjQsNC70YzQvdGL0YUg0YbQtdC90L3QvtGB0YLQtdC5INCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDQuCDQvNC+0LHQuNC70LjQt9Cw0YbQuNC+0L3QvdC+0Lwg0YDQtdC30LXRgNCy0LDRhSAo0YXRgNCw0L3QuNC70LjRidCwLCDRgdC60LvQsNC00Ysg0Lgg0LTRgNGD0LPQuNC1KScsXG5cdCcxNDMwMDYwMTA3MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0L7QsdC+0YDQvtC90YsnLFxuXHQnMTQzMDA2MDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyICjRgtC10YDRgNC40YLQvtGA0LjQuSksINC+0LHQtdGB0L/QtdGH0LjQstCw0Y7RidC40YUg0LfQsNGJ0LjRgtGDINC4INC+0YXRgNCw0L3RgyDQk9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LPRgNCw0L3QuNGG0Ysg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzE0MzAwNjAyMDEwMCc6ICfQlNC70Y8g0L7QsdGD0YHRgtGA0L7QudGB0YLQstCwINC4INGB0L7QtNC10YDQttCw0L3QuNGPINC40L3QttC10L3QtdGA0L3Qvi3RgtC10YXQvdC40YfQtdGB0LrQuNGFINGB0L7QvtGA0YPQttC10L3QuNC5INC4INC30LDQs9GA0LDQttC00LXQvdC40LknLFxuXHQnMTQzMDA2MDIwMjAwJzogJ9CU0LvRjyDQvtCx0YPRgdGC0YDQvtC50YHRgtCy0LAg0Lgg0YHQvtC00LXRgNC20LDQvdC40Y8g0L/QvtCz0YDQsNC90LjRh9C90YvRhSDQt9C90LDQutC+0LInLFxuXHQnMTQzMDA2MDIwMzAwJzogJ9CU0LvRjyDQvtCx0YPRgdGC0YDQvtC50YHRgtCy0LAg0Lgg0YHQvtC00LXRgNC20LDQvdC40Y8g0L/QvtCz0YDQsNC90LjRh9C90YvRhSDQv9GA0L7RgdC10LonLFxuXHQnMTQzMDA2MDIwNDAwJzogJ9CU0LvRjyDQvtCx0YPRgdGC0YDQvtC50YHRgtCy0LAg0Lgg0YHQvtC00LXRgNC20LDQvdC40Y8g0LrQvtC80LzRg9C90LjQutCw0YbQuNC5Jyxcblx0JzE0MzAwNjAyMDUwMCc6ICfQlNC70Y8g0L7QsdGD0YHRgtGA0L7QudGB0YLQstCwINC4INGB0L7QtNC10YDQttCw0L3QuNGPINC/0YPQvdC60YLQvtCyINC/0YDQvtC/0YPRgdC60LAg0YfQtdGA0LXQtyDQk9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGD0Y4g0LPRgNCw0L3QuNGG0YMg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzE0MzAwNjAyMDYwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQtNC70Y8g0LfQsNGJ0LjRgtGLINC4INC+0YXRgNCw0L3RiyDQk9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LPRgNCw0L3QuNGG0Ysg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzE0MzAwNjAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQvtCx0L7RgNC+0L3RiyDQuCDQsdC10LfQvtC/0LDRgdC90L7RgdGC0LgnLFxuXHQnMTQzMDA3MDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC/0YDQvtC80YvRiNC70LXQvdC90L7RgdGC0LgsINGN0L3QtdGA0LPQtdGC0LjQutC4LCDRgtGA0LDQvdGB0L/QvtGA0YLQsCwg0YHQstGP0LfQuCwg0YDQsNC00LjQvtCy0LXRidCw0L3QuNGPLCDRgtC10LvQtdCy0LjQtNC10L3QuNGPLCDQuNC90YTQvtGA0LzQsNGC0LjQutC4LCDQvtCx0LXRgdC/0LXRh9C10L3QuNGPINC60L7RgdC80LjRh9C10YHQutC+0Lkg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4LCDQvtCx0L7RgNC+0L3Riywg0LHQtdC30L7Qv9Cw0YHQvdC+0YHRgtC4INC4INC40L3QvtCz0L4g0YHQv9C10YbQuNCw0LvRjNC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzE0NDAwMDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80YvRhSDQuNGB0YLQvtGA0LjQutC+LdC60YPQu9GM0YLRg9GA0L3Ri9GFINC4INC/0YDQuNGA0L7QtNC90YvRhSDQvtCx0YrQtdC60YLQvtCyICjRgtC10YDRgNC40YLQvtGA0LjQuSknLFxuXHQnMTQ0MDAxMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtGB0L7QsdC+INC+0YXRgNCw0L3Rj9C10LzRi9GFINC/0YDQuNGA0L7QtNC90YvRhSDQvtCx0YrQtdC60YLQvtCyICjRgtC10YDRgNC40YLQvtGA0LjQuSknLFxuXHQnMTQ0MDAxMDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0YUg0L/RgNC40YDQvtC00L3Ri9GFINC30LDQv9C+0LLQtdC00L3QuNC60L7QsiAo0LIg0YLQvtC8INGH0LjRgdC70LUg0LHQuNC+0YHRhNC10YDQvdGL0YUpJyxcblx0JzE0NDAwMTAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9GFINC/0YDQuNGA0L7QtNC90YvRhSDQt9Cw0LrQsNC30L3QuNC60L7QsicsXG5cdCcxNDQwMDEwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC90LDRhtC40L7QvdCw0LvRjNC90YvRhSDQv9Cw0YDQutC+0LInLFxuXHQnMTQ0MDAxMDQwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9GA0LjRgNC+0LTQvdGL0YUg0L/QsNGA0LrQvtCyJyxcblx0JzE0NDAwMTA1MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LTQtdC90LTRgNC+0LvQvtCz0LjRh9C10YHQutC40YUg0L/QsNGA0LrQvtCyJyxcblx0JzE0NDAwMTA2MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LHQvtGC0LDQvdC40YfQtdGB0LrQuNGFINGB0LDQtNC+0LInLFxuXHQnMTQ0MDAxMDcwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGB0LDQvdCw0YLQvtGA0L3QvtCz0L4g0Lgg0LrRg9GA0L7RgNGC0L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMTQ0MDAxMDgwMDAwJzogJ9Ci0LXRgNGA0LjRgtC+0YDQuNC4INC80LXRgdGC0L7RgNC+0LbQtNC10L3QuNC5INC80LjQvdC10YDQsNC70YzQvdGL0YUg0LLQvtC0LCDQu9C10YfQtdCx0L3Ri9GFINCz0YDRj9C30LXQuSwg0YDQsNC/0Ysg0LvQuNC80LDQvdC+0LIg0Lgg0L7Qt9C10YAnLFxuXHQnMTQ0MDAxMDkwMDAwJzogJ9CU0LvRjyDRgtGA0LDQtNC40YbQuNC+0L3QvdC+0LPQviDQv9GA0LjRgNC+0LTQvtC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8nLFxuXHQnMTQ0MDAxMTAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtGB0L7QsdC+INC+0YXRgNCw0L3Rj9C10LzRi9GFINC/0YDQuNGA0L7QtNC90YvRhSDRgtC10YDRgNC40YLQvtGA0LjQuSAo0L7QsdGK0LXQutGC0L7QsiknLFxuXHQnMTQ0MDAyMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyICjRgtC10YDRgNC40YLQvtGA0LjQuSkg0L/RgNC40YDQvtC00L7QvtGF0YDQsNC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMTQ0MDAzMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyICjRgtC10YDRgNC40YLQvtGA0LjQuSkg0YDQtdC60YDQtdCw0YbQuNC+0L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCcxNDQwMDMwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC00L7QvNC+0LIg0L7RgtC00YvRhdCwLCDQv9Cw0L3RgdC40L7QvdCw0YLQvtCyLCDQutC10LzQv9C40L3Qs9C+0LInLFxuXHQnMTQ0MDAzMDIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGE0LjQt9C40YfQtdGB0LrQvtC5INC60YPQu9GM0YLRg9GA0Ysg0Lgg0YHQv9C+0YDRgtCwJyxcblx0JzE0NDAwMzAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YLRg9GA0LjRgdGC0LjRh9C10YHQutC40YUg0LHQsNC3LCDRgdGC0LDRhtC40L7QvdCw0YDQvdGL0YUg0Lgg0L/QsNC70LDRgtC+0YfQvdGL0YUg0YLRg9GA0LjRgdGC0YHQutC+LdC+0LfQtNC+0YDQvtCy0LjRgtC10LvRjNC90YvRhSDQu9Cw0LPQtdGA0LXQuSwg0LTQvtC80L7QsiDRgNGL0LHQvtC70L7QstCwINC4INC+0YXQvtGC0L3QuNC60LAsINC00LXRgtGB0LrQuNGFINGC0YPRgNC40YHRgtC40YfQtdGB0LrQuNGFINGB0YLQsNC90YbQuNC5Jyxcblx0JzE0NDAwMzA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YLRg9GA0LjRgdGC0LjRh9C10YHQutC40YUg0L/QsNGA0LrQvtCyJyxcblx0JzE0NDAwMzA1MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LvQtdGB0L7Qv9Cw0YDQutC+0LInLFxuXHQnMTQ0MDAzMDYwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRg9GH0LXQsdC90L4t0YLRg9GA0LjRgdGC0LjRh9C10YHQutC40YUg0YLRgNC+0L8g0Lgg0YLRgNCw0YHRgScsXG5cdCcxNDQwMDMwNzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC00LXRgtGB0LrQuNGFINC4INGB0L/QvtGA0YLQuNCy0L3Ri9GFINC70LDQs9C10YDQtdC5Jyxcblx0JzE0NDAwMzA4MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YHQutCy0LXRgNC+0LIsINC/0LDRgNC60L7Qsiwg0LPQvtGA0L7QtNGB0LrQuNGFINGB0LDQtNC+0LInLFxuXHQnMTQ0MDAzMDkwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9C70Y/QttC10LknLFxuXHQnMTQ0MDAzMTAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyICjRgtC10YDRgNC40YLQvtGA0LjQuSkg0YDQtdC60YDQtdCw0YbQuNC+0L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCcxNDQwMDQwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LjRgdGC0L7RgNC40LrQvi3QutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzE0NDAwNDAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8g0L3QsNGA0L7QtNC+0LIg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4ICjQv9Cw0LzRj9GC0L3QuNC60L7QsiDQuNGB0YLQvtGA0LjQuCDQuCDQutGD0LvRjNGC0YPRgNGLKSwg0LIg0YLQvtC8INGH0LjRgdC70LUg0L7QsdGK0LXQutGC0L7QsiDQsNGA0YXQtdC+0LvQvtCz0LjRh9C10YHQutC+0LPQviDQvdCw0YHQu9C10LTQuNGPJyxcblx0JzE0NDAwNDAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LLQvtC10L3QvdGL0YUg0Lgg0LPRgNCw0LbQtNCw0L3RgdC60LjRhSDQt9Cw0YXQvtGA0L7QvdC10L3QuNC5Jyxcblx0JzE0NDAwNTAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80YvRhSDQuNGB0YLQvtGA0LjQutC+LdC60YPQu9GM0YLRg9GA0L3Ri9GFINC4INC/0YDQuNGA0L7QtNC90YvRhSDQvtCx0YrQtdC60YLQvtCyICjRgtC10YDRgNC40YLQvtGA0LjQuSknLFxuXHQnMTQ1MDAwMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC70LXRgdC90L7Qs9C+INGE0L7QvdC00LAnLFxuXHQnMTQ1MDAxMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQu9C10YHQvdC+0Lkg0YDQsNGB0YLQuNGC0LXQu9GM0L3QvtGB0YLQuCcsXG5cdCcxNDUwMDIwMDAwMDAnOiAn0JTQu9GPINCy0L7RgdGB0YLQsNC90L7QstC70LXQvdC40Y8g0LvQtdGB0L3QvtC5INGA0LDRgdGC0LjRgtC10LvRjNC90L7RgdGC0LgnLFxuXHQnMTQ1MDAzMDAwMDAwJzogJ9CU0LvRjyDQv9GA0L7Rh9C40YUg0L7QsdGK0LXQutGC0L7QsiDQu9C10YHQvdC+0LPQviDRhdC+0LfRj9C50YHRgtCy0LAnLFxuXHQnMTQ2MDAwMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINCy0L7QtNC90L7Qs9C+INGE0L7QvdC00LAnLFxuXHQnMTQ2MDAxMDAwMDAwJzogJ9Cf0L7QtCDQstC+0LTQvdGL0LzQuCDQvtCx0YrQtdC60YLQsNC80LgnLFxuXHQnMTQ2MDAyMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQs9C40LTRgNC+0YLQtdGF0L3QuNGH0LXRgdC60LjRhSDRgdC+0L7RgNGD0LbQtdC90LjQuScsXG5cdCcxNDYwMDMwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINGB0L7QvtGA0YPQttC10L3QuNC5LCDRgNCw0YHQv9C+0LvQvtC20LXQvdC90YvRhSDQvdCwINCy0L7QtNC90YvRhSDQvtCx0YrQtdC60YLQsNGFJyxcblx0JzE0NzAwMDAwMDAwMCc6ICfQl9C10LzQu9C4INC30LDQv9Cw0YHQsCAo0L3QtdC40YHQv9C+0LvRjNC30YPQtdC80YvQtSknXG59O1xuLy8g0J3QsNC30L3QsNGH0LXQvdC40LUg0LfQtNCw0L3QuNC5XG52YXIgZEFzc0J1aWxkaW5nID0ge1xuXHQnMjA0MDAxMDAwMDAwJzogJ9Cd0LXQttC40LvQvtC1INC30LTQsNC90LjQtScsXG5cdCcyMDQwMDIwMDAwMDAnOiAn0JbQuNC70L7QuSDQtNC+0LwnLFxuXHQnMjA0MDAzMDAwMDAwJzogJ9Cc0L3QvtCz0L7QutCy0LDRgNGC0LjRgNC90YvQuSDQtNC+0LwnXG59O1xuXG52YXIgUGFyY2VsUHJvcGVydGllcztcbnZhciBDb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzO1xudmFyIFVuY29tcGxldGVkUHJvcGVydGllcztcbnZhciBCdWlsZGluZ1Byb3BlcnRpZXM7XG52YXIgWm9uZVByb3BlcnRpZXM7XG52YXIgQm91bmRQcm9wZXJ0aWVzO1xuXG5mdW5jdGlvbiBnZXRWYWx1ZUZyb21EaWN0KEtleSwgRGljKSB7XG4gICAgZm9yICh2YXIgayBpbiBEaWMpIHtcbiAgICAgICAgaWYgKGsgPT09IEtleSkge1xuICAgICAgICAgICAgcmV0dXJuIERpY1trXTtcbiAgICAgICAgfVxuICAgIH1cbn1cblxubW9kdWxlLmV4cG9ydHMuZ2V0UHJvcGVydGllcyA9IGZ1bmN0aW9uIChGZWF0dXJlLCBGZWF0dXJlVHlwZSkge1xuICAgIHN3aXRjaCAoRmVhdHVyZVR5cGUpIHtcbiAgICAgICAgY2FzZSAnUGFyY2VsJyA6XG4gICAgICAgIHtcbiAgICAgICAgICAgIFBhcmNlbFByb3BlcnRpZXMgPSB7XG4gICAgICAgICAgICAgICAgXCLQmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC90L7QvNC10YBcIjogJycsIC8vIHJlcXVpcmVcbiAgICAgICAgICAgICAgICBcItCh0YLQsNGC0YPRgVwiOiAnMDEnLCAvLyBkU3RhdGVzIHJlcXVpcmVcbiAgICAgICAgICAgICAgICBcItCU0LDRgtCwINGB0L7Qt9C00LDQvdC40Y9cIjogJycsXG4gICAgICAgICAgICAgICAgXCLQotC40L8g0L7QsdGK0LXQutGC0LBcIjogJycsIC8vZFBhcmNlbHMgcmVxdWlyZVxuICAgICAgICAgICAgICAgIFwi0JrQsNGC0LXQs9C+0YDQuNGPINC30LXQvNC10LvRjFwiOiAnJywgLy8gZENhdGVnb3JpZXMgLy8gcmVxdWlyZVxuICAgICAgICAgICAgICAgIFwi0J/Qu9C+0YnQsNC00YxcIjogey8vIHJlcXVyZVxuICAgICAgICAgICAgICAgICAgICBcItCX0L3QsNGH0LXQvdC40LVcIjogMCwgLy8gcmVxdWlyZVxuICAgICAgICAgICAgICAgICAgICBcItC10LQu0LjQt9C8XCI6ICcnLCAvL2RVbml0IHJlcXVpcmVcbiAgICAgICAgICAgICAgICAgICAgXCLQotC+0YfQvdC+0YHRgtGMXCI6ICcnIC8vIGQyMF8yXG4gICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBcItCg0LDQt9GA0LXRiNGR0L3QvdC+0LUg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40LVcIjogey8vIHJlcXVpcmVcbiAgICAgICAgICAgICAgICAgICAgXCLQv9C+INC00L7QutGD0LzQtdC90YLRg1wiOiAnJyxcbiAgICAgICAgICAgICAgICAgICAgXCLQv9C+INGB0L/RgNCw0LLQvtGH0L3QuNC60YNcIjogJycgLy8gZFV0aWxpemF0aW9uIHJlcXVpcmVcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9O1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllc1tcItCa0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L3QvtC80LXRgFwiXSA9IEZlYXR1cmUuQ2FkYXN0cmFsTnVtYmVyO1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllc1tcItCh0YLQsNGC0YPRgVwiXSA9IGdldFZhbHVlRnJvbURpY3QoRmVhdHVyZS5TdGF0ZSwgZFN0YXRlcyk7XG4gICAgICAgICAgICBQYXJjZWxQcm9wZXJ0aWVzW1wi0KLQuNC/INC+0LHRitC10LrRgtCwXCJdID0gZ2V0VmFsdWVGcm9tRGljdChGZWF0dXJlLk5hbWUsIGRQYXJjZWxzKTtcbiAgICAgICAgICAgIFBhcmNlbFByb3BlcnRpZXNbXCLQmtCw0YLQtdCz0L7RgNC40Y8g0LfQtdC80LXQu9GMXCJdID0gZ2V0VmFsdWVGcm9tRGljdChGZWF0dXJlLkNhdGVnb3J5LCBkQ2F0ZWdvcmllcyk7XG4gICAgICAgICAgICBQYXJjZWxQcm9wZXJ0aWVzW1wi0JTQsNGC0LAg0YHQvtC30LTQsNC90LjRj1wiXSA9IEZlYXR1cmUuRGF0ZUNyZWF0ZWQ7XG4gICAgICAgICAgICBQYXJjZWxQcm9wZXJ0aWVzW1wi0KDQsNC30YDQtdGI0ZHQvdC90L7QtSDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjQtVwiXVtcItC/0L4g0YHQv9GA0LDQstC+0YfQvdC40LrRg1wiXSA9IFxuICAgICAgICAgICAgICAgICAgICBnZXRWYWx1ZUZyb21EaWN0KEZlYXR1cmUuVXRpbGl6YXRpb24uVXRpbGl6YXRpb24sIGRVdGlsaXphdGlvbnMpO1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllc1tcItCg0LDQt9GA0LXRiNGR0L3QvdC+0LUg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40LVcIl1bXCLQv9C+INC00L7QutGD0LzQtdC90YLRg1wiXSA9IEZlYXR1cmUuVXRpbGl6YXRpb24uQnlEb2M7XG4gICAgICAgICAgICBicmVhaztcbiAgICAgICAgfVxuICAgICAgICBjYXNlICdDb25zdHJ1Y3Rpb24nOntcbiAgICAgICAgICAgIENvbnN0cnVjdGlvblByb3BlcnRpZXMgPSB7XG4gICAgICAgICAgICAgICAgY2FkYXN0cmVOdW1iZXI6ICcnLCAvLyBcbiAgICAgICAgICAgICAgICBPYmplY3RUeXBlOiAnJywgLy8gcmVxdWlyZVxuICAgICAgICAgICAgICAgIEFzc2lnbmF0aW9uTmFtZTogJycsXG4gICAgICAgICAgICAgICAgQWRkcmVzczoge1xuICAgICAgICAgICAgICAgICAgICBOb3RlOiAnJ1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH07XG4gICAgICAgICAgICBpZiAoRmVhdHVyZS5DYWRhc3RyYWxOdW1iZXIpIHtcbiAgICAgICAgICAgICAgICBDb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyID0gRmVhdHVyZS5DYWRhc3RyYWxOdW1iZXI7XG4gICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgIENvbnN0cnVjdGlvblByb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIgPSAnJztcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIFxuICAgICAgICAgICAgQ29uc3RydWN0aW9uUHJvcGVydGllcy5Bc3NpZ25hdGlvbk5hbWUgPSBGZWF0dXJlLkFzc2lnbmF0aW9uTmFtZTtcbiAgICAgICAgICAgIENvbnN0cnVjdGlvblByb3BlcnRpZXMuT2JqZWN0VHlwZSA9IGdldFZhbHVlRnJvbURpY3QoRmVhdHVyZS5PYmplY3RUeXBlLCBkWm9uZSk7XG4gICAgICAgICAgICBDb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzW1wiQWRkcmVzc1wiXVtcIk5vdGVcIl0gPSBGZWF0dXJlLkFkZHJlc3MuTm90ZTtcbiAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICB9XG4gICAgICAgIGNhc2UgJ0J1aWxkaW5nJzp7XG4gICAgICAgICAgICBCdWlsZGluZ1Byb3BlcnRpZXMgPSB7XG4gICAgICAgICAgICAgICAgY2FkYXN0cmVOdW1iZXI6ICcnLCAvLyBcbiAgICAgICAgICAgICAgICBPYmplY3RUeXBlOiAnJywgLy8gcmVxdWlyZVxuICAgICAgICAgICAgICAgIEFzc2lnbmF0aW9uTmFtZTogJycsXG4gICAgICAgICAgICAgICAgQWRkcmVzczoge1xuICAgICAgICAgICAgICAgICAgICBOb3RlOiAnJ1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH07XG4gICAgICAgICAgICBpZiAoRmVhdHVyZS5DYWRhc3RyYWxOdW1iZXIpIHtcbiAgICAgICAgICAgICAgICBCdWlsZGluZ1Byb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIgPSBGZWF0dXJlLkNhZGFzdHJhbE51bWJlcjtcbiAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgQnVpbGRpbmdQcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyID0gJyc7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBcbiAgICAgICAgICAgIEJ1aWxkaW5nUHJvcGVydGllcy5Bc3NpZ25hdGlvbk5hbWUgPSBGZWF0dXJlLkFzc2lnbmF0aW9uTmFtZTtcbiAgICAgICAgICAgIEJ1aWxkaW5nUHJvcGVydGllcy5PYmplY3RUeXBlID0gZ2V0VmFsdWVGcm9tRGljdChGZWF0dXJlLk9iamVjdFR5cGUsIGRab25lKTtcbiAgICAgICAgICAgIEJ1aWxkaW5nUHJvcGVydGllc1tcIkFkZHJlc3NcIl1bXCJOb3RlXCJdID0gRmVhdHVyZS5BZGRyZXNzLk5vdGU7XG4gICAgICAgICAgICBicmVhaztcbiAgICAgICAgfVxuICAgICAgICBjYXNlICdVbmNvbXBsZXRlZCc6e1xuICAgICAgICAgICAgVW5jb21wbGV0ZWRQcm9wZXJ0aWVzID0ge1xuICAgICAgICAgICAgICAgIGNhZGFzdHJlTnVtYmVyOiAnJywgLy8gXG4gICAgICAgICAgICAgICAgT2JqZWN0VHlwZTogJycsIC8vIHJlcXVpcmVcbiAgICAgICAgICAgICAgICBBc3NpZ25hdGlvbk5hbWU6ICcnLFxuICAgICAgICAgICAgICAgIEFkZHJlc3M6IHtcbiAgICAgICAgICAgICAgICAgICAgTm90ZTogJydcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9O1xuICAgICAgICAgICAgaWYgKEZlYXR1cmUuQ2FkYXN0cmFsTnVtYmVyKSB7XG4gICAgICAgICAgICAgICAgVW5jb21wbGV0ZWRQcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyID0gRmVhdHVyZS5DYWRhc3RyYWxOdW1iZXI7XG4gICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgIFVuY29tcGxldGVkUHJvcGVydGllcy5jYWRhc3RyZU51bWJlciA9ICcnO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgXG4gICAgICAgICAgICBVbmNvbXBsZXRlZFByb3BlcnRpZXMuQXNzaWduYXRpb25OYW1lID0gRmVhdHVyZS5Bc3NpZ25hdGlvbk5hbWU7XG4gICAgICAgICAgICBVbmNvbXBsZXRlZFByb3BlcnRpZXMuT2JqZWN0VHlwZSA9IGdldFZhbHVlRnJvbURpY3QoRmVhdHVyZS5PYmplY3RUeXBlLCBkWm9uZSk7XG4gICAgICAgICAgICBVbmNvbXBsZXRlZFByb3BlcnRpZXNbXCJBZGRyZXNzXCJdW1wiTm90ZVwiXSA9IEZlYXR1cmUuQWRkcmVzcy5Ob3RlO1xuICAgICAgICAgICAgYnJlYWs7XG4gICAgICAgIH1cbiAgICAgICAgZGVmYXVsdCA6e1xuICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQotC40L8g0L7QsdGK0LXQutGC0LAg0L3QtSDRgNCw0YHQv9C+0LfQvdCw0L0nKTtcbiAgICAgICAgfVxuICAgIH1cbiAgICByZXR1cm4ge1xuICAgICAgICBwYXJjZWxQcm9wZXJ0aWVzOiBQYXJjZWxQcm9wZXJ0aWVzLFxuICAgICAgICBjb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzOiBDb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzLFxuICAgICAgICB1bmNvbXBsZXRlZFByb3BlcnRpZXM6IFVuY29tcGxldGVkUHJvcGVydGllcyxcbiAgICAgICAgYnVpbGRpbmdQcm9wZXJ0aWVzOiBCdWlsZGluZ1Byb3BlcnRpZXMsXG4gICAgICAgIHpvbmVQcm9wZXJ0aWVzOiBab25lUHJvcGVydGllcyxcbiAgICAgICAgYm91bmRQcm9wZXJ0aWVzOiBCb3VuZFByb3BlcnRpZXNcbiAgICB9O1xufTsiLCJ2YXIgRVMgPSByZXF1aXJlKCcuL3NwYXRpYWwvRW50aXR5U3BhdGlhbC5qcycpO1xudmFyIFByb3BzID0gcmVxdWlyZSgnLi9jYWRQcm9wcycpO1xuXG5tb2R1bGUuZXhwb3J0cy5HZW9KU09OID0gZnVuY3Rpb24gKHhtbERhdGEsIHJlcHJvamVjdCkge1xuXG4gICAgdmFyIGdlb0pTT05RdWFydGFsID0ge1xuICAgICAgICB0eXBlOiBcIkZlYXR1cmVDb2xsZWN0aW9uXCIsXG4gICAgICAgIGZlYXR1cmVzOiBbXVxuICAgIH07XG4gICAgdmFyIGdlb0pTT05Cb3VuZHMgPSB7XG4gICAgICAgIHR5cGU6IFwiRmVhdHVyZUNvbGxlY3Rpb25cIixcbiAgICAgICAgZmVhdHVyZXM6IFtdXG4gICAgfTtcbiAgICB2YXIgZ2VvSlNPTlpvbmVzID0ge1xuICAgICAgICB0eXBlOiBcIkZlYXR1cmVDb2xsZWN0aW9uXCIsXG4gICAgICAgIGZlYXR1cmVzOiBbXVxuICAgIH07XG4gICAgdmFyIGdlb0pTT05QYXJjZWxzID0ge1xuICAgICAgICAndHlwZSc6ICdGZWF0dXJlQ29sbGVjdGlvbicsXG4gICAgICAgICdmZWF0dXJlcyc6IFtdXG4gICAgfTtcbiAgICB2YXIgZ2VvSlNPTlJlYWx0eSA9IHtcbiAgICAgICAgdHlwZTogXCJGZWF0dXJlQ29sbGVjdGlvblwiLFxuICAgICAgICBmZWF0dXJlczogW11cbiAgICB9O1xuICAgIC8vINCe0YLQtNC10LvRjNC90L7QtSDRhdGA0LDQvdC40LvQuNGJ0LUg0LTQu9GPIEdlb21ldHJ5Q29sbGVjdGlvblxuICAgIHZhciBnZW9KU09OUmVhbHR5Q29sbGVjdGlvbiA9IHtcbiAgICAgICAgdHlwZTogXCJGZWF0dXJlQ29sbGVjdGlvblwiLFxuICAgICAgICBmZWF0dXJlczogW11cbiAgICB9O1xuICAgIHZhciBnZW9KU09OT1NNUG9pbnRzID0ge1xuICAgICAgICB0eXBlOiBcIkZlYXR1cmVDb2xsZWN0aW9uXCIsXG4gICAgICAgIGZlYXR1cmVzOiBbXVxuICAgIH07XG5cbiAgICB2YXIgX3JlcHJvamVjdCA9IHJlcHJvamVjdCB8fCBudWxsO1xuXG4gICAgdmFyIEFsbERhdGEgPSAkLnhtbDJqc29uKHhtbERhdGEpLkNhZGFzdHJhbEJsb2Nrcy5DYWRhc3RyYWxCbG9jaztcbiAgICAvL2NvbnNvbGUubG9nKEFsbERhdGEpO1xuXG4gICAgLy8g0JzQvtC20LXRgiDQsdGL0YLRjCDQvdC10YHQutC+0LvRjNC60L4g0KHQmlxuICAgIHZhciBwcm9qTVNLO1xuICAgIGlmIChfcmVwcm9qZWN0ICE9PSBudWxsKSB7XG4gICAgICAgIHByb2pNU0sgPSBBbGxEYXRhLkNvb3JkU3lzdGVtcztcbiAgICB9XG5cbiAgICAvLyDQntCx0YDQsNCx0L7RgtC60LAg0LrQstCw0YDRgtCw0LvQsC4g0J3QtSDQvNC+0LbQtdGCINCx0YvRgtGMINC80L3QvtCz0L7QutC+0L3RgtGD0YDQvdGL0LwgICAgICAgICAgIFxuICAgIGlmIChBbGxEYXRhLlNwYXRpYWxEYXRhICE9PSBudWxsKSB7XG4gICAgICAgIHZhciBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoQWxsRGF0YS5TcGF0aWFsRGF0YS5FbnRpdHlTcGF0aWFsLCBwcm9qTVNLLCAnUXVhcnRhbCcsIGZhbHNlKTtcbiAgICAgICAgaWYgKChzcE9iaiA9PT0gdW5kZWZpbmVkKSB8fCAoc3BPYmoubGVuZ3RoID09PSAwKSkge1xuICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDQutCy0LDRgNGC0LDQu9CwINGBINC/0YPRgdGC0L7QuSDQs9C10L7QvNC10YLRgNC40LXQuSEg0J7QsdGK0LXQutGCINCx0YPQtNC10YIg0L/RgNC+0L/Rg9GJ0LXQvS4nKTtcbiAgICAgICAgfVxuICAgICAgICAvLyDQmtCy0LDRgNGC0LDQu1xuICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICd0eXBlJzogJ0ZlYXR1cmUnXG4gICAgICAgIH07XG4gICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgLy8g0J7RgdGC0LDQu9GM0L3Ri9C1INGB0LLQvtC50YHRgtCy0LAuLi4uXG5cbiAgICAgICAgZ2VvSlNPTlF1YXJ0YWwuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICB9IGVsc2Uge1xuICAgICAgICBjb25zb2xlLmxvZygn0J3QtdGCINC+0L/QuNGB0LDQvdC40Y8g0L/RgNC+0YHRgtGA0LDQvdGB0YLQstC10L3QvdC+0Lkg0YHQvtGB0YLQsNCy0LvRj9GO0YnQtdC5INC60LLQsNGA0YLQsNC70LAnKTtcbiAgICB9XG5cbiAgICAvLyDQntCx0YDQsNCx0L7RgtC60LAg0LPRgNCw0L3QuNGGLiDQndC1INC80L7Qs9GD0YIg0LHRi9GC0Ywg0LzQvdC+0LPQvtC60L7QvdGC0YPRgNC90YvQvNC4XG4gICAgaWYgKEFsbERhdGEuQm91bmRzKSB7XG5cbiAgICAgICAgaWYgKEFsbERhdGEuQm91bmRzLkJvdW5kLnNwbGljZSkge1xuICAgICAgICAgICAgZm9yICh2YXIgaSA9IDA7IGkgPCBBbGxEYXRhLkJvdW5kcy5Cb3VuZC5sZW5ndGg7IGkrKykge1xuICAgICAgICAgICAgICAgIGlmIChBbGxEYXRhLkJvdW5kcy5Cb3VuZFtpXS5Cb3VuZGFyaWVzLkJvdW5kYXJ5LnNwbGljZSkge1xuICAgICAgICAgICAgICAgICAgICBmb3IgKHZhciBrID0gMDsgayA8IEFsbERhdGEuQm91bmRzLkJvdW5kW2ldLkJvdW5kYXJpZXMuQm91bmRhcnkubGVuZ3RoOyBrKyspIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIC8vINCT0YDQsNC90LjRhtCwXG4gICAgICAgICAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAndHlwZSc6ICdGZWF0dXJlJ1xuICAgICAgICAgICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGlmIChBbGxEYXRhLkJvdW5kcy5Cb3VuZFtpXS5Cb3VuZGFyaWVzLkJvdW5kYXJ5W2tdLkVudGl0eVNwYXRpYWwgIT09IG51bGwpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB2YXIgc3BPYmogPSBFUy5nZXRFbnRpdHlTcGF0aWFsKEFsbERhdGEuQm91bmRzLkJvdW5kW2ldLkJvdW5kYXJpZXMuQm91bmRhcnlba10uRW50aXR5U3BhdGlhbCwgcHJvak1TSywgJ0JvdW5kJywgZmFsc2UpO1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGlmICgoc3BPYmogPT09IHVuZGVmaW5lZCkgfHwgKHNwT2JqLmxlbmd0aCA9PT0gMCkpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDQk9GA0LDQvdC40YbRiyDRgSDQv9GD0YHRgtC+0Lkg0LPQtdC+0LzQtdGC0YDQuNC10LkhINCe0LHRitC10LrRgiDQsdGD0LTQtdGCINC/0YDQvtC/0YPRidC10L0uJyk7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIGNvbnRpbnVlO1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgLy8g0J7RgdGC0LDQu9GM0L3Ri9C1INGB0LLQvtC50YHRgtCy0LAuLi4uXG5cbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBnZW9KU09OQm91bmRzLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2coJ9Cd0LXRgiDQvtC/0LjRgdCw0L3QuNGPINC/0YDQvtGB0YLRgNCw0L3RgdGC0LLQtdC90L3QvtC5INGB0L7RgdGC0LDQstC70Y/RjtGJ0LXQuSDQs9GA0LDQvdC40YbRiycpO1xuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICAgICAgLy8g0JPRgNCw0L3QuNGG0LBcbiAgICAgICAgICAgICAgICAgICAgdmFyIGZlYXR1cmUgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAndHlwZSc6ICdGZWF0dXJlJ1xuICAgICAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgICAgICB2YXIgc3BPYmogPSBFUy5nZXRFbnRpdHlTcGF0aWFsKEFsbERhdGEuQm91bmRzLkJvdW5kW2ldLkJvdW5kYXJpZXMuQm91bmRhcnkuRW50aXR5U3BhdGlhbCwgcHJvak1TSywgJ0JvdW5kJywgZmFsc2UpO1xuICAgICAgICAgICAgICAgICAgICBpZiAoKHNwT2JqID09PSB1bmRlZmluZWQpIHx8IChzcE9iai5sZW5ndGggPT09IDApKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0J7QsdGK0LXQutGCINCT0YDQsNC90LjRhtGLINGBINC/0YPRgdGC0L7QuSDQs9C10L7QvNC10YLRgNC40LXQuSEg0J7QsdGK0LXQutGCINCx0YPQtNC10YIg0L/RgNC+0L/Rg9GJ0LXQvS4nKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGNvbnRpbnVlO1xuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgICAgICAgICAgICAgLy8g0J7RgdGC0LDQu9GM0L3Ri9C1INGB0LLQvtC50YHRgtCy0LAuLi4uXG5cbiAgICAgICAgICAgICAgICAgICAgZ2VvSlNPTkJvdW5kcy5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgIHZhciBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoQWxsRGF0YS5Cb3VuZHMuQm91bmQuQm91bmRhcmllcy5Cb3VuZGFyeS5FbnRpdHlTcGF0aWFsLCBwcm9qTVNLLCAnQm91bmQnLCBmYWxzZSk7XG4gICAgICAgICAgICBpZiAoKHNwT2JqID09PSB1bmRlZmluZWQpIHx8IChzcE9iai5sZW5ndGggPT09IDApKSB7XG4gICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDQk9GA0LDQvdC40YbRiyDRgSDQv9GD0YHRgtC+0Lkg0LPQtdC+0LzQtdGC0YDQuNC10LkhINCe0LHRitC10LrRgiDQsdGD0LTQtdGCINC/0YDQvtC/0YPRidC10L0uJyk7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAvLyDQntGB0YLQsNC70YzQvdGL0LUg0YHQstC+0LnRgdGC0LLQsC4uLi5cblxuICAgICAgICAgICAgZ2VvSlNPTkJvdW5kcy5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgICAgICB9XG4gICAgfVxuICAgIC8vINCe0LHRgNCw0LHQvtGC0LrQsCDQt9C+0L0uINCd0LUg0LzQvtCz0YPRgiDQsdGL0YLRjCDQvNC90L7Qs9C+0LrQvtC90YLRg9GA0L3Ri9C80LhcbiAgICBpZiAoQWxsRGF0YS5ab25lcykge1xuXG4gICAgICAgIGlmIChBbGxEYXRhLlpvbmVzLlpvbmUuc3BsaWNlKSB7XG4gICAgICAgICAgICBmb3IgKHZhciBpID0gMDsgaSA8IEFsbERhdGEuWm9uZXMuWm9uZS5sZW5ndGg7IGkrKykge1xuICAgICAgICAgICAgICAgIC8vINCX0L7QvdCwXG4gICAgICAgICAgICAgICAgdmFyIGZlYXR1cmUgPSB7XG4gICAgICAgICAgICAgICAgICAgICd0eXBlJzogJ0ZlYXR1cmUnXG4gICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5ab25lcy5ab25lW2ldLkVudGl0eVNwYXRpYWwgIT09IG51bGwpIHtcbiAgICAgICAgICAgICAgICAgICAgdmFyIHNwT2JqID0gRVMuZ2V0RW50aXR5U3BhdGlhbChBbGxEYXRhLlpvbmVzLlpvbmVbaV0uRW50aXR5U3BhdGlhbCwgcHJvak1TSywgJ1pvbmUnLCBmYWxzZSk7XG4gICAgICAgICAgICAgICAgICAgIGlmICgoc3BPYmogPT09IHVuZGVmaW5lZCkgfHwgKHNwT2JqLmxlbmd0aCA9PT0gMCkpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQntCx0YrQtdC60YIg0JfQvtC90Ysg0YEg0L/Rg9GB0YLQvtC5INCz0LXQvtC80LXRgtGA0LjQtdC5ISDQntCx0YrQtdC60YIg0LHRg9C00LXRgiDQv9GA0L7Qv9GD0YnQtdC9LicpO1xuICAgICAgICAgICAgICAgICAgICAgICAgY29udGludWU7XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5nZW9tZXRyeSA9IHNwT2JqO1xuXG4gICAgICAgICAgICAgICAgICAgIGdlb0pTT05ab25lcy5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQndC10YIg0L7Qv9C40YHQsNC90LjRjyDQv9GA0L7RgdGC0YDQsNC90YHRgtCy0LXQvdC90L7QuSDRgdC+0YHRgtCw0LLQu9GP0Y7RidC10Lkg0LfQvtC90YsnKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICBpZiAoQWxsRGF0YS5ab25lcy5ab25lLkVudGl0eVNwYXRpYWwgIT09IG51bGwpIHtcbiAgICAgICAgICAgICAgICAvLyDQl9C+0L3QsFxuICAgICAgICAgICAgICAgIHZhciBmZWF0dXJlID0ge1xuICAgICAgICAgICAgICAgICAgICAndHlwZSc6ICdGZWF0dXJlJ1xuICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICAgICAgdmFyIHNwT2JqID0gRVMuZ2V0RW50aXR5U3BhdGlhbChBbGxEYXRhLlpvbmVzLlpvbmUuRW50aXR5U3BhdGlhbCwgcHJvak1TSywgJ1pvbmUnLCBmYWxzZSk7XG4gICAgICAgICAgICAgICAgaWYgKChzcE9iaiA9PT0gdW5kZWZpbmVkKSB8fCAoc3BPYmoubGVuZ3RoID09PSAwKSkge1xuICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0J7QsdGK0LXQutGCINCX0L7QvdGLINGBINC/0YPRgdGC0L7QuSDQs9C10L7QvNC10YLRgNC40LXQuSEg0J7QsdGK0LXQutGCINCx0YPQtNC10YIg0L/RgNC+0L/Rg9GJ0LXQvS4nKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgZmVhdHVyZS5nZW9tZXRyeSA9IHNwT2JqO1xuXG4gICAgICAgICAgICAgICAgZ2VvSlNPTlpvbmVzLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQndC10YIg0L7Qv9C40YHQsNC90LjRjyDQv9GA0L7RgdGC0YDQsNC90YHRgtCy0LXQvdC90L7QuSDRgdC+0YHRgtCw0LLQu9GP0Y7RidC10Lkg0LfQvtC90YsnKTtcbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cbiAgICAvLyDQntCx0YDQsNCx0L7RgtC60LAg0LLRgdC10YUg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LJcbiAgICBmb3IgKHZhciBlID0gMDsgZSA8IEFsbERhdGEuUGFyY2Vscy5QYXJjZWwubGVuZ3RoOyBlKyspIHtcbiAgICAgICAgdmFyIHNwT2JqID0gbnVsbDtcbiAgICAgICAgLy8g0JfQtdC80LXQu9GM0L3Ri9C5INGD0YfQsNGB0YLQvtC6XG4gICAgICAgIHZhciBmZWF0dXJlID0ge1xuICAgICAgICAgICAgJ3R5cGUnOiAnRmVhdHVyZSdcbiAgICAgICAgfTtcbiAgICAgICAgaWYgKEFsbERhdGEuUGFyY2Vscy5QYXJjZWxbZV0uRW50aXR5U3BhdGlhbCAhPT0gdW5kZWZpbmVkKSB7XG4gICAgICAgICAgICBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoQWxsRGF0YS5QYXJjZWxzLlBhcmNlbFtlXS5FbnRpdHlTcGF0aWFsLCBwcm9qTVNLLCAnUGFyY2VsJywgZmFsc2UpO1xuICAgICAgICAgICAgaWYgKChzcE9iaiA9PT0gdW5kZWZpbmVkKSB8fCAoc3BPYmoubGVuZ3RoID09PSAwKSkge1xuICAgICAgICAgICAgICAgIGNvbnRpbnVlO1xuICAgICAgICAgICAgfVxuXG4gICAgICAgIH1cbiAgICAgICAgLy8g0JzQvdC+0LPQvtC60L7QvdGC0YPRgNC90YvQuVxuICAgICAgICBlbHNlIGlmIChBbGxEYXRhLlBhcmNlbHMuUGFyY2VsW2VdLkNvbnRvdXJzKSB7XG4gICAgICAgICAgICB2YXIgQ29udG91cnMgPSBBbGxEYXRhLlBhcmNlbHMuUGFyY2VsW2VdLkNvbnRvdXJzLkNvbnRvdXI7XG4gICAgICAgICAgICB2YXIgbXVsdGlQb2x5Z29uID0gW107XG4gICAgICAgICAgICBmb3IgKHZhciBjID0gMDsgYyA8IENvbnRvdXJzLmxlbmd0aDsgYysrKSB7XG4gICAgICAgICAgICAgICAgdmFyIGVzID0gQ29udG91cnNbY10uRW50aXR5U3BhdGlhbDtcbiAgICAgICAgICAgICAgICB2YXIgcCA9IEVTLmdldEVudGl0eVNwYXRpYWwoZXMsIHByb2pNU0ssICdQYXJjZWwnLCB0cnVlKTtcbiAgICAgICAgICAgICAgICBpZiAocCkge1xuICAgICAgICAgICAgICAgICAgICBtdWx0aVBvbHlnb24ucHVzaChwKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBzcE9iaiA9IHtcbiAgICAgICAgICAgICAgICB0eXBlOiBcIk11bHRpUG9seWdvblwiLFxuICAgICAgICAgICAgICAgIGNvb3JkaW5hdGVzOiBtdWx0aVBvbHlnb25cbiAgICAgICAgICAgIH07XG4gICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQndC10YIg0L7Qv9C40YHQsNC90LjRjyDQv9GA0L7RgdGC0YDQsNC90YHRgtCy0LXQvdC90L7QuSDRgdC+0YHRgtCw0LLQu9GP0Y7RidC10LknKTtcbiAgICAgICAgfVxuXG4gICAgICAgIC8vINCV0YHQu9C4INC90LXRgiDQs9C10L7QvNC10YLRgNC40LgsINGC0L4g0L7QsdGK0LXQutGCINC90LUg0L3Rg9C20LXQvVxuICAgICAgICBpZiAoc3BPYmopIHtcbiAgICAgICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgICAgIC8vINCe0YHRgtCw0LvRjNC90YvQtSDRgdCy0L7QudGB0YLQstCwLi4uLlxuICAgICAgICAgICAgdmFyIHByb3BzID0gUHJvcHMuZ2V0UHJvcGVydGllcyhBbGxEYXRhLlBhcmNlbHMuUGFyY2VsW2VdLCAnUGFyY2VsJyk7XG4gICAgICAgICAgICBpZiAocHJvcHMpIHtcbiAgICAgICAgICAgICAgICBmZWF0dXJlLnByb3BlcnRpZXMgPSBwcm9wcy5wYXJjZWxQcm9wZXJ0aWVzO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgLy9jb25zb2xlLmxvZygn0J7QsdGK0LXQutGCINGB0L7Qt9C00LDQvS4g0JrQnTonICsgZmVhdHVyZS5wcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyKTtcbiAgICAgICAgICAgIGdlb0pTT05QYXJjZWxzLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgIH1cblxuICAgIH1cbiAgICAvLyDQntCx0YDQsNCx0L7RgtC60LAg0YHRgtGA0L7QtdC90LjQuS4g0LzQvtCz0YPRgiDQsdGL0YLRjCDRgdC+0YHRgtCw0LLQvdGL0LUg0LjQtyDRgNCw0LfQvdGL0YUg0LPQtdC+0LzQtdGC0YDQuNC5XG4gICAgaWYgKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHkpIHtcbiAgICAgICAgaWYgKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHkuc3BsaWNlKSB7XG5cbiAgICAgICAgICAgIGZ1bmN0aW9uIHByb2Nlc3NFUyhFbnRpdHlTcGF0aWFsLCBvVHlwZSkge1xuICAgICAgICAgICAgICAgIHZhciBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoRW50aXR5U3BhdGlhbCwgcHJvak1TSywgb1R5cGUsIGZhbHNlKTtcbiAgICAgICAgICAgICAgICBpZiAoc3BPYmopIHtcbiAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5nZW9tZXRyeSA9IHNwT2JqO1xuICAgICAgICAgICAgICAgICAgICBpZiAoc3BPYmoudHlwZSA9PT0gJ0dlb21ldHJ5Q29sbGVjdGlvbicpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIGdlb0pTT05SZWFsdHlDb2xsZWN0aW9uLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQlNC+0LHQsNCy0LvQtdC9IGdlb0pTT05SZWFsdHlHZW9tZXRyeUNvbGxlY3Rpb24nKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2coc3BPYmouZ2VvbWV0cmllcyk7XG4gICAgICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgICAgICBnZW9KU09OUmVhbHR5LmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQlNC+0LHQsNCy0LvQtdC9IGdlb0pTT05SZWFsdHkuIFR5cGUgJyArIHNwT2JqLnR5cGUpO1xuICAgICAgICAgICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZyhzcE9iai5jb29yZGluYXRlcyk7XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0J7QmtChINGBINC/0YPRgdGC0L7QuSDQs9C10L7QvNC10YLRgNC40LXQuSEg0J7QsdGK0LXQutGCINCx0YPQtNC10YIg0L/RgNC+0L/Rg9GJ0LXQvS4nKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICAgIGZvciAodmFyIGkgPSAwOyBpIDwgQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eS5sZW5ndGg7IGkrKykge1xuICAgICAgICAgICAgICAgIHZhciBzcE9iaiA9IG51bGw7XG4gICAgICAgICAgICAgICAgLy8g0J7QmtChXG4gICAgICAgICAgICAgICAgdmFyIGZlYXR1cmUgPSB7XG4gICAgICAgICAgICAgICAgICAgICd0eXBlJzogJ0ZlYXR1cmUnXG4gICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICAvLyDRgdGC0YDQvtC10L3QuNGPXG4gICAgICAgICAgICAgICAgaWYgKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uQnVpbGRpbmcpIHtcbiAgICAgICAgICAgICAgICAgICAgaWYgKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uQnVpbGRpbmcuRW50aXR5U3BhdGlhbCkge1xuICAgICAgICAgICAgICAgICAgICAgICAgdmFyIHByb3BzID0gUHJvcHMuZ2V0UHJvcGVydGllcyhBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLkJ1aWxkaW5nLCAnQnVpbGRpbmcnKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGlmIChwcm9wcykge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGZlYXR1cmUucHJvcGVydGllcyA9IHByb3BzLmJ1aWxkaW5nUHJvcGVydGllcztcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKHByb3BzLmJ1aWxkaW5nUHJvcGVydGllcyk7XG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICBwcm9jZXNzRVMoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5CdWlsZGluZy5FbnRpdHlTcGF0aWFsLCAnQnVpbGRpbmcnKTtcbiAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAvLyDQvtCx0YrQtdC60YLRiyDQvdC10LfQsNCy0LXRgNGI0ZHQvdC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwXG4gICAgICAgICAgICAgICAgZWxzZSBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5VbmNvbXBsZXRlZCkge1xuICAgICAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5VbmNvbXBsZXRlZC5FbnRpdHlTcGF0aWFsKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICB2YXIgcHJvcHMgPSBQcm9wcy5nZXRQcm9wZXJ0aWVzKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uVW5jb21wbGV0ZWQsICdVbmNvbXBsZXRlZCcpO1xuICAgICAgICAgICAgICAgICAgICAgICAgaWYgKHByb3BzKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5wcm9wZXJ0aWVzID0gcHJvcHMudW5jb21wbGV0ZWRQcm9wZXJ0aWVzO1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2cocHJvcHMudW5jb21wbGV0ZWRQcm9wZXJ0aWVzKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgIHByb2Nlc3NFUyhBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLlVuY29tcGxldGVkLkVudGl0eVNwYXRpYWwsICdVbmNvbXBsZXRlZCcpO1xuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIC8vINGB0L7QvtGA0YPQttC10L3QuNGPXG4gICAgICAgICAgICAgICAgZWxzZSBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5Db25zdHJ1Y3Rpb24pIHtcbiAgICAgICAgICAgICAgICAgICAgaWYgKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uQ29uc3RydWN0aW9uLkVudGl0eVNwYXRpYWwpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIHZhciBwcm9wcyA9IFByb3BzLmdldFByb3BlcnRpZXMoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5Db25zdHJ1Y3Rpb24sICdDb25zdHJ1Y3Rpb24nKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGlmIChwcm9wcykge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGZlYXR1cmUucHJvcGVydGllcyA9IHByb3BzLmNvbnN0cnVjdGlvblByb3BlcnRpZXM7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZyhwcm9wcy5jb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgIHByb2Nlc3NFUyhBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLkNvbnN0cnVjdGlvbi5FbnRpdHlTcGF0aWFsLCAnQ29uc3RydWN0aW9uJyk7XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG4gICAgLy8g0J7QsdGA0LDQsdC+0YLQutCwINC/0YPQvdC60YLQvtCyINCe0JzQoVxuXG4gICAgcmV0dXJuIHtcbiAgICAgICAgZ2VvSlNPTlF1YXJ0YWw6IGdlb0pTT05RdWFydGFsLFxuICAgICAgICBnZW9KU09OQm91bmRzOiBnZW9KU09OQm91bmRzLFxuICAgICAgICBnZW9KU09OWm9uZXM6IGdlb0pTT05ab25lcyxcbiAgICAgICAgZ2VvSlNPTlBhcmNlbHM6IGdlb0pTT05QYXJjZWxzLFxuICAgICAgICBnZW9KU09OUmVhbHR5OiBnZW9KU09OUmVhbHR5LFxuICAgICAgICBnZW9KU09OUmVhbHR5R2VvbWV0cnlDb2xsZWN0aW9uOiBnZW9KU09OUmVhbHR5Q29sbGVjdGlvblxuICAgIH07XG59O1xuIiwiLyoqXG4gKiDQnNC+0LTRg9C70Ywg0L7QsdGA0LDQsdC+0YLQutC4INCz0LXQvtC80LXRgtGA0LjQuCDRgtC40L/QsCDQv9C+0LvQuNCz0L7QvS5cbiAqINCe0LTQuNC9INCy0L3QtdGI0L3QuNC5INC60L7QvdGC0YPRgCDQuCAwINC40LvQuCDQsdC+0LvQtdC1INCy0L3Rg9GC0YDQtdC90L3QuNGFINC60L7QvdGC0YPRgNC+0LItXCLQtNGL0YDQvtC6XCJcbiAqIFxuICogR2VvSlNPTiBnZW9tZXRyeSDRgtC40L/QsCB0RW50aXR5U3BhdGlhbExhbmRPdXRcbiAqL1xuXG4vL1wiZ2VvbWV0cnlcIjoge1xuLy8gICAgXCJ0eXBlXCI6IFwiUG9seWdvblwiLFxuLy8gICAgXCJjb29yZGluYXRlc1wiOiBbXG4vLyAgICAgIFsgWzEwMC4wLCAwLjBdLCBbMTAxLjAsIDAuMF0sIFsxMDEuMCwgMS4wXSxcbi8vICAgICAgICBbMTAwLjAsIDEuMF0sIFsxMDAuMCwgMC4wXSBdXG4vLyAgICAgIF1cbi8vICB9XG5cbnZhciBwcm9qZWN0aW9ucyA9IHJlcXVpcmUoJy4vU3BhdGlhbFN5c3RlbXMnKTtcblxubW9kdWxlLmV4cG9ydHMuZ2V0RW50aXR5U3BhdGlhbCA9IGZ1bmN0aW9uIChFbnRpdHlTcGF0aWFsT2JqLCBwcm9qLCBvVHlwZSwgcGFydE9mTXVsdHUpIHtcblxuLy9cdHRoaXMuZ2VvbWV0cnkgPSB7XG4vLyAgICAgICAgdHlwZTogJycsXG4vL1x0XHRjb29yZGluYXRlczogW11cbi8vXHR9O1xuXG4gICAgdmFyIF9FbnRpdHlTcGF0aWFsT2JqID0gRW50aXR5U3BhdGlhbE9iajtcbiAgICB2YXIgX3Byb2ogPSBwcm9qIHx8IG51bGw7XG4gICAgdmFyIEFyZWEgPSAwLjA7XG4gICAgdmFyIHNwYXRpYWxTeXNOYW1lID0gbnVsbDtcbiAgICB2YXIgTGluZVN0cmluZyA9IGZhbHNlO1xuXG4gICAgLy8g0JLRi9GH0LjRgdC70LXQvdC40LUg0L/Qu9C+0YnQsNC00Lgg0LfQsNC80LrQvdGD0YLQvtCz0L4g0LrQvtC90YLRg9GA0LBcbiAgICBmdW5jdGlvbiBwb2x5Z29uQXJlYShYcywgWXMsIG51bVBvaW50cykge1xuICAgICAgICB2YXIgYXJlYSA9IDA7XG4gICAgICAgIHZhciBqID0gbnVtUG9pbnRzIC0gMTtcbiAgICAgICAgZm9yICh2YXIgaSA9IDA7IGkgPCBudW1Qb2ludHM7IGkrKylcbiAgICAgICAge1xuICAgICAgICAgICAgYXJlYSA9IGFyZWEgKyAoKFhzW2pdKSArIChYc1tpXSkpICogKChZc1tqXSkgLSAoWXNbaV0pKTtcbiAgICAgICAgICAgIGogPSBpOyAgLy9qIGlzIHByZXZpb3VzIHZlcnRleCB0byBpXG4gICAgICAgIH1cbiAgICAgICAgcmV0dXJuIE1hdGguYWJzKGFyZWEgLyAyKTtcbiAgICB9XG5cbiAgICBmdW5jdGlvbiBjb252ZXJ0Q29vcmQoY29vcmQpIHtcbiAgICAgICAgLy8gZ2xvYmFsXG4gICAgICAgIGlmICgoX3Byb2ogPT09IG51bGwpIHx8IChzcGF0aWFsU3lzTmFtZSA9PT0gbnVsbCkpIHtcbiAgICAgICAgICAgIHJldHVybiBjb29yZDtcbiAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgIHJldHVybiBwcm9qNChwcm9qZWN0aW9ucy5TcGF0aWFsU3lzdGVtc1tzcGF0aWFsU3lzTmFtZV0sICdFUFNHOjM4NTcnLCBjb29yZCk7XG4gICAgICAgIH1cbiAgICB9XG5cbiAgICBmdW5jdGlvbiBnZXRTcGF0aWFsU3lzTmFtZSgpIHtcbiAgICAgICAgdmFyIGlkID0gX0VudGl0eVNwYXRpYWxPYmouRW50U3lzO1xuICAgICAgICBmb3IgKHZhciBpID0gMDsgX3Byb2ouQ29vcmRTeXN0ZW0ubGVuZ3RoOyBpKyspIHtcbiAgICAgICAgICAgIGlmIChfcHJvai5Db29yZFN5c3RlbVtpXS5Dc0lkID09PSBpZCkge1xuICAgICAgICAgICAgICAgIHJldHVybiBfcHJvai5Db29yZFN5c3RlbVtpXS5OYW1lO1xuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgICAgIHJldHVybiBudWxsO1xuICAgIH1cblxuICAgIC8vINCh0L7Qt9C00LDQvdC40LUg0L7QtNC90L7Qs9C+INC30LDQvNC60L3Rg9GC0L7Qs9C+INC60L7QvdGC0YPRgNCwINC40LvQuCDQu9C40L3QuNC4INC40LvQuCDQvtC60YDRg9C20L3QvtGB0YLQuFxuICAgIGZ1bmN0aW9uIGNyZWF0ZUNvbnRvdXIoU3BhdGlhbEVsZW1lbnQpIHtcbiAgICAgICAgdmFyIHhzID0gW107XG4gICAgICAgIHZhciB5cyA9IFtdO1xuICAgICAgICB2YXIgY29udG91ciA9IFtdO1xuICAgICAgICB2YXIgY29vcmQ7XG4gICAgICAgIHZhciByZV9wcm9qZWN0ZWQgPSBbXTtcbiAgICAgICAgLy8g0L/RgNC+0LLQtdGA0LrQsCDQvdCwINC+0LrRgNGD0LbQvdC+0YHRgtGMXG4gICAgICAgIGlmICgoU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5UeXBlVW5pdCA9PT0gXCLQntC60YDRg9C20L3QvtGB0YLRjFwiIHx8IFwi0KLQvtGH0LrQsFwiKSAmJlxuICAgICAgICAgICAgICAgIChTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0LlIgIT09IHVuZGVmaW5lZCkpIHtcbiAgICAgICAgICAgIGNvb3JkID0gW051bWJlcihTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0Lk9yZGluYXRlLlkpLCBOdW1iZXIoU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5PcmRpbmF0ZS5YKV07XG4gICAgICAgICAgICByZV9wcm9qZWN0ZWQgPSBjb252ZXJ0Q29vcmQoY29vcmQpO1xuICAgICAgICAgICAgY29uc29sZS5sb2coY29vcmRbMF0sIHJlX3Byb2plY3RlZFswXSk7XG4gICAgICAgICAgICByZXR1cm4ge1xuICAgICAgICAgICAgICAgICdSJzogTnVtYmVyKFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXQuUiksXG4gICAgICAgICAgICAgICAgJ1knOiBOdW1iZXIocmVfcHJvamVjdGVkWzBdKSxcbiAgICAgICAgICAgICAgICAnWCc6IE51bWJlcihyZV9wcm9qZWN0ZWRbMV0pXG4gICAgICAgICAgICB9O1xuICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgaWYgKFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXQubGVuZ3RoID09PSAxKVxuICAgICAgICAgICAgICAgIHJldHVybiBudWxsO1xuICAgICAgICAgICAgdmFyIGZpcnN0UG9pbnQgPSBTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0WzBdO1xuICAgICAgICAgICAgdmFyIGxhc3RQb2ludCA9IFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXRbU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5sZW5ndGggLSAxXTtcbiAgICAgICAgICAgIGlmIChmaXJzdFBvaW50LlN1Tm1iID09PSBsYXN0UG9pbnQuU3VObWIpIHtcbiAgICAgICAgICAgICAgICBMaW5lU3RyaW5nID0gZmFsc2U7XG4gICAgICAgICAgICAgICAgLy9jb25zb2xlLmxvZyhMaW5lU3RyaW5nLCBmaXJzdFBvaW50LlN1Tm1iLCBsYXN0UG9pbnQuU3VObWIpO1xuICAgICAgICAgICAgICAgIGZvciAodmFyIGogPSAwOyBqIDwgU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5sZW5ndGggLSAxOyBqKyspIHtcbiAgICAgICAgICAgICAgICAgICAgdmFyIHBvaW50ID0gU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdFtqXTtcbiAgICAgICAgICAgICAgICAgICAgdmFyIHh5ID0gW107XG4gICAgICAgICAgICAgICAgICAgIGNvb3JkID0gW051bWJlcihwb2ludC5PcmRpbmF0ZS5ZKSwgTnVtYmVyKHBvaW50Lk9yZGluYXRlLlgpXTtcbiAgICAgICAgICAgICAgICAgICAgcmVfcHJvamVjdGVkID0gY29udmVydENvb3JkKGNvb3JkKTtcbiAgICAgICAgICAgICAgICAgICAgeHkucHVzaChOdW1iZXIocmVfcHJvamVjdGVkWzBdKSk7XG4gICAgICAgICAgICAgICAgICAgIHh5LnB1c2goTnVtYmVyKHJlX3Byb2plY3RlZFsxXSkpO1xuICAgICAgICAgICAgICAgICAgICBjb250b3VyLnB1c2goeHkpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICBBcmVhID0gcG9seWdvbkFyZWEoeHMsIHlzLCB4cy5sZW5ndGgpO1xuICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICBMaW5lU3RyaW5nID0gdHJ1ZTtcbiAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKExpbmVTdHJpbmcsIGZpcnN0UG9pbnQuU3VObWIsIGxhc3RQb2ludC5TdU5tYik7XG4gICAgICAgICAgICAgICAgZm9yICh2YXIgaiA9IDA7IGogPCBTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0Lmxlbmd0aCAtIDE7IGorKykge1xuICAgICAgICAgICAgICAgICAgICB2YXIgcG9pbnQgPSBTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0W2pdO1xuICAgICAgICAgICAgICAgICAgICB2YXIgeHkgPSBbXTtcbiAgICAgICAgICAgICAgICAgICAgY29vcmQgPSBbTnVtYmVyKHBvaW50Lk9yZGluYXRlLlkpLCBOdW1iZXIocG9pbnQuT3JkaW5hdGUuWCldO1xuICAgICAgICAgICAgICAgICAgICByZV9wcm9qZWN0ZWQgPSBjb252ZXJ0Q29vcmQoY29vcmQpO1xuICAgICAgICAgICAgICAgICAgICB4eS5wdXNoKE51bWJlcihyZV9wcm9qZWN0ZWRbMF0pKTtcbiAgICAgICAgICAgICAgICAgICAgeHkucHVzaChOdW1iZXIocmVfcHJvamVjdGVkWzFdKSk7XG4gICAgICAgICAgICAgICAgICAgIGNvbnRvdXIucHVzaCh4eSk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIC8vINCx0YvQstCw0LUg0YfRgtC+IExpbmVTdHJpbmcg0LjQvNC10LXRgiDQvtC00LjQvdCw0LrQvtCy0YvQtSDQv9C10YDQstGD0Y4g0Lgg0L/QvtGB0LvQtdC00L3RjtGOINGC0L7Rh9C60LhcbiAgICAgICAgICAgICAgICAvLyDQvdC+IFN1Tm1iINGA0LDQt9C90YvQtS5cbi8vICAgICAgICAgICAgICAgIGlmICgoY29udG91clswXVswXVswXSA9PT0gY29udG91clswXVtjb250b3VyWzBdLmxlbmd0aC0xXVswXSkgJiZcbi8vICAgICAgICAgICAgICAgICAgICAgICAgKGNvbnRvdXJbMF1bMF1bMV0gPT09IGNvbnRvdXJbMF1bY29udG91clswXS5sZW5ndGgtMV1bMV0pKXtcbi8vICAgICAgICAgICAgICAgICAgICBkZWxldGUoY29udG91clswXVtjb250b3VyLmxlbmd0aC0xXSk7XG4vLyAgICAgICAgICAgICAgICAgICAgY29uc29sZS5sb2coY29udG91clswXVswXVswXSwgY29udG91clswXVtjb250b3VyWzBdLmxlbmd0aC0xXVswXSxMaW5lU3RyaW5nKTtcbi8vICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIC8vY29uc29sZS5sb2coQXJlYSk7XG4gICAgICAgICAgICByZXR1cm4gY29udG91cjtcbiAgICAgICAgfVxuICAgIH1cblxuICAgIGZ1bmN0aW9uIHByb2Nlc3NTcGF0aWFsRWxlbWVudChTcGF0aWFsRWxlbWVudCkge1xuICAgICAgICB2YXIgY250cnMgPSBbXTtcbiAgICAgICAgaWYgKF9wcm9qICE9PSBudWxsKSB7XG4gICAgICAgICAgICBzcGF0aWFsU3lzTmFtZSA9IGdldFNwYXRpYWxTeXNOYW1lKCk7XG4gICAgICAgIH1cbiAgICAgICAgLy8g0KPRgtC40L3QvdCw0Y8g0YLQuNC/0LjQt9Cw0YbQuNGPINC00LvRjyDQv9GA0L7QstC10YDQutC4INC90LDQu9C40YfQuNGPINC00YvRgNC+0Log0LIg0L/QvtC70LjQs9C+0L3QtVxuICAgICAgICAvLyDQkiDQoNC+0YHRgNC10LXRgdGC0YDQtSDQvdC1INGB0LvQtdC00Y/RgiDQt9CwINC/0L7RgNGP0LTQutC+0Lwg0LrQvtC90YLRg9GA0L7QsiDQv9C+0LvQuNCz0L7QvdCwXG4gICAgICAgIGlmIChTcGF0aWFsRWxlbWVudC5zcGxpY2UpIHtcbiAgICAgICAgICAgIHZhciBNYXhBcmVhO1xuICAgICAgICAgICAgdmFyIE1heEFyZWFJZHggPSAwO1xuICAgICAgICAgICAgZm9yICh2YXIgayA9IDA7IGsgPCBTcGF0aWFsRWxlbWVudC5sZW5ndGg7IGsrKykge1xuICAgICAgICAgICAgICAgIHZhciBjb250b3VyID0gU3BhdGlhbEVsZW1lbnRba107XG4gICAgICAgICAgICAgICAgdmFyIGNudCA9IGNyZWF0ZUNvbnRvdXIoY29udG91cik7XG4gICAgICAgICAgICAgICAgaWYgKGNudClcbiAgICAgICAgICAgICAgICAgICAgY250cnMucHVzaChjbnQpO1xuICAgICAgICAgICAgICAgIGlmIChBcmVhID4gTWF4QXJlYSkge1xuICAgICAgICAgICAgICAgICAgICBNYXhBcmVhID0gQXJlYTtcbiAgICAgICAgICAgICAgICAgICAgTWF4QXJlYUlkeCA9IGs7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfVxuICAgICAgICAgICAgLy8g0J/QtdGA0LXQvNC10YnQsNC10Lwg0L7RgdC90L7QstC90L7QuSAo0L3QsNGA0YPQttC90LjQuSkg0LrQvtC90YLRg9GAINCyINC90LDRh9Cw0LvQviDQvNCw0YHRgdC40LLQsFxuICAgICAgICAgICAgaWYgKE1heEFyZWFJZHggPiAwKSB7XG4gICAgICAgICAgICAgICAgdmFyIG1haW5DbnQgPSBjbnRycy5zcGxpY2UoTWF4QXJlYUlkeCwgMSk7XG4gICAgICAgICAgICAgICAgY250cnMuc3BsaWNlKDAsIDAsIG1haW5DbnQpO1xuICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2coJ9Cd0L7QvNC10YAg0L7RgdC90L7QstC90L7Qs9C+INC60L7QvdGC0YPRgNCwINCx0YvQuyAnICsgTWF4QXJlYUlkeCk7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBpZiAoKGNudHJzICE9PSBudWxsKSB8fCAoY250cnMgIT09IHVuZGVmaW5lZCkpIHtcbiAgICAgICAgICAgICAgICByZXR1cm4gY250cnM7XG4gICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgIHJldHVybiBudWxsO1xuICAgICAgICAgICAgfVxuICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgY250cnMucHVzaChjcmVhdGVDb250b3VyKFNwYXRpYWxFbGVtZW50KSk7XG4gICAgICAgICAgICBpZiAoKGNudHJzICE9PSBudWxsKSB8fCAoY250cnMgIT09IHVuZGVmaW5lZCkpIHtcbiAgICAgICAgICAgICAgICByZXR1cm4gY250cnM7XG4gICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgIHJldHVybiBudWxsO1xuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuXG4gICAgLy8g0YMg0YHQvtC+0YDRg9C20LXQvdC40Lkg0LzQvtC20LXRgiDQsdGL0YLRjCDRgdC80LXRiNCw0L3QsNGPINCz0LXQvtC80LXRgtGA0LjRjyAoTGluZVN0cmluZywgTGluZVN0cmluZywgQ2lyY2xlLCBMaW5lU3RyaW5nKVxuICAgIC8vINCyINGN0YLQvtC8INGB0LvRg9GH0LDQtSDQutC+0L3RgtGD0YDRiyBjbnRycyDQsdGD0LTRg9GCINGF0YDQsNC90LjRgtGMINC60L7Qu9C70LXQutGG0LjRjlxuICAgIGZ1bmN0aW9uIHByb2Nlc3NSZWFsdHlTcGF0aWFsRWxlbWVudChTcGF0aWFsRWxlbWVudCkge1xuICAgICAgICB2YXIgY250cnMgPSBbXTtcbiAgICAgICAgaWYgKF9wcm9qICE9PSBudWxsKSB7XG4gICAgICAgICAgICBzcGF0aWFsU3lzTmFtZSA9IGdldFNwYXRpYWxTeXNOYW1lKCk7XG4gICAgICAgIH1cbiAgICAgICAgaWYgKFNwYXRpYWxFbGVtZW50LnNwbGljZSkge1xuICAgICAgICAgICAgdmFyIE1heEFyZWE7XG4gICAgICAgICAgICB2YXIgTWF4QXJlYUlkeCA9IDA7XG4gICAgICAgICAgICBmb3IgKHZhciBrID0gMDsgayA8IFNwYXRpYWxFbGVtZW50Lmxlbmd0aDsgaysrKSB7XG4gICAgICAgICAgICAgICAgdmFyIGNvbnRvdXIgPSBTcGF0aWFsRWxlbWVudFtrXTtcbiAgICAgICAgICAgICAgICB2YXIgY250ID0gY3JlYXRlQ29udG91cihjb250b3VyKTtcbiAgICAgICAgICAgICAgICBpZiAoY250KVxuICAgICAgICAgICAgICAgICAgICBjbnRycy5wdXNoKGNudCk7XG4gICAgICAgICAgICAgICAgaWYgKEFyZWEgPiBNYXhBcmVhKSB7XG4gICAgICAgICAgICAgICAgICAgIE1heEFyZWEgPSBBcmVhO1xuICAgICAgICAgICAgICAgICAgICBNYXhBcmVhSWR4ID0gaztcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICAvLyDQn9C10YDQtdC80LXRidCw0LXQvCDQvtGB0L3QvtCy0L3QvtC5ICjQvdCw0YDRg9C20L3QuNC5KSDQutC+0L3RgtGD0YAg0LIg0L3QsNGH0LDQu9C+INC80LDRgdGB0LjQstCwXG4gICAgICAgICAgICBpZiAoKCFMaW5lU3RyaW5nKSAmJiAoTWF4QXJlYUlkeCA+IDApKSB7XG4gICAgICAgICAgICAgICAgdmFyIG1haW5DbnQgPSBjbnRycy5zcGxpY2UoTWF4QXJlYUlkeCwgMSk7XG4gICAgICAgICAgICAgICAgY250cnMuc3BsaWNlKDAsIDAsIG1haW5DbnQpO1xuICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2coJ9Cd0L7QvNC10YAg0L7RgdC90L7QstC90L7Qs9C+INC60L7QvdGC0YPRgNCwINCx0YvQuyAnICsgTWF4QXJlYUlkeCk7XG4gICAgICAgICAgICB9XG4gICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICBjbnRycy5wdXNoKGNyZWF0ZUNvbnRvdXIoU3BhdGlhbEVsZW1lbnQpKTtcbiAgICAgICAgfVxuICAgICAgICBpZiAoY250cnMubGVuZ3RoID4gMSkge1xuICAgICAgICAgICAgY29sbGVjdGlvbiA9IFtdO1xuXG4gICAgICAgICAgICBmb3IgKHZhciBpID0gMDsgaSA8IGNudHJzLmxlbmd0aCAtIDE7IGkrKykge1xuICAgICAgICAgICAgICAgIC8vINCe0LrRgNGD0LbQvdC+0YHRgtGMXG4gICAgICAgICAgICAgICAgaWYgKGNudHJzW2ldLlIpIHtcbiAgICAgICAgICAgICAgICAgICAgdmFyIHBvaW50cyA9IGFwcHJveGltYXRlQ2lyY2xlKGNudHJzW2ldLlgsIGNudHJzW2ldLlksIGNudHJzW2ldLlIpO1xuICAgICAgICAgICAgICAgICAgICBjb2xsZWN0aW9uLnB1c2goe1xuICAgICAgICAgICAgICAgICAgICAgICAgXCJ0eXBlXCI6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXCJjb29yZGluYXRlc1wiOiBbcG9pbnRzXVxuICAgICAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgLy8g0J/QvtC70LjQs9C+0L1cbiAgICAgICAgICAgICAgICBlbHNlIGlmICghTGluZVN0cmluZykge1xuICAgICAgICAgICAgICAgICAgICBjb2xsZWN0aW9uLnB1c2goe1xuICAgICAgICAgICAgICAgICAgICAgICAgXCJ0eXBlXCI6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXCJjb29yZGluYXRlc1wiOiBbY250cnNbaV1dXG4gICAgICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgIGNvbGxlY3Rpb24ucHVzaCh7XG4gICAgICAgICAgICAgICAgICAgICAgICBcInR5cGVcIjogXCJMaW5lU3RyaW5nXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBcImNvb3JkaW5hdGVzXCI6IGNudHJzW2ldXG4gICAgICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIHJldHVybiAge1xuICAgICAgICAgICAgICAgIFwidHlwZVwiOiBcIkdlb21ldHJ5Q29sbGVjdGlvblwiLFxuICAgICAgICAgICAgICAgIFwiZ2VvbWV0cmllc1wiOiBjb2xsZWN0aW9uXG4gICAgICAgICAgICB9O1xuXG4gICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAvLyDQntC60YDRg9C20L3QvtGB0YLRjFxuICAgICAgICAgICAgaWYgKGNudHJzWzBdLlIpIHtcbiAgICAgICAgICAgICAgICB2YXIgcG9pbnRzID0gYXBwcm94aW1hdGVDaXJjbGUoY250cnNbMF0uWCwgY250cnNbMF0uWSwgY250cnNbMF0uUik7XG4gICAgICAgICAgICAgICAgcmV0dXJuIHtcbiAgICAgICAgICAgICAgICAgICAgXCJ0eXBlXCI6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICBcImNvb3JkaW5hdGVzXCI6IFtwb2ludHNdXG4gICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIC8vINCf0L7Qu9C40LPQvtC9XG4gICAgICAgICAgICBlbHNlIGlmICghTGluZVN0cmluZykge1xuICAgICAgICAgICAgICAgIHJldHVybntcbiAgICAgICAgICAgICAgICAgICAgXCJ0eXBlXCI6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICBcImNvb3JkaW5hdGVzXCI6IFtjbnRyc1swXV1cbiAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICByZXR1cm57XG4gICAgICAgICAgICAgICAgICAgIFwidHlwZVwiOiBcIkxpbmVTdHJpbmdcIixcbiAgICAgICAgICAgICAgICAgICAgXCJjb29yZGluYXRlc1wiOiBjbnRyc1swXVxuICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cbiAgICBmdW5jdGlvbiBhcHByb3hpbWF0ZUNpcmNsZShYLCBZLCBSKSB7XG4gICAgICAgIHZhciByb3RhdGVkQW5nbGUsIHgsIHk7XG4gICAgICAgIHZhciBzaWRlcyA9IDMyO1xuICAgICAgICB2YXIgcG9pbnRzID0gW107XG4gICAgICAgIHggPSBYICsgUjsgLy8g0YHQtNCy0LjQsyDQvdCwINC+0LrRgNGD0LbQvdC+0YHRgtGMXG4gICAgICAgIC8vY29uc29sZS5sb2coJ2FwcHJveGltYXRlQ2lyY2xlJyk7XG4gICAgICAgIGZvciAodmFyIGQgPSAwOyBkIDwgc2lkZXMgLSAxOyBkKyspIHtcbiAgICAgICAgICAgIHZhciB4eSA9IFtdO1xuICAgICAgICAgICAgcm90YXRlZEFuZ2xlID0gKGQgKiAyICogTWF0aC5QSSAvIHNpZGVzKTsvL2FuZ2xlICsgKGQgKiAyICogTWF0aC5QSSAvIHNpZGVzKTtcbiAgICAgICAgICAgIHggPSBYICsgKFIgKiBNYXRoLmNvcyhyb3RhdGVkQW5nbGUpKTtcbiAgICAgICAgICAgIHkgPSBZICsgKFIgKiBNYXRoLnNpbihyb3RhdGVkQW5nbGUpKTtcbiAgICAgICAgICAgIGNvb3JkID0gW051bWJlcih5KSwgTnVtYmVyKHgpXTtcbiAgICAgICAgICAgIHh5LnB1c2goY29vcmRbMF0pO1xuICAgICAgICAgICAgeHkucHVzaChjb29yZFsxXSk7XG4gICAgICAgICAgICBwb2ludHMucHVzaCh4eSk7XG4gICAgICAgIH1cbiAgICAgICAgcG9pbnRzLnB1c2gocG9pbnRzWzBdKTtcbiAgICAgICAgcmV0dXJuIHBvaW50cztcbiAgICB9XG5cbiAgICBpZiAoKF9FbnRpdHlTcGF0aWFsT2JqICE9PSB1bmRlZmluZWQpICYmIChfRW50aXR5U3BhdGlhbE9iaiAhPT0gbnVsbCkpIHtcblxuICAgICAgICB2YXIgY250cnMgPSBbXTtcblxuICAgICAgICBzd2l0Y2ggKG9UeXBlKSB7XG4gICAgICAgICAgICBjYXNlICdQYXJjZWwnIDpcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgICBjbnRycyA9IHByb2Nlc3NTcGF0aWFsRWxlbWVudChfRW50aXR5U3BhdGlhbE9iai5TcGF0aWFsRWxlbWVudCk7XG4gICAgICAgICAgICAgICAgLy8g0JXRgdC70Lgg0Y3RgtC+INC00LvRjyDQvNC90L7Qs9C+0LrQvtC90YLRg9GA0L3QvtCz0L4g0L7QsdGK0LXQutGC0LAsINGC0L4g0LLQvtC30LLRgNCw0YnQtdC8INC80LDRgdGB0LjQsiDQutC+0L3RgtGD0YDQvtCyXG4gICAgICAgICAgICAgICAgaWYgKHBhcnRPZk11bHR1KSB7XG4gICAgICAgICAgICAgICAgICAgIHJldHVybiBjbnRycztcbiAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICByZXR1cm4ge1xuICAgICAgICAgICAgICAgICAgICAgICAgdHlwZTogXCJQb2x5Z29uXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBjb29yZGluYXRlczogY250cnNcbiAgICAgICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgYnJlYWs7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBjYXNlICdDb25zdHJ1Y3Rpb24nOlxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAgIHJldHVybiBwcm9jZXNzUmVhbHR5U3BhdGlhbEVsZW1lbnQoX0VudGl0eVNwYXRpYWxPYmouU3BhdGlhbEVsZW1lbnQpO1xuICAgICAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgY2FzZSAnQnVpbGRpbmcnOlxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAgIHJldHVybiBwcm9jZXNzUmVhbHR5U3BhdGlhbEVsZW1lbnQoX0VudGl0eVNwYXRpYWxPYmouU3BhdGlhbEVsZW1lbnQpO1xuICAgICAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgY2FzZSAnVW5jb21wbGV0ZWQnOlxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAgIHJldHVybiBwcm9jZXNzUmVhbHR5U3BhdGlhbEVsZW1lbnQoX0VudGl0eVNwYXRpYWxPYmouU3BhdGlhbEVsZW1lbnQpO1xuICAgICAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgY2FzZSAnWm9uZSc6XG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICAgY250cnMgPSBwcm9jZXNzU3BhdGlhbEVsZW1lbnQoX0VudGl0eVNwYXRpYWxPYmouU3BhdGlhbEVsZW1lbnQpO1xuICAgICAgICAgICAgICAgIGlmIChwYXJ0T2ZNdWx0dSkge1xuICAgICAgICAgICAgICAgICAgICByZXR1cm4gY250cnM7XG4gICAgICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICAgICAgcmV0dXJuIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIHR5cGU6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgY29vcmRpbmF0ZXM6IGNudHJzXG4gICAgICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgY2FzZSAnUXVhcnRhbCc6XG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICAgY250cnMgPSBwcm9jZXNzU3BhdGlhbEVsZW1lbnQoX0VudGl0eVNwYXRpYWxPYmouU3BhdGlhbEVsZW1lbnQpO1xuICAgICAgICAgICAgICAgIGlmIChwYXJ0T2ZNdWx0dSkge1xuICAgICAgICAgICAgICAgICAgICByZXR1cm4gY250cnM7XG4gICAgICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICAgICAgcmV0dXJuIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIHR5cGU6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgY29vcmRpbmF0ZXM6IGNudHJzXG4gICAgICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIGJyZWFrO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgY2FzZSAnQm91bmQnOlxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAgIGNudHJzID0gcHJvY2Vzc1NwYXRpYWxFbGVtZW50KF9FbnRpdHlTcGF0aWFsT2JqLlNwYXRpYWxFbGVtZW50KTtcbiAgICAgICAgICAgICAgICBpZiAocGFydE9mTXVsdHUpIHtcbiAgICAgICAgICAgICAgICAgICAgcmV0dXJuIGNudHJzO1xuICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgIHJldHVybiB7XG4gICAgICAgICAgICAgICAgICAgICAgICB0eXBlOiBcIlBvbHlnb25cIixcbiAgICAgICAgICAgICAgICAgICAgICAgIGNvb3JkaW5hdGVzOiBjbnRyc1xuICAgICAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICBicmVhaztcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIGRlZmF1bHQgOlxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQotC40L8g0L7QsdGK0LXQutGC0LAg0L3QtSDRgNCw0YHQv9C+0LfQvdCw0L0nKTtcbiAgICAgICAgICAgICAgICByZXR1cm4gbnVsbDtcbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cblxufVxuO1xuIiwiLyogXG4gKiBUaGUgTUlUIExpY2Vuc2VcbiAqXG4gKiBDb3B5cmlnaHQgMjAxNSBmaWxpcHBvdi5cbiAqXG4gKiBQZXJtaXNzaW9uIGlzIGhlcmVieSBncmFudGVkLCBmcmVlIG9mIGNoYXJnZSwgdG8gYW55IHBlcnNvbiBvYnRhaW5pbmcgYSBjb3B5XG4gKiBvZiB0aGlzIHNvZnR3YXJlIGFuZCBhc3NvY2lhdGVkIGRvY3VtZW50YXRpb24gZmlsZXMgKHRoZSBcIlNvZnR3YXJlXCIpLCB0byBkZWFsXG4gKiBpbiB0aGUgU29mdHdhcmUgd2l0aG91dCByZXN0cmljdGlvbiwgaW5jbHVkaW5nIHdpdGhvdXQgbGltaXRhdGlvbiB0aGUgcmlnaHRzXG4gKiB0byB1c2UsIGNvcHksIG1vZGlmeSwgbWVyZ2UsIHB1Ymxpc2gsIGRpc3RyaWJ1dGUsIHN1YmxpY2Vuc2UsIGFuZC9vciBzZWxsXG4gKiBjb3BpZXMgb2YgdGhlIFNvZnR3YXJlLCBhbmQgdG8gcGVybWl0IHBlcnNvbnMgdG8gd2hvbSB0aGUgU29mdHdhcmUgaXNcbiAqIGZ1cm5pc2hlZCB0byBkbyBzbywgc3ViamVjdCB0byB0aGUgZm9sbG93aW5nIGNvbmRpdGlvbnM6XG4gKlxuICogVGhlIGFib3ZlIGNvcHlyaWdodCBub3RpY2UgYW5kIHRoaXMgcGVybWlzc2lvbiBub3RpY2Ugc2hhbGwgYmUgaW5jbHVkZWQgaW5cbiAqIGFsbCBjb3BpZXMgb3Igc3Vic3RhbnRpYWwgcG9ydGlvbnMgb2YgdGhlIFNvZnR3YXJlLlxuICpcbiAqIFRIRSBTT0ZUV0FSRSBJUyBQUk9WSURFRCBcIkFTIElTXCIsIFdJVEhPVVQgV0FSUkFOVFkgT0YgQU5ZIEtJTkQsIEVYUFJFU1MgT1JcbiAqIElNUExJRUQsIElOQ0xVRElORyBCVVQgTk9UIExJTUlURUQgVE8gVEhFIFdBUlJBTlRJRVMgT0YgTUVSQ0hBTlRBQklMSVRZLFxuICogRklUTkVTUyBGT1IgQSBQQVJUSUNVTEFSIFBVUlBPU0UgQU5EIE5PTklORlJJTkdFTUVOVC4gSU4gTk8gRVZFTlQgU0hBTEwgVEhFXG4gKiBBVVRIT1JTIE9SIENPUFlSSUdIVCBIT0xERVJTIEJFIExJQUJMRSBGT1IgQU5ZIENMQUlNLCBEQU1BR0VTIE9SIE9USEVSXG4gKiBMSUFCSUxJVFksIFdIRVRIRVIgSU4gQU4gQUNUSU9OIE9GIENPTlRSQUNULCBUT1JUIE9SIE9USEVSV0lTRSwgQVJJU0lORyBGUk9NLFxuICogT1VUIE9GIE9SIElOIENPTk5FQ1RJT04gV0lUSCBUSEUgU09GVFdBUkUgT1IgVEhFIFVTRSBPUiBPVEhFUiBERUFMSU5HUyBJTlxuICogVEhFIFNPRlRXQVJFLlxuICovXG5cbi8qICDQodC4Y9GC0LXQvNGLINC60L7QvtGA0LTQuNC90LDRgiDQuNC80LXRjtGCINGB0LzRi9GB0Lsg0LTQu9GPINCy0LjQt9GD0LDQu9C40LfQsNGG0LjQuCDQv9C+0LvRg9GH0LDQtdC80YvRhSBHZW9KU09OLFxuICAgINC00LvRjyDRgdC+0YXRgNCw0L3QtdC90LjRjyDQsiDRhNCw0LnQuyDQvdC10YIg0L3QsNC00L7QsdC90L7RgdGC0Lgg0LIg0L/RgNC10L7QsdGA0LDQt9C+0LLQsNC90LjQuC5cbiAgICDQmNC90YTQvtGA0LzQsNGG0LjRjyDQviDRgdC40YHRgtC10LzQsNGFINC60L7QvtGA0LTQuNC90LDRgiDRhdGA0LDQvdC40YLRgdGPINCyINGC0LXQs9C1IDxDb29yZFN5c3RlbXM+XG4gICAgPENvb3JkU3lzdGVtcz5cbiAgICAgICAgPG5zMzpDb29yZFN5c3RlbSBOYW1lPVwi0JzQodCaIDcwLCDQt9C+0L3QsCAzXCIgQ3NJZD1cIklEM1wiIC8+XG4gICAgICAgIDxuczM6Q29vcmRTeXN0ZW0gTmFtZT1cItCc0KHQmiA3MCwg0LfQvtC90LAgNFwiIENzSWQ9XCJJRDRcIiAvPlxuICAgIDwvQ29vcmRTeXN0ZW1zPlxuICAgINC40YUg0LzQvtC20LXRgiDQsdGL0YLRjCDQvdC10YHQutC+0LvRjNC60L4uXG4gICAg0KMg0L7QsdGK0LXQutGC0L7QsiDQsiDRgtC10LPQtSA8RW50aXR5U3BhdGlhbD4g0YPQutCw0LfQsNC90L4g0LIg0LrQsNC60L7QuSDQodCaINC+0L0g0LjQvNC10LXRgiDQutC+0L7RgNC00LjQvdCw0YLRiyxcbiAgICDQvdCw0L/RgNC40LzQtdGAOlxuICAgIDxFbnRpdHlTcGF0aWFsIEVudFN5cz1cIklEM1wiPlxuXG4gICAg0L/RgNC+0LHQu9C10LzRiyDQutC+0L3QstC10YDRgtCw0YbQuNC4INGDINGC0LXRhSB4bWwg0YMg0LrQvtGC0L7RgNGL0Lkg0YPQutCw0LfQsNC90L4gPG5zMzpDb29yZFN5c3RlbSBOYW1lPVwi0KHQmiDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0L7QutGA0YPQs9CwXCIgQ3NJZD1cIklEMVwiIC8+XG4qLyBcblxuXG5tb2R1bGUuZXhwb3J0cy5TcGF0aWFsU3lzdGVtcyA9IHtcbiAgICAvLyDQotC+0LzRgdC60LDRjyDQvtCx0LvQsNGB0YLRjFxuICAgICfQnNCh0JogNzAsINC30L7QvdCwIDQnOiAnK3Byb2o9dG1lcmMgK2xhdF8wPTAgK2xvbl8wPTgzLjczMzMzMzMzMzMzICtrPTEgK3hfMD00MjUwMDAwICt5XzA9LTU5MTI5MDAuNTY2ICtlbGxwcz1rcmFzcyArdG93Z3M4ND0yMy41NywtMTQwLjk1LC03OS44LDAsMC4zNSwwLjc5LC0wLjIyICt1bml0cz1tICtub19kZWZzJyxcbiAgICAn0JzQodCaIDcwLCDQt9C+0L3QsCAyJzogJytwcm9qPXRtZXJjICtsYXRfMD0wICtsb25fMD03Ny43MzMzMzMzMzMzMyAraz0xICt4XzA9MjI1MDAwMCAreV8wPS01OTEyOTAwLjU2NiArZWxscHM9a3Jhc3MgK3Rvd2dzODQ9MjMuNTcsLTE0MC45NSwtNzkuOCwwLDAuMzUsMC43OSwtMC4yMiArdW5pdHM9bSArbm9fZGVmcycsXG4gICAgJ9Cc0KHQmiA3MCwg0LfQvtC90LAgMyc6ICcrcHJvaj10bWVyYyArbGF0XzA9MCArbG9uXzA9ODAuNzMzMzMzMzMzMzMgK2s9MSAreF8wPTMyNTAwMDAgK3lfMD0tNTkxMjkwMC41NjYgK2VsbHBzPWtyYXNzICt0b3dnczg0PTIzLjU3LC0xNDAuOTUsLTc5LjgsMCwwLjM1LDAuNzksLTAuMjIgK3VuaXRzPW0gK25vX2RlZnMnXG59OyJdfQ==
