(function e(t,n,r){function s(o,u){if(!n[o]){if(!t[o]){var a=typeof require=="function"&&require;if(!u&&a)return a(o,!0);if(i)return i(o,!0);var f=new Error("Cannot find module '"+o+"'");throw f.code="MODULE_NOT_FOUND",f}var l=n[o]={exports:{}};t[o][0].call(l.exports,function(e){var n=t[o][1][e];return s(n?n:e)},l,l.exports,e,t,n,r)}return n[o].exports}var i=typeof require=="function"&&require;for(var o=0;o<r.length;o++)s(r[o]);return s})({1:[function(require,module,exports){
/* 
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */

var Converter = require('./cadXML2GeoJSON.js');
var map;

StartParse();

function StartParse() {

    var container = document.getElementById('popup');
    var content = document.getElementById('popup-content');
    var closer = document.getElementById('popup-closer');

    closer.onclick = function () {
        overlay.setPosition(undefined);
        closer.blur();
        return false;
    };

    var overlay = new ol.Overlay(/** @type {olx.OverlayOptions} */ ({
        element: container,
        autoPan: true,
        autoPanAnimation: {
            duration: 250
        }
    }));

    // https://bitbucket.org/surenrao/xml2json
    // http://www.chrome-allow-file-access-from-file.com/
    var parsedData;
    $.get('./testdata/doc2153522.xml', function (xml) {
        //var json = $.xml2json(xml).CadastralBlocks;
        // $("#data").html('<code>'+JSON.stringify(json)+'</code>');
        //console.log(Converter.GeoJSON);
        parsedData = Converter.GeoJSON(xml);
    }).success(
            function () {
                // http://www.color-hex.com/
                var parcelFill = new ol.style.Fill({
                    color: '#bbf144'
                });
                var zoneFill = new ol.style.Fill({
                    color: '#009fff'
                });
                var realtylStroke = new ol.style.Stroke({
                    color: '#FF00C1',
                    width: 1.2
                });

                var stroke = new ol.style.Stroke({
                    color: '#313030',
                    width: 1
                });
                var boundStroke = new ol.style.Stroke({
                    color: '#004C00',
                    width: 1
                });
                var zoneStroke = new ol.style.Stroke({
                    color: '#143388',
                    width: 1
                });
                var quartalStroke = new ol.style.Stroke({
                    color: '#3b202f',
                    width: 2
                });
                var text = new ol.style.Text({
                    // TODO Подписать кадастровые номера
                });

                // Стили
                var parcelStyle = new ol.style.Style({
                    fill: parcelFill,
                    stroke: stroke
                });
                var realtyStyle = new ol.style.Style({
                    stroke: realtylStroke
                });
                var quartalStyle = new ol.style.Style({
                    stroke: quartalStroke
                });
                var boundStyle = new ol.style.Style({
                    stroke: boundStroke
                });
                var zoneStyle = new ol.style.Style({
                    fill: zoneFill,
                    stroke: zoneStroke
                });


                var quartalSource = new ol.source.Vector({
                    projection: 'EPSG:4326'
                });
                var parcelSource = new ol.source.Vector({
                    features: (new ol.format.GeoJSON()).readFeatures(parsedData.geoJSONParcels),
                    projection: 'EPSG:4326'
                });
                var realtySource = new ol.source.Vector({
                    features: (new ol.format.GeoJSON()).readFeatures(parsedData.geoJSONRealty),
                    projection: 'EPSG:4326'
                });
                var boundSource = new ol.source.Vector({
                    projection: 'EPSG:4326'
                });
                var zoneSource = new ol.source.Vector({
                    projection: 'EPSG:4326'
                });
                var quartalLayer = new ol.layer.Vector({
                    title: 'Квартал',
                    source: quartalSource,
                    style: quartalStyle,
                    opacity: 0.5
                });
                var parcelLayer = new ol.layer.Vector({
                    title: 'ЗУ',
                    source: parcelSource,
                    style: parcelStyle,
                    opacity: 0.5
                });
                var realtyLayer = new ol.layer.Vector({
                    title: 'ОКС',
                    source: realtySource,
                    style: realtyStyle,
                    opacity: 0.5
                });
                var boundLayer = new ol.layer.Vector({
                    title: 'Границы',
                    source: boundSource,
                    style: boundStyle,
                    opacity: 0.5
                });
                var zoneLayer = new ol.layer.Vector({
                    title: 'Зоны',
                    source: zoneSource,
                    style: zoneStyle,
                    opacity: 0.5
                });

                var format = new ol.format.GeoJSON();

                var realtysCircle = parsedData.geoJSONRealtyCircle;

                // vectorSource.addFeature(new ol.Feature(new ol.geom.Circle([5e6, 7e6], 1e6)));
                for (var i = 0; i < realtysCircle.features.length; i++) {
                    console.log(realtysCircle.features[i]);
                    realtyLayer.getSource().addFeature(
                            new ol.Feature(new ol.geom.Circle(
                                    [realtysCircle.features[i].geometry.coordinates[0],
                                        realtysCircle.features[i].geometry.coordinates[1]],
                                    realtysCircle.features[i].geometry.radius)));
                }
                var zones = parsedData.geoJSONZones;
                for (var i = 0; i < zones.features.length; i++) {
                    var geometryObj = format.readGeometry(zones.features[i].geometry);
                    var feature = new ol.Feature({
                        geometry: geometryObj//,
                                //propA : parsedData.features[i].properties.cadnumber
                    });
                    zoneLayer.getSource().addFeature(feature);
                }
                var quartal = parsedData.geoJSONQuartal;
                for (var i = 0; i < quartal.features.length; i++) {
                    var geometryObj = format.readGeometry(quartal.features[i].geometry);
                    var feature = new ol.Feature({
                        geometry: geometryObj//,
                                //propA : parsedData.features[i].properties.cadnumber
                    });
                    quartalLayer.getSource().addFeature(feature);
                }
                var bounds = parsedData.geoJSONBounds;
                for (var i = 0; i < bounds.features.length; i++) {
                    var geometryObj = format.readGeometry(bounds.features[i].geometry);
                    var feature = new ol.Feature({
                        geometry: geometryObj//,
                                //propA : parsedData.features[i].properties.cadnumber
                    });
                    boundLayer.getSource().addFeature(feature);
                }

                map = new ol.Map({
                    target: 'map',
                    layers: [
                        new ol.layer.Tile({
                            source: new ol.source.OSM(),
                            opacity: 0.5,
                            visible: false,
                            title: 'Подложка'
                        }),
                        new ol.layer.Tile({
                            title: 'ПКК',
                            source: new ol.source.TileArcGISRest({
                                url: 'http://maps.rosreestr.ru/arcgis/rest/services/Cadastre/Cadastre/MapServer/'
                            })
                        }),
                        quartalLayer, boundLayer, zoneLayer,
                        parcelLayer, realtyLayer
                    ],
                    overlays: [overlay],
                    view: new ol.View({
                        projection: 'EPSG:3857',
                        center: [0, 0],
                        zoom: 7
                    })
                });
                map.getView().fit(quartalLayer.getSource().getExtent(), map.getSize());
                var layerSwitcher = new ol.control.LayerSwitcher({
                    tipLabel: 'Слои' // Optional label for button
                });
                map.addControl(layerSwitcher);
//                var graticule = new ol.Graticule({
//                    map: map
//                });
                map.on('singleclick', function (evt) {
                    var features = [];
                    var coordinate = evt.coordinate;

                    for (var i = 0; i < map.getLayers().getLength(); i++) {
                        var layer = map.getLayers().item(i);
                        if (layer instanceof ol.layer.Vector) {
                            var feature = layer.getSource().getClosestFeatureToCoordinate(evt.coordinate);
                            if (feature) {
                                features.push(feature);
                            }
                        }
                    }
                    createInfoContetnt(features, coordinate);
                });

                function createInfoContetnt(features, coordinate) {
                    var contenInfo = '';
//                    var st = '';
//                    var cat = '';
//                    var name = '';
//                    var ut = '';
                    for (var i = 0; i < features.length; i++) {
//                        var f = features[i];
//                        if (f.get('cadastreNumber') !== undefined) {
//                            cn = f.get('cadastreNumber');
//                        }
//                        if (f.get('State') !== undefined) {
//                            st = f.get('State');
//                        }
//                        if (f.get('Name') !== undefined) {
//                            name = f.get('Name');
//                        }
//                        if (f.get('Category') !== undefined) {
//                            cat = f.get('Category');
//                        }
//                        if (f.get('Category') !== undefined) {
//                            cat = f.get('Category');
//                        }
                        console.log(features[i].getProperties());
//                    }
//                    var hdms = ol.coordinate.toStringHDMS(ol.proj.transform(
//                            coordinate, 'EPSG:3857', 'EPSG:4326'));
//                        var json = JSON.stringify(features[i].getProperties());
//                        contenInfo += '<p>' + $('').jJsonViewer(json) + '</p>';
                        
//                    content.innerHTML = '<p>Кадастровый номер:<code>' + cn +
//                            '</code></p><p>Объект:<code>' + name + '</code></p>' +
//                            '</code><p>Статус:<code>' + st + '</code></p>' +
//                            '</code><p>Категория земель:<code>' + cat + '</code></p>';
                        //content.jJsonViewer(features[i].getProperties()); 
                    }
//                    content.innerHTML = contenInfo;
//                    overlay.setPosition(coordinate);
                }
            });

}

},{"./cadXML2GeoJSON.js":3}],2:[function(require,module,exports){
/* 
 * The MIT License
 *
 * Copyright 2015 filippov.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */
'use strict';
// Dicts

// Статус объекта недвижимости
var dStates = {
    '01': 'Ранее учтенный',
    '05': 'Временный',
    '06': 'Учтенный',
    '07': 'Снят с учета',
    '08': 'Аннулированный'
};
// Тип  объекта недвижимости
var dParcels = {
    '01': 'Землепользование',
    '02': 'Единое землепользование',
    '03': 'Обособленный участок',
    '04': 'Условный участок',
    '05': 'Многоконтурный участок',
    '06': 'Значение отсутствует'
};
// Категория земель
var dCategories = {
    '003001000000': 'Земли сельскохозяйственного назначения',
    '003002000000': 'Земли населённых пунктов',
    '003003000000': 'Земли промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, земли для обеспечения космической деятельности, земли обороны, безопасности и земли иного специального назначения',
    '003004000000': 'Земли особо охраняемых территорий и объектов',
    '003005000000': 'Земли лесного фонда',
    '003006000000': 'Земли водного фонда',
    '003007000000': 'Земли запаса',
    '003008000000': 'Категория не установлена'
};
// Ограничения (обременения) прав
var dEncumbrances = {
	'022001000000': 'Сервитут',
	'022001001000': 'Публичный сервитут',
	'022001002000': 'Частный сервитут',
	'022002000000': 'Арест',
	'022003000000': 'Запрещение',
	'022004000000': 'Ограничения прав на земельный участок, предусмотренные статьями 56, 56.1 Земельного кодекса Российской Федерации',
	'022005000000': 'Решение об изъятии земельного участка, жилого помещения',
	'022006000000': 'Аренда (в том числе, субаренда)',
	'022007000000': 'Ипотека',
	'022008000000': 'Ипотека в силу закона',
	'022009000000': 'Безвозмездное (срочное) пользование земельным/лесным участком',
	'022010000000': 'Доверительное управление',
	'022011000000': 'Рента',
	'022012000000': 'Запрет на совершение действий в сфере ГКУ в отношении ОН',
	'022099000000': 'Иные ограничения (обременения) прав'
};
// Единицы измерений
var dUnits = {
	'003': 'Миллиметр',
	'004': 'Сантиметр',
	'005': 'Дециметр',
	'006': 'Метр',
	'008': 'Километр',
	'009': 'Мегаметр',
	'047': 'Морская миля',
	'050': 'Квадратный миллиметр',
	'051': 'Квадратный сантиметр',
	'053': 'Квадратный дециметр',
	'055': 'Квадратный метр',
	'058': 'Тысяча квадратных метров',
	'059': 'Гектар',
	'061': 'Квадратный километр',
	'109': 'Ар (100 м2)',
	'359': 'Сутки',
	'360': 'Неделя',
	'361': 'Декада',
	'362': 'Месяц',
	'364': 'Квартал',
	'365': 'Полугодие',
	'356': 'Час',
	'355': 'Минута ',
	'366': 'Год',
	'383': 'Рубль',
	'384': 'Тысяча рублей',
	'385': 'Миллион рублей',
	'386': 'Миллиард рублей',
	'1000': 'Неопределено',
	'1001': 'Значение отсутствует',
	'1002': 'Рублей за кв. метр',
	'1003': 'Рублей за ар',
	'1004': 'Рублей  за гектар',
	'1005': 'Иные',
	'1006': 'Рублей за кв. км',
	'1007': 'Рабочий день'
};
// Все документы (Сборник классификаторов, коды 8.1, 8.2, 555, 558.1, 558.2, 558.3, 558.4, 558.5, 558.6)
var dAllDocuments = {
	'008001000000': 'Документы, удостоверяющие личность физического лица',
	'008001001000': 'Паспорт гражданина Российской Федерации',
	'008001002000': 'Паспорт гражданина СССР',
	'008001003000': 'Паспорт гражданина иностранного государства',
	'008001004000': 'Общегражданский заграничный паспорт',
	'008001005000': 'Заграничный паспорт Министерства морского флота',
	'008001006000': 'Дипломатический паспорт',
	'008001007000': 'Паспорт моряка (удостоверение личности моряка)',
	'008001008000': 'Военный билет военнослужащего',
	'008001009000': 'Временное удостоверение, выданное взамен военного билета',
	'008001010000': 'Удостоверение личности офицера Министерства обороны Российской Федерации, Министерства внутренних дел Российской Федерации и других воинских формирований с приложением справки о прописке (регистрации) Ф-33',
	'008001011000': 'Свидетельство о рождении',
	'008001012000': 'Свидетельство о рассмотрении ходатайства о признании беженцем на территории Российской Федерации по существу',
	'008001013000': 'Вид на жительство иностранного гражданина или лица без гражданства',
	'008001014000': 'Справка об освобождении из мест лишения свободы',
	'008001015000': 'Временное удостоверение личности гражданина Российской Федерации',
	'008001016000': 'Удостоверение вынужденного переселенца',
	'008001017000': 'Разрешение на временное проживание в Российской Федерации',
	'008001018000': 'Удостоверение беженца в Российской Федерации',
	'008001019000': 'Свидетельство о рассмотрении ходатайства о признании лица вынужденным переселенцем',
	'008001020000': 'Свидетельство о предоставлении временного убежища на территории Российской Федерации',
	'008001099000': 'Иные документы, предусмотренные законодательством Российской Федерации или признаваемые в соответствии с международным договором Российской Федерации в качестве документов, удостоверяющих личность',
	'008002000000': 'Документы, идентифицирующие юридическое лицо',
	'008002001000': 'Свидетельство о государственной регистрации юридического лица',
	'008002002000': 'Свидетельство о внесении записей в ЕГРЮЛ',
	'008002004000': 'Устав',
	'008002005000': 'Учредительный договор',
	'008002006000': 'Положение (общее положение об организации)',
	'008002007000': 'Свидетельство (или уведомление) о постановке на учёт в налоговом органе с указанием ИНН',
	'008002008000': 'Выписка из ЕГРЮЛ',
	'008002099000': 'Иной документ',
	'555001000000': 'Квитанция',
	'555002000000': 'Платёжное поручение',
	'555003000000': 'Чек',
	'555004000000': 'Подтверждение электронного платежа',
	'555005000000': 'Документ, подтверждающий право заявителя на безвозмездное получение сведений',
	'558100000000': 'ЗАЯВЛЕНИЯ',
	'558101000000': 'Заявления и запросы, связанные с государственным кадастровым учётом',
	'558101010000': 'Запрос о предоставлении сведений, внесённых в государственный кадастр недвижимости, в виде кадастровой выписки об объекте недвижимости, кадастрового паспорта объекта недвижимости и кадастрового плана территории, кадастровой справки о кадастровой стоимости объекта недвижимости',
	'558101020000': 'Заявление о постановке на государственный кадастровый учёт объекта недвижимости',
	'558101030000': 'Заявление о государственном кадастровом учёте изменений объекта недвижимости',
	'558101040000': 'Заявление о внесении в Единый государственный реестр объектов капитального строительства (ЕГРОКС) сведений об объекте капитального строительства (ОКС)',
	'558101050000': 'Запрос о предоставлении сведений об ОКС',
	'558101060000': 'Заявление о снятии с государственного кадастрового учёта объекта недвижимости',
	'558101070000': 'Заявление о внесении в государственный кадастр недвижимости сведений о ранее учтённом объекте недвижимости',
	'558101080000': 'Заявление об исправлении кадастровой ошибки',
	'558101090000': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости',
	'558101090100': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости об объекте недвижимости',
	'558101090200': 'Заявление об исправлении технической ошибки в сведениях государственного кадастра недвижимости о прохождении участка Государственной границы Российской Федерации; о границах между субъектами Российской Федерации; о границах муниципальных образований; о границах населённых пунктов; о территориальных зонах и зонах с особыми условиями использования территорий; о картографической и геодезической основах государственного кадастра недвижимости',
	'558101100000': 'Заявление о представлении дополнительных документов на государственный кадастровый учёт',
	'558101110000': 'Внутриведомственный запрос информации государственного кадастра недвижимости',
	'558101120000': 'Запрос о предоставлении копии документа, на основании которого сведения об объекте недвижимости внесены в государственный кадастр недвижимости',
	'558101130000': 'Запрос о предоставлении сведений, внесённых в государственный кадастр недвижимости, посредством обеспечения доступа к информационному ресурсу, содержащему сведения государственного кадастра недвижимости',
	'558101140000': 'Запрос о предоставлении перечня объектов недвижимости, подлежащих государственной кадастровой оценке',
	'558101150000': 'Заявление о прекращении осуществления кадастрового учёта',
	'558101160000': 'Межведомственный запрос документов в органах государственной власти и органах местного самоуправления',
	'558101170000': 'Запрос документов о ранее учтённом объекте недвижимости в органах государственной власти, органах местного самоуправления или органах и организациях по государственному техническому учёту и (или) технической инвентаризации',
	'558102000000': 'Заявления и запросы, связанные с регистрацией прав',
	'558102010000': 'Заявление о государственной регистрации права на недвижимое имущество, сделки с ним, ограничения (обременения), перехода, прекращения права на недвижимое имущество',
	'558102020000': 'Заявление о государственной регистрации прекращения права (ограничения (обременения) права)',
	'558102030000': 'Заявление о внесении изменений в ЕГРП',
	'558102040000': 'Заявление об исправлении технической ошибки',
	'558102050000': 'Заявление о представлении дополнительных документов для государственной регистрации прав',
	'558102060000': 'Заявление о приостановлении государственной регистрации прав на недвижимое имущество и сделок с ним',
	'558102070000': 'Заявление о возобновлении государственной регистрации',
	'558102080000': 'Заявление о прекращении государственной регистрации',
	'558102090000': 'Заявление о повторной выдаче свидетельства о государственной регистрации права',
	'558102100000': 'Запрос о предоставлении сведений, содержащихся в Едином государственном реестре прав на недвижимое имущество и сделок с ним',
	'558102110000': 'Заявление о постановке на учёт бесхозяйных недвижимых вещей',
	'558102120000': 'Заявление о выдаче закладной (новой закладной, дубликата закладной, аннулированной закладной)',
	'558102130000': 'Запрос о выдаче копий договоров и иных документов, выражающих содержание односторонних сделок, совершенных в простой письменной форме',
	'558102140000': 'Заявление о приостановлении государственной регистрации, возврате документов без проведения государственной регистрации, представлении дополнительных документов, о возобновлении государственной регистрации, ранее приостановленной по заявлению правообладателя, стороны (сторон) сделки, лица, чьё право ограничивается (обременяется), лица, в пользу которого право ограничивается (обременяется), законного владельца закладной (их представителя)',
	'558102150000': 'Заявление о повторной выдаче нового свидетельства о государственной регистрации права, выдаче закладной, внесении изменений в запись Единого государственного реестра прав на недвижимое имущество и сделок с ним, погашении регистрационной записи об ипотеке',
	'558102160000': 'Заявление о принятии объекта недвижимого имущества вновь во владение, пользование и распоряжение (в собственность)',
	'558102170000': 'Заявление о внесении в Единый государственный реестр прав на недвижимое имущество и сделок с ним отметки о наличии судебного спора в отношении зарегистрированного права',
	'558102180000': 'Заявление об исправлении технической ошибки в записях Единого государственного реестра прав на недвижимое имущество и сделок с ним, о наличии возражения в отношении зарегистрированного права на объект недвижимости, о погашении записи в Едином государственном реестре прав на недвижимое имущество и сделок с ним о наличии возражения в отношении зарегистрированного права на объект недвижимости, о невозможности государственной регистрации перехода, ограничения (обременения), прекращения права на объект недвижимости без личного участия собственника (его законного представителя), об отзыве ранее представленного заявления о невозможности государственной регистрации перехода, ограничения (обременения), прекращения права на объект недвижимости без личного участия собственника (его законного представителя)',
	'558102190000': 'Заявление о скреплении добавочного листа (добавочных листов) с закладной',
	'558102200000': 'Запрос о предоставлении сведений, содержащихся в Едином государственном реестре прав на недвижимое имущество и сделок с ним, посредством обеспечения доступа к информационному ресурсу, содержащему сведения Единого государственного реестра прав на недвижимое имущество и сделок с ним',
	'558102210000': 'Заявление о государственной регистрации законного владельца закладной',
	'558102220000': 'Заявление о внесении изменений в запись Единого государственного реестра прав на недвижимое имущество и сделок с ним, погашении регистрационной записи об ипотеке',
	'558103000000': 'Заявления о государственном учёте зданий, сооружений, помещений, объектов незавершённого строительства (объектов учёта) и запросы о предоставлении сведений, внесённых в Единый государственный реестр',
	'558103010000': 'Заявление о постановке на государственный учёт объекта учёта',
	'558103020000': 'Заявление о внесении в ЕГРОКС сведений о ранее учтённом объекте капитального строительства',
	'558103030000': 'Заявление о государственном учёте изменений объекта учёта',
	'558103040000': 'Заявление о снятии с государственного учёта объекта учёта',
	'558103050000': 'Заявление об исправлении технической ошибки',
	'558103060000': 'Заявление об исключении сведений из ЕГРОКС, носящих временный характер',
	'558103070000': 'Запрос о предоставлении копии документа, на основании которого сведения об объекте внесены в Единый государственный реестр',
	'558103080000': 'Запрос о предоставлении сведений, внесенных в Единый государственный реестр',
	'558103090000': 'Заявление о представлении дополнительных документов на государственный учёт',
	'558104000000': 'Заявление о возврате платежа',
	'558199000000': 'Иное заявление',
	'558200000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ ОПИСАНИЕ ОБЪЕКТА',
	'558201000000': 'Описание земельных участков',
	'558202000000': 'Землеустроительное дело',
	'558203000000': 'Межевой план',
	'558204000000': 'Документ (копия), на основании которого сведения об объекте недвижимости внесены в ГКН',
	'558205000000': 'Технический паспорт объекта учёта',
	'558205010000': 'Технический паспорт домовладения',
	'558205020000': 'Технический паспорт здания (строения)',
	'558205030000': 'Технический паспорт жилого помещения (квартиры)',
	'558205040000': 'Технический паспорт объекта индивидуального жилищного строительства',
	'558205050000': 'Технический паспорт сооружения',
	'558205060000': 'Технический паспорт объекта незавершённого строительства',
	'558206000000': 'Выписка из технического паспорта',
	'558206010000': 'Выписка из технического паспорта на здание (строение)',
	'558206020000': 'Выписка из технического паспорта БТИ',
	'558207000000': 'Документ (копия), подтверждающий разрешение земельного спора о согласовании местоположения границ земельного участка',
	'558208000000': 'Документ (копия), подтверждающий принадлежность земельного участка к определенной категории земель',
	'558209000000': 'Документ (копия), подтверждающий установленное разрешенное использование земельного участка',
	'558210000000': 'Кадастровый план земельного участка (выписка из государственного земельного кадастра)',
	'558211000000': 'Планы иных объектов недвижимости',
	'558211010000': 'Технический план здания, сооружения, помещения либо объекта незавершённого строительства',
	'558211020000': 'План участка лесного фонда',
	'558211030000': 'План объекта недвижимости',
	'558211040000': 'Экспликация к поэтажному плану',
	'558212000000': 'Декларация об объекте недвижимости',
	'558213000000': 'Кадастровый паспорт объекта недвижимости',
	'558213010000': 'Кадастровый паспорт земельного участка',
	'558213020000': 'Кадастровый паспорт помещения (выписка из ГКН)',
	'558213030000': 'Кадастровый паспорт здания, сооружения, объекта незавершённого строительства',
	'558214000000': 'Кадастровая выписка об объекте недвижимости',
	'558214010000': 'Кадастровая выписка о земельном участке',
	'558214020000': 'Кадастровая выписка о здании, сооружении, объекте незавершённого строительства',
	'558216000000': 'Документ, подтверждающий изменение назначения здания, помещения или сооружения, наименования сооружения',
	'558217000000': 'Кадастровый план территории',
	'558218000000': 'Кадастровая справка о кадастровой стоимости объекта недвижимости',
	'558219000000': 'Акт обследования, подтверждающий прекращение существования объекта учёта',
	'558220000000': 'Документы, в виде которых предоставляются сведения Единого государственного реестра',
	'558220010000': 'Выписка из Реестра, содержащая относящиеся к информации ограниченного доступа сведения об объекте учета',
	'558220020000': 'Справка, содержащая, внесённые в Единый государственный реестр сведения о прекращении существования объекта учёта',
	'558220030000': 'Выписка из Реестра, подтверждающая факт отсутствия в Реестре сведений об объекте учета',
	'558221000000': 'ПРОЧИЕ',
	'558221010000': 'Решение о необходимости устранения кадастровой ошибки',
	'558221020000': 'Международный договор Российской Федерации, в соответствии с которым установлено или изменено прохождение государственной границы Российской Федерации',
	'558221030000': 'Документ, содержащий необходимые для внесения в государственный кадастр недвижимости сведения о границах между субъектами Российской Федерации, границах муниципального образования, границах населённого пункта',
	'558221040000': 'Документ, содержащий необходимые для внесения в государственный кадастр недвижимости сведения об установлении или изменении территориальной зоны или зоны с особыми условиями использования территорий, либо об отмене установления такой зоны',
	'558221050000': 'Решение о присвоении, изменении адреса',
	'558221060000': 'Документы органов, осуществляющих ведение лесного и водного кадастра, содержащие сведения о природных объектах',
	'558221070000': 'Документ, содержащий сведения об адресе объекта недвижимости',
	'558221080000': 'Акт об утверждении результатов определения кадастровой стоимости',
	'558221990000': 'Иной документ, содержащий описание объекта',
	'558222000000': 'Документ, воспроизводящий сведения, содержащиеся в международном договоре Российской Федерации, в соответствии с которым установлено или изменено прохождение государственной границы Российской Федерации, а также сведения о федеральном законе, которым ратифицирован международный договор Российской Федерации, и об официальном опубликовании такого федерального закона',
	'558223000000': 'Соглашение об изменении границ между субъектами Российской Федерации',
	'558224000000': 'Закон субъекта Российской Федерации об установлении или изменении границ муниципальных образований либо о преобразовании муниципальных образований',
	'558225000000': 'Акт уполномоченного органа об установлении или изменении границ населённых пунктов',
	'558226000000': 'Документ, воспроизводящий необходимые для внесения в государственный кадастр недвижимости сведения о границах между субъектами Российской Федерации, границах муниципального образования, границах населённого пункта, содержащиеся в утверждённых органами власти документах',
	'558227000000': 'Решение об установлении или изменении границ зон с особыми условиями использования территорий',
	'558228000000': 'Правовой акт, которым утверждены или изменены правила землепользования и застройки',
	'558229000000': 'Документ, подтверждающий изменение назначения помещения',
	'558230000000': 'Решение о переводе жилого помещения в нежилое помещение, нежилого помещения в жилое помещение',
	'558231000000': 'Акт приемочной комиссии, подтверждающий завершение переустройства и (или) перепланировки и (или) иных работ',
	'558232000000': 'Документы, воспроизводящие сведения об изменении назначения помещения',
	'558233000000': 'Документ, воспроизводящий сведения, содержащиеся в решении о переводе жилого помещения в нежилое помещение, нежилого помещения в жилое помещение',
	'558234000000': 'Документ, воспроизводящий сведения, содержащиеся в акте приемочной комиссии, подтверждающем завершение переустройства и (или) перепланировки и (или) иных работ',
	'558235000000': 'Документ, подтверждающий изменение назначения здания',
	'558236000000': 'Документ, подтверждающий изменение назначения сооружения',
	'558237000000': 'Решение о предоставлении разрешения на условно разрешенный вид использования',
	'558238000000': 'Решение об определении (изменении) вида разрешенного использования',
	'558239000000': 'Документ (копия), воспроизводящий сведения о предоставлении разрешения на условно разрешенный вид использования, об определении (изменении) вида разрешенного использования',
	'558240000000': 'Документ, воспроизводящий сведения, содержащиеся в решении о присвоении, изменении адреса',
	'558241000000': 'Документ, воспроизводящий содержащиеся в разрешении на ввод объекта капитального строительства в эксплуатацию сведения',
	'558242000000': 'Документ, воспроизводящий сведения, содержащиеся в реестре объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
	'558243000000': 'Документ, воспроизводящий сведения, содержащиеся в акте Правительства Российской Федерации об исключении объекта недвижимости из единого государственного реестра объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
	'558244000000': 'Документ, содержащий сведения о дате поступления документов, предусмотренных статьей 17 Федерального закона "Об объектах культурного наследия (памятниках истории и культуры) народов Российской Федерации", в отношении объекта недвижимости',
	'558245000000': 'Решение (копия решения) соответствующего органа государственной власти об отказе включить объект недвижимости в единый государственный реестр объектов культурного наследия (памятников истории и культуры) народов Российской Федерации',
	'558246000000': 'Акт Правительства Российской Федерации об исключении объекта недвижимости из единого государственного реестра объектов культурного наследия',
	'558247000000': 'Документ, воспроизводящий сведения о наименовании водного объекта и установленных параметрах водоохранных зон и прибрежных защитных полос, зон затопления, подтопления и других зон с особыми условиями их использования',
	'558248000000': 'Документ, воспроизводящий содержащиеся в государственном лесном реестре сведения в отношении лесного участка',
	'558249000000': 'Документ, воспроизводящий сведения, содержащиеся во вступившем в силу акте об утверждении результатов определения кадастровой стоимости',
	'558250000000': 'Документ, воспроизводящий сведения, содержащиеся в решении об установлении или изменении границ зон с особыми условиями использования территорий',
	'558251000000': 'Документ, воспроизводящий сведения, содержащиеся в правовом акте, которым утверждены или изменены правила землепользования и застройки, включая сведения о территориальных зонах',
	'558252000000': 'Карта (план) объекта землеустройства',
	'558253000000': 'Декларация заинтересованного лица о выбранном виде разрешенного использования земельного участка',
	'558254000000': 'Документы, определяющие (определявшие) в соответствии с законодательством Российской Федерации местоположение границ земельного участка (земельных участков)',
	'558254010000': 'Землеустроительная документация',
	'558254020000': 'Лесоустроительная документация',
	'558254030000': 'Документы градостроительного зонирования (Правила землепользования и застройки)',
	'558254040000': 'Документация по планировке территории (проекты межевания территорий), в т.ч. документ по планировке территории в планируемых границах искусственного земельного участка',
	'558254050000': 'Копия проекта межевания земельных участков',
	'558254060000': 'Акт отвода земельных участков в натуре',
	'558254070000': 'Проект границ земельных участков',
	'558254080000': 'Проект (копии отдельных составных частей) организации и застройки территорий садоводческих, огороднических или дачных некоммерческих объединений граждан',
	'558254090000': 'Проект (копии отдельных составных частей) перераспределения сельскохозяйственных угодий и иных земель сельскохозяйственного назначения',
	'558254100000': 'Решение о предварительном согласовании мест размещения объектов',
	'558254110000': 'Копия решения общего собрания участников долевой собственности на земельный участок из земель сельскохозяйственного назначения об утверждении проекта межевания земельных участков',
	'558254120000': 'Копия документа, подтверждающего согласование проекта межевания земельного участка',
	'558254130000': 'Возражения заинтересованных лиц по поводу местоположения границ земельного участка',
	'558254140000': 'Документ, свидетельствующий о снятии возражений заинтересованных лиц по поводу местоположения границ земельного участка',
	'558254150000': 'Схема расположения земельных участков на кадастровых планах или кадастровых картах соответствующих территорий',
	'558254990000': 'Прочие документы, определяющие (определявшие) в соответствии с законодательством Российской Федерации местоположение границ земельного участка (земельных участков)',
	'558255000000': 'Картографические материалы',
	'558256000000': 'Материалы картографо-геодезического фонда',
	'558257000000': 'Документы, устанавливающие предельные минимальные и максимальные размеры, соответствующие виду разрешенного использования земельного участка',
	'558257010000': 'Федеральный закон',
	'558257020000': 'Закон субъекта Российской Федерации',
	'558257030000': 'Нормативный правовой акт органа местного самоуправления',
	'558258000000': 'Документ, содержащий информацию о ранее присвоенных государственных учетных номерах объекта недвижимости',
	'558259000000': 'Протокол образования земельных участков',
	'558260000000': 'Чертеж (абрис) помещения',
	'558261000000': 'Проектная документация здания',
	'558262000000': 'Проектная документация сооружения',
	'558263000000': 'Решение комиссии по рассмотрению споров о результатах определения кадастровой стоимости',
	'558264000000': 'Решение суда',
	'558299000000': 'Иной документ, содержащий описание объекта',
	'558300000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ ОПИСАНИЕ ЗАЯВИТЕЛЯ ИЛИ ЕГО ПРЕДСТАВИТЕЛЯ',
	'558301000000': 'Документы, подтверждающие полномочия представителя',
	'558301010000': 'Доверенность',
	'558301020000': 'Свидетельство о рождении',
	'558301030000': 'Свидетельство об усыновлении',
	'558301040000': 'Решение суда',
	'558301050000': 'Определение суда',
	'558301060000': 'Протокол об избрании (единоличного исполнительного органа юридического лица)',
	'558301070000': 'Выписка из протокола об избрании (единоличного исполнительного органа юридического лица)',
	'558301080000': 'Приказ о назначении (руководителя или иного уполномоченного лица)',
	'558301090000': 'Решение органов опеки и попечительства',
	'558301100000': 'Договор коммерческого представительства',
	'558301110000': 'Договор доверительного управления',
	'558301120000': 'Постановление судебного пристава-исполнителя',
	'558301130000': 'Протокол общего собрания',
	'558301140000': 'Акт органа государственной власти или органа местного самоуправления, подтверждающий полномочия представителя заявителя',
	'558301990000': 'Иной документ',
	'558400000000': 'ДОКУМЕНТЫ О ПРАВАХ, СДЕЛКАХ, ОГРАНИЧЕНИЯХ (ОБРЕМЕНЕНИЯХ)',
	'558401000000': 'Правоустанавливающие и правоудостоверяющие документы',
	'558401010000': 'Договоры / соглашения',
	'558401010100': 'Сделки об отчуждении',
	'558401010101': 'Договор купли-продажи',
	'558401010102': 'Договор мены',
	'558401010103': 'Договор дарения',
	'558401010104': 'Договор ренты',
	'558401010105': 'Договор пожизненного содержания с иждивением',
	'558401010106': 'Договор приватизации (договор передачи объекта недвижимости в собственность)',
	'558401010200': 'Другие сделки',
	'558401010201': 'Договор участия в долевом строительстве',
	'558401010202': 'Соглашение об определении (перераспределении) долей в праве общей долевой собственности',
	'558401010203': 'Брачный договор',
	'558401010204': 'Соглашение об отступном',
	'558401010205': 'Соглашение о разделе имущества',
	'558401010206': 'Соглашение о выделе доли',
	'558401010207': 'Инвестиционный договор (договор об инвестировании)',
	'558401010208': 'Мировое соглашение',
	'558401010209': 'Договор аренды (субаренды)',
	'558401010210': 'Договор об ипотеке',
	'558401010211': 'Договор безвозмездного срочного пользования земельным участком',
	'558401010212': 'Кредитный договор',
	'558401010213': 'Договор займа',
	'558401010214': 'Соглашение об установлении сервитута',
	'558401010215': 'Соглашение об изменении содержания закладной',
	'558401010216': 'Дополнительное соглашение (соглашение об изменении условий договора) к договору',
	'558401010217': 'Соглашение о расторжении договора',
	'558401010218': 'Соглашение об уступке прав требования по договору (договор о передаче прав и обязанностей)',
	'558401010219': 'Договор простого товарищества (договор о совместной деятельности)',
	'558401010220': 'Государственный контракт',
	'558401010299': 'Иная сделка',
	'558401020000': 'Акты органов государственной власти или органов местного самоуправления',
	'558401020100': 'Федеральный закон',
	'558401020200': 'Указ Президента Российской Федерации',
	'558401020300': 'Постановление Правительства Российской Федерации',
	'558401020400': 'Закон (законы Российской Федерации, субъекта Российской Федерации)',
	'558401020500': 'Документ о предоставлении земельных участков',
	'558401020600': 'Решение об образовании земельных участков',
	'558401020700': 'Акт об установлении сервитута',
	'558401020800': 'Акт об установлении ограничения (обременения)',
	'558401029900': 'Иные акты органов государственной власти или органов местного самоуправления',
	'558401030000': 'Свидетельство о праве на наследство',
	'558401030100': 'Свидетельство о праве на наследство по закону',
	'558401030200': 'Свидетельство о праве на наследство по завещанию',
	'558401040000': 'Вступившие в силу судебные акты',
	'558401040100': 'Судебный акт, устанавливающий запрет на совершение действий в сфере государственного кадастрового учета в отношении объекта недвижимости',
	'558401040200': 'Судебный акт о восстановлении аннулированных и исключенных из государственного кадастра недвижимости сведений об объекте недвижимости',
	'558401040300': 'Судебный акт об установлении обременения (ограничении) в использовании объекта недвижимости  (части объекта недвижимости)',
	'558401049900': 'Иные предусмотренные законодательством судебные акты',
	'558401050000': 'Акты (свидетельства) о правах на объекты недвижимости',
	'558401050100': 'Регистрационное удостоверение',
	'558401050200': 'Свидетельство о праве на землю',
	'558401050300': 'Государственный акт о праве на землю',
	'558401050400': 'Свидетельство о праве собственности',
	'558401059900': 'Иные акты, свидетельства о правах на объекты недвижимости',
	'558401060000': 'Документы на вновь возведенный (реконструированный) объект',
	'558401060100': 'Разрешение на ввод объекта в эксплуатацию',
	'558401060200': 'Разрешение на строительство',
	'558401060300': 'Акт ввода в эксплуатацию',
	'558401060400': 'Копия решения о создании искусственного земельного участка',
	'558401070000': 'Документы при упрощенном порядке оформления прав граждан на отдельные объекты недвижимого имущества',
	'558401070100': 'Выписка из похозяйственной книги о наличии у гражданина права на земельный участок',
	'558401070200': 'Кадастровый паспорт объекта недвижимости',
	'558401070300': 'Декларация об объекте недвижимого имущества',
	'558401080000': 'Прочие правоустанавливающие документы',
	'558401080100': 'Передаточный акт',
	'558401080200': 'Разделительный баланс',
	'558401080300': 'План приватизации',
	'558401080400': 'Правила доверительного управления',
	'558401080500': 'Акт описи и ареста имущества',
	'558401080600': 'Протокол о выделе земельного участка в счет земельной доли',
	'558401080700': 'Протокол общего собрания собственников помещений в многоквартирном доме',
	'558401080800': 'Отказ одаряемого принять дар (отказ от дара)',
	'558401080900': 'Соглашение о новации',
	'558401081000': 'Соглашение о разделе наследственного имущества',
	'558401081100': 'Соглашение об уплате алиментов',
	'558401081200': 'Документ, подтверждающий наличие, возникновение, переход ограничения (обременения) вещного права на объект недвижимости в пользу заявителя',
	'558401089900': 'Иной документ',
	'558402000000': 'СОПУТСТВУЮЩИЕ И ДОПОЛНИТЕЛЬНЫЕ ДОКУМЕНТЫ',
	'558402010000': 'Согласие супруга на совершение сделки',
	'558402020000': 'Согласие органов опеки и попечительства',
	'558402030000': 'Свидетельство о заключении брака',
	'558402040000': 'Свидетельство о расторжении брака',
	'558402050000': 'Решение об одобрении (о совершении) сделки',
	'558402060000': 'Справка о стоимости (справка о соотношении стоимости отчуждаемого объекта и балансовой стоимости имущества или активов хозяйственного общества)',
	'558402070000': 'Справка о заинтересованных лицах в сделке',
	'558402080000': 'Выписка из домовой книги (сведения о лицах, сохраняющих право проживания в жилом помещении после перехода права на него)',
	'558402090000': 'Выписка из лицевого счета (сведения о лицах, сохраняющих право проживания в жилом помещении после перехода права на него)',
	'558402100000': 'Протокол о результатах торгов',
	'558402110000': 'Лицензия (лицензия на осуществление определенных видов деятельности)',
	'558402120000': 'Проектная декларация',
	'558402130000': 'Отказ от преимущественного права покупки (для участников долевой собственности, для субъекта Российской Федерации при продаже земельного участка из состава земель сельскохозяйственного назначения)',
	'558402140000': 'Решение о создании юридического лица',
	'558402150000': 'Решение о реорганизации юридического лица',
	'558402160000': 'Решение о ликвидации юридического лица',
	'558402170000': 'Решение об утверждении оценки имущества (решение об утверждении оценки неденежных вкладов в уставный капитал общества)',
	'558402180000': 'Исполнительный лист',
	'558402190000': 'Договор поручения',
	'558402200000': 'Бухгалтерский баланс',
	'558402210000': 'Закладная',
	'558402220000': 'Добавочный лист к закладной',
	'558402230000': 'Выписка из реестра муниципальной собственности',
	'558402240000': 'Выписка из реестра собственности субъекта Российской Федерации',
	'558402250000': 'Выписка из реестра федерального имущества',
	'558402260000': 'Жилищный сертификат',
	'558402270000': 'Аудиторское заключение',
	'558402280000': 'Отчет о проведении независимой оценки (акт оценки)',
	'558402390000': 'Акт инвентаризации',
	'558402400000': 'Охранное обязательство собственника объекта культурного наследия',
	'558402990000': 'Иной документ',
	'558403000000': 'ДОКУМЕНТЫ, СОДЕРЖАЩИЕ СВЕДЕНИЯ ЕГРП',
	'558403010000': 'Свидетельство о государственной регистрации права',
	'558403020000': 'Выписка о правах на объект недвижимого имущества',
	'558403030000': 'Выписка о переходе прав на объект недвижимого имущества',
	'558403040000': 'Выписка о правах отдельного лица на имеющиеся у него объекты недвижимого имущества',
	'558403050000': 'Выписка о признании правообладателя недееспособным или ограниченно дееспособным',
	'558403060000': 'Справка о содержании правоустанавливающих документов на объект недвижимого имущества',
	'558403070000': 'Справка о лицах, получивших сведения об объекте недвижимого имущества',
	'558403080000': 'Копии договоров и иных документов, выражающих содержание односторонних сделок, совершенных в простой письменной форме',
	'558403090000': 'Выписка из ЕГРП о принятии на учёт бесхозяйного объекта недвижимого имущества',
	'558403100000': 'Выписка из ЕГРП о принятии на учёт бесхозяйного объекта недвижимого имущества, от права собственности на который собственник отказался',
	'558403110000': 'Выписка из ЕГРП о бесхозяйном объекте недвижимого имущества, принятом на учёт',
	'558403120000': 'Выписка из единого государственного реестра прав на недвижимое имущество и сделок с ним, удостоверяющая проведение государственной регистрации возникновения и (или) перехода прав на недвижимое имущество',
	'558403990000': 'Иной документ',
	'558404000000': 'Соглашения и согласия об образовании земельных участков',
	'558404010000': 'Соглашение о разделе, об объединении, о перераспределении земельных участков или о выделе из земельных участков',
	'558404020000': 'Согласие на образование земельных участков',
	'558404030000': 'Соглашение об образовании общей долевой собственности на земельный участок, образуемый при выделе его в счет земельной доли или земельных долей',
	'558404040000': 'Соглашение об образовании общей совместной собственности на земельный участок, образуемый при выделе его в счет земельной доли или земельных долей',
	'558405000000': 'Документы, подтверждающие возникновение права собственности в отношении земельного участка в силу федерального закона вне зависимости от момента государственной регистрации этого права в ЕГРП',
	'558405010000': 'Копия решения о безвозмездной передаче военного недвижимого имущества из федеральной собственности в собственность субъекта Российской Федерации - города федерального значения Москвы или Санкт-Петербурга либо муниципальную собственность',
	'558405020000': 'Подлинник или копия письма органа исполнительной власти субъекта Российской Федерации - города федерального значения Москвы или Санкт-Петербурга либо органа местного самоуправления муниципального образования о согласовании границ образуемого земельного участка с приложением согласованного проекта границ земельного участка в случае, если акт согласования границ земельного участка не заверен подписью уполномоченного должностного лица соответствующего органа',
	'558405030000': 'Решение об изъятии земельных участков и (или) расположенных на них иных объектов недвижимого имущества в целях размещения олимпийских объектов',
	'558405040000': 'Копия акта приема-передачи объектов недвижимого имущества, в отношении которых принято решение об изъятии в целях размещения олимпийских объектов',
	'558405990000': 'Иные документы, подтверждающие возникновение права собственности в отношении земельного участка в силу федерального закона вне зависимости от момента государственной регистрации этого права в ЕГРП',
	'558500000000': 'Решения, уведомления, расписки',
	'558501000000': 'Документы о результатах государственного кадастрового учёта',
	'558501010000': 'РЕШЕНИЯ',
	'558501010100': 'Решение об отказе в предоставлении запрашиваемых сведений',
	'558501010200': 'Решение об отказе в исправлении кадастровой ошибки',
	'558501010300': 'Решение об отказе в исправлении технической ошибки',
	'558501010400': 'Решение об исправлении технической и кадастровой ошибок',
	'558501010500': 'Решение об отказе в осуществлении кадастровой процедуры',
	'558501010600': 'Решение о приостановлении осуществления кадастровой процедуры',
	'558501010700': 'Решение об отказе в снятии приостановления',
	'558501010800': 'Решение о снятии с кадастрового учёта земельных участков со статусом «временные» по заявлению заинтересованного лица',
	'558501010900': 'Решение об отказе в выдаче кадастрового паспорта',
	'558501011000': 'Решение об осуществлении кадастровой процедуры',
	'558501011100': 'Решение об аннулировании кадастровых сведений',
	'558501011200': 'Решение об отклонении заявления об исправлении технической ошибки',
	'558501011300': 'Решение о внесении записи о наличии возражения',
	'558501011400': 'Решение о погашении записи о наличии возражения',
	'558501011500': 'Решение о внесении записи о заявлении о невозможности государственной регистрации',
	'558501011600': 'Решение о погашении записи о заявлении о невозможности государственной регистрации',
	'558501020000': 'УВЕДОМЛЕНИЯ',
	'558501020100': 'Уведомление об отсутствии в ГКН запрашиваемых сведений',
	'558501020200': 'Уведомление об осуществлённом кадастровом учёте',
	'558501020300': 'Уведомление об отказе в приеме документов для внесения в Единый государственный реестр объектов капитального строительства (далее - Единый государственный реестр) сведений об ОКС',
	'558501020400': 'Уведомление об отказе в приеме документов для предоставления из Единого государственного реестра сведений об ОКС',
	'558501020500': 'Уведомление об устранении технической ошибки в сведениях ГКН',
	'558501020600': 'Уведомление об отказе в выдаче сведений об ОКС',
	'558501020700': 'Уведомление о приостановлении осуществления кадастровой процедуры',
	'558501020800': 'Уведомление об отказе в осуществлении кадастровой процедуры',
	'558501020900': 'Уведомление о регистрации права',
	'558501021000': 'Уведомление о приостановлении принятия на учёт имущества в качестве бесхозяйного',
	'558501021100': 'Сообщение об отказе в принятии на учёт имущества в качестве бесхозяйного',
	'558501021200': 'Уведомление о снятии с учёта имущества в качестве бесхозяйного',
	'558501021300': 'Уведомление о возврате заявления о наличии возражения в отношении зарегистрированного права на объект недвижимости без рассмотрения',
	'558501030000': 'ПРОЧИЕ',
	'558501030100': 'Расписка в получении соответствующих документов для проведения государственного кадастрового учёта',
	'558501030200': 'Протокол проверки документов',
	'558501030300': 'Акт определения кадастровой стоимости земельных участков',
	'558501030400': 'Протокол выявления технической ошибки',
	'558501030500': 'Акт определения кадастровой стоимости объектов недвижимости',
	'558501039900': 'Иные документы',
	'558502000000': 'ДОКУМЕНТЫ О РЕЗУЛЬТАТАХ РЕГИСТРАЦИИ ПРАВ',
	'558502010000': 'УВЕДОМЛЕНИЯ, СООБЩЕНИЯ',
	'558502010100': 'Уведомление о приостановлении государственной регистрации прав',
	'558502010200': 'Уведомление о прекращении государственной регистрации прав',
	'558502010300': 'Уведомление о зарегистрированных ограничениях (обременениях) прав',
	'558502010400': 'Уведомление о внесении изменений в ЕГРП',
	'558502010500': 'Уведомление об исправлении технической ошибки в записях единого государственного реестра прав на недвижимое имущество и сделок с ним',
	'558502010600': 'Сообщение об отказе в государственной регистрации прав',
	'558502010700': 'Сообщение об отказе в предоставлении сведений из ЕГРП',
	'558502010800': 'Уведомление об отсутствии в ЕГРП запрашиваемых сведений',
	'558502010900': 'Сообщение о приёме заявления о государственной регистрации права, ограничения (обременения) права на предприятие, сделки с ним',
	'558502011000': 'Сообщение о поступлении документов на государственную регистрацию договоров мены и (или) перехода права',
	'558502011100': 'Уведомление о возврате приложенных к заявлению документов без рассмотрения',
	'558502011200': 'Уведомление о государственной регистрации прекращения ограничения (обременения)',
	'558502011300': 'Уведомление об отсутствии сведений о лицах, получивших сведения об объектах недвижимого имущества',
	'558502011400': 'Уведомление о государственной регистрации права собственности субъекта Российской Федерации или муниципального образования на земельный участок или земельную долю вследствие отказа от соответствующего права правообладателем',
	'558502011500': 'Уведомление о поступлении решения суда, вступившего в законную силу, с указанием срока окончания осуществления государственной регистрации прав, в случае если отказ в государственной регистрации прав признан судом необоснованным',
	'558502011600': 'Уведомление о внесении изменений в единый государственный реестр прав на недвижимое имущество и сделок с ним в связи с изменением содержащихся в базовых государственных информационных ресурсах сведений о правообладателе (правообладателях)',
	'558502011700': 'Уведомление о возврате документов без рассмотрения при отказе в осуществлении государственного кадастрового учета',
	'558502020000': 'ПРОЧИЕ',
	'558502020100': 'Расписка в получении документов на государственную регистрацию прав',
	'558502029900': 'Иной документ',
	'558601000000': 'Расписка в получении извещений о проведении собрания о согласовании местоположения границ',
	'558602000000': 'Уведомление о вручении извещения о проведении собрания о согласовании местоположения границ',
	'558603000000': 'Копия страницы печатного издания, содержащей извещение о проведении собрания о согласовании местоположения границ земельного участка, включая первый лист, содержащего реквизиты такого печатного издания',
	'558699000000': 'Иные документы, свидетельствующие о соблюдении установленного порядка извещения заинтересованных лиц о проведении собрания о согласовании местоположения границ земельного участка'
};
//Территориальные зоны и зоны с особыми условиями использования территорий
var dZone = {
	'218010000000': 'Территориальные зоны',
	'218010010000': 'Жилая зона',
	'218010020000': 'Общественно-деловая зона',
	'218010030000': 'Производственная зона, зона инженерной и транспортной инфраструктур',
	'218010040000': 'Зона сельскохозяйственного использования',
	'218010050000': 'Зона рекреационного назначения',
	'218010060000': 'Зона особо охраняемых территорий',
	'218010070000': 'Зона специального назначения',
	'218010080000': 'Зона размещения военных объектов',
	'218010090000': 'Иная зона',
	'218020000000': 'Зоны с особыми условиями использования территории',
	'218020010000': 'Зоны охраны природных объектов',
	'218020010001': 'Территория особо охраняемого природного объекта',
	'218020010002': 'Охранная зона особо охраняемого природного объекта',
	'218020010003': 'Водоохранная зона',
	'218020010004': 'Прибрежная защитная полоса',
	'218020010005': 'Зона санитарной охраны источников водоснабжения и водопроводов питьевого назначения',
	'218020010006': 'Особо ценные земли',
	'218020020000': 'Зоны охраны искусственных объектов',
	'218020020001': 'Территория объекта культурного наследия',
	'218020020002': 'Зона охраны объекта культурного наследия',
	'218020020003': 'Охранная зона геодезического пункта',
	'218020020004': 'Охранная зона стационарного пункта наблюдений за состоянием окружающей природной среды',
	'218020020005': 'Охранная зона транспорта',
	'218020020006': 'Охранная зона инженерных коммуникаций',
	'218020020007': 'Охранная зона линий и сооружений связи и линий и сооружений радиофикации',
	'218020020008': 'Придорожная полоса',
	'218020030000': 'Зоны защиты населения',
	'218020030001': 'Запретная зона при военном складе',
	'218020030002': 'Запретный район при военном складе',
	'218020030003': 'Загрязненные земли',
	'218020030004': 'Охранная зона загрязненных земель',
	'218020030005': 'Санитарно-защитная зона предприятий, сооружений и иных объектов',
	'218020030006': 'Санитарный разрыв (санитарная полоса отчуждения)',
	'218020030007': 'Зона ограничения от передающего радиотехнического объекта',
	'218020030008': 'Район падения отделяющихся частей ракет',
	'218020040000': 'Прочие зоны с особыми условиями использования территории',
	'218020040001': 'Зона публичного сервитута',
	'218020040002': 'Зона резервирования земель',
	'218020040003': 'Горный отвод',
	'218020040004': 'Пригородная зона',
	'218020040005': 'Зеленая зона',
	'218020040006': 'Особая экономическая зона',
	'218020040007': 'Пограничная зона',
	'218020040008': 'Территория традиционного природопользования',
	'218020050000': 'Иные зоны с особыми условиями использования территории',
	'218020050001': 'Иная зона с особыми условиями использования территории'		
};
// Классификатор видов использования земель
var dUtilizations = {
	'141000000000': 'Для размещения объектов сельскохозяйственного назначения и сельскохозяйственных угодий',
	'141001000000': 'Для сельскохозяйственного производства',
	'141001010000': 'Для использования в качестве сельскохозяйственных угодий',
	'141001020000': 'Для размещения зданий, строений, сооружений, используемых для производства, хранения и первичной переработки сельскохозяйственной продукции',
	'141001030000': 'Для размещения внутрихозяйственных дорог и коммуникаций',
	'141001040000': 'Для размещения водных объектов',
	'141002000000': 'Для ведения крестьянского (фермерского) хозяйства',
	'141003000000': 'Для ведения личного подсобного хозяйства',
	'141004000000': 'Для ведения гражданами садоводства и огородничества',
	'141005000000': 'Для ведения гражданами животноводства',
	'141006000000': 'Для дачного строительства',
	'141007000000': 'Для размещения древесно-кустарниковой растительности, предназначенной для защиты земель от воздействия негативных (вредных) природных, антропогенных и техногенных явлений',
	'141008000000': 'Для научно-исследовательских целей',
	'141009000000': 'Для учебных целей',
	'141010000000': 'Для сенокошения и выпаса скота гражданами',
	'141011000000': 'Фонд перераспределения',
	'141012000000': 'Для размещения объектов охотничьего хозяйства',
	'141013000000': 'Для размещения объектов рыбного хозяйства',
	'141014000000': 'Для иных видов сельскохозяйственного использования',
	'142000000000': 'Для размещения объектов, характерных для населённых пунктов',
	'142001000000': 'Для объектов жилой застройки',
	'142001010000': 'Для индивидуальной жилой застройки',
	'142001020000': 'Для многоквартирной застройки',
	'142001020100': 'Для малоэтажной застройки',
	'142001020200': 'Для среднеэтажной застройки',
	'142001020300': 'Для многоэтажной застройки',
	'142001020400': 'Для иных видов жилой застройки',
	'142001030000': 'Для размещения объектов дошкольного, начального, общего и среднего (полного) общего образования',
	'142001040000': 'Для размещения иных объектов, допустимых в жилых зонах и не перечисленных в классификаторе',
	'142002000000': 'Для объектов общественно-делового значения',
	'142002010000': 'Для размещения объектов социального и коммунально-бытового назначения',
	'142002020000': 'Для размещения объектов здравоохранения',
	'142002030000': 'Для размещения объектов культуры',
	'142002040000': 'Для размещения объектов торговли',
	'142002040100': 'Для размещения объектов розничной торговли',
	'142002040200': 'Для размещения объектов оптовой торговли',
	'142002050000': 'Для размещения объектов общественного питания',
	'142002060000': 'Для размещения объектов предпринимательской деятельности',
	'142002070000': 'Для размещения объектов среднего профессионального и высшего профессионального образования',
	'142002080000': 'Для размещения административных зданий',
	'142002090000': 'Для размещения научно-исследовательских учреждений',
	'142002100000': 'Для размещения культовых зданий',
	'142002110000': 'Для стоянок автомобильного транспорта',
	'142002120000': 'Для размещения объектов делового назначения, в том числе офисных центров',
	'142002130000': 'Для размещения объектов финансового назначения',
	'142002140000': 'Для размещения гостиниц',
	'142002150000': 'Для размещения подземных или многоэтажных гаражей',
	'142002160000': 'Для размещения индивидуальных гаражей',
	'142002170000': 'Для размещения иных объектов общественно-делового значения, обеспечивающих жизнь граждан',
	'142003000000': 'Для общего пользования (уличная сеть)',
	'142004000000': 'Для размещения объектов специального назначения',
	'142004010000': 'Для размещения кладбищ',
	'142004020000': 'Для размещения крематориев',
	'142004030000': 'Для размещения скотомогильников',
	'142004040000': 'Под объектами размещения отходов потребления',
	'142004050000': 'Под иными объектами специального назначения',
	'142005000000': 'Для размещения коммунальных, складских объектов',
	'142006000000': 'Для размещения объектов жилищно-коммунального хозяйства',
	'142007000000': 'Для иных видов использования, характерных для населённых пунктов',
	'143000000000': 'Для размещения объектов промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, обеспечения космической деятельности, обороны, безопасности и иного специального назначения',
	'143001000000': 'Для размещения промышленных объектов',
	'143001010000': 'Для размещения производственных и административных зданий, строений, сооружений и обслуживающих их объектов',
	'143001010100': 'Для размещения производственных зданий',
	'143001010200': 'Для размещения коммуникаций',
	'143001010300': 'Для размещения подъездных путей',
	'143001010400': 'Для размещения складских помещений',
	'143001010500': 'Для размещения административных зданий',
	'143001010600': 'Для размещения культурно-бытовых зданий',
	'143001010700': 'Для размещения иных сооружений промышленности',
	'143001020000': 'Для добычи и разработки полезных ископаемых',
	'143001030000': 'Для размещения иных объектов промышленности',
	'143002000000': 'Для размещения объектов энергетики',
	'143002010000': 'Для размещения электростанций и обслуживающих сооружений и объектов',
	'143002010100': 'Для размещения гидроэлектростанций',
	'143002010200': 'Для размещения атомных станций',
	'143002010300': 'Для размещения ядерных установок',
	'143002010400': 'Для размещения пунктов хранения ядерных материалов и радиоактивных веществ энергетики',
	'143002010500': 'Для размещения хранилищ радиоактивных отходов',
	'143002010600': 'Для размещения тепловых станций',
	'143002010700': 'Для размещения иных типов электростанций',
	'143002010800': 'Для размещения иных обслуживающих сооружений и объектов',
	'143002020000': 'Для размещения объектов электросетевого хозяйства',
	'143002020100': 'Для размещения воздушных линий электропередачи',
	'143002020200': 'Для размещения наземных сооружений кабельных линий электропередачи',
	'143002020300': 'Для размещения подстанций',
	'143002020400': 'Для размещения распределительных пунктов',
	'143002020500': 'Для размещения других сооружений и объектов электросетевого хозяйства',
	'143002030000': 'Для размещения иных объектов энергетики',
	'143003000000': 'Для размещения объектов транспорта',
	'143003010000': 'Для размещения и эксплуатации объектов железнодорожного транспорта',
	'143003010100': 'Для размещения железнодорожных путей и их конструктивных элементов',
	'143003010200': 'Для размещения полос отвода железнодорожных путей',
	'143003010300': 'Для размещения, эксплуатации, расширения и реконструкции строений, зданий, сооружений, в том числе железнодорожных вокзалов, железнодорожных станций, а также устройств и других объектов, необходимых для эксплуатации, содержания, строительства, реконструкции, ремонта, развития наземных и подземных зданий, строений, сооружений, устройств и других объектов железнодорожного транспорта',
	'143003010301': 'Для размещения железнодорожных вокзалов',
	'143003010302': 'Для размещения железнодорожных станций',
	'143003010303': 'Для размещения устройств и других объектов, необходимых для эксплуатации, содержания, строительства, реконструкции, ремонта, развития наземных и подземных зданий, строений, сооружений, устройств и других объектов железнодорожного транспорта',
	'143003020000': 'Для размещения и эксплуатации объектов автомобильного транспорта и объектов дорожного хозяйства',
	'143003020100': 'Для размещения автомобильных дорог и их конструктивных элементов',
	'143003020200': 'Для размещения полос отвода',
	'143003020300': 'Для размещения объектов дорожного сервиса в полосах отвода автомобильных дорог',
	'143003020400': 'Для размещения дорожных сооружений',
	'143003020500': 'Для размещения автовокзалов и автостанций',
	'143003020600': 'Для размещения иных объектов автомобильного транспорта и дорожного хозяйства',
	'143003030000': 'Для размещения и эксплуатации объектов морского, внутреннего водного транспорта',
	'143003030100': 'Для размещения искусственно созданных внутренних водных путей',
	'143003030200': 'Для размещения морских и речных портов, причалов, пристаней',
	'143003030300': 'Для размещения иных объектов морского, внутреннего водного транспорта',
	'143003030400': 'Для выделения береговой полосы',
	'143003040000': 'Для размещения и эксплуатации объектов воздушного транспорта',
	'143003040100': 'Для размещения аэропортов и аэродромов',
	'143003040200': 'Для размещения аэровокзалов',
	'143003040300': 'Для размещения взлетно-посадочных полос',
	'143003040400': 'Для размещения иных наземных объектов воздушного транспорта',
	'143003050000': 'Для размещения и эксплуатации объектов трубопроводного транспорта',
	'143003050100': 'Для размещения нефтепроводов',
	'143003050200': 'Для размещения газопроводов',
	'143003050300': 'Для размещения иных трубопроводов',
	'143003050400': 'Для размещения иных объектов трубопроводного транспорта',
	'143003060000': 'Для размещения и эксплуатации иных объектов транспорта',
	'143004000000': 'Для размещения объектов связи, радиовещания, телевидения, информатики',
	'143004010000': 'Для размещения эксплуатационных предприятий связи и обслуживания линий связи',
	'143004020000': 'Для размещения кабельных, радиорелейных и воздушных линий связи и линий радиофикации на трассах кабельных и воздушных линий связи и радиофикации и их охранные зоны',
	'143004030000': 'Для размещения подземных кабельных и воздушных линий связи и радиофикации и их охранные зоны',
	'143004040000': 'Для размещения наземных и подземных необслуживаемых усилительных пунктов на кабельных линиях связи и их охранные зоны',
	'143004050000': 'Для размещения наземных сооружений и инфраструктур спутниковой связи',
	'143004060000': 'Для размещения иных объектов связи, радиовещания, телевидения, информатики',
	'143005000000': 'Для размещения объектов, предназначенных для обеспечения космической деятельности',
	'143005010000': 'Для размещения космодромов, стартовых комплексов и пусковых установок',
	'143005020000': 'Для размещения командно-измерительных комплексов, центров и пунктов управления полетами космических объектов, приема, хранения и переработки информации',
	'143005030000': 'Для размещения баз хранения космической техники',
	'143005040000': 'Для размещения полигонов приземления космических объектов и взлетно-посадочных полос',
	'143005050000': 'Для размещения объектов экспериментальной базы для отработки космической техники',
	'143005060000': 'Для размещения центров и оборудования для подготовки космонавтов',
	'143005070000': 'Для размещения других наземных сооружений и техники, используемых при осуществлении космической деятельности',
	'143006000000': 'Для размещения объектов, предназначенных для обеспечения обороны и безопасности',
	'143006010000': 'Для обеспечения задач обороны',
	'143006010100': 'Для размещения военных организаций, учреждений и других объектов',
	'143006010200': 'Для дислокации войск и сил флота',
	'143006010300': 'Для проведения учений и иных мероприятий',
	'143006010400': 'Для испытательных полигонов',
	'143006010500': 'Для мест уничтожения оружия и захоронения отходов',
	'143006010600': 'Для создания запасов материальных ценностей в государственном и мобилизационном резервах (хранилища, склады и другие)',
	'143006010700': 'Для размещения иных объектов обороны',
	'143006020000': 'Для размещения объектов (территорий), обеспечивающих защиту и охрану Государственной границы Российской Федерации',
	'143006020100': 'Для обустройства и содержания инженерно-технических сооружений и заграждений',
	'143006020200': 'Для обустройства и содержания пограничных знаков',
	'143006020300': 'Для обустройства и содержания пограничных просек',
	'143006020400': 'Для обустройства и содержания коммуникаций',
	'143006020500': 'Для обустройства и содержания пунктов пропуска через Государственную границу Российской Федерации',
	'143006020600': 'Для размещения иных объектов для защиты и охраны Государственной границы Российской Федерации',
	'143006030000': 'Для размещения иных объектов обороны и безопасности',
	'143007000000': 'Для размещения иных объектов промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, обеспечения космической деятельности, обороны, безопасности и иного специального назначения',
	'144000000000': 'Для размещения особо охраняемых историко-культурных и природных объектов (территорий)',
	'144001000000': 'Для размещения особо охраняемых природных объектов (территорий)',
	'144001010000': 'Для размещения государственных природных заповедников (в том числе биосферных)',
	'144001020000': 'Для размещения государственных природных заказников',
	'144001030000': 'Для размещения национальных парков',
	'144001040000': 'Для размещения природных парков',
	'144001050000': 'Для размещения дендрологических парков',
	'144001060000': 'Для размещения ботанических садов',
	'144001070000': 'Для размещения объектов санаторного и курортного назначения',
	'144001080000': 'Территории месторождений минеральных вод, лечебных грязей, рапы лиманов и озер',
	'144001090000': 'Для традиционного природопользования',
	'144001100000': 'Для размещения иных особо охраняемых природных территорий (объектов)',
	'144002000000': 'Для размещения объектов (территорий) природоохранного назначения',
	'144003000000': 'Для размещения объектов (территорий) рекреационного назначения',
	'144003010000': 'Для размещения домов отдыха, пансионатов, кемпингов',
	'144003020000': 'Для размещения объектов физической культуры и спорта',
	'144003030000': 'Для размещения туристических баз, стационарных и палаточных туристско-оздоровительных лагерей, домов рыболова и охотника, детских туристических станций',
	'144003040000': 'Для размещения туристических парков',
	'144003050000': 'Для размещения лесопарков',
	'144003060000': 'Для размещения учебно-туристических троп и трасс',
	'144003070000': 'Для размещения детских и спортивных лагерей',
	'144003080000': 'Для размещения скверов, парков, городских садов',
	'144003090000': 'Для размещения пляжей',
	'144003100000': 'Для размещения иных объектов (территорий) рекреационного назначения',
	'144004000000': 'Для размещения объектов историко-культурного назначения',
	'144004010000': 'Для размещения объектов культурного наследия народов Российской Федерации (памятников истории и культуры), в том числе объектов археологического наследия',
	'144004020000': 'Для размещения военных и гражданских захоронений',
	'144005000000': 'Для размещения иных особо охраняемых историко-культурных и природных объектов (территорий)',
	'145000000000': 'Для размещения объектов лесного фонда',
	'145001000000': 'Для размещения лесной растительности',
	'145002000000': 'Для восстановления лесной растительности',
	'145003000000': 'Для прочих объектов лесного хозяйства',
	'146000000000': 'Для размещения объектов водного фонда',
	'146001000000': 'Под водными объектами',
	'146002000000': 'Для размещения гидротехнических сооружений',
	'146003000000': 'Для размещения иных сооружений, расположенных на водных объектах',
	'147000000000': 'Земли запаса (неиспользуемые)'
};
// Назначение зданий
var dAssBuilding = {
	'204001000000': 'Нежилое здание',
	'204002000000': 'Жилой дом',
	'204003000000': 'Многоквартирный дом'
};

var ParcelProperties;
var ConstructionProperties;
var UncompletedProperties;
var BuildingProperties;
var ZoneProperties;
var BoundProperties;

function getValueFromDict(Key, Dic) {
    for (var k in Dic) {
        if (k === Key) {
            return Dic[k];
        }
    }
}

module.exports.getProperties = function (Feature, FeatureType) {
    switch (FeatureType) {
        case 'Parcel' :
        {
            ParcelProperties = {
                "Кадастровый номер": '', // require
                "Статус": '01', // dStates require
                "Дата создания": '',
                "Тип объекта": '', //dParcels require
                "Категория земель": '', // dCategories // require
                "Площадь": {// requre
                    "Значение": 0, // require
                    "ед.изм": '', //dUnit require
                    "Точность": '' // d20_2
                },
                "Разрешённое использование": {// require
                    "по документу": '',
                    "по справочнику": '' // dUtilization require
                }
            };
            ParcelProperties["Кадастровый номер"] = Feature.CadastralNumber;
            ParcelProperties["Статус"] = getValueFromDict(Feature.State, dStates);
            ParcelProperties["Тип объекта"] = getValueFromDict(Feature.Name, dParcels);
            ParcelProperties["Категория земель"] = getValueFromDict(Feature.Category, dCategories);
            ParcelProperties["Дата создания"] = Feature.DateCreated;
            ParcelProperties["Разрешённое использование"]["по справочнику"] = 
                    getValueFromDict(Feature.Utilization.Utilization, dUtilizations);
            ParcelProperties["Разрешённое использование"]["по документу"] = Feature.Utilization.ByDoc;
            break;
        }
        case 'Construction':{
            ConstructionProperties = {
                cadastreNumber: '', // 
                ObjectType: '', // require
                AssignationName: ''
            }
            if (Feature.CadastralNumber) {
                ConstructionProperties.cadastreNumber = Feature.CadastralNumber;
            } else {
                ConstructionProperties.cadastreNumber = '';
            }
            
            ConstructionProperties.AssignationName = Feature.AssignationName;
            ConstructionProperties.ObjectType = getValueFromDict(Feature.ObjectType, dZone);
        }
        case 'Building':{
            ConstructionProperties = {
                cadastreNumber: '', // 
                ObjectType: '', // require
                AssignationName: ''
            }
            if (Feature.CadastralNumber) {
                ConstructionProperties.cadastreNumber = Feature.CadastralNumber;
            } else {
                ConstructionProperties.cadastreNumber = '';
            }
            
            ConstructionProperties.AssignationName = Feature.AssignationName;
            ConstructionProperties.ObjectType = getValueFromDict(Feature.ObjectType, dZone);
        }
        default :{
                console.log('Тип объекта не распознан');
        }
    }
    return {
        parcelProperties: ParcelProperties,
        constructionProperties: ConstructionProperties,
        uncompletedProperties: UncompletedProperties,
        buildingProperties: BuildingProperties,
        zoneProperties: ZoneProperties,
        boundProperties: BoundProperties
    };
};
},{}],3:[function(require,module,exports){
var ES = require('./spatial/EntitySpatial.js');
var Props = require('./cadProps');

var projMSK = {
    'МСК_70_зона_4': '+proj=tmerc +lat_0=0 +lon_0=83.73333333333 +k=1 +x_0=4250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs',
    'МСК_70_зона_2': '+proj=tmerc +lat_0=0 +lon_0=77.73333333333 +k=1 +x_0=2250000 +y_0=-5912900.566 +ellps=krass +towgs84=23.57,-140.95,-79.8,0,0.35,0.79,-0.22 +units=m +no_defs'
};

module.exports.GeoJSON = function (xmlData) {

    var geoJSONQuartal = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONBounds = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONZones = {
        type: "FeatureCollection",
        features: []
    };
    var geoJSONParcels = {
        'type': 'FeatureCollection',
        'features': []
    };
    var geoJSONRealty = {
        type: "FeatureCollection",
        features: []
    };
    // В GeoJSON нет окружностей и обрабатывать стандартными парсерами нельзя
    var geoJSONRealtyCircle = {
        type: "CircleCollection",
        features: []
    };
    var geoJSONOSMPoints = {
        type: "FeatureCollection",
        features: []
    };

    var AllData = $.xml2json(xmlData).CadastralBlocks.CadastralBlock;
    console.log(AllData);

    // Обработка квартала. Не может быть многоконтурным           
    if (AllData.SpatialData !== null) {
        var spObj = ES.getEntitySpatial(AllData.SpatialData.EntitySpatial, projMSK, false);
        if ((spObj === undefined) || (spObj.length === 0)) {
            console.log('Объект квартала с пустой геометрией! Объект будет пропущен.');
        }
        // Квартал
        var feature = {
            'type': 'Feature'
        };
        feature.geometry = spObj;
        // Остальные свойства....

        geoJSONQuartal.features.push(feature);
    } else {
        console.log('Нет описания пространственной составляющей квартала');
    }

    // Обработка границ. Не могут быть многоконтурными
    if (AllData.Bounds) {

        if (AllData.Bounds.Bound.splice) {
            for (var i = 0; i < AllData.Bounds.Bound.length; i++) {
                if (AllData.Bounds.Bound[i].Boundaries.Boundary.splice) {
                    for (var k = 0; k < AllData.Bounds.Bound[i].Boundaries.Boundary.length; k++) {
                        // Граница
                        var feature = {
                            'type': 'Feature'
                        };
                        if (AllData.Bounds.Bound[i].Boundaries.Boundary[k].EntitySpatial !== null) {
                            var spObj = ES.getEntitySpatial(AllData.Bounds.Bound[i].Boundaries.Boundary[k].EntitySpatial, projMSK, false);
                            if ((spObj === undefined) || (spObj.length === 0)) {
                                console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
                                continue;
                            }
                            feature.geometry = spObj;
                            // Остальные свойства....

                            geoJSONBounds.features.push(feature);
                        } else {
                            //console.log('Нет описания пространственной составляющей границы');
                        }
                    }
                } else {
                    // Граница
                    var feature = {
                        'type': 'Feature'
                    };
                    var spObj = ES.getEntitySpatial(AllData.Bounds.Bound[i].Boundaries.Boundary.EntitySpatial, projMSK, false);
                    if ((spObj === undefined) || (spObj.length === 0)) {
                        console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
                        continue;
                    }
                    feature.geometry = spObj;
                    // Остальные свойства....

                    geoJSONBounds.features.push(feature);
                }
            }
        } else {
            var spObj = ES.getEntitySpatial(AllData.Bounds.Bound.Boundaries.Boundary.EntitySpatial, projMSK, false);
            if ((spObj === undefined) || (spObj.length === 0)) {
                console.log('Объект Границы с пустой геометрией! Объект будет пропущен.');
            }
            feature.geometry = spObj;
            // Остальные свойства....

            geoJSONBounds.features.push(feature);
        }
    }
    // Обработка зон. Не могут быть многоконтурными
    if (AllData.Zones) {

        if (AllData.Zones.Zone.splice) {
            for (var i = 0; i < AllData.Zones.Zone.length; i++) {
                // Зона
                var feature = {
                    'type': 'Feature'
                };
                if (AllData.Zones.Zone[i].EntitySpatial !== null) {
                    var spObj = ES.getEntitySpatial(AllData.Zones.Zone[i].EntitySpatial, projMSK, false);
                    if ((spObj === undefined) || (spObj.length === 0)) {
                        console.log('Объект Зоны с пустой геометрией! Объект будет пропущен.');
                        continue;
                    }
                    feature.geometry = spObj;

                    geoJSONZones.features.push(feature);
                } else {
                    console.log('Нет описания пространственной составляющей зоны');
                }
            }
        } else {
            if (AllData.Zones.Zone.EntitySpatial !== null) {
                // Зона
                var feature = {
                    'type': 'Feature'
                };
                var spObj = ES.getEntitySpatial(AllData.Zones.Zone.EntitySpatial, projMSK, false);
                if ((spObj === undefined) || (spObj.length === 0)) {
                    console.log('Объект Зоны с пустой геометрией! Объект будет пропущен.');
                }
                feature.geometry = spObj;

                geoJSONZones.features.push(feature);
            } else {
                console.log('Нет описания пространственной составляющей зоны');
            }
        }
    }
    // Обработка всех земельных участков
    for (var e = 0; e < AllData.Parcels.Parcel.length; e++) {
        var spObj = null;
        // Земельный участок
        var feature = {
            'type': 'Feature'
        };
        if (AllData.Parcels.Parcel[e].EntitySpatial !== undefined) {
            spObj = ES.getEntitySpatial(AllData.Parcels.Parcel[e].EntitySpatial, projMSK, false);
            if ((spObj === undefined) || (spObj.length === 0)) {
                continue;
            }

        }
        // Многоконтурный
        else if (AllData.Parcels.Parcel[e].Contours) {
            var Contours = AllData.Parcels.Parcel[e].Contours.Contour;
            var multiPolygon = [];
            for (var c = 0; c < Contours.length; c++) {
                var es = Contours[c].EntitySpatial;
                var p = ES.getEntitySpatial(es, projMSK, true);
                if (p) {
                    multiPolygon.push(p);
                }
            }
            spObj = {
                type: "MultiPolygon",
                coordinates: multiPolygon
            };
        } else {
            //console.log('Нет описания пространственной составляющей');
        }

        // Если нет геометрии, то объект не нужен
        if (spObj) {
            feature.geometry = spObj;
            // Остальные свойства....
            var props = Props.getProperties(AllData.Parcels.Parcel[e], 'Parcel');
            if (props) {
                feature.properties = props.parcelProperties;
            }
            //console.log('Объект создан. КН:' + feature.properties.cadastreNumber);
            geoJSONParcels.features.push(feature);
        }

    }
    // Обработка строений. Не могут быть многоконтурными
    if (AllData.ObjectsRealty.ObjectRealty) {
        if (AllData.ObjectsRealty.ObjectRealty.splice) {

            function processES(EntitySpatial) {
                var spObj = ES.getEntitySpatial(EntitySpatial, projMSK);
                if (spObj) {
                    feature.geometry = spObj;
                    if (spObj.type === 'Circle') {
                        geoJSONRealtyCircle.features.push(feature);
                        console.log('Добавлен geoJSONRealtyCircle');
                    } else {
                        geoJSONRealty.features.push(feature);
                        console.log('Добавлен geoJSONRealty. Type ' + spObj.type);
                    }
                } else {
                    console.log('ОКС с пустой геометрией! Объект будет пропущен.');
                }
            }

            for (var i = 0; i < AllData.ObjectsRealty.ObjectRealty.length; i++) {
                var spObj = null;
                // ОКС
                var feature = {
                    'type': 'Feature'
                };
                // строения
                if (AllData.ObjectsRealty.ObjectRealty[i].Building) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Building.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Building, 'Building');
                        if (props) {
                            feature.properties = props.buildingProperties;
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Building.EntitySpatial);
                    }
                }
                // объекты незавершённого строительства
                else if (AllData.ObjectsRealty.ObjectRealty[i].Uncompleted) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Uncompleted.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Uncompleted, 'Uncompleted');
                        if (props) {
                            feature.properties = props.uncompletedProperties;
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Uncompleted.EntitySpatial);
                    }
                }
                // сооружения
                else if (AllData.ObjectsRealty.ObjectRealty[i].Construction) {
                    if (AllData.ObjectsRealty.ObjectRealty[i].Construction.EntitySpatial) {
                        var props = Props.getProperties(AllData.ObjectsRealty.ObjectRealty[i].Construction, 'Construction');
                        if (props) {
                            feature.properties = props.constructionProperties;
                        }
                        processES(AllData.ObjectsRealty.ObjectRealty[i].Construction.EntitySpatial);
                    }
                }
            }
        }
    }
    // Обработка пунктов ОМС

    return {
        geoJSONQuartal: geoJSONQuartal,
        geoJSONBounds: geoJSONBounds, 
        geoJSONZones: geoJSONZones,
        geoJSONParcels: geoJSONParcels,
        geoJSONRealty: geoJSONRealty,
        geoJSONRealtyCircle: geoJSONRealtyCircle
    };
};

},{"./cadProps":2,"./spatial/EntitySpatial.js":4}],4:[function(require,module,exports){
/**
 * Модуль обработки геометрии типа полигон.
 * Один внешний контур и 0 или более внутренних контуров-"дырок"
 * 
 * GeoJSON geometry типа tEntitySpatialLandOut
 */

//"geometry": {
//    "type": "Polygon",
//    "coordinates": [
//      [ [100.0, 0.0], [101.0, 0.0], [101.0, 1.0],
//        [100.0, 1.0], [100.0, 0.0] ]
//      ]
//  }


module.exports.getEntitySpatial = function (EntitySpatialObj, proj, partOfMultu) {

//	this.geometry = {
//        type: '',
//		coordinates: []
//	};

    //var EntitySpatial = [];
    var Area = 0.0;

    // Вычисление площади замкнутого контура
    function polygonArea(Xs, Ys, numPoints) {
        var area = 0;
        var j = numPoints - 1;
        for (var i = 0; i < numPoints; i++)
        {
            area = area + ((Xs[j]) + (Xs[i])) * ((Ys[j]) - (Ys[i]));
            j = i;  //j is previous vertex to i
        }
        return Math.abs(area / 2);
    }
    
    function convertCoord(coord) {
        // global
        return proj4(proj["МСК_70_зона_2"], 'EPSG:3857', coord);
    }
    
    // Создание одного замкнутого контура
    function createContour(SpatialElement) {
        var xs = [];
        var ys = [];
        var contour = [];
        var coord;
        var reprojected;
        // проверка на окружность
        if ((partOfMultu === undefined) &&
                (SpatialElement.SpelementUnit.R !== undefined)) {
            coord = [SpatialElement.SpelementUnit.Ordinate.Y, SpatialElement.SpelementUnit.Ordinate.X];
            reprojected = convertCoord(coord);
            return {
                
                'R': Number(SpatialElement.SpelementUnit.R),
                'X': Number(reprojected[0]),
                'Y': Number(reprojected[1])
            };
        } else {
            var firstPoint = SpatialElement.SpelementUnit[0];
            var lastPoint = SpatialElement.SpelementUnit[SpatialElement.SpelementUnit.length-1];
            if (firstPoint.SuNmb === lastPoint.SuNmb) {
                LineString = false;
                for (var j = 0; j < SpatialElement.SpelementUnit.length; j++) {
                    var point = SpatialElement.SpelementUnit[j];
                    var xy = [];
                    xs.push(parseFloat(point.Ordinate.Y));
                    ys.push(parseFloat(point.Ordinate.X));
                    coord = [parseFloat(point.Ordinate.Y), parseFloat(point.Ordinate.X)];
                    reprojected = convertCoord(coord);
                    xy.push(reprojected[0]);
                    xy.push(reprojected[1]);
                    contour.push(xy);
                }
                Area = polygonArea(xs, ys, xs.length);
            } else {
                LineString = true;
                for (var j = 0; j < SpatialElement.SpelementUnit.length-1; j++) {
                    var point = SpatialElement.SpelementUnit[j];
                    var xy = [];
                    xs.push(parseFloat(point.Ordinate.Y));
                    ys.push(parseFloat(point.Ordinate.X));
                    coord = [parseFloat(point.Ordinate.Y), parseFloat(point.Ordinate.X)];
                    reprojected = convertCoord(coord);
                    xy.push(reprojected[0]);
                    xy.push(reprojected[1]);
                    contour.push(xy);
                }
            }
            //console.log(Area);
            return contour;
        }
    }

    if ((EntitySpatialObj !== undefined) && (EntitySpatialObj !== null)) {
        var cntrs = [];
        // Утинная типизация для проверки наличия дырок в полигоне
        // В Росреестре не следят за порядком контуров полигона
        if (EntitySpatialObj.SpatialElement.splice) {
            //console.log('Полигон с дырками');

            var MaxArea;
            var MaxAreaIdx = 0;
            for (var k = 0; k < EntitySpatialObj.SpatialElement.length; k++) {
                var contour = EntitySpatialObj.SpatialElement[k];
                var cnt = createContour(contour);
                if (cnt)
                    cntrs.push(cnt);
                if (Area > MaxArea) {
                    MaxArea = Area;
                    MaxAreaIdx = k;
                }
            }
            // Перемещаем основной (наружний) контур в начало массива
            if (MaxAreaIdx > 0) {
                var mainCnt = cntrs.splice(MaxAreaIdx, 1);
                cntrs.splice(0, 0, mainCnt);
                //console.log('Номер основного контура был ' + MaxAreaIdx);
            }

            // Если это для многоконтурного объекта, то возвращем массив контуров
            if (partOfMultu) {
                return cntrs;
            }
            // для ОКС. Только один контур
            else if (partOfMultu === undefined) {
                if (cntrs[0].R) {
                    return {
                        "type": "Circle",
                        "coordinates": [cntrs[0].X, cntrs[0].Y],
                        "radius": cntrs[0].R,
                        "properties": {
                            "radius_units": "m"
                        }
                    };
                }
            } // Полилиня лоя ОКС
            else if ((partOfMultu === undefined) && (LineString)) {
                return {
                    "type": "MultiLineString",
                    "coordinates": cntrs
                };
            }
            // Если это для простого объекта, то возвращем объект geometry
            else {
                return {
                    type: "Polygon",
                    coordinates: cntrs
                };
            }

        } else {
            var contour = EntitySpatialObj.SpatialElement;
            var polygon = createContour(contour);
            cntrs.push(polygon);
            // Если это для многоконтурного объекта, то возвращем массив контуров
            if (partOfMultu) {
                return cntrs;
            }
            // для ОКС. Окружность
            else if ((partOfMultu === undefined) && (cntrs[0].R)) {
                return {
                    "type": "Circle",
                    "coordinates": [cntrs[0].X, cntrs[0].Y],
                    "radius": cntrs[0].R,
                    "properties": {
                        "radius_units": "m"
                    } 
                };
            } // Полилиня лоя ОКС
            else if ((partOfMultu === undefined) && (LineString)) {
                return {
                    "type": "LineString",
                    "coordinates": cntrs[0]
                };
            }
            // Если это для простого объекта, то возвращем объект geometry
            else {
                return {
                    type: "Polygon",
                    coordinates: cntrs
                };
            }
        }
    }
};

},{}]},{},[1])
//# sourceMappingURL=data:application/json;base64,eyJ2ZXJzaW9uIjozLCJzb3VyY2VzIjpbIm5vZGVfbW9kdWxlcy9ncnVudC1icm93c2VyaWZ5L25vZGVfbW9kdWxlcy9icm93c2VyaWZ5L25vZGVfbW9kdWxlcy9icm93c2VyLXBhY2svX3ByZWx1ZGUuanMiLCJzcmMvYXBwLmpzIiwic3JjL2NhZFByb3BzLmpzIiwic3JjL2NhZFhNTDJHZW9KU09OLmpzIiwic3JjL3NwYXRpYWwvRW50aXR5U3BhdGlhbC5qcyJdLCJuYW1lcyI6W10sIm1hcHBpbmdzIjoiQUFBQTtBQ0FBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBOztBQ2pSQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBOztBQzEyQkE7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTs7QUM1UUE7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0E7QUFDQTtBQUNBO0FBQ0EiLCJmaWxlIjoiZ2VuZXJhdGVkLmpzIiwic291cmNlUm9vdCI6IiIsInNvdXJjZXNDb250ZW50IjpbIihmdW5jdGlvbiBlKHQsbixyKXtmdW5jdGlvbiBzKG8sdSl7aWYoIW5bb10pe2lmKCF0W29dKXt2YXIgYT10eXBlb2YgcmVxdWlyZT09XCJmdW5jdGlvblwiJiZyZXF1aXJlO2lmKCF1JiZhKXJldHVybiBhKG8sITApO2lmKGkpcmV0dXJuIGkobywhMCk7dmFyIGY9bmV3IEVycm9yKFwiQ2Fubm90IGZpbmQgbW9kdWxlICdcIitvK1wiJ1wiKTt0aHJvdyBmLmNvZGU9XCJNT0RVTEVfTk9UX0ZPVU5EXCIsZn12YXIgbD1uW29dPXtleHBvcnRzOnt9fTt0W29dWzBdLmNhbGwobC5leHBvcnRzLGZ1bmN0aW9uKGUpe3ZhciBuPXRbb11bMV1bZV07cmV0dXJuIHMobj9uOmUpfSxsLGwuZXhwb3J0cyxlLHQsbixyKX1yZXR1cm4gbltvXS5leHBvcnRzfXZhciBpPXR5cGVvZiByZXF1aXJlPT1cImZ1bmN0aW9uXCImJnJlcXVpcmU7Zm9yKHZhciBvPTA7bzxyLmxlbmd0aDtvKyspcyhyW29dKTtyZXR1cm4gc30pIiwiLyogXG4gKiBUbyBjaGFuZ2UgdGhpcyBsaWNlbnNlIGhlYWRlciwgY2hvb3NlIExpY2Vuc2UgSGVhZGVycyBpbiBQcm9qZWN0IFByb3BlcnRpZXMuXG4gKiBUbyBjaGFuZ2UgdGhpcyB0ZW1wbGF0ZSBmaWxlLCBjaG9vc2UgVG9vbHMgfCBUZW1wbGF0ZXNcbiAqIGFuZCBvcGVuIHRoZSB0ZW1wbGF0ZSBpbiB0aGUgZWRpdG9yLlxuICovXG5cbnZhciBDb252ZXJ0ZXIgPSByZXF1aXJlKCcuL2NhZFhNTDJHZW9KU09OLmpzJyk7XG52YXIgbWFwO1xuXG5TdGFydFBhcnNlKCk7XG5cbmZ1bmN0aW9uIFN0YXJ0UGFyc2UoKSB7XG5cbiAgICB2YXIgY29udGFpbmVyID0gZG9jdW1lbnQuZ2V0RWxlbWVudEJ5SWQoJ3BvcHVwJyk7XG4gICAgdmFyIGNvbnRlbnQgPSBkb2N1bWVudC5nZXRFbGVtZW50QnlJZCgncG9wdXAtY29udGVudCcpO1xuICAgIHZhciBjbG9zZXIgPSBkb2N1bWVudC5nZXRFbGVtZW50QnlJZCgncG9wdXAtY2xvc2VyJyk7XG5cbiAgICBjbG9zZXIub25jbGljayA9IGZ1bmN0aW9uICgpIHtcbiAgICAgICAgb3ZlcmxheS5zZXRQb3NpdGlvbih1bmRlZmluZWQpO1xuICAgICAgICBjbG9zZXIuYmx1cigpO1xuICAgICAgICByZXR1cm4gZmFsc2U7XG4gICAgfTtcblxuICAgIHZhciBvdmVybGF5ID0gbmV3IG9sLk92ZXJsYXkoLyoqIEB0eXBlIHtvbHguT3ZlcmxheU9wdGlvbnN9ICovICh7XG4gICAgICAgIGVsZW1lbnQ6IGNvbnRhaW5lcixcbiAgICAgICAgYXV0b1BhbjogdHJ1ZSxcbiAgICAgICAgYXV0b1BhbkFuaW1hdGlvbjoge1xuICAgICAgICAgICAgZHVyYXRpb246IDI1MFxuICAgICAgICB9XG4gICAgfSkpO1xuXG4gICAgLy8gaHR0cHM6Ly9iaXRidWNrZXQub3JnL3N1cmVucmFvL3htbDJqc29uXG4gICAgLy8gaHR0cDovL3d3dy5jaHJvbWUtYWxsb3ctZmlsZS1hY2Nlc3MtZnJvbS1maWxlLmNvbS9cbiAgICB2YXIgcGFyc2VkRGF0YTtcbiAgICAkLmdldCgnLi90ZXN0ZGF0YS9kb2MxNzE4NTE1LnhtbCcsIGZ1bmN0aW9uICh4bWwpIHtcbiAgICAgICAgLy92YXIganNvbiA9ICQueG1sMmpzb24oeG1sKS5DYWRhc3RyYWxCbG9ja3M7XG4gICAgICAgIC8vICQoXCIjZGF0YVwiKS5odG1sKCc8Y29kZT4nK0pTT04uc3RyaW5naWZ5KGpzb24pKyc8L2NvZGU+Jyk7XG4gICAgICAgIC8vY29uc29sZS5sb2coQ29udmVydGVyLkdlb0pTT04pO1xuICAgICAgICBwYXJzZWREYXRhID0gQ29udmVydGVyLkdlb0pTT04oeG1sKTtcbiAgICB9KS5zdWNjZXNzKFxuICAgICAgICAgICAgZnVuY3Rpb24gKCkge1xuICAgICAgICAgICAgICAgIC8vIGh0dHA6Ly93d3cuY29sb3ItaGV4LmNvbS9cbiAgICAgICAgICAgICAgICB2YXIgcGFyY2VsRmlsbCA9IG5ldyBvbC5zdHlsZS5GaWxsKHtcbiAgICAgICAgICAgICAgICAgICAgY29sb3I6ICcjYmJmMTQ0J1xuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIHZhciB6b25lRmlsbCA9IG5ldyBvbC5zdHlsZS5GaWxsKHtcbiAgICAgICAgICAgICAgICAgICAgY29sb3I6ICcjMDA5ZmZmJ1xuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIHZhciByZWFsdHlsU3Ryb2tlID0gbmV3IG9sLnN0eWxlLlN0cm9rZSh7XG4gICAgICAgICAgICAgICAgICAgIGNvbG9yOiAnI0ZGMDBDMScsXG4gICAgICAgICAgICAgICAgICAgIHdpZHRoOiAxLjJcbiAgICAgICAgICAgICAgICB9KTtcblxuICAgICAgICAgICAgICAgIHZhciBzdHJva2UgPSBuZXcgb2wuc3R5bGUuU3Ryb2tlKHtcbiAgICAgICAgICAgICAgICAgICAgY29sb3I6ICcjMzEzMDMwJyxcbiAgICAgICAgICAgICAgICAgICAgd2lkdGg6IDFcbiAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB2YXIgYm91bmRTdHJva2UgPSBuZXcgb2wuc3R5bGUuU3Ryb2tlKHtcbiAgICAgICAgICAgICAgICAgICAgY29sb3I6ICcjMDA0QzAwJyxcbiAgICAgICAgICAgICAgICAgICAgd2lkdGg6IDFcbiAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB2YXIgem9uZVN0cm9rZSA9IG5ldyBvbC5zdHlsZS5TdHJva2Uoe1xuICAgICAgICAgICAgICAgICAgICBjb2xvcjogJyMxNDMzODgnLFxuICAgICAgICAgICAgICAgICAgICB3aWR0aDogMVxuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIHZhciBxdWFydGFsU3Ryb2tlID0gbmV3IG9sLnN0eWxlLlN0cm9rZSh7XG4gICAgICAgICAgICAgICAgICAgIGNvbG9yOiAnIzNiMjAyZicsXG4gICAgICAgICAgICAgICAgICAgIHdpZHRoOiAyXG4gICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgdmFyIHRleHQgPSBuZXcgb2wuc3R5bGUuVGV4dCh7XG4gICAgICAgICAgICAgICAgICAgIC8vIFRPRE8g0J/QvtC00L/QuNGB0LDRgtGMINC60LDQtNCw0YHRgtGA0L7QstGL0LUg0L3QvtC80LXRgNCwXG4gICAgICAgICAgICAgICAgfSk7XG5cbiAgICAgICAgICAgICAgICAvLyDQodGC0LjQu9C4XG4gICAgICAgICAgICAgICAgdmFyIHBhcmNlbFN0eWxlID0gbmV3IG9sLnN0eWxlLlN0eWxlKHtcbiAgICAgICAgICAgICAgICAgICAgZmlsbDogcGFyY2VsRmlsbCxcbiAgICAgICAgICAgICAgICAgICAgc3Ryb2tlOiBzdHJva2VcbiAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB2YXIgcmVhbHR5U3R5bGUgPSBuZXcgb2wuc3R5bGUuU3R5bGUoe1xuICAgICAgICAgICAgICAgICAgICBzdHJva2U6IHJlYWx0eWxTdHJva2VcbiAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB2YXIgcXVhcnRhbFN0eWxlID0gbmV3IG9sLnN0eWxlLlN0eWxlKHtcbiAgICAgICAgICAgICAgICAgICAgc3Ryb2tlOiBxdWFydGFsU3Ryb2tlXG4gICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgdmFyIGJvdW5kU3R5bGUgPSBuZXcgb2wuc3R5bGUuU3R5bGUoe1xuICAgICAgICAgICAgICAgICAgICBzdHJva2U6IGJvdW5kU3Ryb2tlXG4gICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgdmFyIHpvbmVTdHlsZSA9IG5ldyBvbC5zdHlsZS5TdHlsZSh7XG4gICAgICAgICAgICAgICAgICAgIGZpbGw6IHpvbmVGaWxsLFxuICAgICAgICAgICAgICAgICAgICBzdHJva2U6IHpvbmVTdHJva2VcbiAgICAgICAgICAgICAgICB9KTtcblxuXG4gICAgICAgICAgICAgICAgdmFyIHF1YXJ0YWxTb3VyY2UgPSBuZXcgb2wuc291cmNlLlZlY3Rvcih7XG4gICAgICAgICAgICAgICAgICAgIHByb2plY3Rpb246ICdFUFNHOjQzMjYnXG4gICAgICAgICAgICAgICAgfSk7XG4gICAgICAgICAgICAgICAgdmFyIHBhcmNlbFNvdXJjZSA9IG5ldyBvbC5zb3VyY2UuVmVjdG9yKHtcbiAgICAgICAgICAgICAgICAgICAgZmVhdHVyZXM6IChuZXcgb2wuZm9ybWF0Lkdlb0pTT04oKSkucmVhZEZlYXR1cmVzKHBhcnNlZERhdGEuZ2VvSlNPTlBhcmNlbHMpLFxuICAgICAgICAgICAgICAgICAgICBwcm9qZWN0aW9uOiAnRVBTRzo0MzI2J1xuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIHZhciByZWFsdHlTb3VyY2UgPSBuZXcgb2wuc291cmNlLlZlY3Rvcih7XG4gICAgICAgICAgICAgICAgICAgIGZlYXR1cmVzOiAobmV3IG9sLmZvcm1hdC5HZW9KU09OKCkpLnJlYWRGZWF0dXJlcyhwYXJzZWREYXRhLmdlb0pTT05SZWFsdHkpLFxuICAgICAgICAgICAgICAgICAgICBwcm9qZWN0aW9uOiAnRVBTRzo0MzI2J1xuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIHZhciBib3VuZFNvdXJjZSA9IG5ldyBvbC5zb3VyY2UuVmVjdG9yKHtcbiAgICAgICAgICAgICAgICAgICAgcHJvamVjdGlvbjogJ0VQU0c6NDMyNidcbiAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB2YXIgem9uZVNvdXJjZSA9IG5ldyBvbC5zb3VyY2UuVmVjdG9yKHtcbiAgICAgICAgICAgICAgICAgICAgcHJvamVjdGlvbjogJ0VQU0c6NDMyNidcbiAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB2YXIgcXVhcnRhbExheWVyID0gbmV3IG9sLmxheWVyLlZlY3Rvcih7XG4gICAgICAgICAgICAgICAgICAgIHRpdGxlOiAn0JrQstCw0YDRgtCw0LsnLFxuICAgICAgICAgICAgICAgICAgICBzb3VyY2U6IHF1YXJ0YWxTb3VyY2UsXG4gICAgICAgICAgICAgICAgICAgIHN0eWxlOiBxdWFydGFsU3R5bGUsXG4gICAgICAgICAgICAgICAgICAgIG9wYWNpdHk6IDAuNVxuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIHZhciBwYXJjZWxMYXllciA9IG5ldyBvbC5sYXllci5WZWN0b3Ioe1xuICAgICAgICAgICAgICAgICAgICB0aXRsZTogJ9CX0KMnLFxuICAgICAgICAgICAgICAgICAgICBzb3VyY2U6IHBhcmNlbFNvdXJjZSxcbiAgICAgICAgICAgICAgICAgICAgc3R5bGU6IHBhcmNlbFN0eWxlLFxuICAgICAgICAgICAgICAgICAgICBvcGFjaXR5OiAwLjVcbiAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB2YXIgcmVhbHR5TGF5ZXIgPSBuZXcgb2wubGF5ZXIuVmVjdG9yKHtcbiAgICAgICAgICAgICAgICAgICAgdGl0bGU6ICfQntCa0KEnLFxuICAgICAgICAgICAgICAgICAgICBzb3VyY2U6IHJlYWx0eVNvdXJjZSxcbiAgICAgICAgICAgICAgICAgICAgc3R5bGU6IHJlYWx0eVN0eWxlLFxuICAgICAgICAgICAgICAgICAgICBvcGFjaXR5OiAwLjVcbiAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICB2YXIgYm91bmRMYXllciA9IG5ldyBvbC5sYXllci5WZWN0b3Ioe1xuICAgICAgICAgICAgICAgICAgICB0aXRsZTogJ9CT0YDQsNC90LjRhtGLJyxcbiAgICAgICAgICAgICAgICAgICAgc291cmNlOiBib3VuZFNvdXJjZSxcbiAgICAgICAgICAgICAgICAgICAgc3R5bGU6IGJvdW5kU3R5bGUsXG4gICAgICAgICAgICAgICAgICAgIG9wYWNpdHk6IDAuNVxuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIHZhciB6b25lTGF5ZXIgPSBuZXcgb2wubGF5ZXIuVmVjdG9yKHtcbiAgICAgICAgICAgICAgICAgICAgdGl0bGU6ICfQl9C+0L3RiycsXG4gICAgICAgICAgICAgICAgICAgIHNvdXJjZTogem9uZVNvdXJjZSxcbiAgICAgICAgICAgICAgICAgICAgc3R5bGU6IHpvbmVTdHlsZSxcbiAgICAgICAgICAgICAgICAgICAgb3BhY2l0eTogMC41XG4gICAgICAgICAgICAgICAgfSk7XG5cbiAgICAgICAgICAgICAgICB2YXIgZm9ybWF0ID0gbmV3IG9sLmZvcm1hdC5HZW9KU09OKCk7XG5cbiAgICAgICAgICAgICAgICB2YXIgcmVhbHR5c0NpcmNsZSA9IHBhcnNlZERhdGEuZ2VvSlNPTlJlYWx0eUNpcmNsZTtcblxuICAgICAgICAgICAgICAgIC8vIHZlY3RvclNvdXJjZS5hZGRGZWF0dXJlKG5ldyBvbC5GZWF0dXJlKG5ldyBvbC5nZW9tLkNpcmNsZShbNWU2LCA3ZTZdLCAxZTYpKSk7XG4gICAgICAgICAgICAgICAgZm9yICh2YXIgaSA9IDA7IGkgPCByZWFsdHlzQ2lyY2xlLmZlYXR1cmVzLmxlbmd0aDsgaSsrKSB7XG4gICAgICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKHJlYWx0eXNDaXJjbGUuZmVhdHVyZXNbaV0pO1xuICAgICAgICAgICAgICAgICAgICByZWFsdHlMYXllci5nZXRTb3VyY2UoKS5hZGRGZWF0dXJlKFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgIG5ldyBvbC5GZWF0dXJlKG5ldyBvbC5nZW9tLkNpcmNsZShcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIFtyZWFsdHlzQ2lyY2xlLmZlYXR1cmVzW2ldLmdlb21ldHJ5LmNvb3JkaW5hdGVzWzBdLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIHJlYWx0eXNDaXJjbGUuZmVhdHVyZXNbaV0uZ2VvbWV0cnkuY29vcmRpbmF0ZXNbMV1dLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgcmVhbHR5c0NpcmNsZS5mZWF0dXJlc1tpXS5nZW9tZXRyeS5yYWRpdXMpKSk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIHZhciB6b25lcyA9IHBhcnNlZERhdGEuZ2VvSlNPTlpvbmVzO1xuICAgICAgICAgICAgICAgIGZvciAodmFyIGkgPSAwOyBpIDwgem9uZXMuZmVhdHVyZXMubGVuZ3RoOyBpKyspIHtcbiAgICAgICAgICAgICAgICAgICAgdmFyIGdlb21ldHJ5T2JqID0gZm9ybWF0LnJlYWRHZW9tZXRyeSh6b25lcy5mZWF0dXJlc1tpXS5nZW9tZXRyeSk7XG4gICAgICAgICAgICAgICAgICAgIHZhciBmZWF0dXJlID0gbmV3IG9sLkZlYXR1cmUoe1xuICAgICAgICAgICAgICAgICAgICAgICAgZ2VvbWV0cnk6IGdlb21ldHJ5T2JqLy8sXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIC8vcHJvcEEgOiBwYXJzZWREYXRhLmZlYXR1cmVzW2ldLnByb3BlcnRpZXMuY2FkbnVtYmVyXG4gICAgICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgICAgICB6b25lTGF5ZXIuZ2V0U291cmNlKCkuYWRkRmVhdHVyZShmZWF0dXJlKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgdmFyIHF1YXJ0YWwgPSBwYXJzZWREYXRhLmdlb0pTT05RdWFydGFsO1xuICAgICAgICAgICAgICAgIGZvciAodmFyIGkgPSAwOyBpIDwgcXVhcnRhbC5mZWF0dXJlcy5sZW5ndGg7IGkrKykge1xuICAgICAgICAgICAgICAgICAgICB2YXIgZ2VvbWV0cnlPYmogPSBmb3JtYXQucmVhZEdlb21ldHJ5KHF1YXJ0YWwuZmVhdHVyZXNbaV0uZ2VvbWV0cnkpO1xuICAgICAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZSA9IG5ldyBvbC5GZWF0dXJlKHtcbiAgICAgICAgICAgICAgICAgICAgICAgIGdlb21ldHJ5OiBnZW9tZXRyeU9iai8vLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAvL3Byb3BBIDogcGFyc2VkRGF0YS5mZWF0dXJlc1tpXS5wcm9wZXJ0aWVzLmNhZG51bWJlclxuICAgICAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICAgICAgcXVhcnRhbExheWVyLmdldFNvdXJjZSgpLmFkZEZlYXR1cmUoZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIHZhciBib3VuZHMgPSBwYXJzZWREYXRhLmdlb0pTT05Cb3VuZHM7XG4gICAgICAgICAgICAgICAgZm9yICh2YXIgaSA9IDA7IGkgPCBib3VuZHMuZmVhdHVyZXMubGVuZ3RoOyBpKyspIHtcbiAgICAgICAgICAgICAgICAgICAgdmFyIGdlb21ldHJ5T2JqID0gZm9ybWF0LnJlYWRHZW9tZXRyeShib3VuZHMuZmVhdHVyZXNbaV0uZ2VvbWV0cnkpO1xuICAgICAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZSA9IG5ldyBvbC5GZWF0dXJlKHtcbiAgICAgICAgICAgICAgICAgICAgICAgIGdlb21ldHJ5OiBnZW9tZXRyeU9iai8vLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAvL3Byb3BBIDogcGFyc2VkRGF0YS5mZWF0dXJlc1tpXS5wcm9wZXJ0aWVzLmNhZG51bWJlclxuICAgICAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICAgICAgYm91bmRMYXllci5nZXRTb3VyY2UoKS5hZGRGZWF0dXJlKGZlYXR1cmUpO1xuICAgICAgICAgICAgICAgIH1cblxuICAgICAgICAgICAgICAgIG1hcCA9IG5ldyBvbC5NYXAoe1xuICAgICAgICAgICAgICAgICAgICB0YXJnZXQ6ICdtYXAnLFxuICAgICAgICAgICAgICAgICAgICBsYXllcnM6IFtcbiAgICAgICAgICAgICAgICAgICAgICAgIG5ldyBvbC5sYXllci5UaWxlKHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBzb3VyY2U6IG5ldyBvbC5zb3VyY2UuT1NNKCksXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgb3BhY2l0eTogMC41LFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgIHZpc2libGU6IGZhbHNlLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgIHRpdGxlOiAn0J/QvtC00LvQvtC20LrQsCdcbiAgICAgICAgICAgICAgICAgICAgICAgIH0pLFxuICAgICAgICAgICAgICAgICAgICAgICAgbmV3IG9sLmxheWVyLlRpbGUoe1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIHRpdGxlOiAn0J/QmtCaJyxcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBzb3VyY2U6IG5ldyBvbC5zb3VyY2UuVGlsZUFyY0dJU1Jlc3Qoe1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICB1cmw6ICdodHRwOi8vbWFwcy5yb3NyZWVzdHIucnUvYXJjZ2lzL3Jlc3Qvc2VydmljZXMvQ2FkYXN0cmUvQ2FkYXN0cmUvTWFwU2VydmVyLydcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9KVxuICAgICAgICAgICAgICAgICAgICAgICAgfSksXG4gICAgICAgICAgICAgICAgICAgICAgICBxdWFydGFsTGF5ZXIsIGJvdW5kTGF5ZXIsIHpvbmVMYXllcixcbiAgICAgICAgICAgICAgICAgICAgICAgIHBhcmNlbExheWVyLCByZWFsdHlMYXllclxuICAgICAgICAgICAgICAgICAgICBdLFxuICAgICAgICAgICAgICAgICAgICBvdmVybGF5czogW292ZXJsYXldLFxuICAgICAgICAgICAgICAgICAgICB2aWV3OiBuZXcgb2wuVmlldyh7XG4gICAgICAgICAgICAgICAgICAgICAgICBwcm9qZWN0aW9uOiAnRVBTRzozODU3JyxcbiAgICAgICAgICAgICAgICAgICAgICAgIGNlbnRlcjogWzAsIDBdLFxuICAgICAgICAgICAgICAgICAgICAgICAgem9vbTogN1xuICAgICAgICAgICAgICAgICAgICB9KVxuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIG1hcC5nZXRWaWV3KCkuZml0KHF1YXJ0YWxMYXllci5nZXRTb3VyY2UoKS5nZXRFeHRlbnQoKSwgbWFwLmdldFNpemUoKSk7XG4gICAgICAgICAgICAgICAgdmFyIGxheWVyU3dpdGNoZXIgPSBuZXcgb2wuY29udHJvbC5MYXllclN3aXRjaGVyKHtcbiAgICAgICAgICAgICAgICAgICAgdGlwTGFiZWw6ICfQodC70L7QuCcgLy8gT3B0aW9uYWwgbGFiZWwgZm9yIGJ1dHRvblxuICAgICAgICAgICAgICAgIH0pO1xuICAgICAgICAgICAgICAgIG1hcC5hZGRDb250cm9sKGxheWVyU3dpdGNoZXIpO1xuLy8gICAgICAgICAgICAgICAgdmFyIGdyYXRpY3VsZSA9IG5ldyBvbC5HcmF0aWN1bGUoe1xuLy8gICAgICAgICAgICAgICAgICAgIG1hcDogbWFwXG4vLyAgICAgICAgICAgICAgICB9KTtcbiAgICAgICAgICAgICAgICBtYXAub24oJ3NpbmdsZWNsaWNrJywgZnVuY3Rpb24gKGV2dCkge1xuICAgICAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZXMgPSBbXTtcbiAgICAgICAgICAgICAgICAgICAgdmFyIGNvb3JkaW5hdGUgPSBldnQuY29vcmRpbmF0ZTtcblxuICAgICAgICAgICAgICAgICAgICBmb3IgKHZhciBpID0gMDsgaSA8IG1hcC5nZXRMYXllcnMoKS5nZXRMZW5ndGgoKTsgaSsrKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICB2YXIgbGF5ZXIgPSBtYXAuZ2V0TGF5ZXJzKCkuaXRlbShpKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGlmIChsYXllciBpbnN0YW5jZW9mIG9sLmxheWVyLlZlY3Rvcikge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIHZhciBmZWF0dXJlID0gbGF5ZXIuZ2V0U291cmNlKCkuZ2V0Q2xvc2VzdEZlYXR1cmVUb0Nvb3JkaW5hdGUoZXZ0LmNvb3JkaW5hdGUpO1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGlmIChmZWF0dXJlKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIGZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIGNyZWF0ZUluZm9Db250ZXRudChmZWF0dXJlcywgY29vcmRpbmF0ZSk7XG4gICAgICAgICAgICAgICAgfSk7XG5cbiAgICAgICAgICAgICAgICBmdW5jdGlvbiBjcmVhdGVJbmZvQ29udGV0bnQoZmVhdHVyZXMsIGNvb3JkaW5hdGUpIHtcbiAgICAgICAgICAgICAgICAgICAgdmFyIGNvbnRlbkluZm8gPSAnJztcbi8vICAgICAgICAgICAgICAgICAgICB2YXIgc3QgPSAnJztcbi8vICAgICAgICAgICAgICAgICAgICB2YXIgY2F0ID0gJyc7XG4vLyAgICAgICAgICAgICAgICAgICAgdmFyIG5hbWUgPSAnJztcbi8vICAgICAgICAgICAgICAgICAgICB2YXIgdXQgPSAnJztcbiAgICAgICAgICAgICAgICAgICAgZm9yICh2YXIgaSA9IDA7IGkgPCBmZWF0dXJlcy5sZW5ndGg7IGkrKykge1xuLy8gICAgICAgICAgICAgICAgICAgICAgICB2YXIgZiA9IGZlYXR1cmVzW2ldO1xuLy8gICAgICAgICAgICAgICAgICAgICAgICBpZiAoZi5nZXQoJ2NhZGFzdHJlTnVtYmVyJykgIT09IHVuZGVmaW5lZCkge1xuLy8gICAgICAgICAgICAgICAgICAgICAgICAgICAgY24gPSBmLmdldCgnY2FkYXN0cmVOdW1iZXInKTtcbi8vICAgICAgICAgICAgICAgICAgICAgICAgfVxuLy8gICAgICAgICAgICAgICAgICAgICAgICBpZiAoZi5nZXQoJ1N0YXRlJykgIT09IHVuZGVmaW5lZCkge1xuLy8gICAgICAgICAgICAgICAgICAgICAgICAgICAgc3QgPSBmLmdldCgnU3RhdGUnKTtcbi8vICAgICAgICAgICAgICAgICAgICAgICAgfVxuLy8gICAgICAgICAgICAgICAgICAgICAgICBpZiAoZi5nZXQoJ05hbWUnKSAhPT0gdW5kZWZpbmVkKSB7XG4vLyAgICAgICAgICAgICAgICAgICAgICAgICAgICBuYW1lID0gZi5nZXQoJ05hbWUnKTtcbi8vICAgICAgICAgICAgICAgICAgICAgICAgfVxuLy8gICAgICAgICAgICAgICAgICAgICAgICBpZiAoZi5nZXQoJ0NhdGVnb3J5JykgIT09IHVuZGVmaW5lZCkge1xuLy8gICAgICAgICAgICAgICAgICAgICAgICAgICAgY2F0ID0gZi5nZXQoJ0NhdGVnb3J5Jyk7XG4vLyAgICAgICAgICAgICAgICAgICAgICAgIH1cbi8vICAgICAgICAgICAgICAgICAgICAgICAgaWYgKGYuZ2V0KCdDYXRlZ29yeScpICE9PSB1bmRlZmluZWQpIHtcbi8vICAgICAgICAgICAgICAgICAgICAgICAgICAgIGNhdCA9IGYuZ2V0KCdDYXRlZ29yeScpO1xuLy8gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZyhmZWF0dXJlc1tpXS5nZXRQcm9wZXJ0aWVzKCkpO1xuLy8gICAgICAgICAgICAgICAgICAgIH1cbi8vICAgICAgICAgICAgICAgICAgICB2YXIgaGRtcyA9IG9sLmNvb3JkaW5hdGUudG9TdHJpbmdIRE1TKG9sLnByb2oudHJhbnNmb3JtKFxuLy8gICAgICAgICAgICAgICAgICAgICAgICAgICAgY29vcmRpbmF0ZSwgJ0VQU0c6Mzg1NycsICdFUFNHOjQzMjYnKSk7XG4vLyAgICAgICAgICAgICAgICAgICAgICAgIHZhciBqc29uID0gSlNPTi5zdHJpbmdpZnkoZmVhdHVyZXNbaV0uZ2V0UHJvcGVydGllcygpKTtcbi8vICAgICAgICAgICAgICAgICAgICAgICAgY29udGVuSW5mbyArPSAnPHA+JyArICQoJycpLmpKc29uVmlld2VyKGpzb24pICsgJzwvcD4nO1xuICAgICAgICAgICAgICAgICAgICAgICAgXG4vLyAgICAgICAgICAgICAgICAgICAgY29udGVudC5pbm5lckhUTUwgPSAnPHA+0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQvdC+0LzQtdGAOjxjb2RlPicgKyBjbiArXG4vLyAgICAgICAgICAgICAgICAgICAgICAgICAgICAnPC9jb2RlPjwvcD48cD7QntCx0YrQtdC60YI6PGNvZGU+JyArIG5hbWUgKyAnPC9jb2RlPjwvcD4nICtcbi8vICAgICAgICAgICAgICAgICAgICAgICAgICAgICc8L2NvZGU+PHA+0KHRgtCw0YLRg9GBOjxjb2RlPicgKyBzdCArICc8L2NvZGU+PC9wPicgK1xuLy8gICAgICAgICAgICAgICAgICAgICAgICAgICAgJzwvY29kZT48cD7QmtCw0YLQtdCz0L7RgNC40Y8g0LfQtdC80LXQu9GMOjxjb2RlPicgKyBjYXQgKyAnPC9jb2RlPjwvcD4nO1xuICAgICAgICAgICAgICAgICAgICAgICAgLy9jb250ZW50LmpKc29uVmlld2VyKGZlYXR1cmVzW2ldLmdldFByb3BlcnRpZXMoKSk7IFxuICAgICAgICAgICAgICAgICAgICB9XG4vLyAgICAgICAgICAgICAgICAgICAgY29udGVudC5pbm5lckhUTUwgPSBjb250ZW5JbmZvO1xuLy8gICAgICAgICAgICAgICAgICAgIG92ZXJsYXkuc2V0UG9zaXRpb24oY29vcmRpbmF0ZSk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfSk7XG5cbn1cbiIsIi8qIFxuICogVGhlIE1JVCBMaWNlbnNlXG4gKlxuICogQ29weXJpZ2h0IDIwMTUgZmlsaXBwb3YuXG4gKlxuICogUGVybWlzc2lvbiBpcyBoZXJlYnkgZ3JhbnRlZCwgZnJlZSBvZiBjaGFyZ2UsIHRvIGFueSBwZXJzb24gb2J0YWluaW5nIGEgY29weVxuICogb2YgdGhpcyBzb2Z0d2FyZSBhbmQgYXNzb2NpYXRlZCBkb2N1bWVudGF0aW9uIGZpbGVzICh0aGUgXCJTb2Z0d2FyZVwiKSwgdG8gZGVhbFxuICogaW4gdGhlIFNvZnR3YXJlIHdpdGhvdXQgcmVzdHJpY3Rpb24sIGluY2x1ZGluZyB3aXRob3V0IGxpbWl0YXRpb24gdGhlIHJpZ2h0c1xuICogdG8gdXNlLCBjb3B5LCBtb2RpZnksIG1lcmdlLCBwdWJsaXNoLCBkaXN0cmlidXRlLCBzdWJsaWNlbnNlLCBhbmQvb3Igc2VsbFxuICogY29waWVzIG9mIHRoZSBTb2Z0d2FyZSwgYW5kIHRvIHBlcm1pdCBwZXJzb25zIHRvIHdob20gdGhlIFNvZnR3YXJlIGlzXG4gKiBmdXJuaXNoZWQgdG8gZG8gc28sIHN1YmplY3QgdG8gdGhlIGZvbGxvd2luZyBjb25kaXRpb25zOlxuICpcbiAqIFRoZSBhYm92ZSBjb3B5cmlnaHQgbm90aWNlIGFuZCB0aGlzIHBlcm1pc3Npb24gbm90aWNlIHNoYWxsIGJlIGluY2x1ZGVkIGluXG4gKiBhbGwgY29waWVzIG9yIHN1YnN0YW50aWFsIHBvcnRpb25zIG9mIHRoZSBTb2Z0d2FyZS5cbiAqXG4gKiBUSEUgU09GVFdBUkUgSVMgUFJPVklERUQgXCJBUyBJU1wiLCBXSVRIT1VUIFdBUlJBTlRZIE9GIEFOWSBLSU5ELCBFWFBSRVNTIE9SXG4gKiBJTVBMSUVELCBJTkNMVURJTkcgQlVUIE5PVCBMSU1JVEVEIFRPIFRIRSBXQVJSQU5USUVTIE9GIE1FUkNIQU5UQUJJTElUWSxcbiAqIEZJVE5FU1MgRk9SIEEgUEFSVElDVUxBUiBQVVJQT1NFIEFORCBOT05JTkZSSU5HRU1FTlQuIElOIE5PIEVWRU5UIFNIQUxMIFRIRVxuICogQVVUSE9SUyBPUiBDT1BZUklHSFQgSE9MREVSUyBCRSBMSUFCTEUgRk9SIEFOWSBDTEFJTSwgREFNQUdFUyBPUiBPVEhFUlxuICogTElBQklMSVRZLCBXSEVUSEVSIElOIEFOIEFDVElPTiBPRiBDT05UUkFDVCwgVE9SVCBPUiBPVEhFUldJU0UsIEFSSVNJTkcgRlJPTSxcbiAqIE9VVCBPRiBPUiBJTiBDT05ORUNUSU9OIFdJVEggVEhFIFNPRlRXQVJFIE9SIFRIRSBVU0UgT1IgT1RIRVIgREVBTElOR1MgSU5cbiAqIFRIRSBTT0ZUV0FSRS5cbiAqL1xuJ3VzZSBzdHJpY3QnO1xuLy8gRGljdHNcblxuLy8g0KHRgtCw0YLRg9GBINC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuFxudmFyIGRTdGF0ZXMgPSB7XG4gICAgJzAxJzogJ9Cg0LDQvdC10LUg0YPRh9GC0LXQvdC90YvQuScsXG4gICAgJzA1JzogJ9CS0YDQtdC80LXQvdC90YvQuScsXG4gICAgJzA2JzogJ9Cj0YfRgtC10L3QvdGL0LknLFxuICAgICcwNyc6ICfQodC90Y/RgiDRgSDRg9GH0LXRgtCwJyxcbiAgICAnMDgnOiAn0JDQvdC90YPQu9C40YDQvtCy0LDQvdC90YvQuSdcbn07XG4vLyDQotC40L8gINC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuFxudmFyIGRQYXJjZWxzID0ge1xuICAgICcwMSc6ICfQl9C10LzQu9C10L/QvtC70YzQt9C+0LLQsNC90LjQtScsXG4gICAgJzAyJzogJ9CV0LTQuNC90L7QtSDQt9C10LzQu9C10L/QvtC70YzQt9C+0LLQsNC90LjQtScsXG4gICAgJzAzJzogJ9Ce0LHQvtGB0L7QsdC70LXQvdC90YvQuSDRg9GH0LDRgdGC0L7QuicsXG4gICAgJzA0JzogJ9Cj0YHQu9C+0LLQvdGL0Lkg0YPRh9Cw0YHRgtC+0LonLFxuICAgICcwNSc6ICfQnNC90L7Qs9C+0LrQvtC90YLRg9GA0L3Ri9C5INGD0YfQsNGB0YLQvtC6JyxcbiAgICAnMDYnOiAn0JfQvdCw0YfQtdC90LjQtSDQvtGC0YHRg9GC0YHRgtCy0YPQtdGCJ1xufTtcbi8vINCa0LDRgtC10LPQvtGA0LjRjyDQt9C10LzQtdC70YxcbnZhciBkQ2F0ZWdvcmllcyA9IHtcbiAgICAnMDAzMDAxMDAwMDAwJzogJ9CX0LXQvNC70Lgg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcbiAgICAnMDAzMDAyMDAwMDAwJzogJ9CX0LXQvNC70Lgg0L3QsNGB0LXQu9GR0L3QvdGL0YUg0L/Rg9C90LrRgtC+0LInLFxuICAgICcwMDMwMDMwMDAwMDAnOiAn0JfQtdC80LvQuCDQv9GA0L7QvNGL0YjQu9C10L3QvdC+0YHRgtC4LCDRjdC90LXRgNCz0LXRgtC40LrQuCwg0YLRgNCw0L3RgdC/0L7RgNGC0LAsINGB0LLRj9C30LgsINGA0LDQtNC40L7QstC10YnQsNC90LjRjywg0YLQtdC70LXQstC40LTQtdC90LjRjywg0LjQvdGE0L7RgNC80LDRgtC40LrQuCwg0LfQtdC80LvQuCDQtNC70Y8g0L7QsdC10YHQv9C10YfQtdC90LjRjyDQutC+0YHQvNC40YfQtdGB0LrQvtC5INC00LXRj9GC0LXQu9GM0L3QvtGB0YLQuCwg0LfQtdC80LvQuCDQvtCx0L7RgNC+0L3Riywg0LHQtdC30L7Qv9Cw0YHQvdC+0YHRgtC4INC4INC30LXQvNC70Lgg0LjQvdC+0LPQviDRgdC/0LXRhtC40LDQu9GM0L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuICAgICcwMDMwMDQwMDAwMDAnOiAn0JfQtdC80LvQuCDQvtGB0L7QsdC+INC+0YXRgNCw0L3Rj9C10LzRi9GFINGC0LXRgNGA0LjRgtC+0YDQuNC5INC4INC+0LHRitC10LrRgtC+0LInLFxuICAgICcwMDMwMDUwMDAwMDAnOiAn0JfQtdC80LvQuCDQu9C10YHQvdC+0LPQviDRhNC+0L3QtNCwJyxcbiAgICAnMDAzMDA2MDAwMDAwJzogJ9CX0LXQvNC70Lgg0LLQvtC00L3QvtCz0L4g0YTQvtC90LTQsCcsXG4gICAgJzAwMzAwNzAwMDAwMCc6ICfQl9C10LzQu9C4INC30LDQv9Cw0YHQsCcsXG4gICAgJzAwMzAwODAwMDAwMCc6ICfQmtCw0YLQtdCz0L7RgNC40Y8g0L3QtSDRg9GB0YLQsNC90L7QstC70LXQvdCwJ1xufTtcbi8vINCe0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pINC/0YDQsNCyXG52YXIgZEVuY3VtYnJhbmNlcyA9IHtcblx0JzAyMjAwMTAwMDAwMCc6ICfQodC10YDQstC40YLRg9GCJyxcblx0JzAyMjAwMTAwMTAwMCc6ICfQn9GD0LHQu9C40YfQvdGL0Lkg0YHQtdGA0LLQuNGC0YPRgicsXG5cdCcwMjIwMDEwMDIwMDAnOiAn0KfQsNGB0YLQvdGL0Lkg0YHQtdGA0LLQuNGC0YPRgicsXG5cdCcwMjIwMDIwMDAwMDAnOiAn0JDRgNC10YHRgicsXG5cdCcwMjIwMDMwMDAwMDAnOiAn0JfQsNC/0YDQtdGJ0LXQvdC40LUnLFxuXHQnMDIyMDA0MDAwMDAwJzogJ9Ce0LPRgNCw0L3QuNGH0LXQvdC40Y8g0L/RgNCw0LIg0L3QsCDQt9C10LzQtdC70YzQvdGL0Lkg0YPRh9Cw0YHRgtC+0LosINC/0YDQtdC00YPRgdC80L7RgtGA0LXQvdC90YvQtSDRgdGC0LDRgtGM0Y/QvNC4IDU2LCA1Ni4xINCX0LXQvNC10LvRjNC90L7Qs9C+INC60L7QtNC10LrRgdCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCcwMjIwMDUwMDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQuNC30YrRj9GC0LjQuCDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCwg0LbQuNC70L7Qs9C+INC/0L7QvNC10YnQtdC90LjRjycsXG5cdCcwMjIwMDYwMDAwMDAnOiAn0JDRgNC10L3QtNCwICjQsiDRgtC+0Lwg0YfQuNGB0LvQtSwg0YHRg9Cx0LDRgNC10L3QtNCwKScsXG5cdCcwMjIwMDcwMDAwMDAnOiAn0JjQv9C+0YLQtdC60LAnLFxuXHQnMDIyMDA4MDAwMDAwJzogJ9CY0L/QvtGC0LXQutCwINCyINGB0LjQu9GDINC30LDQutC+0L3QsCcsXG5cdCcwMjIwMDkwMDAwMDAnOiAn0JHQtdC30LLQvtC30LzQtdC30LTQvdC+0LUgKNGB0YDQvtGH0L3QvtC1KSDQv9C+0LvRjNC30L7QstCw0L3QuNC1INC30LXQvNC10LvRjNC90YvQvC/Qu9C10YHQvdGL0Lwg0YPRh9Cw0YHRgtC60L7QvCcsXG5cdCcwMjIwMTAwMDAwMDAnOiAn0JTQvtCy0LXRgNC40YLQtdC70YzQvdC+0LUg0YPQv9GA0LDQstC70LXQvdC40LUnLFxuXHQnMDIyMDExMDAwMDAwJzogJ9Cg0LXQvdGC0LAnLFxuXHQnMDIyMDEyMDAwMDAwJzogJ9CX0LDQv9GA0LXRgiDQvdCwINGB0L7QstC10YDRiNC10L3QuNC1INC00LXQudGB0YLQstC40Lkg0LIg0YHRhNC10YDQtSDQk9Ca0KMg0LIg0L7RgtC90L7RiNC10L3QuNC4INCe0J0nLFxuXHQnMDIyMDk5MDAwMDAwJzogJ9CY0L3Ri9C1INC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pINC/0YDQsNCyJ1xufTtcbi8vINCV0LTQuNC90LjRhtGLINC40LfQvNC10YDQtdC90LjQuVxudmFyIGRVbml0cyA9IHtcblx0JzAwMyc6ICfQnNC40LvQu9C40LzQtdGC0YAnLFxuXHQnMDA0JzogJ9Ch0LDQvdGC0LjQvNC10YLRgCcsXG5cdCcwMDUnOiAn0JTQtdGG0LjQvNC10YLRgCcsXG5cdCcwMDYnOiAn0JzQtdGC0YAnLFxuXHQnMDA4JzogJ9Ca0LjQu9C+0LzQtdGC0YAnLFxuXHQnMDA5JzogJ9Cc0LXQs9Cw0LzQtdGC0YAnLFxuXHQnMDQ3JzogJ9Cc0L7RgNGB0LrQsNGPINC80LjQu9GPJyxcblx0JzA1MCc6ICfQmtCy0LDQtNGA0LDRgtC90YvQuSDQvNC40LvQu9C40LzQtdGC0YAnLFxuXHQnMDUxJzogJ9Ca0LLQsNC00YDQsNGC0L3Ri9C5INGB0LDQvdGC0LjQvNC10YLRgCcsXG5cdCcwNTMnOiAn0JrQstCw0LTRgNCw0YLQvdGL0Lkg0LTQtdGG0LjQvNC10YLRgCcsXG5cdCcwNTUnOiAn0JrQstCw0LTRgNCw0YLQvdGL0Lkg0LzQtdGC0YAnLFxuXHQnMDU4JzogJ9Ci0YvRgdGP0YfQsCDQutCy0LDQtNGA0LDRgtC90YvRhSDQvNC10YLRgNC+0LInLFxuXHQnMDU5JzogJ9CT0LXQutGC0LDRgCcsXG5cdCcwNjEnOiAn0JrQstCw0LTRgNCw0YLQvdGL0Lkg0LrQuNC70L7QvNC10YLRgCcsXG5cdCcxMDknOiAn0JDRgCAoMTAwINC8MiknLFxuXHQnMzU5JzogJ9Ch0YPRgtC60LgnLFxuXHQnMzYwJzogJ9Cd0LXQtNC10LvRjycsXG5cdCczNjEnOiAn0JTQtdC60LDQtNCwJyxcblx0JzM2Mic6ICfQnNC10YHRj9GGJyxcblx0JzM2NCc6ICfQmtCy0LDRgNGC0LDQuycsXG5cdCczNjUnOiAn0J/QvtC70YPQs9C+0LTQuNC1Jyxcblx0JzM1Nic6ICfQp9Cw0YEnLFxuXHQnMzU1JzogJ9Cc0LjQvdGD0YLQsCAnLFxuXHQnMzY2JzogJ9CT0L7QtCcsXG5cdCczODMnOiAn0KDRg9Cx0LvRjCcsXG5cdCczODQnOiAn0KLRi9GB0Y/Rh9CwINGA0YPQsdC70LXQuScsXG5cdCczODUnOiAn0JzQuNC70LvQuNC+0L0g0YDRg9Cx0LvQtdC5Jyxcblx0JzM4Nic6ICfQnNC40LvQu9C40LDRgNC0INGA0YPQsdC70LXQuScsXG5cdCcxMDAwJzogJ9Cd0LXQvtC/0YDQtdC00LXQu9C10L3QvicsXG5cdCcxMDAxJzogJ9CX0L3QsNGH0LXQvdC40LUg0L7RgtGB0YPRgtGB0YLQstGD0LXRgicsXG5cdCcxMDAyJzogJ9Cg0YPQsdC70LXQuSDQt9CwINC60LIuINC80LXRgtGAJyxcblx0JzEwMDMnOiAn0KDRg9Cx0LvQtdC5INC30LAg0LDRgCcsXG5cdCcxMDA0JzogJ9Cg0YPQsdC70LXQuSAg0LfQsCDQs9C10LrRgtCw0YAnLFxuXHQnMTAwNSc6ICfQmNC90YvQtScsXG5cdCcxMDA2JzogJ9Cg0YPQsdC70LXQuSDQt9CwINC60LIuINC60LwnLFxuXHQnMTAwNyc6ICfQoNCw0LHQvtGH0LjQuSDQtNC10L3RjCdcbn07XG4vLyDQktGB0LUg0LTQvtC60YPQvNC10L3RgtGLICjQodCx0L7RgNC90LjQuiDQutC70LDRgdGB0LjRhNC40LrQsNGC0L7RgNC+0LIsINC60L7QtNGLIDguMSwgOC4yLCA1NTUsIDU1OC4xLCA1NTguMiwgNTU4LjMsIDU1OC40LCA1NTguNSwgNTU4LjYpXG52YXIgZEFsbERvY3VtZW50cyA9IHtcblx0JzAwODAwMTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0YssINGD0LTQvtGB0YLQvtCy0LXRgNGP0Y7RidC40LUg0LvQuNGH0L3QvtGB0YLRjCDRhNC40LfQuNGH0LXRgdC60L7Qs9C+INC70LjRhtCwJyxcblx0JzAwODAwMTAwMTAwMCc6ICfQn9Cw0YHQv9C+0YDRgiDQs9GA0LDQttC00LDQvdC40L3QsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnMDA4MDAxMDAyMDAwJzogJ9Cf0LDRgdC/0L7RgNGCINCz0YDQsNC20LTQsNC90LjQvdCwINCh0KHQodCgJyxcblx0JzAwODAwMTAwMzAwMCc6ICfQn9Cw0YHQv9C+0YDRgiDQs9GA0LDQttC00LDQvdC40L3QsCDQuNC90L7RgdGC0YDQsNC90L3QvtCz0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQsCcsXG5cdCcwMDgwMDEwMDQwMDAnOiAn0J7QsdGJ0LXQs9GA0LDQttC00LDQvdGB0LrQuNC5INC30LDQs9GA0LDQvdC40YfQvdGL0Lkg0L/QsNGB0L/QvtGA0YInLFxuXHQnMDA4MDAxMDA1MDAwJzogJ9CX0LDQs9GA0LDQvdC40YfQvdGL0Lkg0L/QsNGB0L/QvtGA0YIg0JzQuNC90LjRgdGC0LXRgNGB0YLQstCwINC80L7RgNGB0LrQvtCz0L4g0YTQu9C+0YLQsCcsXG5cdCcwMDgwMDEwMDYwMDAnOiAn0JTQuNC/0LvQvtC80LDRgtC40YfQtdGB0LrQuNC5INC/0LDRgdC/0L7RgNGCJyxcblx0JzAwODAwMTAwNzAwMCc6ICfQn9Cw0YHQv9C+0YDRgiDQvNC+0YDRj9C60LAgKNGD0LTQvtGB0YLQvtCy0LXRgNC10L3QuNC1INC70LjRh9C90L7RgdGC0Lgg0LzQvtGA0Y/QutCwKScsXG5cdCcwMDgwMDEwMDgwMDAnOiAn0JLQvtC10L3QvdGL0Lkg0LHQuNC70LXRgiDQstC+0LXQvdC90L7RgdC70YPQttCw0YnQtdCz0L4nLFxuXHQnMDA4MDAxMDA5MDAwJzogJ9CS0YDQtdC80LXQvdC90L7QtSDRg9C00L7RgdGC0L7QstC10YDQtdC90LjQtSwg0LLRi9C00LDQvdC90L7QtSDQstC30LDQvNC10L0g0LLQvtC10L3QvdC+0LPQviDQsdC40LvQtdGC0LAnLFxuXHQnMDA4MDAxMDEwMDAwJzogJ9Cj0LTQvtGB0YLQvtCy0LXRgNC10L3QuNC1INC70LjRh9C90L7RgdGC0Lgg0L7RhNC40YbQtdGA0LAg0JzQuNC90LjRgdGC0LXRgNGB0YLQstCwINC+0LHQvtGA0L7QvdGLINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCwg0JzQuNC90LjRgdGC0LXRgNGB0YLQstCwINCy0L3Rg9GC0YDQtdC90L3QuNGFINC00LXQuyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0Lgg0LTRgNGD0LPQuNGFINCy0L7QuNC90YHQutC40YUg0YTQvtGA0LzQuNGA0L7QstCw0L3QuNC5INGBINC/0YDQuNC70L7QttC10L3QuNC10Lwg0YHQv9GA0LDQstC60Lgg0L4g0L/RgNC+0L/QuNGB0LrQtSAo0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCkg0KQtMzMnLFxuXHQnMDA4MDAxMDExMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INGA0L7QttC00LXQvdC40LgnLFxuXHQnMDA4MDAxMDEyMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INGA0LDRgdGB0LzQvtGC0YDQtdC90LjQuCDRhdC+0LTQsNGC0LDQudGB0YLQstCwINC+INC/0YDQuNC30L3QsNC90LjQuCDQsdC10LbQtdC90YbQtdC8INC90LAg0YLQtdGA0YDQuNGC0L7RgNC40Lgg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC/0L4g0YHRg9GJ0LXRgdGC0LLRgycsXG5cdCcwMDgwMDEwMTMwMDAnOiAn0JLQuNC0INC90LAg0LbQuNGC0LXQu9GM0YHRgtCy0L4g0LjQvdC+0YHRgtGA0LDQvdC90L7Qs9C+INCz0YDQsNC20LTQsNC90LjQvdCwINC40LvQuCDQu9C40YbQsCDQsdC10Lcg0LPRgNCw0LbQtNCw0L3RgdGC0LLQsCcsXG5cdCcwMDgwMDEwMTQwMDAnOiAn0KHQv9GA0LDQstC60LAg0L7QsSDQvtGB0LLQvtCx0L7QttC00LXQvdC40Lgg0LjQtyDQvNC10YHRgiDQu9C40YjQtdC90LjRjyDRgdCy0L7QsdC+0LTRiycsXG5cdCcwMDgwMDEwMTUwMDAnOiAn0JLRgNC10LzQtdC90L3QvtC1INGD0LTQvtGB0YLQvtCy0LXRgNC10L3QuNC1INC70LjRh9C90L7RgdGC0Lgg0LPRgNCw0LbQtNCw0L3QuNC90LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzAwODAwMTAxNjAwMCc6ICfQo9C00L7RgdGC0L7QstC10YDQtdC90LjQtSDQstGL0L3Rg9C20LTQtdC90L3QvtCz0L4g0L/QtdGA0LXRgdC10LvQtdC90YbQsCcsXG5cdCcwMDgwMDEwMTcwMDAnOiAn0KDQsNC30YDQtdGI0LXQvdC40LUg0L3QsCDQstGA0LXQvNC10L3QvdC+0LUg0L/RgNC+0LbQuNCy0LDQvdC40LUg0LIg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzAwODAwMTAxODAwMCc6ICfQo9C00L7RgdGC0L7QstC10YDQtdC90LjQtSDQsdC10LbQtdC90YbQsCDQsiDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnMDA4MDAxMDE5MDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INGA0LDRgdGB0LzQvtGC0YDQtdC90LjQuCDRhdC+0LTQsNGC0LDQudGB0YLQstCwINC+INC/0YDQuNC30L3QsNC90LjQuCDQu9C40YbQsCDQstGL0L3Rg9C20LTQtdC90L3Ri9C8INC/0LXRgNC10YHQtdC70LXQvdGG0LXQvCcsXG5cdCcwMDgwMDEwMjAwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDQstGA0LXQvNC10L3QvdC+0LPQviDRg9Cx0LXQttC40YnQsCDQvdCwINGC0LXRgNGA0LjRgtC+0YDQuNC4INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCcwMDgwMDEwOTkwMDAnOiAn0JjQvdGL0LUg0LTQvtC60YPQvNC10L3RgtGLLCDQv9GA0LXQtNGD0YHQvNC+0YLRgNC10L3QvdGL0LUg0LfQsNC60L7QvdC+0LTQsNGC0LXQu9GM0YHRgtCy0L7QvCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0LjQu9C4INC/0YDQuNC30L3QsNCy0LDQtdC80YvQtSDQsiDRgdC+0L7RgtCy0LXRgtGB0YLQstC40Lgg0YEg0LzQtdC20LTRg9C90LDRgNC+0LTQvdGL0Lwg0LTQvtCz0L7QstC+0YDQvtC8INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQsiDQutCw0YfQtdGB0YLQstC1INC00L7QutGD0LzQtdC90YLQvtCyLCDRg9C00L7RgdGC0L7QstC10YDRj9GO0YnQuNGFINC70LjRh9C90L7RgdGC0YwnLFxuXHQnMDA4MDAyMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0LjQtNC10L3RgtC40YTQuNGG0LjRgNGD0Y7RidC40LUg0Y7RgNC40LTQuNGH0LXRgdC60L7QtSDQu9C40YbQvicsXG5cdCcwMDgwMDIwMDEwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0Y7RgNC40LTQuNGH0LXRgdC60L7Qs9C+INC70LjRhtCwJyxcblx0JzAwODAwMjAwMjAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQstC90LXRgdC10L3QuNC4INC30LDQv9C40YHQtdC5INCyINCV0JPQoNCu0JsnLFxuXHQnMDA4MDAyMDA0MDAwJzogJ9Cj0YHRgtCw0LInLFxuXHQnMDA4MDAyMDA1MDAwJzogJ9Cj0YfRgNC10LTQuNGC0LXQu9GM0L3Ri9C5INC00L7Qs9C+0LLQvtGAJyxcblx0JzAwODAwMjAwNjAwMCc6ICfQn9C+0LvQvtC20LXQvdC40LUgKNC+0LHRidC10LUg0L/QvtC70L7QttC10L3QuNC1INC+0LEg0L7RgNCz0LDQvdC40LfQsNGG0LjQuCknLFxuXHQnMDA4MDAyMDA3MDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+ICjQuNC70Lgg0YPQstC10LTQvtC80LvQtdC90LjQtSkg0L4g0L/QvtGB0YLQsNC90L7QstC60LUg0L3QsCDRg9GH0ZHRgiDQsiDQvdCw0LvQvtCz0L7QstC+0Lwg0L7RgNCz0LDQvdC1INGBINGD0LrQsNC30LDQvdC40LXQvCDQmNCd0J0nLFxuXHQnMDA4MDAyMDA4MDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0JXQk9Cg0K7QmycsXG5cdCcwMDgwMDIwOTkwMDAnOiAn0JjQvdC+0Lkg0LTQvtC60YPQvNC10L3RgicsXG5cdCc1NTUwMDEwMDAwMDAnOiAn0JrQstC40YLQsNC90YbQuNGPJyxcblx0JzU1NTAwMjAwMDAwMCc6ICfQn9C70LDRgtGR0LbQvdC+0LUg0L/QvtGA0YPRh9C10L3QuNC1Jyxcblx0JzU1NTAwMzAwMDAwMCc6ICfQp9C10LonLFxuXHQnNTU1MDA0MDAwMDAwJzogJ9Cf0L7QtNGC0LLQtdGA0LbQtNC10L3QuNC1INGN0LvQtdC60YLRgNC+0L3QvdC+0LPQviDQv9C70LDRgtC10LbQsCcsXG5cdCc1NTUwMDUwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQv9GA0LDQstC+INC30LDRj9Cy0LjRgtC10LvRjyDQvdCwINCx0LXQt9Cy0L7Qt9C80LXQt9C00L3QvtC1INC/0L7Qu9GD0YfQtdC90LjQtSDRgdCy0LXQtNC10L3QuNC5Jyxcblx0JzU1ODEwMDAwMDAwMCc6ICfQl9CQ0K/QktCb0JXQndCY0K8nLFxuXHQnNTU4MTAxMDAwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjRjyDQuCDQt9Cw0L/RgNC+0YHRiywg0YHQstGP0LfQsNC90L3Ri9C1INGBINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQvCDQutCw0LTQsNGB0YLRgNC+0LLRi9C8INGD0YfRkdGC0L7QvCcsXG5cdCc1NTgxMDEwMTAwMDAnOiAn0JfQsNC/0YDQvtGBINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0YHQstC10LTQtdC90LjQuSwg0LLQvdC10YHRkdC90L3Ri9GFINCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgsINCyINCy0LjQtNC1INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0LLRi9C/0LjRgdC60Lgg0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0LgsINC60LDQtNCw0YHRgtGA0L7QstC+0LPQviDQv9Cw0YHQv9C+0YDRgtCwINC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQuCDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0L/Qu9Cw0L3QsCDRgtC10YDRgNC40YLQvtGA0LjQuCwg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDRgdC/0YDQsNCy0LrQuCDQviDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INGB0YLQvtC40LzQvtGB0YLQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MTAxMDIwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9C+0YHRgtCw0L3QvtCy0LrQtSDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgNC+0LLRi9C5INGD0YfRkdGCINC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgxMDEwMzAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDQutCw0LTQsNGB0YLRgNC+0LLQvtC8INGD0YfRkdGC0LUg0LjQt9C80LXQvdC10L3QuNC5INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgxMDEwNDAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LIg0JXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAg0L7QsdGK0LXQutGC0L7QsiDQutCw0L/QuNGC0LDQu9GM0L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAgKNCV0JPQoNCe0JrQoSkg0YHQstC10LTQtdC90LjQuSDQvtCxINC+0LHRitC10LrRgtC1INC60LDQv9C40YLQsNC70YzQvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCAo0J7QmtChKScsXG5cdCc1NTgxMDEwNTAwMDAnOiAn0JfQsNC/0YDQvtGBINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0YHQstC10LTQtdC90LjQuSDQvtCxINCe0JrQoScsXG5cdCc1NTgxMDEwNjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INGB0L3Rj9GC0LjQuCDRgSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0YPRh9GR0YLQsCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MTAxMDcwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0YHQstC10LTQtdC90LjQuSDQviDRgNCw0L3QtdC1INGD0YfRgtGR0L3QvdC+0Lwg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODEwMTA4MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L7RiNC40LHQutC4Jyxcblx0JzU1ODEwMTA5MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0L7RiNC40LHQutC4INCyINGB0LLQtdC00LXQvdC40Y/RhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgxMDEwOTAxMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCDQsiDRgdCy0LXQtNC10L3QuNGP0YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MTAxMDkwMjAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQvtCxINC40YHQv9GA0LDQstC70LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60Lgg0LIg0YHQstC10LTQtdC90LjRj9GFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INC+INC/0YDQvtGF0L7QttC00LXQvdC40Lgg0YPRh9Cw0YHRgtC60LAg0JPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCz0YDQsNC90LjRhtGLINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuDsg0L4g0LPRgNCw0L3QuNGG0LDRhSDQvNC10LbQtNGDINGB0YPQsdGK0LXQutGC0LDQvNC4INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuDsg0L4g0LPRgNCw0L3QuNGG0LDRhSDQvNGD0L3QuNGG0LjQv9Cw0LvRjNC90YvRhSDQvtCx0YDQsNC30L7QstCw0L3QuNC5OyDQviDQs9GA0LDQvdC40YbQsNGFINC90LDRgdC10LvRkdC90L3Ri9GFINC/0YPQvdC60YLQvtCyOyDQviDRgtC10YDRgNC40YLQvtGA0LjQsNC70YzQvdGL0YUg0LfQvtC90LDRhSDQuCDQt9C+0L3QsNGFINGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuTsg0L4g0LrQsNGA0YLQvtCz0YDQsNGE0LjRh9C10YHQutC+0Lkg0Lgg0LPQtdC+0LTQtdC30LjRh9C10YHQutC+0Lkg0L7RgdC90L7QstCw0YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MTAxMTAwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9GA0LXQtNGB0YLQsNCy0LvQtdC90LjQuCDQtNC+0L/QvtC70L3QuNGC0LXQu9GM0L3Ri9GFINC00L7QutGD0LzQtdC90YLQvtCyINC90LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGA0L7QstGL0Lkg0YPRh9GR0YInLFxuXHQnNTU4MTAxMTEwMDAwJzogJ9CS0L3Rg9GC0YDQuNCy0LXQtNC+0LzRgdGC0LLQtdC90L3Ri9C5INC30LDQv9GA0L7RgSDQuNC90YTQvtGA0LzQsNGG0LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgxMDExMjAwMDAnOiAn0JfQsNC/0YDQvtGBINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0LrQvtC/0LjQuCDQtNC+0LrRg9C80LXQvdGC0LAsINC90LAg0L7RgdC90L7QstCw0L3QuNC4INC60L7RgtC+0YDQvtCz0L4g0YHQstC10LTQtdC90LjRjyDQvtCxINC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQstC90LXRgdC10L3RiyDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LrQsNC00LDRgdGC0YAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODEwMTEzMDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5LCDQstC90LXRgdGR0L3QvdGL0YUg0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60LDQtNCw0YHRgtGAINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCwg0L/QvtGB0YDQtdC00YHRgtCy0L7QvCDQvtCx0LXRgdC/0LXRh9C10L3QuNGPINC00L7RgdGC0YPQv9CwINC6INC40L3RhNC+0YDQvNCw0YbQuNC+0L3QvdC+0LzRgyDRgNC10YHRg9GA0YHRgywg0YHQvtC00LXRgNC20LDRidC10LzRgyDRgdCy0LXQtNC10L3QuNGPINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INC60LDQtNCw0YHRgtGA0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODEwMTE0MDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDQv9C10YDQtdGH0L3RjyDQvtCx0YrQtdC60YLQvtCyINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCwg0L/QvtC00LvQtdC20LDRidC40YUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L7RhtC10L3QutC1Jyxcblx0JzU1ODEwMTE1MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/RgNC10LrRgNCw0YnQtdC90LjQuCDQvtGB0YPRidC10YHRgtCy0LvQtdC90LjRjyDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0YPRh9GR0YLQsCcsXG5cdCc1NTgxMDExNjAwMDAnOiAn0JzQtdC20LLQtdC00L7QvNGB0YLQstC10L3QvdGL0Lkg0LfQsNC/0YDQvtGBINC00L7QutGD0LzQtdC90YLQvtCyINCyINC+0YDQs9Cw0L3QsNGFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQstC70LDRgdGC0Lgg0Lgg0L7RgNCz0LDQvdCw0YUg0LzQtdGB0YLQvdC+0LPQviDRgdCw0LzQvtGD0L/RgNCw0LLQu9C10L3QuNGPJyxcblx0JzU1ODEwMTE3MDAwMCc6ICfQl9Cw0L/RgNC+0YEg0LTQvtC60YPQvNC10L3RgtC+0LIg0L4g0YDQsNC90LXQtSDRg9GH0YLRkdC90L3QvtC8INC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQsiDQvtGA0LPQsNC90LDRhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LLQu9Cw0YHRgtC4LCDQvtGA0LPQsNC90LDRhSDQvNC10YHRgtC90L7Qs9C+INGB0LDQvNC+0YPQv9GA0LDQstC70LXQvdC40Y8g0LjQu9C4INC+0YDQs9Cw0L3QsNGFINC4INC+0YDQs9Cw0L3QuNC30LDRhtC40Y/RhSDQv9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvNGDINGC0LXRhdC90LjRh9C10YHQutC+0LzRgyDRg9GH0ZHRgtGDINC4ICjQuNC70LgpINGC0LXRhdC90LjRh9C10YHQutC+0Lkg0LjQvdCy0LXQvdGC0LDRgNC40LfQsNGG0LjQuCcsXG5cdCc1NTgxMDIwMDAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNGPINC4INC30LDQv9GA0L7RgdGLLCDRgdCy0Y/Qt9Cw0L3QvdGL0LUg0YEg0YDQtdCz0LjRgdGC0YDQsNGG0LjQtdC5INC/0YDQsNCyJyxcblx0JzU1ODEwMjAxMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LLQsCDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviwg0YHQtNC10LvQutC4INGBINC90LjQvCwg0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjyksINC/0LXRgNC10YXQvtC00LAsINC/0YDQtdC60YDQsNGJ0LXQvdC40Y8g0L/RgNCw0LLQsCDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQvicsXG5cdCc1NTgxMDIwMjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQtdC60YDQsNGJ0LXQvdC40Y8g0L/RgNCw0LLQsCAo0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjykg0L/RgNCw0LLQsCknLFxuXHQnNTU4MTAyMDMwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INC40LfQvNC10L3QtdC90LjQuSDQsiDQldCT0KDQnycsXG5cdCc1NTgxMDIwNDAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCcsXG5cdCc1NTgxMDIwNTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0YDQtdC00YHRgtCw0LLQu9C10L3QuNC4INC00L7Qv9C+0LvQvdC40YLQtdC70YzQvdGL0YUg0LTQvtC60YPQvNC10L3RgtC+0LIg0LTQu9GPINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCyJyxcblx0JzU1ODEwMjA2MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QuNC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwnLFxuXHQnNTU4MTAyMDcwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQstC+0LfQvtCx0L3QvtCy0LvQtdC90LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCcsXG5cdCc1NTgxMDIwODAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0YDQtdC60YDQsNGJ0LXQvdC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40LgnLFxuXHQnNTU4MTAyMDkwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9C+0LLRgtC+0YDQvdC+0Lkg0LLRi9C00LDRh9C1INGB0LLQuNC00LXRgtC10LvRjNGB0YLQstCwINC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCy0LAnLFxuXHQnNTU4MTAyMTAwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGB0LLQtdC00LXQvdC40LksINGB0L7QtNC10YDQttCw0YnQuNGF0YHRjyDQsiDQldC00LjQvdC+0Lwg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC8INGA0LXQtdGB0YLRgNC1INC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwnLFxuXHQnNTU4MTAyMTEwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9C+0YHRgtCw0L3QvtCy0LrQtSDQvdCwINGD0YfRkdGCINCx0LXRgdGF0L7Qt9GP0LnQvdGL0YUg0L3QtdC00LLQuNC20LjQvNGL0YUg0LLQtdGJ0LXQuScsXG5cdCc1NTgxMDIxMjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCy0YvQtNCw0YfQtSDQt9Cw0LrQu9Cw0LTQvdC+0LkgKNC90L7QstC+0Lkg0LfQsNC60LvQsNC00L3QvtC5LCDQtNGD0LHQu9C40LrQsNGC0LAg0LfQsNC60LvQsNC00L3QvtC5LCDQsNC90L3Rg9C70LjRgNC+0LLQsNC90L3QvtC5INC30LDQutC70LDQtNC90L7QuSknLFxuXHQnNTU4MTAyMTMwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQstGL0LTQsNGH0LUg0LrQvtC/0LjQuSDQtNC+0LPQvtCy0L7RgNC+0LIg0Lgg0LjQvdGL0YUg0LTQvtC60YPQvNC10L3RgtC+0LIsINCy0YvRgNCw0LbQsNGO0YnQuNGFINGB0L7QtNC10YDQttCw0L3QuNC1INC+0LTQvdC+0YHRgtC+0YDQvtC90L3QuNGFINGB0LTQtdC70L7Quiwg0YHQvtCy0LXRgNGI0LXQvdC90YvRhSDQsiDQv9GA0L7RgdGC0L7QuSDQv9C40YHRjNC80LXQvdC90L7QuSDRhNC+0YDQvNC1Jyxcblx0JzU1ODEwMjE0MDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QuNC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4LCDQstC+0LfQstGA0LDRgtC1INC00L7QutGD0LzQtdC90YLQvtCyINCx0LXQtyDQv9GA0L7QstC10LTQtdC90LjRjyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCwg0L/RgNC10LTRgdGC0LDQstC70LXQvdC40Lgg0LTQvtC/0L7Qu9C90LjRgtC10LvRjNC90YvRhSDQtNC+0LrRg9C80LXQvdGC0L7Qsiwg0L4g0LLQvtC30L7QsdC90L7QstC70LXQvdC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40LgsINGA0LDQvdC10LUg0L/RgNC40L7RgdGC0LDQvdC+0LLQu9C10L3QvdC+0Lkg0L/QviDQt9Cw0Y/QstC70LXQvdC40Y4g0L/RgNCw0LLQvtC+0LHQu9Cw0LTQsNGC0LXQu9GPLCDRgdGC0L7RgNC+0L3RiyAo0YHRgtC+0YDQvtC9KSDRgdC00LXQu9C60LgsINC70LjRhtCwLCDRh9GM0ZEg0L/RgNCw0LLQviDQvtCz0YDQsNC90LjRh9C40LLQsNC10YLRgdGPICjQvtCx0YDQtdC80LXQvdGP0LXRgtGB0Y8pLCDQu9C40YbQsCwg0LIg0L/QvtC70YzQt9GDINC60L7RgtC+0YDQvtCz0L4g0L/RgNCw0LLQviDQvtCz0YDQsNC90LjRh9C40LLQsNC10YLRgdGPICjQvtCx0YDQtdC80LXQvdGP0LXRgtGB0Y8pLCDQt9Cw0LrQvtC90L3QvtCz0L4g0LLQu9Cw0LTQtdC70YzRhtCwINC30LDQutC70LDQtNC90L7QuSAo0LjRhSDQv9GA0LXQtNGB0YLQsNCy0LjRgtC10LvRjyknLFxuXHQnNTU4MTAyMTUwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQv9C+0LLRgtC+0YDQvdC+0Lkg0LLRi9C00LDRh9C1INC90L7QstC+0LPQviDRgdCy0LjQtNC10YLQtdC70YzRgdGC0LLQsCDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQstCwLCDQstGL0LTQsNGH0LUg0LfQsNC60LvQsNC00L3QvtC5LCDQstC90LXRgdC10L3QuNC4INC40LfQvNC10L3QtdC90LjQuSDQsiDQt9Cw0L/QuNGB0Ywg0JXQtNC40L3QvtCz0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YDQtdC10YHRgtGA0LAg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCwg0L/QvtCz0LDRiNC10L3QuNC4INGA0LXQs9C40YHRgtGA0LDRhtC40L7QvdC90L7QuSDQt9Cw0L/QuNGB0Lgg0L7QsSDQuNC/0L7RgtC10LrQtScsXG5cdCc1NTgxMDIxNjAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0YDQuNC90Y/RgtC40Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAg0LLQvdC+0LLRjCDQstC+INCy0LvQsNC00LXQvdC40LUsINC/0L7Qu9GM0LfQvtCy0LDQvdC40LUg0Lgg0YDQsNGB0L/QvtGA0Y/QttC10L3QuNC1ICjQsiDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLRjCknLFxuXHQnNTU4MTAyMTcwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INCyINCV0LTQuNC90YvQuSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YDQtdC10YHRgtGAINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40Lwg0L7RgtC80LXRgtC60Lgg0L4g0L3QsNC70LjRh9C40Lgg0YHRg9C00LXQsdC90L7Qs9C+INGB0L/QvtGA0LAg0LIg0L7RgtC90L7RiNC10L3QuNC4INC30LDRgNC10LPQuNGB0YLRgNC40YDQvtCy0LDQvdC90L7Qs9C+INC/0YDQsNCy0LAnLFxuXHQnNTU4MTAyMTgwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQvtCxINC40YHQv9GA0LDQstC70LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60Lgg0LIg0LfQsNC/0LjRgdGP0YUg0JXQtNC40L3QvtCz0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YDQtdC10YHRgtGA0LAg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCwg0L4g0L3QsNC70LjRh9C40Lgg0LLQvtC30YDQsNC20LXQvdC40Y8g0LIg0L7RgtC90L7RiNC10L3QuNC4INC30LDRgNC10LPQuNGB0YLRgNC40YDQvtCy0LDQvdC90L7Qs9C+INC/0YDQsNCy0LAg0L3QsCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4LCDQviDQv9C+0LPQsNGI0LXQvdC40Lgg0LfQsNC/0LjRgdC4INCyINCV0LTQuNC90L7QvCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lwg0YDQtdC10YHRgtGA0LUg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCDQviDQvdCw0LvQuNGH0LjQuCDQstC+0LfRgNCw0LbQtdC90LjRjyDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LfQsNGA0LXQs9C40YHRgtGA0LjRgNC+0LLQsNC90L3QvtCz0L4g0L/RgNCw0LLQsCDQvdCwINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7RgdGC0LgsINC+INC90LXQstC+0LfQvNC+0LbQvdC+0YHRgtC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0LXRgNC10YXQvtC00LAsINC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pLCDQv9GA0LXQutGA0LDRidC10L3QuNGPINC/0YDQsNCy0LAg0L3QsCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCx0LXQtyDQu9C40YfQvdC+0LPQviDRg9GH0LDRgdGC0LjRjyDRgdC+0LHRgdGC0LLQtdC90L3QuNC60LAgKNC10LPQviDQt9Cw0LrQvtC90L3QvtCz0L4g0L/RgNC10LTRgdGC0LDQstC40YLQtdC70Y8pLCDQvtCxINC+0YLQt9GL0LLQtSDRgNCw0L3QtdC1INC/0YDQtdC00YHRgtCw0LLQu9C10L3QvdC+0LPQviDQt9Cw0Y/QstC70LXQvdC40Y8g0L4g0L3QtdCy0L7Qt9C80L7QttC90L7RgdGC0Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/QtdGA0LXRhdC+0LTQsCwg0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjyksINC/0YDQtdC60YDQsNGJ0LXQvdC40Y8g0L/RgNCw0LLQsCDQvdCwINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0LHQtdC3INC70LjRh9C90L7Qs9C+INGD0YfQsNGB0YLQuNGPINGB0L7QsdGB0YLQstC10L3QvdC40LrQsCAo0LXQs9C+INC30LDQutC+0L3QvdC+0LPQviDQv9GA0LXQtNGB0YLQsNCy0LjRgtC10LvRjyknLFxuXHQnNTU4MTAyMTkwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDRgdC60YDQtdC/0LvQtdC90LjQuCDQtNC+0LHQsNCy0L7Rh9C90L7Qs9C+INC70LjRgdGC0LAgKNC00L7QsdCw0LLQvtGH0L3Ri9GFINC70LjRgdGC0L7Qsikg0YEg0LfQsNC60LvQsNC00L3QvtC5Jyxcblx0JzU1ODEwMjIwMDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDRgdCy0LXQtNC10L3QuNC5LCDRgdC+0LTQtdGA0LbQsNGJ0LjRhdGB0Y8g0LIg0JXQtNC40L3QvtC8INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QvCDRgNC10LXRgdGC0YDQtSDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8LCDQv9C+0YHRgNC10LTRgdGC0LLQvtC8INC+0LHQtdGB0L/QtdGH0LXQvdC40Y8g0LTQvtGB0YLRg9C/0LAg0Log0LjQvdGE0L7RgNC80LDRhtC40L7QvdC90L7QvNGDINGA0LXRgdGD0YDRgdGDLCDRgdC+0LTQtdGA0LbQsNGJ0LXQvNGDINGB0LLQtdC00LXQvdC40Y8g0JXQtNC40L3QvtCz0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YDQtdC10YHRgtGA0LAg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCcsXG5cdCc1NTgxMDIyMTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC30LDQutC+0L3QvdC+0LPQviDQstC70LDQtNC10LvRjNGG0LAg0LfQsNC60LvQsNC00L3QvtC5Jyxcblx0JzU1ODEwMjIyMDAwMCc6ICfQl9Cw0Y/QstC70LXQvdC40LUg0L4g0LLQvdC10YHQtdC90LjQuCDQuNC30LzQtdC90LXQvdC40Lkg0LIg0LfQsNC/0LjRgdGMINCV0LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+INC4INGB0LTQtdC70L7QuiDRgSDQvdC40LwsINC/0L7Qs9Cw0YjQtdC90LjQuCDRgNC10LPQuNGB0YLRgNCw0YbQuNC+0L3QvdC+0Lkg0LfQsNC/0LjRgdC4INC+0LEg0LjQv9C+0YLQtdC60LUnLFxuXHQnNTU4MTAzMDAwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjRjyDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lwg0YPRh9GR0YLQtSDQt9C00LDQvdC40LksINGB0L7QvtGA0YPQttC10L3QuNC5LCDQv9C+0LzQtdGJ0LXQvdC40LksINC+0LHRitC10LrRgtC+0LIg0L3QtdC30LDQstC10YDRiNGR0L3QvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCAo0L7QsdGK0LXQutGC0L7QsiDRg9GH0ZHRgtCwKSDQuCDQt9Cw0L/RgNC+0YHRiyDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGB0LLQtdC00LXQvdC40LksINCy0L3QtdGB0ZHQvdC90YvRhSDQsiDQldC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCcsXG5cdCc1NTgxMDMwMTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0L7RgdGC0LDQvdC+0LLQutC1INC90LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGD0YfRkdGCINC+0LHRitC10LrRgtCwINGD0YfRkdGC0LAnLFxuXHQnNTU4MTAzMDIwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INCyINCV0JPQoNCe0JrQoSDRgdCy0LXQtNC10L3QuNC5INC+INGA0LDQvdC10LUg0YPRh9GC0ZHQvdC90L7QvCDQvtCx0YrQtdC60YLQtSDQutCw0L/QuNGC0LDQu9GM0L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAnLFxuXHQnNTU4MTAzMDMwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lwg0YPRh9GR0YLQtSDQuNC30LzQtdC90LXQvdC40Lkg0L7QsdGK0LXQutGC0LAg0YPRh9GR0YLQsCcsXG5cdCc1NTgxMDMwNDAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INGB0L3Rj9GC0LjQuCDRgSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRg9GH0ZHRgtCwINC+0LHRitC10LrRgtCwINGD0YfRkdGC0LAnLFxuXHQnNTU4MTAzMDUwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQvtCxINC40YHQv9GA0LDQstC70LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60LgnLFxuXHQnNTU4MTAzMDYwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQvtCxINC40YHQutC70Y7Rh9C10L3QuNC4INGB0LLQtdC00LXQvdC40Lkg0LjQtyDQldCT0KDQntCa0KEsINC90L7RgdGP0YnQuNGFINCy0YDQtdC80LXQvdC90YvQuSDRhdCw0YDQsNC60YLQtdGAJyxcblx0JzU1ODEwMzA3MDAwMCc6ICfQl9Cw0L/RgNC+0YEg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDQutC+0L/QuNC4INC00L7QutGD0LzQtdC90YLQsCwg0L3QsCDQvtGB0L3QvtCy0LDQvdC40Lgg0LrQvtGC0L7RgNC+0LPQviDRgdCy0LXQtNC10L3QuNGPINC+0LEg0L7QsdGK0LXQutGC0LUg0LLQvdC10YHQtdC90Ysg0LIg0JXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAnLFxuXHQnNTU4MTAzMDgwMDAwJzogJ9CX0LDQv9GA0L7RgSDQviDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGB0LLQtdC00LXQvdC40LksINCy0L3QtdGB0LXQvdC90YvRhSDQsiDQldC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCcsXG5cdCc1NTgxMDMwOTAwMDAnOiAn0JfQsNGP0LLQu9C10L3QuNC1INC+INC/0YDQtdC00YHRgtCw0LLQu9C10L3QuNC4INC00L7Qv9C+0LvQvdC40YLQtdC70YzQvdGL0YUg0LTQvtC60YPQvNC10L3RgtC+0LIg0L3QsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0YPRh9GR0YInLFxuXHQnNTU4MTA0MDAwMDAwJzogJ9CX0LDRj9Cy0LvQtdC90LjQtSDQviDQstC+0LfQstGA0LDRgtC1INC/0LvQsNGC0LXQttCwJyxcblx0JzU1ODE5OTAwMDAwMCc6ICfQmNC90L7QtSDQt9Cw0Y/QstC70LXQvdC40LUnLFxuXHQnNTU4MjAwMDAwMDAwJzogJ9CU0J7QmtCj0JzQldCd0KLQqywg0KHQntCU0JXQoNCW0JDQqdCY0JUg0J7Qn9CY0KHQkNCd0JjQlSDQntCR0KrQldCa0KLQkCcsXG5cdCc1NTgyMDEwMDAwMDAnOiAn0J7Qv9C40YHQsNC90LjQtSDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG5cdCc1NTgyMDIwMDAwMDAnOiAn0JfQtdC80LvQtdGD0YHRgtGA0L7QuNGC0LXQu9GM0L3QvtC1INC00LXQu9C+Jyxcblx0JzU1ODIwMzAwMDAwMCc6ICfQnNC10LbQtdCy0L7QuSDQv9C70LDQvScsXG5cdCc1NTgyMDQwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgiAo0LrQvtC/0LjRjyksINC90LAg0L7RgdC90L7QstCw0L3QuNC4INC60L7RgtC+0YDQvtCz0L4g0YHQstC10LTQtdC90LjRjyDQvtCxINC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQstC90LXRgdC10L3RiyDQsiDQk9Ca0J0nLFxuXHQnNTU4MjA1MDAwMDAwJzogJ9Ci0LXRhdC90LjRh9C10YHQutC40Lkg0L/QsNGB0L/QvtGA0YIg0L7QsdGK0LXQutGC0LAg0YPRh9GR0YLQsCcsXG5cdCc1NTgyMDUwMTAwMDAnOiAn0KLQtdGF0L3QuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgiDQtNC+0LzQvtCy0LvQsNC00LXQvdC40Y8nLFxuXHQnNTU4MjA1MDIwMDAwJzogJ9Ci0LXRhdC90LjRh9C10YHQutC40Lkg0L/QsNGB0L/QvtGA0YIg0LfQtNCw0L3QuNGPICjRgdGC0YDQvtC10L3QuNGPKScsXG5cdCc1NTgyMDUwMzAwMDAnOiAn0KLQtdGF0L3QuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgiDQttC40LvQvtCz0L4g0L/QvtC80LXRidC10L3QuNGPICjQutCy0LDRgNGC0LjRgNGLKScsXG5cdCc1NTgyMDUwNDAwMDAnOiAn0KLQtdGF0L3QuNGH0LXRgdC60LjQuSDQv9Cw0YHQv9C+0YDRgiDQvtCx0YrQtdC60YLQsCDQuNC90LTQuNCy0LjQtNGD0LDQu9GM0L3QvtCz0L4g0LbQuNC70LjRidC90L7Qs9C+INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstCwJyxcblx0JzU1ODIwNTA1MDAwMCc6ICfQotC10YXQvdC40YfQtdGB0LrQuNC5INC/0LDRgdC/0L7RgNGCINGB0L7QvtGA0YPQttC10L3QuNGPJyxcblx0JzU1ODIwNTA2MDAwMCc6ICfQotC10YXQvdC40YfQtdGB0LrQuNC5INC/0LDRgdC/0L7RgNGCINC+0LHRitC10LrRgtCwINC90LXQt9Cw0LLQtdGA0YjRkdC90L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAnLFxuXHQnNTU4MjA2MDAwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0YLQtdGF0L3QuNGH0LXRgdC60L7Qs9C+INC/0LDRgdC/0L7RgNGC0LAnLFxuXHQnNTU4MjA2MDEwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0YLQtdGF0L3QuNGH0LXRgdC60L7Qs9C+INC/0LDRgdC/0L7RgNGC0LAg0L3QsCDQt9C00LDQvdC40LUgKNGB0YLRgNC+0LXQvdC40LUpJyxcblx0JzU1ODIwNjAyMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INGC0LXRhdC90LjRh9C10YHQutC+0LPQviDQv9Cw0YHQv9C+0YDRgtCwINCR0KLQmCcsXG5cdCc1NTgyMDcwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgiAo0LrQvtC/0LjRjyksINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0YDQsNC30YDQtdGI0LXQvdC40LUg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YHQv9C+0YDQsCDQviDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40Lgg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjRjyDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuXHQnNTU4MjA4MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIgKNC60L7Qv9C40Y8pLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC/0YDQuNC90LDQtNC70LXQttC90L7RgdGC0Ywg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAg0Log0L7Qv9GA0LXQtNC10LvQtdC90L3QvtC5INC60LDRgtC10LPQvtGA0LjQuCDQt9C10LzQtdC70YwnLFxuXHQnNTU4MjA5MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIgKNC60L7Qv9C40Y8pLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INGD0YHRgtCw0L3QvtCy0LvQtdC90L3QvtC1INGA0LDQt9GA0LXRiNC10L3QvdC+0LUg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40LUg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuXHQnNTU4MjEwMDAwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L/Qu9Cw0L0g0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAgKNCy0YvQv9C40YHQutCwINC40Lcg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LfQtdC80LXQu9GM0L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQsCknLFxuXHQnNTU4MjExMDAwMDAwJzogJ9Cf0LvQsNC90Ysg0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MjExMDEwMDAwJzogJ9Ci0LXRhdC90LjRh9C10YHQutC40Lkg0L/Qu9Cw0L0g0LfQtNCw0L3QuNGPLCDRgdC+0L7RgNGD0LbQtdC90LjRjywg0L/QvtC80LXRidC10L3QuNGPINC70LjQsdC+INC+0LHRitC10LrRgtCwINC90LXQt9Cw0LLQtdGA0YjRkdC90L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAnLFxuXHQnNTU4MjExMDIwMDAwJzogJ9Cf0LvQsNC9INGD0YfQsNGB0YLQutCwINC70LXRgdC90L7Qs9C+INGE0L7QvdC00LAnLFxuXHQnNTU4MjExMDMwMDAwJzogJ9Cf0LvQsNC9INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgyMTEwNDAwMDAnOiAn0K3QutGB0L/Qu9C40LrQsNGG0LjRjyDQuiDQv9C+0Y3RgtCw0LbQvdC+0LzRgyDQv9C70LDQvdGDJyxcblx0JzU1ODIxMjAwMDAwMCc6ICfQlNC10LrQu9Cw0YDQsNGG0LjRjyDQvtCxINC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgyMTMwMDAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQv9Cw0YHQv9C+0YDRgiDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MjEzMDEwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L/QsNGB0L/QvtGA0YIg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuXHQnNTU4MjEzMDIwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L/QsNGB0L/QvtGA0YIg0L/QvtC80LXRidC10L3QuNGPICjQstGL0L/QuNGB0LrQsCDQuNC3INCT0JrQnSknLFxuXHQnNTU4MjEzMDMwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L/QsNGB0L/QvtGA0YIg0LfQtNCw0L3QuNGPLCDRgdC+0L7RgNGD0LbQtdC90LjRjywg0L7QsdGK0LXQutGC0LAg0L3QtdC30LDQstC10YDRiNGR0L3QvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCcsXG5cdCc1NTgyMTQwMDAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0LDRjyDQstGL0L/QuNGB0LrQsCDQvtCxINC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgyMTQwMTAwMDAnOiAn0JrQsNC00LDRgdGC0YDQvtCy0LDRjyDQstGL0L/QuNGB0LrQsCDQviDQt9C10LzQtdC70YzQvdC+0Lwg0YPRh9Cw0YHRgtC60LUnLFxuXHQnNTU4MjE0MDIwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstCw0Y8g0LLRi9C/0LjRgdC60LAg0L4g0LfQtNCw0L3QuNC4LCDRgdC+0L7RgNGD0LbQtdC90LjQuCwg0L7QsdGK0LXQutGC0LUg0L3QtdC30LDQstC10YDRiNGR0L3QvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCcsXG5cdCc1NTgyMTYwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQuNC30LzQtdC90LXQvdC40LUg0L3QsNC30L3QsNGH0LXQvdC40Y8g0LfQtNCw0L3QuNGPLCDQv9C+0LzQtdGJ0LXQvdC40Y8g0LjQu9C4INGB0L7QvtGA0YPQttC10L3QuNGPLCDQvdCw0LjQvNC10L3QvtCy0LDQvdC40Y8g0YHQvtC+0YDRg9C20LXQvdC40Y8nLFxuXHQnNTU4MjE3MDAwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstGL0Lkg0L/Qu9Cw0L0g0YLQtdGA0YDQuNGC0L7RgNC40LgnLFxuXHQnNTU4MjE4MDAwMDAwJzogJ9Ca0LDQtNCw0YHRgtGA0L7QstCw0Y8g0YHQv9GA0LDQstC60LAg0L4g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDRgdGC0L7QuNC80L7RgdGC0Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODIxOTAwMDAwMCc6ICfQkNC60YIg0L7QsdGB0LvQtdC00L7QstCw0L3QuNGPLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC5INC/0YDQtdC60YDQsNGJ0LXQvdC40LUg0YHRg9GJ0LXRgdGC0LLQvtCy0LDQvdC40Y8g0L7QsdGK0LXQutGC0LAg0YPRh9GR0YLQsCcsXG5cdCc1NTgyMjAwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLLCDQsiDQstC40LTQtSDQutC+0YLQvtGA0YvRhSDQv9GA0LXQtNC+0YHRgtCw0LLQu9GP0Y7RgtGB0Y8g0YHQstC10LTQtdC90LjRjyDQldC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCcsXG5cdCc1NTgyMjAwMTAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQoNC10LXRgdGC0YDQsCwg0YHQvtC00LXRgNC20LDRidCw0Y8g0L7RgtC90L7RgdGP0YnQuNC10YHRjyDQuiDQuNC90YTQvtGA0LzQsNGG0LjQuCDQvtCz0YDQsNC90LjRh9C10L3QvdC+0LPQviDQtNC+0YHRgtGD0L/QsCDRgdCy0LXQtNC10L3QuNGPINC+0LEg0L7QsdGK0LXQutGC0LUg0YPRh9C10YLQsCcsXG5cdCc1NTgyMjAwMjAwMDAnOiAn0KHQv9GA0LDQstC60LAsINGB0L7QtNC10YDQttCw0YnQsNGPLCDQstC90LXRgdGR0L3QvdGL0LUg0LIg0JXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAg0YHQstC10LTQtdC90LjRjyDQviDQv9GA0LXQutGA0LDRidC10L3QuNC4INGB0YPRidC10YHRgtCy0L7QstCw0L3QuNGPINC+0LHRitC10LrRgtCwINGD0YfRkdGC0LAnLFxuXHQnNTU4MjIwMDMwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0KDQtdC10YHRgtGA0LAsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidCw0Y8g0YTQsNC60YIg0L7RgtGB0YPRgtGB0YLQstC40Y8g0LIg0KDQtdC10YHRgtGA0LUg0YHQstC10LTQtdC90LjQuSDQvtCxINC+0LHRitC10LrRgtC1INGD0YfQtdGC0LAnLFxuXHQnNTU4MjIxMDAwMDAwJzogJ9Cf0KDQntCn0JjQlScsXG5cdCc1NTgyMjEwMTAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0L3QtdC+0LHRhdC+0LTQuNC80L7RgdGC0Lgg0YPRgdGC0YDQsNC90LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQvtGI0LjQsdC60LgnLFxuXHQnNTU4MjIxMDIwMDAwJzogJ9Cc0LXQttC00YPQvdCw0YDQvtC00L3Ri9C5INC00L7Qs9C+0LLQvtGAINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCwg0LIg0YHQvtC+0YLQstC10YLRgdGC0LLQuNC4INGBINC60L7RgtC+0YDRi9C8INGD0YHRgtCw0L3QvtCy0LvQtdC90L4g0LjQu9C4INC40LfQvNC10L3QtdC90L4g0L/RgNC+0YXQvtC20LTQtdC90LjQtSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LPRgNCw0L3QuNGG0Ysg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzU1ODIyMTAzMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDRgdC+0LTQtdGA0LbQsNGJ0LjQuSDQvdC10L7QsdGF0L7QtNC40LzRi9C1INC00LvRjyDQstC90LXRgdC10L3QuNGPINCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0YHQstC10LTQtdC90LjRjyDQviDQs9GA0LDQvdC40YbQsNGFINC80LXQttC00YMg0YHRg9Cx0YrQtdC60YLQsNC80Lgg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4LCDQs9GA0LDQvdC40YbQsNGFINC80YPQvdC40YbQuNC/0LDQu9GM0L3QvtCz0L4g0L7QsdGA0LDQt9C+0LLQsNC90LjRjywg0LPRgNCw0L3QuNGG0LDRhSDQvdCw0YHQtdC70ZHQvdC90L7Qs9C+INC/0YPQvdC60YLQsCcsXG5cdCc1NTgyMjEwNDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0YHQvtC00LXRgNC20LDRidC40Lkg0L3QtdC+0LHRhdC+0LTQuNC80YvQtSDQtNC70Y8g0LLQvdC10YHQtdC90LjRjyDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LrQsNC00LDRgdGC0YAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INGB0LLQtdC00LXQvdC40Y8g0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0LjQu9C4INC40LfQvNC10L3QtdC90LjQuCDRgtC10YDRgNC40YLQvtGA0LjQsNC70YzQvdC+0Lkg0LfQvtC90Ysg0LjQu9C4INC30L7QvdGLINGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuSwg0LvQuNCx0L4g0L7QsSDQvtGC0LzQtdC90LUg0YPRgdGC0LDQvdC+0LLQu9C10L3QuNGPINGC0LDQutC+0Lkg0LfQvtC90YsnLFxuXHQnNTU4MjIxMDUwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC/0YDQuNGB0LLQvtC10L3QuNC4LCDQuNC30LzQtdC90LXQvdC40Lgg0LDQtNGA0LXRgdCwJyxcblx0JzU1ODIyMTA2MDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0Ysg0L7RgNCz0LDQvdC+0LIsINC+0YHRg9GJ0LXRgdGC0LLQu9GP0Y7RidC40YUg0LLQtdC00LXQvdC40LUg0LvQtdGB0L3QvtCz0L4g0Lgg0LLQvtC00L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQsCwg0YHQvtC00LXRgNC20LDRidC40LUg0YHQstC10LTQtdC90LjRjyDQviDQv9GA0LjRgNC+0LTQvdGL0YUg0L7QsdGK0LXQutGC0LDRhScsXG5cdCc1NTgyMjEwNzAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0YHQvtC00LXRgNC20LDRidC40Lkg0YHQstC10LTQtdC90LjRjyDQvtCxINCw0LTRgNC10YHQtSDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MjIxMDgwMDAwJzogJ9CQ0LrRgiDQvtCxINGD0YLQstC10YDQttC00LXQvdC40Lgg0YDQtdC30YPQu9GM0YLQsNGC0L7QsiDQvtC/0YDQtdC00LXQu9C10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0YHRgtC+0LjQvNC+0YHRgtC4Jyxcblx0JzU1ODIyMTk5MDAwMCc6ICfQmNC90L7QuSDQtNC+0LrRg9C80LXQvdGCLCDRgdC+0LTQtdGA0LbQsNGJ0LjQuSDQvtC/0LjRgdCw0L3QuNC1INC+0LHRitC10LrRgtCwJyxcblx0JzU1ODIyMjAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjywg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINC80LXQttC00YPQvdCw0YDQvtC00L3QvtC8INC00L7Qs9C+0LLQvtGA0LUg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4LCDQsiDRgdC+0L7RgtCy0LXRgtGB0YLQstC40Lgg0YEg0LrQvtGC0L7RgNGL0Lwg0YPRgdGC0LDQvdC+0LLQu9C10L3QviDQuNC70Lgg0LjQt9C80LXQvdC10L3QviDQv9GA0L7RhdC+0LbQtNC10L3QuNC1INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQs9GA0LDQvdC40YbRiyDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgsINCwINGC0LDQutC20LUg0YHQstC10LTQtdC90LjRjyDQviDRhNC10LTQtdGA0LDQu9GM0L3QvtC8INC30LDQutC+0L3QtSwg0LrQvtGC0L7RgNGL0Lwg0YDQsNGC0LjRhNC40YbQuNGA0L7QstCw0L0g0LzQtdC20LTRg9C90LDRgNC+0LTQvdGL0Lkg0LTQvtCz0L7QstC+0YAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4LCDQuCDQvtCxINC+0YTQuNGG0LjQsNC70YzQvdC+0Lwg0L7Qv9GD0LHQu9C40LrQvtCy0LDQvdC40Lgg0YLQsNC60L7Qs9C+INGE0LXQtNC10YDQsNC70YzQvdC+0LPQviDQt9Cw0LrQvtC90LAnLFxuXHQnNTU4MjIzMDAwMDAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0LjQt9C80LXQvdC10L3QuNC4INCz0YDQsNC90LjRhiDQvNC10LbQtNGDINGB0YPQsdGK0LXQutGC0LDQvNC4INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCc1NTgyMjQwMDAwMDAnOiAn0JfQsNC60L7QvSDRgdGD0LHRitC10LrRgtCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQvtCxINGD0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQuNC70Lgg0LjQt9C80LXQvdC10L3QuNC4INCz0YDQsNC90LjRhiDQvNGD0L3QuNGG0LjQv9Cw0LvRjNC90YvRhSDQvtCx0YDQsNC30L7QstCw0L3QuNC5INC70LjQsdC+INC+INC/0YDQtdC+0LHRgNCw0LfQvtCy0LDQvdC40Lgg0LzRg9C90LjRhtC40L/QsNC70YzQvdGL0YUg0L7QsdGA0LDQt9C+0LLQsNC90LjQuScsXG5cdCc1NTgyMjUwMDAwMDAnOiAn0JDQutGCINGD0L/QvtC70L3QvtC80L7Rh9C10L3QvdC+0LPQviDQvtGA0LPQsNC90LAg0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0LjQu9C4INC40LfQvNC10L3QtdC90LjQuCDQs9GA0LDQvdC40YYg0L3QsNGB0LXQu9GR0L3QvdGL0YUg0L/Rg9C90LrRgtC+0LInLFxuXHQnNTU4MjI2MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDQvdC10L7QsdGF0L7QtNC40LzRi9C1INC00LvRjyDQstC90LXRgdC10L3QuNGPINCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDQutCw0LTQsNGB0YLRgCDQvdC10LTQstC40LbQuNC80L7RgdGC0Lgg0YHQstC10LTQtdC90LjRjyDQviDQs9GA0LDQvdC40YbQsNGFINC80LXQttC00YMg0YHRg9Cx0YrQtdC60YLQsNC80Lgg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4LCDQs9GA0LDQvdC40YbQsNGFINC80YPQvdC40YbQuNC/0LDQu9GM0L3QvtCz0L4g0L7QsdGA0LDQt9C+0LLQsNC90LjRjywg0LPRgNCw0L3QuNGG0LDRhSDQvdCw0YHQtdC70ZHQvdC90L7Qs9C+INC/0YPQvdC60YLQsCwg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINGD0YLQstC10YDQttC00ZHQvdC90YvRhSDQvtGA0LPQsNC90LDQvNC4INCy0LvQsNGB0YLQuCDQtNC+0LrRg9C80LXQvdGC0LDRhScsXG5cdCc1NTgyMjcwMDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0LjQu9C4INC40LfQvNC10L3QtdC90LjQuCDQs9GA0LDQvdC40YYg0LfQvtC9INGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuScsXG5cdCc1NTgyMjgwMDAwMDAnOiAn0J/RgNCw0LLQvtCy0L7QuSDQsNC60YIsINC60L7RgtC+0YDRi9C8INGD0YLQstC10YDQttC00LXQvdGLINC40LvQuCDQuNC30LzQtdC90LXQvdGLINC/0YDQsNCy0LjQu9CwINC30LXQvNC70LXQv9C+0LvRjNC30L7QstCw0L3QuNGPINC4INC30LDRgdGC0YDQvtC50LrQuCcsXG5cdCc1NTgyMjkwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQuNC30LzQtdC90LXQvdC40LUg0L3QsNC30L3QsNGH0LXQvdC40Y8g0L/QvtC80LXRidC10L3QuNGPJyxcblx0JzU1ODIzMDAwMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQv9C10YDQtdCy0L7QtNC1INC20LjQu9C+0LPQviDQv9C+0LzQtdGJ0LXQvdC40Y8g0LIg0L3QtdC20LjQu9C+0LUg0L/QvtC80LXRidC10L3QuNC1LCDQvdC10LbQuNC70L7Qs9C+INC/0L7QvNC10YnQtdC90LjRjyDQsiDQttC40LvQvtC1INC/0L7QvNC10YnQtdC90LjQtScsXG5cdCc1NTgyMzEwMDAwMDAnOiAn0JDQutGCINC/0YDQuNC10LzQvtGH0L3QvtC5INC60L7QvNC40YHRgdC40LgsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0LfQsNCy0LXRgNGI0LXQvdC40LUg0L/QtdGA0LXRg9GB0YLRgNC+0LnRgdGC0LLQsCDQuCAo0LjQu9C4KSDQv9C10YDQtdC/0LvQsNC90LjRgNC+0LLQutC4INC4ICjQuNC70LgpINC40L3Ri9GFINGA0LDQsdC+0YInLFxuXHQnNTU4MjMyMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC1INGB0LLQtdC00LXQvdC40Y8g0L7QsSDQuNC30LzQtdC90LXQvdC40Lgg0L3QsNC30L3QsNGH0LXQvdC40Y8g0L/QvtC80LXRidC10L3QuNGPJyxcblx0JzU1ODIzMzAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjywg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINGA0LXRiNC10L3QuNC4INC+INC/0LXRgNC10LLQvtC00LUg0LbQuNC70L7Qs9C+INC/0L7QvNC10YnQtdC90LjRjyDQsiDQvdC10LbQuNC70L7QtSDQv9C+0LzQtdGJ0LXQvdC40LUsINC90LXQttC40LvQvtCz0L4g0L/QvtC80LXRidC10L3QuNGPINCyINC20LjQu9C+0LUg0L/QvtC80LXRidC10L3QuNC1Jyxcblx0JzU1ODIzNDAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjywg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINCw0LrRgtC1INC/0YDQuNC10LzQvtGH0L3QvtC5INC60L7QvNC40YHRgdC40LgsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC10Lwg0LfQsNCy0LXRgNGI0LXQvdC40LUg0L/QtdGA0LXRg9GB0YLRgNC+0LnRgdGC0LLQsCDQuCAo0LjQu9C4KSDQv9C10YDQtdC/0LvQsNC90LjRgNC+0LLQutC4INC4ICjQuNC70LgpINC40L3Ri9GFINGA0LDQsdC+0YInLFxuXHQnNTU4MjM1MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0LjQt9C80LXQvdC10L3QuNC1INC90LDQt9C90LDRh9C10L3QuNGPINC30LTQsNC90LjRjycsXG5cdCc1NTgyMzYwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQuNC30LzQtdC90LXQvdC40LUg0L3QsNC30L3QsNGH0LXQvdC40Y8g0YHQvtC+0YDRg9C20LXQvdC40Y8nLFxuXHQnNTU4MjM3MDAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0YDQsNC30YDQtdGI0LXQvdC40Y8g0L3QsCDRg9GB0LvQvtCy0L3QviDRgNCw0LfRgNC10YjQtdC90L3Ri9C5INCy0LjQtCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjycsXG5cdCc1NTgyMzgwMDAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtC/0YDQtdC00LXQu9C10L3QuNC4ICjQuNC30LzQtdC90LXQvdC40LgpINCy0LjQtNCwINGA0LDQt9GA0LXRiNC10L3QvdC+0LPQviDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjycsXG5cdCc1NTgyMzkwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgiAo0LrQvtC/0LjRjyksINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPINC+INC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0YDQsNC30YDQtdGI0LXQvdC40Y8g0L3QsCDRg9GB0LvQvtCy0L3QviDRgNCw0LfRgNC10YjQtdC90L3Ri9C5INCy0LjQtCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjywg0L7QsSDQvtC/0YDQtdC00LXQu9C10L3QuNC4ICjQuNC30LzQtdC90LXQvdC40LgpINCy0LjQtNCwINGA0LDQt9GA0LXRiNC10L3QvdC+0LPQviDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjycsXG5cdCc1NTgyNDAwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDRgNC10YjQtdC90LjQuCDQviDQv9GA0LjRgdCy0L7QtdC90LjQuCwg0LjQt9C80LXQvdC10L3QuNC4INCw0LTRgNC10YHQsCcsXG5cdCc1NTgyNDEwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDRgNCw0LfRgNC10YjQtdC90LjQuCDQvdCwINCy0LLQvtC0INC+0LHRitC10LrRgtCwINC60LDQv9C40YLQsNC70YzQvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCDQsiDRjdC60YHQv9C70YPQsNGC0LDRhtC40Y4g0YHQstC10LTQtdC90LjRjycsXG5cdCc1NTgyNDIwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDRgNC10LXRgdGC0YDQtSDQvtCx0YrQtdC60YLQvtCyINC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNGB0LvQtdC00LjRjyAo0L/QsNC80Y/RgtC90LjQutC+0LIg0LjRgdGC0L7RgNC40Lgg0Lgg0LrRg9C70YzRgtGD0YDRiykg0L3QsNGA0L7QtNC+0LIg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzU1ODI0MzAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDQstC+0YHQv9GA0L7QuNC30LLQvtC00Y/RidC40Lkg0YHQstC10LTQtdC90LjRjywg0YHQvtC00LXRgNC20LDRidC40LXRgdGPINCyINCw0LrRgtC1INCf0YDQsNCy0LjRgtC10LvRjNGB0YLQstCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQvtCxINC40YHQutC70Y7Rh9C10L3QuNC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQuNC3INC10LTQuNC90L7Qs9C+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7Qs9C+INGA0LXQtdGB0YLRgNCwINC+0LHRitC10LrRgtC+0LIg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPICjQv9Cw0LzRj9GC0L3QuNC60L7QsiDQuNGB0YLQvtGA0LjQuCDQuCDQutGD0LvRjNGC0YPRgNGLKSDQvdCw0YDQvtC00L7QsiDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnNTU4MjQ0MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINGB0L7QtNC10YDQttCw0YnQuNC5INGB0LLQtdC00LXQvdC40Y8g0L4g0LTQsNGC0LUg0L/QvtGB0YLRg9C/0LvQtdC90LjRjyDQtNC+0LrRg9C80LXQvdGC0L7Qsiwg0L/RgNC10LTRg9GB0LzQvtGC0YDQtdC90L3Ri9GFINGB0YLQsNGC0YzQtdC5IDE3INCk0LXQtNC10YDQsNC70YzQvdC+0LPQviDQt9Cw0LrQvtC90LAgXCLQntCxINC+0LHRitC10LrRgtCw0YUg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPICjQv9Cw0LzRj9GC0L3QuNC60LDRhSDQuNGB0YLQvtGA0LjQuCDQuCDQutGD0LvRjNGC0YPRgNGLKSDQvdCw0YDQvtC00L7QsiDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LhcIiwg0LIg0L7RgtC90L7RiNC10L3QuNC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTgyNDUwMDAwMDAnOiAn0KDQtdGI0LXQvdC40LUgKNC60L7Qv9C40Y8g0YDQtdGI0LXQvdC40Y8pINGB0L7QvtGC0LLQtdGC0YHRgtCy0YPRjtGJ0LXQs9C+INC+0YDQs9Cw0L3QsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0LLQu9Cw0YHRgtC4INC+0LEg0L7RgtC60LDQt9C1INCy0LrQu9GO0YfQuNGC0Ywg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQsiDQtdC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCDQvtCx0YrQtdC60YLQvtCyINC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNGB0LvQtdC00LjRjyAo0L/QsNC80Y/RgtC90LjQutC+0LIg0LjRgdGC0L7RgNC40Lgg0Lgg0LrRg9C70YzRgtGD0YDRiykg0L3QsNGA0L7QtNC+0LIg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzU1ODI0NjAwMDAwMCc6ICfQkNC60YIg0J/RgNCw0LLQuNGC0LXQu9GM0YHRgtCy0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC+0LEg0LjRgdC60LvRjtGH0LXQvdC40Lgg0L7QsdGK0LXQutGC0LAg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INC40Lcg0LXQtNC40L3QvtCz0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YDQtdC10YHRgtGA0LAg0L7QsdGK0LXQutGC0L7QsiDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8nLFxuXHQnNTU4MjQ3MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPINC+INC90LDQuNC80LXQvdC+0LLQsNC90LjQuCDQstC+0LTQvdC+0LPQviDQvtCx0YrQtdC60YLQsCDQuCDRg9GB0YLQsNC90L7QstC70LXQvdC90YvRhSDQv9Cw0YDQsNC80LXRgtGA0LDRhSDQstC+0LTQvtC+0YXRgNCw0L3QvdGL0YUg0LfQvtC9INC4INC/0YDQuNCx0YDQtdC20L3Ri9GFINC30LDRidC40YLQvdGL0YUg0L/QvtC70L7RgSwg0LfQvtC9INC30LDRgtC+0L/Qu9C10L3QuNGPLCDQv9C+0LTRgtC+0L/Qu9C10L3QuNGPINC4INC00YDRg9Cz0LjRhSDQt9C+0L0g0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YUg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8nLFxuXHQnNTU4MjQ4MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC8INC70LXRgdC90L7QvCDRgNC10LXRgdGC0YDQtSDRgdCy0LXQtNC10L3QuNGPINCyINC+0YLQvdC+0YjQtdC90LjQuCDQu9C10YHQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG5cdCc1NTgyNDkwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQstC+INCy0YHRgtGD0L/QuNCy0YjQtdC8INCyINGB0LjQu9GDINCw0LrRgtC1INC+0LEg0YPRgtCy0LXRgNC20LTQtdC90LjQuCDRgNC10LfRg9C70YzRgtCw0YLQvtCyINC+0L/RgNC10LTQtdC70LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDRgdGC0L7QuNC80L7RgdGC0LgnLFxuXHQnNTU4MjUwMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YIsINCy0L7RgdC/0YDQvtC40LfQstC+0LTRj9GJ0LjQuSDRgdCy0LXQtNC10L3QuNGPLCDRgdC+0LTQtdGA0LbQsNGJ0LjQtdGB0Y8g0LIg0YDQtdGI0LXQvdC40Lgg0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0LjQu9C4INC40LfQvNC10L3QtdC90LjQuCDQs9GA0LDQvdC40YYg0LfQvtC9INGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuScsXG5cdCc1NTgyNTEwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0LLQvtGB0L/RgNC+0LjQt9Cy0L7QtNGP0YnQuNC5INGB0LLQtdC00LXQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQuNC10YHRjyDQsiDQv9GA0LDQstC+0LLQvtC8INCw0LrRgtC1LCDQutC+0YLQvtGA0YvQvCDRg9GC0LLQtdGA0LbQtNC10L3RiyDQuNC70Lgg0LjQt9C80LXQvdC10L3RiyDQv9GA0LDQstC40LvQsCDQt9C10LzQu9C10L/QvtC70YzQt9C+0LLQsNC90LjRjyDQuCDQt9Cw0YHRgtGA0L7QudC60LgsINCy0LrQu9GO0YfQsNGPINGB0LLQtdC00LXQvdC40Y8g0L4g0YLQtdGA0YDQuNGC0L7RgNC40LDQu9GM0L3Ri9GFINC30L7QvdCw0YUnLFxuXHQnNTU4MjUyMDAwMDAwJzogJ9Ca0LDRgNGC0LAgKNC/0LvQsNC9KSDQvtCx0YrQtdC60YLQsCDQt9C10LzQu9C10YPRgdGC0YDQvtC50YHRgtCy0LAnLFxuXHQnNTU4MjUzMDAwMDAwJzogJ9CU0LXQutC70LDRgNCw0YbQuNGPINC30LDQuNC90YLQtdGA0LXRgdC+0LLQsNC90L3QvtCz0L4g0LvQuNGG0LAg0L4g0LLRi9Cx0YDQsNC90L3QvtC8INCy0LjQtNC1INGA0LDQt9GA0LXRiNC10L3QvdC+0LPQviDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG5cdCc1NTgyNTQwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLLCDQvtC/0YDQtdC00LXQu9GP0Y7RidC40LUgKNC+0L/RgNC10LTQtdC70Y/QstGI0LjQtSkg0LIg0YHQvtC+0YLQstC10YLRgdGC0LLQuNC4INGBINC30LDQutC+0L3QvtC00LDRgtC10LvRjNGB0YLQstC+0Lwg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC80LXRgdGC0L7Qv9C+0LvQvtC20LXQvdC40LUg0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwICjQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsiknLFxuXHQnNTU4MjU0MDEwMDAwJzogJ9CX0LXQvNC70LXRg9GB0YLRgNC+0LjRgtC10LvRjNC90LDRjyDQtNC+0LrRg9C80LXQvdGC0LDRhtC40Y8nLFxuXHQnNTU4MjU0MDIwMDAwJzogJ9Cb0LXRgdC+0YPRgdGC0YDQvtC40YLQtdC70YzQvdCw0Y8g0LTQvtC60YPQvNC10L3RgtCw0YbQuNGPJyxcblx0JzU1ODI1NDAzMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0Ysg0LPRgNCw0LTQvtGB0YLRgNC+0LjRgtC10LvRjNC90L7Qs9C+INC30L7QvdC40YDQvtCy0LDQvdC40Y8gKNCf0YDQsNCy0LjQu9CwINC30LXQvNC70LXQv9C+0LvRjNC30L7QstCw0L3QuNGPINC4INC30LDRgdGC0YDQvtC50LrQuCknLFxuXHQnNTU4MjU0MDQwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLQsNGG0LjRjyDQv9C+INC/0LvQsNC90LjRgNC+0LLQutC1INGC0LXRgNGA0LjRgtC+0YDQuNC4ICjQv9GA0L7QtdC60YLRiyDQvNC10LbQtdCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LkpLCDQsiDRgi7Rhy4g0LTQvtC60YPQvNC10L3RgiDQv9C+INC/0LvQsNC90LjRgNC+0LLQutC1INGC0LXRgNGA0LjRgtC+0YDQuNC4INCyINC/0LvQsNC90LjRgNGD0LXQvNGL0YUg0LPRgNCw0L3QuNGG0LDRhSDQuNGB0LrRg9GB0YHRgtCy0LXQvdC90L7Qs9C+INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcblx0JzU1ODI1NDA1MDAwMCc6ICfQmtC+0L/QuNGPINC/0YDQvtC10LrRgtCwINC80LXQttC10LLQsNC90LjRjyDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG5cdCc1NTgyNTQwNjAwMDAnOiAn0JDQutGCINC+0YLQstC+0LTQsCDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsiDQsiDQvdCw0YLRg9GA0LUnLFxuXHQnNTU4MjU0MDcwMDAwJzogJ9Cf0YDQvtC10LrRgiDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuXHQnNTU4MjU0MDgwMDAwJzogJ9Cf0YDQvtC10LrRgiAo0LrQvtC/0LjQuCDQvtGC0LTQtdC70YzQvdGL0YUg0YHQvtGB0YLQsNCy0L3Ri9GFINGH0LDRgdGC0LXQuSkg0L7RgNCz0LDQvdC40LfQsNGG0LjQuCDQuCDQt9Cw0YHRgtGA0L7QudC60Lgg0YLQtdGA0YDQuNGC0L7RgNC40Lkg0YHQsNC00L7QstC+0LTRh9C10YHQutC40YUsINC+0LPQvtGA0L7QtNC90LjRh9C10YHQutC40YUg0LjQu9C4INC00LDRh9C90YvRhSDQvdC10LrQvtC80LzQtdGA0YfQtdGB0LrQuNGFINC+0LHRitC10LTQuNC90LXQvdC40Lkg0LPRgNCw0LbQtNCw0L0nLFxuXHQnNTU4MjU0MDkwMDAwJzogJ9Cf0YDQvtC10LrRgiAo0LrQvtC/0LjQuCDQvtGC0LTQtdC70YzQvdGL0YUg0YHQvtGB0YLQsNCy0L3Ri9GFINGH0LDRgdGC0LXQuSkg0L/QtdGA0LXRgNCw0YHQv9GA0LXQtNC10LvQtdC90LjRjyDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3Ri9GFINGD0LPQvtC00LjQuSDQuCDQuNC90YvRhSDQt9C10LzQtdC70Ywg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzU1ODI1NDEwMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQv9GA0LXQtNCy0LDRgNC40YLQtdC70YzQvdC+0Lwg0YHQvtCz0LvQsNGB0L7QstCw0L3QuNC4INC80LXRgdGCINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LInLFxuXHQnNTU4MjU0MTEwMDAwJzogJ9Ca0L7Qv9C40Y8g0YDQtdGI0LXQvdC40Y8g0L7QsdGJ0LXQs9C+INGB0L7QsdGA0LDQvdC40Y8g0YPRh9Cw0YHRgtC90LjQutC+0LIg0LTQvtC70LXQstC+0Lkg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Lgg0L3QsCDQt9C10LzQtdC70YzQvdGL0Lkg0YPRh9Cw0YHRgtC+0Log0LjQtyDQt9C10LzQtdC70Ywg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPINC+0LEg0YPRgtCy0LXRgNC20LTQtdC90LjQuCDQv9GA0L7QtdC60YLQsCDQvNC10LbQtdCy0LDQvdC40Y8g0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuXHQnNTU4MjU0MTIwMDAwJzogJ9Ca0L7Qv9C40Y8g0LTQvtC60YPQvNC10L3RgtCwLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQtdCz0L4g0YHQvtCz0LvQsNGB0L7QstCw0L3QuNC1INC/0YDQvtC10LrRgtCwINC80LXQttC10LLQsNC90LjRjyDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG5cdCc1NTgyNTQxMzAwMDAnOiAn0JLQvtC30YDQsNC20LXQvdC40Y8g0LfQsNC40L3RgtC10YDQtdGB0L7QstCw0L3QvdGL0YUg0LvQuNGGINC/0L4g0L/QvtCy0L7QtNGDINC80LXRgdGC0L7Qv9C+0LvQvtC20LXQvdC40Y8g0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcblx0JzU1ODI1NDE0MDAwMCc6ICfQlNC+0LrRg9C80LXQvdGCLCDRgdCy0LjQtNC10YLQtdC70YzRgdGC0LLRg9GO0YnQuNC5INC+INGB0L3Rj9GC0LjQuCDQstC+0LfRgNCw0LbQtdC90LjQuSDQt9Cw0LjQvdGC0LXRgNC10YHQvtCy0LDQvdC90YvRhSDQu9C40YYg0L/QviDQv9C+0LLQvtC00YMg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjRjyDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAnLFxuXHQnNTU4MjU0MTUwMDAwJzogJ9Ch0YXQtdC80LAg0YDQsNGB0L/QvtC70L7QttC10L3QuNGPINC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyINC90LAg0LrQsNC00LDRgdGC0YDQvtCy0YvRhSDQv9C70LDQvdCw0YUg0LjQu9C4INC60LDQtNCw0YHRgtGA0L7QstGL0YUg0LrQsNGA0YLQsNGFINGB0L7QvtGC0LLQtdGC0YHRgtCy0YPRjtGJ0LjRhSDRgtC10YDRgNC40YLQvtGA0LjQuScsXG5cdCc1NTgyNTQ5OTAwMDAnOiAn0J/RgNC+0YfQuNC1INC00L7QutGD0LzQtdC90YLRiywg0L7Qv9GA0LXQtNC10LvRj9GO0YnQuNC1ICjQvtC/0YDQtdC00LXQu9GP0LLRiNC40LUpINCyINGB0L7QvtGC0LLQtdGC0YHRgtCy0LjQuCDRgSDQt9Cw0LrQvtC90L7QtNCw0YLQtdC70YzRgdGC0LLQvtC8INCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNC1INCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCAo0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LIpJyxcblx0JzU1ODI1NTAwMDAwMCc6ICfQmtCw0YDRgtC+0LPRgNCw0YTQuNGH0LXRgdC60LjQtSDQvNCw0YLQtdGA0LjQsNC70YsnLFxuXHQnNTU4MjU2MDAwMDAwJzogJ9Cc0LDRgtC10YDQuNCw0LvRiyDQutCw0YDRgtC+0LPRgNCw0YTQvi3Qs9C10L7QtNC10LfQuNGH0LXRgdC60L7Qs9C+INGE0L7QvdC00LAnLFxuXHQnNTU4MjU3MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0YPRgdGC0LDQvdCw0LLQu9C40LLQsNGO0YnQuNC1INC/0YDQtdC00LXQu9GM0L3Ri9C1INC80LjQvdC40LzQsNC70YzQvdGL0LUg0Lgg0LzQsNC60YHQuNC80LDQu9GM0L3Ri9C1INGA0LDQt9C80LXRgNGLLCDRgdC+0L7RgtCy0LXRgtGB0YLQstGD0Y7RidC40LUg0LLQuNC00YMg0YDQsNC30YDQtdGI0LXQvdC90L7Qs9C+INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJyxcblx0JzU1ODI1NzAxMDAwMCc6ICfQpNC10LTQtdGA0LDQu9GM0L3Ri9C5INC30LDQutC+0L0nLFxuXHQnNTU4MjU3MDIwMDAwJzogJ9CX0LDQutC+0L0g0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LgnLFxuXHQnNTU4MjU3MDMwMDAwJzogJ9Cd0L7RgNC80LDRgtC40LLQvdGL0Lkg0L/RgNCw0LLQvtCy0L7QuSDQsNC60YIg0L7RgNCz0LDQvdCwINC80LXRgdGC0L3QvtCz0L4g0YHQsNC80L7Rg9C/0YDQsNCy0LvQtdC90LjRjycsXG5cdCc1NTgyNTgwMDAwMDAnOiAn0JTQvtC60YPQvNC10L3Rgiwg0YHQvtC00LXRgNC20LDRidC40Lkg0LjQvdGE0L7RgNC80LDRhtC40Y4g0L4g0YDQsNC90LXQtSDQv9GA0LjRgdCy0L7QtdC90L3Ri9GFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvRhSDRg9GH0LXRgtC90YvRhSDQvdC+0LzQtdGA0LDRhSDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LgnLFxuXHQnNTU4MjU5MDAwMDAwJzogJ9Cf0YDQvtGC0L7QutC+0Lsg0L7QsdGA0LDQt9C+0LLQsNC90LjRjyDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG5cdCc1NTgyNjAwMDAwMDAnOiAn0KfQtdGA0YLQtdC2ICjQsNCx0YDQuNGBKSDQv9C+0LzQtdGJ0LXQvdC40Y8nLFxuXHQnNTU4MjYxMDAwMDAwJzogJ9Cf0YDQvtC10LrRgtC90LDRjyDQtNC+0LrRg9C80LXQvdGC0LDRhtC40Y8g0LfQtNCw0L3QuNGPJyxcblx0JzU1ODI2MjAwMDAwMCc6ICfQn9GA0L7QtdC60YLQvdCw0Y8g0LTQvtC60YPQvNC10L3RgtCw0YbQuNGPINGB0L7QvtGA0YPQttC10L3QuNGPJyxcblx0JzU1ODI2MzAwMDAwMCc6ICfQoNC10YjQtdC90LjQtSDQutC+0LzQuNGB0YHQuNC4INC/0L4g0YDQsNGB0YHQvNC+0YLRgNC10L3QuNGOINGB0L/QvtGA0L7QsiDQviDRgNC10LfRg9C70YzRgtCw0YLQsNGFINC+0L/RgNC10LTQtdC70LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDRgdGC0L7QuNC80L7RgdGC0LgnLFxuXHQnNTU4MjY0MDAwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INGB0YPQtNCwJyxcblx0JzU1ODI5OTAwMDAwMCc6ICfQmNC90L7QuSDQtNC+0LrRg9C80LXQvdGCLCDRgdC+0LTQtdGA0LbQsNGJ0LjQuSDQvtC/0LjRgdCw0L3QuNC1INC+0LHRitC10LrRgtCwJyxcblx0JzU1ODMwMDAwMDAwMCc6ICfQlNCe0JrQo9Cc0JXQndCi0KssINCh0J7QlNCV0KDQltCQ0KnQmNCVINCe0J/QmNCh0JDQndCY0JUg0JfQkNCv0JLQmNCi0JXQm9CvINCY0JvQmCDQldCT0J4g0J/QoNCV0JTQodCi0JDQktCY0KLQldCb0K8nLFxuXHQnNTU4MzAxMDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQtSDQv9C+0LvQvdC+0LzQvtGH0LjRjyDQv9GA0LXQtNGB0YLQsNCy0LjRgtC10LvRjycsXG5cdCc1NTgzMDEwMTAwMDAnOiAn0JTQvtCy0LXRgNC10L3QvdC+0YHRgtGMJyxcblx0JzU1ODMwMTAyMDAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDRgNC+0LbQtNC10L3QuNC4Jyxcblx0JzU1ODMwMTAzMDAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQvtCxINGD0YHRi9C90L7QstC70LXQvdC40LgnLFxuXHQnNTU4MzAxMDQwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INGB0YPQtNCwJyxcblx0JzU1ODMwMTA1MDAwMCc6ICfQntC/0YDQtdC00LXQu9C10L3QuNC1INGB0YPQtNCwJyxcblx0JzU1ODMwMTA2MDAwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INC+0LEg0LjQt9Cx0YDQsNC90LjQuCAo0LXQtNC40L3QvtC70LjRh9C90L7Qs9C+INC40YHQv9C+0LvQvdC40YLQtdC70YzQvdC+0LPQviDQvtGA0LPQsNC90LAg0Y7RgNC40LTQuNGH0LXRgdC60L7Qs9C+INC70LjRhtCwKScsXG5cdCc1NTgzMDEwNzAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQv9GA0L7RgtC+0LrQvtC70LAg0L7QsSDQuNC30LHRgNCw0L3QuNC4ICjQtdC00LjQvdC+0LvQuNGH0L3QvtCz0L4g0LjRgdC/0L7Qu9C90LjRgtC10LvRjNC90L7Qs9C+INC+0YDQs9Cw0L3QsCDRjtGA0LjQtNC40YfQtdGB0LrQvtCz0L4g0LvQuNGG0LApJyxcblx0JzU1ODMwMTA4MDAwMCc6ICfQn9GA0LjQutCw0Lcg0L4g0L3QsNC30L3QsNGH0LXQvdC40LggKNGA0YPQutC+0LLQvtC00LjRgtC10LvRjyDQuNC70Lgg0LjQvdC+0LPQviDRg9C/0L7Qu9C90L7QvNC+0YfQtdC90L3QvtCz0L4g0LvQuNGG0LApJyxcblx0JzU1ODMwMTA5MDAwMCc6ICfQoNC10YjQtdC90LjQtSDQvtGA0LPQsNC90L7QsiDQvtC/0LXQutC4INC4INC/0L7Qv9C10YfQuNGC0LXQu9GM0YHRgtCy0LAnLFxuXHQnNTU4MzAxMTAwMDAwJzogJ9CU0L7Qs9C+0LLQvtGAINC60L7QvNC80LXRgNGH0LXRgdC60L7Qs9C+INC/0YDQtdC00YHRgtCw0LLQuNGC0LXQu9GM0YHRgtCy0LAnLFxuXHQnNTU4MzAxMTEwMDAwJzogJ9CU0L7Qs9C+0LLQvtGAINC00L7QstC10YDQuNGC0LXQu9GM0L3QvtCz0L4g0YPQv9GA0LDQstC70LXQvdC40Y8nLFxuXHQnNTU4MzAxMTIwMDAwJzogJ9Cf0L7RgdGC0LDQvdC+0LLQu9C10L3QuNC1INGB0YPQtNC10LHQvdC+0LPQviDQv9GA0LjRgdGC0LDQstCwLdC40YHQv9C+0LvQvdC40YLQtdC70Y8nLFxuXHQnNTU4MzAxMTMwMDAwJzogJ9Cf0YDQvtGC0L7QutC+0Lsg0L7QsdGJ0LXQs9C+INGB0L7QsdGA0LDQvdC40Y8nLFxuXHQnNTU4MzAxMTQwMDAwJzogJ9CQ0LrRgiDQvtGA0LPQsNC90LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCy0LvQsNGB0YLQuCDQuNC70Lgg0L7RgNCz0LDQvdCwINC80LXRgdGC0L3QvtCz0L4g0YHQsNC80L7Rg9C/0YDQsNCy0LvQtdC90LjRjywg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQuSDQv9C+0LvQvdC+0LzQvtGH0LjRjyDQv9GA0LXQtNGB0YLQsNCy0LjRgtC10LvRjyDQt9Cw0Y/QstC40YLQtdC70Y8nLFxuXHQnNTU4MzAxOTkwMDAwJzogJ9CY0L3QvtC5INC00L7QutGD0LzQtdC90YInLFxuXHQnNTU4NDAwMDAwMDAwJzogJ9CU0J7QmtCj0JzQldCd0KLQqyDQniDQn9Cg0JDQktCQ0KUsINCh0JTQldCb0JrQkNClLCDQntCT0KDQkNCd0JjQp9CV0J3QmNCv0KUgKNCe0JHQoNCV0JzQldCd0JXQndCY0K/QpSknLFxuXHQnNTU4NDAxMDAwMDAwJzogJ9Cf0YDQsNCy0L7Rg9GB0YLQsNC90LDQstC70LjQstCw0Y7RidC40LUg0Lgg0L/RgNCw0LLQvtGD0LTQvtGB0YLQvtCy0LXRgNGP0Y7RidC40LUg0LTQvtC60YPQvNC10L3RgtGLJyxcblx0JzU1ODQwMTAxMDAwMCc6ICfQlNC+0LPQvtCy0L7RgNGLIC8g0YHQvtCz0LvQsNGI0LXQvdC40Y8nLFxuXHQnNTU4NDAxMDEwMTAwJzogJ9Ch0LTQtdC70LrQuCDQvtCxINC+0YLRh9GD0LbQtNC10L3QuNC4Jyxcblx0JzU1ODQwMTAxMDEwMSc6ICfQlNC+0LPQvtCy0L7RgCDQutGD0L/Qu9C4LdC/0YDQvtC00LDQttC4Jyxcblx0JzU1ODQwMTAxMDEwMic6ICfQlNC+0LPQvtCy0L7RgCDQvNC10L3RiycsXG5cdCc1NTg0MDEwMTAxMDMnOiAn0JTQvtCz0L7QstC+0YAg0LTQsNGA0LXQvdC40Y8nLFxuXHQnNTU4NDAxMDEwMTA0JzogJ9CU0L7Qs9C+0LLQvtGAINGA0LXQvdGC0YsnLFxuXHQnNTU4NDAxMDEwMTA1JzogJ9CU0L7Qs9C+0LLQvtGAINC/0L7QttC40LfQvdC10L3QvdC+0LPQviDRgdC+0LTQtdGA0LbQsNC90LjRjyDRgSDQuNC20LTQuNCy0LXQvdC40LXQvCcsXG5cdCc1NTg0MDEwMTAxMDYnOiAn0JTQvtCz0L7QstC+0YAg0L/RgNC40LLQsNGC0LjQt9Cw0YbQuNC4ICjQtNC+0LPQvtCy0L7RgCDQv9C10YDQtdC00LDRh9C4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQsiDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLRjCknLFxuXHQnNTU4NDAxMDEwMjAwJzogJ9CU0YDRg9Cz0LjQtSDRgdC00LXQu9C60LgnLFxuXHQnNTU4NDAxMDEwMjAxJzogJ9CU0L7Qs9C+0LLQvtGAINGD0YfQsNGB0YLQuNGPINCyINC00L7Qu9C10LLQvtC8INGB0YLRgNC+0LjRgtC10LvRjNGB0YLQstC1Jyxcblx0JzU1ODQwMTAxMDIwMic6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINC+0L/RgNC10LTQtdC70LXQvdC40LggKNC/0LXRgNC10YDQsNGB0L/RgNC10LTQtdC70LXQvdC40LgpINC00L7Qu9C10Lkg0LIg0L/RgNCw0LLQtSDQvtCx0YnQtdC5INC00L7Qu9C10LLQvtC5INGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4Jyxcblx0JzU1ODQwMTAxMDIwMyc6ICfQkdGA0LDRh9C90YvQuSDQtNC+0LPQvtCy0L7RgCcsXG5cdCc1NTg0MDEwMTAyMDQnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDQvtGC0YHRgtGD0L/QvdC+0LwnLFxuXHQnNTU4NDAxMDEwMjA1JzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+INGA0LDQt9C00LXQu9C1INC40LzRg9GJ0LXRgdGC0LLQsCcsXG5cdCc1NTg0MDEwMTAyMDYnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L4g0LLRi9C00LXQu9C1INC00L7Qu9C4Jyxcblx0JzU1ODQwMTAxMDIwNyc6ICfQmNC90LLQtdGB0YLQuNGG0LjQvtC90L3Ri9C5INC00L7Qs9C+0LLQvtGAICjQtNC+0LPQvtCy0L7RgCDQvtCxINC40L3QstC10YHRgtC40YDQvtCy0LDQvdC40LgpJyxcblx0JzU1ODQwMTAxMDIwOCc6ICfQnNC40YDQvtCy0L7QtSDRgdC+0LPQu9Cw0YjQtdC90LjQtScsXG5cdCc1NTg0MDEwMTAyMDknOiAn0JTQvtCz0L7QstC+0YAg0LDRgNC10L3QtNGLICjRgdGD0LHQsNGA0LXQvdC00YspJyxcblx0JzU1ODQwMTAxMDIxMCc6ICfQlNC+0LPQvtCy0L7RgCDQvtCxINC40L/QvtGC0LXQutC1Jyxcblx0JzU1ODQwMTAxMDIxMSc6ICfQlNC+0LPQvtCy0L7RgCDQsdC10LfQstC+0LfQvNC10LfQtNC90L7Qs9C+INGB0YDQvtGH0L3QvtCz0L4g0L/QvtC70YzQt9C+0LLQsNC90LjRjyDQt9C10LzQtdC70YzQvdGL0Lwg0YPRh9Cw0YHRgtC60L7QvCcsXG5cdCc1NTg0MDEwMTAyMTInOiAn0JrRgNC10LTQuNGC0L3Ri9C5INC00L7Qs9C+0LLQvtGAJyxcblx0JzU1ODQwMTAxMDIxMyc6ICfQlNC+0LPQvtCy0L7RgCDQt9Cw0LnQvNCwJyxcblx0JzU1ODQwMTAxMDIxNCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINGD0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDRgdC10YDQstC40YLRg9GC0LAnLFxuXHQnNTU4NDAxMDEwMjE1JzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+0LEg0LjQt9C80LXQvdC10L3QuNC4INGB0L7QtNC10YDQttCw0L3QuNGPINC30LDQutC70LDQtNC90L7QuScsXG5cdCc1NTg0MDEwMTAyMTYnOiAn0JTQvtC/0L7Qu9C90LjRgtC10LvRjNC90L7QtSDRgdC+0LPQu9Cw0YjQtdC90LjQtSAo0YHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDQuNC30LzQtdC90LXQvdC40Lgg0YPRgdC70L7QstC40Lkg0LTQvtCz0L7QstC+0YDQsCkg0Log0LTQvtCz0L7QstC+0YDRgycsXG5cdCc1NTg0MDEwMTAyMTcnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L4g0YDQsNGB0YLQvtGA0LbQtdC90LjQuCDQtNC+0LPQvtCy0L7RgNCwJyxcblx0JzU1ODQwMTAxMDIxOCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINGD0YHRgtGD0L/QutC1INC/0YDQsNCyINGC0YDQtdCx0L7QstCw0L3QuNGPINC/0L4g0LTQvtCz0L7QstC+0YDRgyAo0LTQvtCz0L7QstC+0YAg0L4g0L/QtdGA0LXQtNCw0YfQtSDQv9GA0LDQsiDQuCDQvtCx0Y/Qt9Cw0L3QvdC+0YHRgtC10LkpJyxcblx0JzU1ODQwMTAxMDIxOSc6ICfQlNC+0LPQvtCy0L7RgCDQv9GA0L7RgdGC0L7Qs9C+INGC0L7QstCw0YDQuNGJ0LXRgdGC0LLQsCAo0LTQvtCz0L7QstC+0YAg0L4g0YHQvtCy0LzQtdGB0YLQvdC+0Lkg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4KScsXG5cdCc1NTg0MDEwMTAyMjAnOiAn0JPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INC60L7QvdGC0YDQsNC60YInLFxuXHQnNTU4NDAxMDEwMjk5JzogJ9CY0L3QsNGPINGB0LTQtdC70LrQsCcsXG5cdCc1NTg0MDEwMjAwMDAnOiAn0JDQutGC0Ysg0L7RgNCz0LDQvdC+0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCy0LvQsNGB0YLQuCDQuNC70Lgg0L7RgNCz0LDQvdC+0LIg0LzQtdGB0YLQvdC+0LPQviDRgdCw0LzQvtGD0L/RgNCw0LLQu9C10L3QuNGPJyxcblx0JzU1ODQwMTAyMDEwMCc6ICfQpNC10LTQtdGA0LDQu9GM0L3Ri9C5INC30LDQutC+0L0nLFxuXHQnNTU4NDAxMDIwMjAwJzogJ9Cj0LrQsNC3INCf0YDQtdC30LjQtNC10L3RgtCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCc1NTg0MDEwMjAzMDAnOiAn0J/QvtGB0YLQsNC90L7QstC70LXQvdC40LUg0J/RgNCw0LLQuNGC0LXQu9GM0YHRgtCy0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4Jyxcblx0JzU1ODQwMTAyMDQwMCc6ICfQl9Cw0LrQvtC9ICjQt9Cw0LrQvtC90Ysg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4LCDRgdGD0LHRitC10LrRgtCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCknLFxuXHQnNTU4NDAxMDIwNTAwJzogJ9CU0L7QutGD0LzQtdC90YIg0L4g0L/RgNC10LTQvtGB0YLQsNCy0LvQtdC90LjQuCDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG5cdCc1NTg0MDEwMjA2MDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtCx0YDQsNC30L7QstCw0L3QuNC4INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcblx0JzU1ODQwMTAyMDcwMCc6ICfQkNC60YIg0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0YHQtdGA0LLQuNGC0YPRgtCwJyxcblx0JzU1ODQwMTAyMDgwMCc6ICfQkNC60YIg0L7QsSDRg9GB0YLQsNC90L7QstC70LXQvdC40Lgg0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjyknLFxuXHQnNTU4NDAxMDI5OTAwJzogJ9CY0L3Ri9C1INCw0LrRgtGLINC+0YDQs9Cw0L3QvtCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDQstC70LDRgdGC0Lgg0LjQu9C4INC+0YDQs9Cw0L3QvtCyINC80LXRgdGC0L3QvtCz0L4g0YHQsNC80L7Rg9C/0YDQsNCy0LvQtdC90LjRjycsXG5cdCc1NTg0MDEwMzAwMDAnOiAn0KHQstC40LTQtdGC0LXQu9GM0YHRgtCy0L4g0L4g0L/RgNCw0LLQtSDQvdCwINC90LDRgdC70LXQtNGB0YLQstC+Jyxcblx0JzU1ODQwMTAzMDEwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQv9GA0LDQstC1INC90LAg0L3QsNGB0LvQtdC00YHRgtCy0L4g0L/QviDQt9Cw0LrQvtC90YMnLFxuXHQnNTU4NDAxMDMwMjAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INC/0YDQsNCy0LUg0L3QsCDQvdCw0YHQu9C10LTRgdGC0LLQviDQv9C+INC30LDQstC10YnQsNC90LjRjicsXG5cdCc1NTg0MDEwNDAwMDAnOiAn0JLRgdGC0YPQv9C40LLRiNC40LUg0LIg0YHQuNC70YMg0YHRg9C00LXQsdC90YvQtSDQsNC60YLRiycsXG5cdCc1NTg0MDEwNDAxMDAnOiAn0KHRg9C00LXQsdC90YvQuSDQsNC60YIsINGD0YHRgtCw0L3QsNCy0LvQuNCy0LDRjtGJ0LjQuSDQt9Cw0L/RgNC10YIg0L3QsCDRgdC+0LLQtdGA0YjQtdC90LjQtSDQtNC10LnRgdGC0LLQuNC5INCyINGB0YTQtdGA0LUg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INGD0YfQtdGC0LAg0LIg0L7RgtC90L7RiNC10L3QuNC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTg0MDEwNDAyMDAnOiAn0KHRg9C00LXQsdC90YvQuSDQsNC60YIg0L4g0LLQvtGB0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQsNC90L3Rg9C70LjRgNC+0LLQsNC90L3Ri9GFINC4INC40YHQutC70Y7Rh9C10L3QvdGL0YUg0LjQtyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDRgdCy0LXQtNC10L3QuNC5INC+0LEg0L7QsdGK0LXQutGC0LUg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODQwMTA0MDMwMCc6ICfQodGD0LTQtdCx0L3Ri9C5INCw0LrRgiDQvtCxINGD0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQvtCx0YDQtdC80LXQvdC10L3QuNGPICjQvtCz0YDQsNC90LjRh9C10L3QuNC4KSDQsiDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjQuCDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7RgdGC0LggICjRh9Cw0YHRgtC4INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCknLFxuXHQnNTU4NDAxMDQ5OTAwJzogJ9CY0L3Ri9C1INC/0YDQtdC00YPRgdC80L7RgtGA0LXQvdC90YvQtSDQt9Cw0LrQvtC90L7QtNCw0YLQtdC70YzRgdGC0LLQvtC8INGB0YPQtNC10LHQvdGL0LUg0LDQutGC0YsnLFxuXHQnNTU4NDAxMDUwMDAwJzogJ9CQ0LrRgtGLICjRgdCy0LjQtNC10YLQtdC70YzRgdGC0LLQsCkg0L4g0L/RgNCw0LLQsNGFINC90LAg0L7QsdGK0LXQutGC0Ysg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODQwMTA1MDEwMCc6ICfQoNC10LPQuNGB0YLRgNCw0YbQuNC+0L3QvdC+0LUg0YPQtNC+0YHRgtC+0LLQtdGA0LXQvdC40LUnLFxuXHQnNTU4NDAxMDUwMjAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INC/0YDQsNCy0LUg0L3QsCDQt9C10LzQu9GOJyxcblx0JzU1ODQwMTA1MDMwMCc6ICfQk9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdGL0Lkg0LDQutGCINC+INC/0YDQsNCy0LUg0L3QsCDQt9C10LzQu9GOJyxcblx0JzU1ODQwMTA1MDQwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQv9GA0LDQstC1INGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4Jyxcblx0JzU1ODQwMTA1OTkwMCc6ICfQmNC90YvQtSDQsNC60YLRiywg0YHQstC40LTQtdGC0LXQu9GM0YHRgtCy0LAg0L4g0L/RgNCw0LLQsNGFINC90LAg0L7QsdGK0LXQutGC0Ysg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODQwMTA2MDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0Ysg0L3QsCDQstC90L7QstGMINCy0L7Qt9Cy0LXQtNC10L3QvdGL0LkgKNGA0LXQutC+0L3RgdGC0YDRg9C40YDQvtCy0LDQvdC90YvQuSkg0L7QsdGK0LXQutGCJyxcblx0JzU1ODQwMTA2MDEwMCc6ICfQoNCw0LfRgNC10YjQtdC90LjQtSDQvdCwINCy0LLQvtC0INC+0LHRitC10LrRgtCwINCyINGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjRjicsXG5cdCc1NTg0MDEwNjAyMDAnOiAn0KDQsNC30YDQtdGI0LXQvdC40LUg0L3QsCDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQvicsXG5cdCc1NTg0MDEwNjAzMDAnOiAn0JDQutGCINCy0LLQvtC00LAg0LIg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNGOJyxcblx0JzU1ODQwMTA2MDQwMCc6ICfQmtC+0L/QuNGPINGA0LXRiNC10L3QuNGPINC+INGB0L7Qt9C00LDQvdC40Lgg0LjRgdC60YPRgdGB0YLQstC10L3QvdC+0LPQviDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCcsXG5cdCc1NTg0MDEwNzAwMDAnOiAn0JTQvtC60YPQvNC10L3RgtGLINC/0YDQuCDRg9C/0YDQvtGJ0LXQvdC90L7QvCDQv9C+0YDRj9C00LrQtSDQvtGE0L7RgNC80LvQtdC90LjRjyDQv9GA0LDQsiDQs9GA0LDQttC00LDQvSDQvdCwINC+0YLQtNC10LvRjNC90YvQtSDQvtCx0YrQtdC60YLRiyDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG5cdCc1NTg0MDEwNzAxMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQv9C+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0Lkg0LrQvdC40LPQuCDQviDQvdCw0LvQuNGH0LjQuCDRgyDQs9GA0LDQttC00LDQvdC40L3QsCDQv9GA0LDQstCwINC90LAg0LfQtdC80LXQu9GM0L3Ri9C5INGD0YfQsNGB0YLQvtC6Jyxcblx0JzU1ODQwMTA3MDIwMCc6ICfQmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC/0LDRgdC/0L7RgNGCINC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCcsXG5cdCc1NTg0MDEwNzAzMDAnOiAn0JTQtdC60LvQsNGA0LDRhtC40Y8g0L7QsSDQvtCx0YrQtdC60YLQtSDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG5cdCc1NTg0MDEwODAwMDAnOiAn0J/RgNC+0YfQuNC1INC/0YDQsNCy0L7Rg9GB0YLQsNC90LDQstC70LjQstCw0Y7RidC40LUg0LTQvtC60YPQvNC10L3RgtGLJyxcblx0JzU1ODQwMTA4MDEwMCc6ICfQn9C10YDQtdC00LDRgtC+0YfQvdGL0Lkg0LDQutGCJyxcblx0JzU1ODQwMTA4MDIwMCc6ICfQoNCw0LfQtNC10LvQuNGC0LXQu9GM0L3Ri9C5INCx0LDQu9Cw0L3RgScsXG5cdCc1NTg0MDEwODAzMDAnOiAn0J/Qu9Cw0L0g0L/RgNC40LLQsNGC0LjQt9Cw0YbQuNC4Jyxcblx0JzU1ODQwMTA4MDQwMCc6ICfQn9GA0LDQstC40LvQsCDQtNC+0LLQtdGA0LjRgtC10LvRjNC90L7Qs9C+INGD0L/RgNCw0LLQu9C10L3QuNGPJyxcblx0JzU1ODQwMTA4MDUwMCc6ICfQkNC60YIg0L7Qv9C40YHQuCDQuCDQsNGA0LXRgdGC0LAg0LjQvNGD0YnQtdGB0YLQstCwJyxcblx0JzU1ODQwMTA4MDYwMCc6ICfQn9GA0L7RgtC+0LrQvtC7INC+INCy0YvQtNC10LvQtSDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDQsiDRgdGH0LXRgiDQt9C10LzQtdC70YzQvdC+0Lkg0LTQvtC70LgnLFxuXHQnNTU4NDAxMDgwNzAwJzogJ9Cf0YDQvtGC0L7QutC+0Lsg0L7QsdGJ0LXQs9C+INGB0L7QsdGA0LDQvdC40Y8g0YHQvtCx0YHRgtCy0LXQvdC90LjQutC+0LIg0L/QvtC80LXRidC10L3QuNC5INCyINC80L3QvtCz0L7QutCy0LDRgNGC0LjRgNC90L7QvCDQtNC+0LzQtScsXG5cdCc1NTg0MDEwODA4MDAnOiAn0J7RgtC60LDQtyDQvtC00LDRgNGP0LXQvNC+0LPQviDQv9GA0LjQvdGP0YLRjCDQtNCw0YAgKNC+0YLQutCw0Lcg0L7RgiDQtNCw0YDQsCknLFxuXHQnNTU4NDAxMDgwOTAwJzogJ9Ch0L7Qs9C70LDRiNC10L3QuNC1INC+INC90L7QstCw0YbQuNC4Jyxcblx0JzU1ODQwMTA4MTAwMCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQviDRgNCw0LfQtNC10LvQtSDQvdCw0YHQu9C10LTRgdGC0LLQtdC90L3QvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcblx0JzU1ODQwMTA4MTEwMCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINGD0L/Qu9Cw0YLQtSDQsNC70LjQvNC10L3RgtC+0LInLFxuXHQnNTU4NDAxMDgxMjAwJzogJ9CU0L7QutGD0LzQtdC90YIsINC/0L7QtNGC0LLQtdGA0LbQtNCw0Y7RidC40Lkg0L3QsNC70LjRh9C40LUsINCy0L7Qt9C90LjQutC90L7QstC10L3QuNC1LCDQv9C10YDQtdGF0L7QtCDQvtCz0YDQsNC90LjRh9C10L3QuNGPICjQvtCx0YDQtdC80LXQvdC10L3QuNGPKSDQstC10YnQvdC+0LPQviDQv9GA0LDQstCwINC90LAg0L7QsdGK0LXQutGCINC90LXQtNCy0LjQttC40LzQvtGB0YLQuCDQsiDQv9C+0LvRjNC30YMg0LfQsNGP0LLQuNGC0LXQu9GPJyxcblx0JzU1ODQwMTA4OTkwMCc6ICfQmNC90L7QuSDQtNC+0LrRg9C80LXQvdGCJyxcblx0JzU1ODQwMjAwMDAwMCc6ICfQodCe0J/Qo9Ci0KHQotCS0KPQrtCp0JjQlSDQmCDQlNCe0J/QntCb0J3QmNCi0JXQm9Cs0J3Qq9CVINCU0J7QmtCj0JzQldCd0KLQqycsXG5cdCc1NTg0MDIwMTAwMDAnOiAn0KHQvtCz0LvQsNGB0LjQtSDRgdGD0L/RgNGD0LPQsCDQvdCwINGB0L7QstC10YDRiNC10L3QuNC1INGB0LTQtdC70LrQuCcsXG5cdCc1NTg0MDIwMjAwMDAnOiAn0KHQvtCz0LvQsNGB0LjQtSDQvtGA0LPQsNC90L7QsiDQvtC/0LXQutC4INC4INC/0L7Qv9C10YfQuNGC0LXQu9GM0YHRgtCy0LAnLFxuXHQnNTU4NDAyMDMwMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INC30LDQutC70Y7Rh9C10L3QuNC4INCx0YDQsNC60LAnLFxuXHQnNTU4NDAyMDQwMDAwJzogJ9Ch0LLQuNC00LXRgtC10LvRjNGB0YLQstC+INC+INGA0LDRgdGC0L7RgNC20LXQvdC40Lgg0LHRgNCw0LrQsCcsXG5cdCc1NTg0MDIwNTAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtC00L7QsdGA0LXQvdC40LggKNC+INGB0L7QstC10YDRiNC10L3QuNC4KSDRgdC00LXQu9C60LgnLFxuXHQnNTU4NDAyMDYwMDAwJzogJ9Ch0L/RgNCw0LLQutCwINC+INGB0YLQvtC40LzQvtGB0YLQuCAo0YHQv9GA0LDQstC60LAg0L4g0YHQvtC+0YLQvdC+0YjQtdC90LjQuCDRgdGC0L7QuNC80L7RgdGC0Lgg0L7RgtGH0YPQttC00LDQtdC80L7Qs9C+INC+0LHRitC10LrRgtCwINC4INCx0LDQu9Cw0L3RgdC+0LLQvtC5INGB0YLQvtC40LzQvtGB0YLQuCDQuNC80YPRidC10YHRgtCy0LAg0LjQu9C4INCw0LrRgtC40LLQvtCyINGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0L7QsdGJ0LXRgdGC0LLQsCknLFxuXHQnNTU4NDAyMDcwMDAwJzogJ9Ch0L/RgNCw0LLQutCwINC+INC30LDQuNC90YLQtdGA0LXRgdC+0LLQsNC90L3Ri9GFINC70LjRhtCw0YUg0LIg0YHQtNC10LvQutC1Jyxcblx0JzU1ODQwMjA4MDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INC00L7QvNC+0LLQvtC5INC60L3QuNCz0LggKNGB0LLQtdC00LXQvdC40Y8g0L4g0LvQuNGG0LDRhSwg0YHQvtGF0YDQsNC90Y/RjtGJ0LjRhSDQv9GA0LDQstC+INC/0YDQvtC20LjQstCw0L3QuNGPINCyINC20LjQu9C+0Lwg0L/QvtC80LXRidC10L3QuNC4INC/0L7RgdC70LUg0L/QtdGA0LXRhdC+0LTQsCDQv9GA0LDQstCwINC90LAg0L3QtdCz0L4pJyxcblx0JzU1ODQwMjA5MDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQuNC3INC70LjRhtC10LLQvtCz0L4g0YHRh9C10YLQsCAo0YHQstC10LTQtdC90LjRjyDQviDQu9C40YbQsNGFLCDRgdC+0YXRgNCw0L3Rj9GO0YnQuNGFINC/0YDQsNCy0L4g0L/RgNC+0LbQuNCy0LDQvdC40Y8g0LIg0LbQuNC70L7QvCDQv9C+0LzQtdGJ0LXQvdC40Lgg0L/QvtGB0LvQtSDQv9C10YDQtdGF0L7QtNCwINC/0YDQsNCy0LAg0L3QsCDQvdC10LPQviknLFxuXHQnNTU4NDAyMTAwMDAwJzogJ9Cf0YDQvtGC0L7QutC+0Lsg0L4g0YDQtdC30YPQu9GM0YLQsNGC0LDRhSDRgtC+0YDQs9C+0LInLFxuXHQnNTU4NDAyMTEwMDAwJzogJ9Cb0LjRhtC10L3Qt9C40Y8gKNC70LjRhtC10L3Qt9C40Y8g0L3QsCDQvtGB0YPRidC10YHRgtCy0LvQtdC90LjQtSDQvtC/0YDQtdC00LXQu9C10L3QvdGL0YUg0LLQuNC00L7QsiDQtNC10Y/RgtC10LvRjNC90L7RgdGC0LgpJyxcblx0JzU1ODQwMjEyMDAwMCc6ICfQn9GA0L7QtdC60YLQvdCw0Y8g0LTQtdC60LvQsNGA0LDRhtC40Y8nLFxuXHQnNTU4NDAyMTMwMDAwJzogJ9Ce0YLQutCw0Lcg0L7RgiDQv9GA0LXQuNC80YPRidC10YHRgtCy0LXQvdC90L7Qs9C+INC/0YDQsNCy0LAg0L/QvtC60YPQv9C60LggKNC00LvRjyDRg9GH0LDRgdGC0L3QuNC60L7QsiDQtNC+0LvQtdCy0L7QuSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCwg0LTQu9GPINGB0YPQsdGK0LXQutGC0LAg0KDQvtGB0YHQuNC50YHQutC+0Lkg0KTQtdC00LXRgNCw0YbQuNC4INC/0YDQuCDQv9GA0L7QtNCw0LbQtSDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDQuNC3INGB0L7RgdGC0LDQstCwINC30LXQvNC10LvRjCDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8pJyxcblx0JzU1ODQwMjE0MDAwMCc6ICfQoNC10YjQtdC90LjQtSDQviDRgdC+0LfQtNCw0L3QuNC4INGO0YDQuNC00LjRh9C10YHQutC+0LPQviDQu9C40YbQsCcsXG5cdCc1NTg0MDIxNTAwMDAnOiAn0KDQtdGI0LXQvdC40LUg0L4g0YDQtdC+0YDQs9Cw0L3QuNC30LDRhtC40Lgg0Y7RgNC40LTQuNGH0LXRgdC60L7Qs9C+INC70LjRhtCwJyxcblx0JzU1ODQwMjE2MDAwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQu9C40LrQstC40LTQsNGG0LjQuCDRjtGA0LjQtNC40YfQtdGB0LrQvtCz0L4g0LvQuNGG0LAnLFxuXHQnNTU4NDAyMTcwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0YPRgtCy0LXRgNC20LTQtdC90LjQuCDQvtGG0LXQvdC60Lgg0LjQvNGD0YnQtdGB0YLQstCwICjRgNC10YjQtdC90LjQtSDQvtCxINGD0YLQstC10YDQttC00LXQvdC40Lgg0L7RhtC10L3QutC4INC90LXQtNC10L3QtdC20L3Ri9GFINCy0LrQu9Cw0LTQvtCyINCyINGD0YHRgtCw0LLQvdGL0Lkg0LrQsNC/0LjRgtCw0Lsg0L7QsdGJ0LXRgdGC0LLQsCknLFxuXHQnNTU4NDAyMTgwMDAwJzogJ9CY0YHQv9C+0LvQvdC40YLQtdC70YzQvdGL0Lkg0LvQuNGB0YInLFxuXHQnNTU4NDAyMTkwMDAwJzogJ9CU0L7Qs9C+0LLQvtGAINC/0L7RgNGD0YfQtdC90LjRjycsXG5cdCc1NTg0MDIyMDAwMDAnOiAn0JHRg9GF0LPQsNC70YLQtdGA0YHQutC40Lkg0LHQsNC70LDQvdGBJyxcblx0JzU1ODQwMjIxMDAwMCc6ICfQl9Cw0LrQu9Cw0LTQvdCw0Y8nLFxuXHQnNTU4NDAyMjIwMDAwJzogJ9CU0L7QsdCw0LLQvtGH0L3Ri9C5INC70LjRgdGCINC6INC30LDQutC70LDQtNC90L7QuScsXG5cdCc1NTg0MDIyMzAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDRgNC10LXRgdGC0YDQsCDQvNGD0L3QuNGG0LjQv9Cw0LvRjNC90L7QuSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCcsXG5cdCc1NTg0MDIyNDAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDRgNC10LXRgdGC0YDQsCDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDRgdGD0LHRitC10LrRgtCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCc1NTg0MDIyNTAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDRgNC10LXRgdGC0YDQsCDRhNC10LTQtdGA0LDQu9GM0L3QvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcblx0JzU1ODQwMjI2MDAwMCc6ICfQltC40LvQuNGJ0L3Ri9C5INGB0LXRgNGC0LjRhNC40LrQsNGCJyxcblx0JzU1ODQwMjI3MDAwMCc6ICfQkNGD0LTQuNGC0L7RgNGB0LrQvtC1INC30LDQutC70Y7Rh9C10L3QuNC1Jyxcblx0JzU1ODQwMjI4MDAwMCc6ICfQntGC0YfQtdGCINC+INC/0YDQvtCy0LXQtNC10L3QuNC4INC90LXQt9Cw0LLQuNGB0LjQvNC+0Lkg0L7RhtC10L3QutC4ICjQsNC60YIg0L7RhtC10L3QutC4KScsXG5cdCc1NTg0MDIzOTAwMDAnOiAn0JDQutGCINC40L3QstC10L3RgtCw0YDQuNC30LDRhtC40LgnLFxuXHQnNTU4NDAyNDAwMDAwJzogJ9Ce0YXRgNCw0L3QvdC+0LUg0L7QsdGP0LfQsNGC0LXQu9GM0YHRgtCy0L4g0YHQvtCx0YHRgtCy0LXQvdC90LjQutCwINC+0LHRitC10LrRgtCwINC60YPQu9GM0YLRg9GA0L3QvtCz0L4g0L3QsNGB0LvQtdC00LjRjycsXG5cdCc1NTg0MDI5OTAwMDAnOiAn0JjQvdC+0Lkg0LTQvtC60YPQvNC10L3RgicsXG5cdCc1NTg0MDMwMDAwMDAnOiAn0JTQntCa0KPQnNCV0J3QotCrLCDQodCe0JTQldCg0JbQkNCp0JjQlSDQodCS0JXQlNCV0J3QmNCvINCV0JPQoNCfJyxcblx0JzU1ODQwMzAxMDAwMCc6ICfQodCy0LjQtNC10YLQtdC70YzRgdGC0LLQviDQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQstCwJyxcblx0JzU1ODQwMzAyMDAwMCc6ICfQktGL0L/QuNGB0LrQsCDQviDQv9GA0LDQstCw0YUg0L3QsCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuXHQnNTU4NDAzMDMwMDAwJzogJ9CS0YvQv9C40YHQutCwINC+INC/0LXRgNC10YXQvtC00LUg0L/RgNCw0LIg0L3QsCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0LPQviDQuNC80YPRidC10YHRgtCy0LAnLFxuXHQnNTU4NDAzMDQwMDAwJzogJ9CS0YvQv9C40YHQutCwINC+INC/0YDQsNCy0LDRhSDQvtGC0LTQtdC70YzQvdC+0LPQviDQu9C40YbQsCDQvdCwINC40LzQtdGO0YnQuNC10YHRjyDRgyDQvdC10LPQviDQvtCx0YrQtdC60YLRiyDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG5cdCc1NTg0MDMwNTAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0L4g0L/RgNC40LfQvdCw0L3QuNC4INC/0YDQsNCy0L7QvtCx0LvQsNC00LDRgtC10LvRjyDQvdC10LTQtdC10YHQv9C+0YHQvtCx0L3Ri9C8INC40LvQuCDQvtCz0YDQsNC90LjRh9C10L3QvdC+INC00LXQtdGB0L/QvtGB0L7QsdC90YvQvCcsXG5cdCc1NTg0MDMwNjAwMDAnOiAn0KHQv9GA0LDQstC60LAg0L4g0YHQvtC00LXRgNC20LDQvdC40Lgg0L/RgNCw0LLQvtGD0YHRgtCw0L3QsNCy0LvQuNCy0LDRjtGJ0LjRhSDQtNC+0LrRg9C80LXQvdGC0L7QsiDQvdCwINC+0LHRitC10LrRgiDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG5cdCc1NTg0MDMwNzAwMDAnOiAn0KHQv9GA0LDQstC60LAg0L4g0LvQuNGG0LDRhSwg0L/QvtC70YPRh9C40LLRiNC40YUg0YHQstC10LTQtdC90LjRjyDQvtCxINC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcblx0JzU1ODQwMzA4MDAwMCc6ICfQmtC+0L/QuNC4INC00L7Qs9C+0LLQvtGA0L7QsiDQuCDQuNC90YvRhSDQtNC+0LrRg9C80LXQvdGC0L7Qsiwg0LLRi9GA0LDQttCw0Y7RidC40YUg0YHQvtC00LXRgNC20LDQvdC40LUg0L7QtNC90L7RgdGC0L7RgNC+0L3QvdC40YUg0YHQtNC10LvQvtC6LCDRgdC+0LLQtdGA0YjQtdC90L3Ri9GFINCyINC/0YDQvtGB0YLQvtC5INC/0LjRgdGM0LzQtdC90L3QvtC5INGE0L7RgNC80LUnLFxuXHQnNTU4NDAzMDkwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0JXQk9Cg0J8g0L4g0L/RgNC40L3Rj9GC0LjQuCDQvdCwINGD0YfRkdGCINCx0LXRgdGF0L7Qt9GP0LnQvdC+0LPQviDQvtCx0YrQtdC60YLQsCDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCcsXG5cdCc1NTg0MDMxMDAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQldCT0KDQnyDQviDQv9GA0LjQvdGP0YLQuNC4INC90LAg0YPRh9GR0YIg0LHQtdGB0YXQvtC30Y/QudC90L7Qs9C+INC+0LHRitC10LrRgtCwINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwLCDQvtGCINC/0YDQsNCy0LAg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Lgg0L3QsCDQutC+0YLQvtGA0YvQuSDRgdC+0LHRgdGC0LLQtdC90L3QuNC6INC+0YLQutCw0LfQsNC70YHRjycsXG5cdCc1NTg0MDMxMTAwMDAnOiAn0JLRi9C/0LjRgdC60LAg0LjQtyDQldCT0KDQnyDQviDQsdC10YHRhdC+0LfRj9C50L3QvtC8INC+0LHRitC10LrRgtC1INC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwLCDQv9GA0LjQvdGP0YLQvtC8INC90LAg0YPRh9GR0YInLFxuXHQnNTU4NDAzMTIwMDAwJzogJ9CS0YvQv9C40YHQutCwINC40Lcg0LXQtNC40L3QvtCz0L4g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtCz0L4g0YDQtdC10YHRgtGA0LAg0L/RgNCw0LIg0L3QsCDQvdC10LTQstC40LbQuNC80L7QtSDQuNC80YPRidC10YHRgtCy0L4g0Lgg0YHQtNC10LvQvtC6INGBINC90LjQvCwg0YPQtNC+0YHRgtC+0LLQtdGA0Y/RjtGJ0LDRjyDQv9GA0L7QstC10LTQtdC90LjQtSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQstC+0LfQvdC40LrQvdC+0LLQtdC90LjRjyDQuCAo0LjQu9C4KSDQv9C10YDQtdGF0L7QtNCwINC/0YDQsNCyINC90LAg0L3QtdC00LLQuNC20LjQvNC+0LUg0LjQvNGD0YnQtdGB0YLQstC+Jyxcblx0JzU1ODQwMzk5MDAwMCc6ICfQmNC90L7QuSDQtNC+0LrRg9C80LXQvdGCJyxcblx0JzU1ODQwNDAwMDAwMCc6ICfQodC+0LPQu9Cw0YjQtdC90LjRjyDQuCDRgdC+0LPQu9Cw0YHQuNGPINC+0LEg0L7QsdGA0LDQt9C+0LLQsNC90LjQuCDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG5cdCc1NTg0MDQwMTAwMDAnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L4g0YDQsNC30LTQtdC70LUsINC+0LEg0L7QsdGK0LXQtNC40L3QtdC90LjQuCwg0L4g0L/QtdGA0LXRgNCw0YHQv9GA0LXQtNC10LvQtdC90LjQuCDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsiDQuNC70Lgg0L4g0LLRi9C00LXQu9C1INC40Lcg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LInLFxuXHQnNTU4NDA0MDIwMDAwJzogJ9Ch0L7Qs9C70LDRgdC40LUg0L3QsCDQvtCx0YDQsNC30L7QstCw0L3QuNC1INC30LXQvNC10LvRjNC90YvRhSDRg9GH0LDRgdGC0LrQvtCyJyxcblx0JzU1ODQwNDAzMDAwMCc6ICfQodC+0LPQu9Cw0YjQtdC90LjQtSDQvtCxINC+0LHRgNCw0LfQvtCy0LDQvdC40Lgg0L7QsdGJ0LXQuSDQtNC+0LvQtdCy0L7QuSDRgdC+0LHRgdGC0LLQtdC90L3QvtGB0YLQuCDQvdCwINC30LXQvNC10LvRjNC90YvQuSDRg9GH0LDRgdGC0L7Quiwg0L7QsdGA0LDQt9GD0LXQvNGL0Lkg0L/RgNC4INCy0YvQtNC10LvQtSDQtdCz0L4g0LIg0YHRh9C10YIg0LfQtdC80LXQu9GM0L3QvtC5INC00L7Qu9C4INC40LvQuCDQt9C10LzQtdC70YzQvdGL0YUg0LTQvtC70LXQuScsXG5cdCc1NTg0MDQwNDAwMDAnOiAn0KHQvtCz0LvQsNGI0LXQvdC40LUg0L7QsSDQvtCx0YDQsNC30L7QstCw0L3QuNC4INC+0LHRidC10Lkg0YHQvtCy0LzQtdGB0YLQvdC+0Lkg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Lgg0L3QsCDQt9C10LzQtdC70YzQvdGL0Lkg0YPRh9Cw0YHRgtC+0LosINC+0LHRgNCw0LfRg9C10LzRi9C5INC/0YDQuCDQstGL0LTQtdC70LUg0LXQs9C+INCyINGB0YfQtdGCINC30LXQvNC10LvRjNC90L7QuSDQtNC+0LvQuCDQuNC70Lgg0LfQtdC80LXQu9GM0L3Ri9GFINC00L7Qu9C10LknLFxuXHQnNTU4NDA1MDAwMDAwJzogJ9CU0L7QutGD0LzQtdC90YLRiywg0L/QvtC00YLQstC10YDQttC00LDRjtGJ0LjQtSDQstC+0LfQvdC40LrQvdC+0LLQtdC90LjQtSDQv9GA0LDQstCwINGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtC4INCyINC+0YLQvdC+0YjQtdC90LjQuCDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDQsiDRgdC40LvRgyDRhNC10LTQtdGA0LDQu9GM0L3QvtCz0L4g0LfQsNC60L7QvdCwINCy0L3QtSDQt9Cw0LLQuNGB0LjQvNC+0YHRgtC4INC+0YIg0LzQvtC80LXQvdGC0LAg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0Y3RgtC+0LPQviDQv9GA0LDQstCwINCyINCV0JPQoNCfJyxcblx0JzU1ODQwNTAxMDAwMCc6ICfQmtC+0L/QuNGPINGA0LXRiNC10L3QuNGPINC+INCx0LXQt9Cy0L7Qt9C80LXQt9C00L3QvtC5INC/0LXRgNC10LTQsNGH0LUg0LLQvtC10L3QvdC+0LPQviDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCDQuNC3INGE0LXQtNC10YDQsNC70YzQvdC+0Lkg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Lgg0LIg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Ywg0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40LggLSDQs9C+0YDQvtC00LAg0YTQtdC00LXRgNCw0LvRjNC90L7Qs9C+INC30L3QsNGH0LXQvdC40Y8g0JzQvtGB0LrQstGLINC40LvQuCDQodCw0L3QutGCLdCf0LXRgtC10YDQsdGD0YDQs9CwINC70LjQsdC+INC80YPQvdC40YbQuNC/0LDQu9GM0L3Rg9GOINGB0L7QsdGB0YLQstC10L3QvdC+0YHRgtGMJyxcblx0JzU1ODQwNTAyMDAwMCc6ICfQn9C+0LTQu9C40L3QvdC40Log0LjQu9C4INC60L7Qv9C40Y8g0L/QuNGB0YzQvNCwINC+0YDQs9Cw0L3QsCDQuNGB0L/QvtC70L3QuNGC0LXQu9GM0L3QvtC5INCy0LvQsNGB0YLQuCDRgdGD0LHRitC10LrRgtCwINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCAtINCz0L7RgNC+0LTQsCDRhNC10LTQtdGA0LDQu9GM0L3QvtCz0L4g0LfQvdCw0YfQtdC90LjRjyDQnNC+0YHQutCy0Ysg0LjQu9C4INCh0LDQvdC60YIt0J/QtdGC0LXRgNCx0YPRgNCz0LAg0LvQuNCx0L4g0L7RgNCz0LDQvdCwINC80LXRgdGC0L3QvtCz0L4g0YHQsNC80L7Rg9C/0YDQsNCy0LvQtdC90LjRjyDQvNGD0L3QuNGG0LjQv9Cw0LvRjNC90L7Qs9C+INC+0LHRgNCw0LfQvtCy0LDQvdC40Y8g0L4g0YHQvtCz0LvQsNGB0L7QstCw0L3QuNC4INCz0YDQsNC90LjRhiDQvtCx0YDQsNC30YPQtdC80L7Qs9C+INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwINGBINC/0YDQuNC70L7QttC10L3QuNC10Lwg0YHQvtCz0LvQsNGB0L7QstCw0L3QvdC+0LPQviDQv9GA0L7QtdC60YLQsCDQs9GA0LDQvdC40YYg0LfQtdC80LXQu9GM0L3QvtCz0L4g0YPRh9Cw0YHRgtC60LAg0LIg0YHQu9GD0YfQsNC1LCDQtdGB0LvQuCDQsNC60YIg0YHQvtCz0LvQsNGB0L7QstCw0L3QuNGPINCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCDQvdC1INC30LDQstC10YDQtdC9INC/0L7QtNC/0LjRgdGM0Y4g0YPQv9C+0LvQvdC+0LzQvtGH0LXQvdC90L7Qs9C+INC00L7Qu9C20L3QvtGB0YLQvdC+0LPQviDQu9C40YbQsCDRgdC+0L7RgtCy0LXRgtGB0YLQstGD0Y7RidC10LPQviDQvtGA0LPQsNC90LAnLFxuXHQnNTU4NDA1MDMwMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0LjQt9GK0Y/RgtC40Lgg0LfQtdC80LXQu9GM0L3Ri9GFINGD0YfQsNGB0YLQutC+0LIg0LggKNC40LvQuCkg0YDQsNGB0L/QvtC70L7QttC10L3QvdGL0YUg0L3QsCDQvdC40YUg0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQvdC10LTQstC40LbQuNC80L7Qs9C+INC40LzRg9GJ0LXRgdGC0LLQsCDQsiDRhtC10LvRj9GFINGA0LDQt9C80LXRidC10L3QuNGPINC+0LvQuNC80L/QuNC50YHQutC40YUg0L7QsdGK0LXQutGC0L7QsicsXG5cdCc1NTg0MDUwNDAwMDAnOiAn0JrQvtC/0LjRjyDQsNC60YLQsCDQv9GA0LjQtdC80LAt0L/QtdGA0LXQtNCw0YfQuCDQvtCx0YrQtdC60YLQvtCyINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwLCDQsiDQvtGC0L3QvtGI0LXQvdC40Lgg0LrQvtGC0L7RgNGL0YUg0L/RgNC40L3Rj9GC0L4g0YDQtdGI0LXQvdC40LUg0L7QsSDQuNC30YrRj9GC0LjQuCDQsiDRhtC10LvRj9GFINGA0LDQt9C80LXRidC10L3QuNGPINC+0LvQuNC80L/QuNC50YHQutC40YUg0L7QsdGK0LXQutGC0L7QsicsXG5cdCc1NTg0MDU5OTAwMDAnOiAn0JjQvdGL0LUg0LTQvtC60YPQvNC10L3RgtGLLCDQv9C+0LTRgtCy0LXRgNC20LTQsNGO0YnQuNC1INCy0L7Qt9C90LjQutC90L7QstC10L3QuNC1INC/0YDQsNCy0LAg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Lgg0LIg0L7RgtC90L7RiNC10L3QuNC4INC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwINCyINGB0LjQu9GDINGE0LXQtNC10YDQsNC70YzQvdC+0LPQviDQt9Cw0LrQvtC90LAg0LLQvdC1INC30LDQstC40YHQuNC80L7RgdGC0Lgg0L7RgiDQvNC+0LzQtdC90YLQsCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDRjdGC0L7Qs9C+INC/0YDQsNCy0LAg0LIg0JXQk9Cg0J8nLFxuXHQnNTU4NTAwMDAwMDAwJzogJ9Cg0LXRiNC10L3QuNGPLCDRg9Cy0LXQtNC+0LzQu9C10L3QuNGPLCDRgNCw0YHQv9C40YHQutC4Jyxcblx0JzU1ODUwMTAwMDAwMCc6ICfQlNC+0LrRg9C80LXQvdGC0Ysg0L4g0YDQtdC30YPQu9GM0YLQsNGC0LDRhSDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0YPRh9GR0YLQsCcsXG5cdCc1NTg1MDEwMTAwMDAnOiAn0KDQldCo0JXQndCY0K8nLFxuXHQnNTU4NTAxMDEwMTAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Lgg0LfQsNC/0YDQsNGI0LjQstCw0LXQvNGL0YUg0YHQstC10LTQtdC90LjQuScsXG5cdCc1NTg1MDEwMTAyMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INC+0YjQuNCx0LrQuCcsXG5cdCc1NTg1MDEwMTAzMDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCcsXG5cdCc1NTg1MDEwMTA0MDAnOiAn0KDQtdGI0LXQvdC40LUg0L7QsSDQuNGB0L/RgNCw0LLQu9C10L3QuNC4INGC0LXRhdC90LjRh9C10YHQutC+0Lkg0Lgg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQvtGI0LjQsdC+0LonLFxuXHQnNTU4NTAxMDEwNTAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNC4INC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0L/RgNC+0YbQtdC00YPRgNGLJyxcblx0JzU1ODUwMTAxMDYwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQv9GA0LjQvtGB0YLQsNC90L7QstC70LXQvdC40Lgg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQv9GA0L7RhtC10LTRg9GA0YsnLFxuXHQnNTU4NTAxMDEwNzAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgtC60LDQt9C1INCyINGB0L3Rj9GC0LjQuCDQv9GA0LjQvtGB0YLQsNC90L7QstC70LXQvdC40Y8nLFxuXHQnNTU4NTAxMDEwODAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INGB0L3Rj9GC0LjQuCDRgSDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0YPRh9GR0YLQsCDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsiDRgdC+INGB0YLQsNGC0YPRgdC+0LwgwqvQstGA0LXQvNC10L3QvdGL0LXCuyDQv9C+INC30LDRj9Cy0LvQtdC90LjRjiDQt9Cw0LjQvdGC0LXRgNC10YHQvtCy0LDQvdC90L7Qs9C+INC70LjRhtCwJyxcblx0JzU1ODUwMTAxMDkwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQstGL0LTQsNGH0LUg0LrQsNC00LDRgdGC0YDQvtCy0L7Qs9C+INC/0LDRgdC/0L7RgNGC0LAnLFxuXHQnNTU4NTAxMDExMDAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40Lgg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQv9GA0L7RhtC10LTRg9GA0YsnLFxuXHQnNTU4NTAxMDExMTAwJzogJ9Cg0LXRiNC10L3QuNC1INC+0LEg0LDQvdC90YPQu9C40YDQvtCy0LDQvdC40Lgg0LrQsNC00LDRgdGC0YDQvtCy0YvRhSDRgdCy0LXQtNC10L3QuNC5Jyxcblx0JzU1ODUwMTAxMTIwMCc6ICfQoNC10YjQtdC90LjQtSDQvtCxINC+0YLQutC70L7QvdC10L3QuNC4INC30LDRj9Cy0LvQtdC90LjRjyDQvtCxINC40YHQv9GA0LDQstC70LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60LgnLFxuXHQnNTU4NTAxMDExMzAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LfQsNC/0LjRgdC4INC+INC90LDQu9C40YfQuNC4INCy0L7Qt9GA0LDQttC10L3QuNGPJyxcblx0JzU1ODUwMTAxMTQwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQv9C+0LPQsNGI0LXQvdC40Lgg0LfQsNC/0LjRgdC4INC+INC90LDQu9C40YfQuNC4INCy0L7Qt9GA0LDQttC10L3QuNGPJyxcblx0JzU1ODUwMTAxMTUwMCc6ICfQoNC10YjQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INC30LDQv9C40YHQuCDQviDQt9Cw0Y/QstC70LXQvdC40Lgg0L4g0L3QtdCy0L7Qt9C80L7QttC90L7RgdGC0Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40LgnLFxuXHQnNTU4NTAxMDExNjAwJzogJ9Cg0LXRiNC10L3QuNC1INC+INC/0L7Qs9Cw0YjQtdC90LjQuCDQt9Cw0L/QuNGB0Lgg0L4g0LfQsNGP0LLQu9C10L3QuNC4INC+INC90LXQstC+0LfQvNC+0LbQvdC+0YHRgtC4INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4Jyxcblx0JzU1ODUwMTAyMDAwMCc6ICfQo9CS0JXQlNCe0JzQm9CV0J3QmNCvJyxcblx0JzU1ODUwMTAyMDEwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0L7RgtGB0YPRgtGB0YLQstC40Lgg0LIg0JPQmtCdINC30LDQv9GA0LDRiNC40LLQsNC10LzRi9GFINGB0LLQtdC00LXQvdC40LknLFxuXHQnNTU4NTAxMDIwMjAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQvtGB0YPRidC10YHRgtCy0LvRkdC90L3QvtC8INC60LDQtNCw0YHRgtGA0L7QstC+0Lwg0YPRh9GR0YLQtScsXG5cdCc1NTg1MDEwMjAzMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQv9GA0LjQtdC80LUg0LTQvtC60YPQvNC10L3RgtC+0LIg0LTQu9GPINCy0L3QtdGB0LXQvdC40Y8g0LIg0JXQtNC40L3Ri9C5INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvQuSDRgNC10LXRgdGC0YAg0L7QsdGK0LXQutGC0L7QsiDQutCw0L/QuNGC0LDQu9GM0L3QvtCz0L4g0YHRgtGA0L7QuNGC0LXQu9GM0YHRgtCy0LAgKNC00LDQu9C10LUgLSDQldC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCkg0YHQstC10LTQtdC90LjQuSDQvtCxINCe0JrQoScsXG5cdCc1NTg1MDEwMjA0MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQv9GA0LjQtdC80LUg0LTQvtC60YPQvNC10L3RgtC+0LIg0LTQu9GPINC/0YDQtdC00L7RgdGC0LDQstC70LXQvdC40Y8g0LjQtyDQldC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDRgdCy0LXQtNC10L3QuNC5INC+0LEg0J7QmtChJyxcblx0JzU1ODUwMTAyMDUwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0YPRgdGC0YDQsNC90LXQvdC40Lgg0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60Lgg0LIg0YHQstC10LTQtdC90LjRj9GFINCT0JrQnScsXG5cdCc1NTg1MDEwMjA2MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQstGL0LTQsNGH0LUg0YHQstC10LTQtdC90LjQuSDQvtCxINCe0JrQoScsXG5cdCc1NTg1MDEwMjA3MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQv9GA0LjQvtGB0YLQsNC90L7QstC70LXQvdC40Lgg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40Y8g0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQv9GA0L7RhtC10LTRg9GA0YsnLFxuXHQnNTU4NTAxMDIwODAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40Lgg0LrQsNC00LDRgdGC0YDQvtCy0L7QuSDQv9GA0L7RhtC10LTRg9GA0YsnLFxuXHQnNTU4NTAxMDIwOTAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQstCwJyxcblx0JzU1ODUwMTAyMTAwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INC/0YDQuNC+0YHRgtCw0L3QvtCy0LvQtdC90LjQuCDQv9GA0LjQvdGP0YLQuNGPINC90LAg0YPRh9GR0YIg0LjQvNGD0YnQtdGB0YLQstCwINCyINC60LDRh9C10YHRgtCy0LUg0LHQtdGB0YXQvtC30Y/QudC90L7Qs9C+Jyxcblx0JzU1ODUwMTAyMTEwMCc6ICfQodC+0L7QsdGJ0LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0L/RgNC40L3Rj9GC0LjQuCDQvdCwINGD0YfRkdGCINC40LzRg9GJ0LXRgdGC0LLQsCDQsiDQutCw0YfQtdGB0YLQstC1INCx0LXRgdGF0L7Qt9GP0LnQvdC+0LPQvicsXG5cdCc1NTg1MDEwMjEyMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDRgdC90Y/RgtC40Lgg0YEg0YPRh9GR0YLQsCDQuNC80YPRidC10YHRgtCy0LAg0LIg0LrQsNGH0LXRgdGC0LLQtSDQsdC10YHRhdC+0LfRj9C50L3QvtCz0L4nLFxuXHQnNTU4NTAxMDIxMzAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LLQvtC30LLRgNCw0YLQtSDQt9Cw0Y/QstC70LXQvdC40Y8g0L4g0L3QsNC70LjRh9C40Lgg0LLQvtC30YDQsNC20LXQvdC40Y8g0LIg0L7RgtC90L7RiNC10L3QuNC4INC30LDRgNC10LPQuNGB0YLRgNC40YDQvtCy0LDQvdC90L7Qs9C+INC/0YDQsNCy0LAg0L3QsCDQvtCx0YrQtdC60YIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4INCx0LXQtyDRgNCw0YHRgdC80L7RgtGA0LXQvdC40Y8nLFxuXHQnNTU4NTAxMDMwMDAwJzogJ9Cf0KDQntCn0JjQlScsXG5cdCc1NTg1MDEwMzAxMDAnOiAn0KDQsNGB0L/QuNGB0LrQsCDQsiDQv9C+0LvRg9GH0LXQvdC40Lgg0YHQvtC+0YLQstC10YLRgdGC0LLRg9GO0YnQuNGFINC00L7QutGD0LzQtdC90YLQvtCyINC00LvRjyDQv9GA0L7QstC10LTQtdC90LjRjyDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0YPRh9GR0YLQsCcsXG5cdCc1NTg1MDEwMzAyMDAnOiAn0J/RgNC+0YLQvtC60L7QuyDQv9GA0L7QstC10YDQutC4INC00L7QutGD0LzQtdC90YLQvtCyJyxcblx0JzU1ODUwMTAzMDMwMCc6ICfQkNC60YIg0L7Qv9GA0LXQtNC10LvQtdC90LjRjyDQutCw0LTQsNGB0YLRgNC+0LLQvtC5INGB0YLQvtC40LzQvtGB0YLQuCDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QsicsXG5cdCc1NTg1MDEwMzA0MDAnOiAn0J/RgNC+0YLQvtC60L7QuyDQstGL0Y/QstC70LXQvdC40Y8g0YLQtdGF0L3QuNGH0LXRgdC60L7QuSDQvtGI0LjQsdC60LgnLFxuXHQnNTU4NTAxMDMwNTAwJzogJ9CQ0LrRgiDQvtC/0YDQtdC00LXQu9C10L3QuNGPINC60LDQtNCw0YHRgtGA0L7QstC+0Lkg0YHRgtC+0LjQvNC+0YHRgtC4INC+0LHRitC10LrRgtC+0LIg0L3QtdC00LLQuNC20LjQvNC+0YHRgtC4Jyxcblx0JzU1ODUwMTAzOTkwMCc6ICfQmNC90YvQtSDQtNC+0LrRg9C80LXQvdGC0YsnLFxuXHQnNTU4NTAyMDAwMDAwJzogJ9CU0J7QmtCj0JzQldCd0KLQqyDQniDQoNCV0JfQo9Cb0KzQotCQ0KLQkNClINCg0JXQk9CY0KHQotCg0JDQptCY0Jgg0J/QoNCQ0JInLFxuXHQnNTU4NTAyMDEwMDAwJzogJ9Cj0JLQldCU0J7QnNCb0JXQndCY0K8sINCh0J7QntCR0KnQldCd0JjQrycsXG5cdCc1NTg1MDIwMTAxMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQv9GA0LjQvtGB0YLQsNC90L7QstC70LXQvdC40Lgg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LInLFxuXHQnNTU4NTAyMDEwMjAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0L/RgNC10LrRgNCw0YnQtdC90LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lkg0YDQtdCz0LjRgdGC0YDQsNGG0LjQuCDQv9GA0LDQsicsXG5cdCc1NTg1MDIwMTAzMDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQt9Cw0YDQtdCz0LjRgdGC0YDQuNGA0L7QstCw0L3QvdGL0YUg0L7Qs9GA0LDQvdC40YfQtdC90LjRj9GFICjQvtCx0YDQtdC80LXQvdC10L3QuNGP0YUpINC/0YDQsNCyJyxcblx0JzU1ODUwMjAxMDQwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INCy0L3QtdGB0LXQvdC40Lgg0LjQt9C80LXQvdC10L3QuNC5INCyINCV0JPQoNCfJyxcblx0JzU1ODUwMjAxMDUwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+0LEg0LjRgdC/0YDQsNCy0LvQtdC90LjQuCDRgtC10YXQvdC40YfQtdGB0LrQvtC5INC+0YjQuNCx0LrQuCDQsiDQt9Cw0L/QuNGB0Y/RhSDQtdC00LjQvdC+0LPQviDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDRgNC10LXRgdGC0YDQsCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8Jyxcblx0JzU1ODUwMjAxMDYwMCc6ICfQodC+0L7QsdGJ0LXQvdC40LUg0L7QsSDQvtGC0LrQsNC30LUg0LIg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LInLFxuXHQnNTU4NTAyMDEwNzAwJzogJ9Ch0L7QvtCx0YnQtdC90LjQtSDQvtCxINC+0YLQutCw0LfQtSDQsiDQv9GA0LXQtNC+0YHRgtCw0LLQu9C10L3QuNC4INGB0LLQtdC00LXQvdC40Lkg0LjQtyDQldCT0KDQnycsXG5cdCc1NTg1MDIwMTA4MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQvtCxINC+0YLRgdGD0YLRgdGC0LLQuNC4INCyINCV0JPQoNCfINC30LDQv9GA0LDRiNC40LLQsNC10LzRi9GFINGB0LLQtdC00LXQvdC40LknLFxuXHQnNTU4NTAyMDEwOTAwJzogJ9Ch0L7QvtCx0YnQtdC90LjQtSDQviDQv9GA0LjRkdC80LUg0LfQsNGP0LLQu9C10L3QuNGPINC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCy0LAsINC+0LPRgNCw0L3QuNGH0LXQvdC40Y8gKNC+0LHRgNC10LzQtdC90LXQvdC40Y8pINC/0YDQsNCy0LAg0L3QsCDQv9GA0LXQtNC/0YDQuNGP0YLQuNC1LCDRgdC00LXQu9C60Lgg0YEg0L3QuNC8Jyxcblx0JzU1ODUwMjAxMTAwMCc6ICfQodC+0L7QsdGJ0LXQvdC40LUg0L4g0L/QvtGB0YLRg9C/0LvQtdC90LjQuCDQtNC+0LrRg9C80LXQvdGC0L7QsiDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YPRjiDRgNC10LPQuNGB0YLRgNCw0YbQuNGOINC00L7Qs9C+0LLQvtGA0L7QsiDQvNC10L3RiyDQuCAo0LjQu9C4KSDQv9C10YDQtdGF0L7QtNCwINC/0YDQsNCy0LAnLFxuXHQnNTU4NTAyMDExMTAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LLQvtC30LLRgNCw0YLQtSDQv9GA0LjQu9C+0LbQtdC90L3Ri9GFINC6INC30LDRj9Cy0LvQtdC90LjRjiDQtNC+0LrRg9C80LXQvdGC0L7QsiDQsdC10Lcg0YDQsNGB0YHQvNC+0YLRgNC10L3QuNGPJyxcblx0JzU1ODUwMjAxMTIwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQtdC60YDQsNGJ0LXQvdC40Y8g0L7Qs9GA0LDQvdC40YfQtdC90LjRjyAo0L7QsdGA0LXQvNC10L3QtdC90LjRjyknLFxuXHQnNTU4NTAyMDExMzAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L7QsSDQvtGC0YHRg9GC0YHRgtCy0LjQuCDRgdCy0LXQtNC10L3QuNC5INC+INC70LjRhtCw0YUsINC/0L7Qu9GD0YfQuNCy0YjQuNGFINGB0LLQtdC00LXQvdC40Y8g0L7QsSDQvtCx0YrQtdC60YLQsNGFINC90LXQtNCy0LjQttC40LzQvtCz0L4g0LjQvNGD0YnQtdGB0YLQstCwJyxcblx0JzU1ODUwMjAxMTQwMCc6ICfQo9Cy0LXQtNC+0LzQu9C10L3QuNC1INC+INCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCy0LAg0YHQvtCx0YHRgtCy0LXQvdC90L7RgdGC0Lgg0YHRg9Cx0YrQtdC60YLQsCDQoNC+0YHRgdC40LnRgdC60L7QuSDQpNC10LTQtdGA0LDRhtC40Lgg0LjQu9C4INC80YPQvdC40YbQuNC/0LDQu9GM0L3QvtCz0L4g0L7QsdGA0LDQt9C+0LLQsNC90LjRjyDQvdCwINC30LXQvNC10LvRjNC90YvQuSDRg9GH0LDRgdGC0L7QuiDQuNC70Lgg0LfQtdC80LXQu9GM0L3Rg9GOINC00L7Qu9GOINCy0YHQu9C10LTRgdGC0LLQuNC1INC+0YLQutCw0LfQsCDQvtGCINGB0L7QvtGC0LLQtdGC0YHRgtCy0YPRjtGJ0LXQs9C+INC/0YDQsNCy0LAg0L/RgNCw0LLQvtC+0LHQu9Cw0LTQsNGC0LXQu9C10LwnLFxuXHQnNTU4NTAyMDExNTAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0L/QvtGB0YLRg9C/0LvQtdC90LjQuCDRgNC10YjQtdC90LjRjyDRgdGD0LTQsCwg0LLRgdGC0YPQv9C40LLRiNC10LPQviDQsiDQt9Cw0LrQvtC90L3Rg9GOINGB0LjQu9GDLCDRgSDRg9C60LDQt9Cw0L3QuNC10Lwg0YHRgNC+0LrQsCDQvtC60L7QvdGH0LDQvdC40Y8g0L7RgdGD0YnQtdGB0YLQstC70LXQvdC40Y8g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INGA0LXQs9C40YHRgtGA0LDRhtC40Lgg0L/RgNCw0LIsINCyINGB0LvRg9GH0LDQtSDQtdGB0LvQuCDQvtGC0LrQsNC3INCyINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90L7QuSDRgNC10LPQuNGB0YLRgNCw0YbQuNC4INC/0YDQsNCyINC/0YDQuNC30L3QsNC9INGB0YPQtNC+0Lwg0L3QtdC+0LHQvtGB0L3QvtCy0LDQvdC90YvQvCcsXG5cdCc1NTg1MDIwMTE2MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQstC90LXRgdC10L3QuNC4INC40LfQvNC10L3QtdC90LjQuSDQsiDQtdC00LjQvdGL0Lkg0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9C5INGA0LXQtdGB0YLRgCDQv9GA0LDQsiDQvdCwINC90LXQtNCy0LjQttC40LzQvtC1INC40LzRg9GJ0LXRgdGC0LLQviDQuCDRgdC00LXQu9C+0Log0YEg0L3QuNC8INCyINGB0LLRj9C30Lgg0YEg0LjQt9C80LXQvdC10L3QuNC10Lwg0YHQvtC00LXRgNC20LDRidC40YXRgdGPINCyINCx0LDQt9C+0LLRi9GFINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvRhSDQuNC90YTQvtGA0LzQsNGG0LjQvtC90L3Ri9GFINGA0LXRgdGD0YDRgdCw0YUg0YHQstC10LTQtdC90LjQuSDQviDQv9GA0LDQstC+0L7QsdC70LDQtNCw0YLQtdC70LUgKNC/0YDQsNCy0L7QvtCx0LvQsNC00LDRgtC10LvRj9GFKScsXG5cdCc1NTg1MDIwMTE3MDAnOiAn0KPQstC10LTQvtC80LvQtdC90LjQtSDQviDQstC+0LfQstGA0LDRgtC1INC00L7QutGD0LzQtdC90YLQvtCyINCx0LXQtyDRgNCw0YHRgdC80L7RgtGA0LXQvdC40Y8g0L/RgNC4INC+0YLQutCw0LfQtSDQsiDQvtGB0YPRidC10YHRgtCy0LvQtdC90LjQuCDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0LPQviDQutCw0LTQsNGB0YLRgNC+0LLQvtCz0L4g0YPRh9C10YLQsCcsXG5cdCc1NTg1MDIwMjAwMDAnOiAn0J/QoNCe0KfQmNCVJyxcblx0JzU1ODUwMjAyMDEwMCc6ICfQoNCw0YHQv9C40YHQutCwINCyINC/0L7Qu9GD0YfQtdC90LjQuCDQtNC+0LrRg9C80LXQvdGC0L7QsiDQvdCwINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YPRjiDRgNC10LPQuNGB0YLRgNCw0YbQuNGOINC/0YDQsNCyJyxcblx0JzU1ODUwMjAyOTkwMCc6ICfQmNC90L7QuSDQtNC+0LrRg9C80LXQvdGCJyxcblx0JzU1ODYwMTAwMDAwMCc6ICfQoNCw0YHQv9C40YHQutCwINCyINC/0L7Qu9GD0YfQtdC90LjQuCDQuNC30LLQtdGJ0LXQvdC40Lkg0L4g0L/RgNC+0LLQtdC00LXQvdC40Lgg0YHQvtCx0YDQsNC90LjRjyDQviDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40Lgg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjRjyDQs9GA0LDQvdC40YYnLFxuXHQnNTU4NjAyMDAwMDAwJzogJ9Cj0LLQtdC00L7QvNC70LXQvdC40LUg0L4g0LLRgNGD0YfQtdC90LjQuCDQuNC30LLQtdGJ0LXQvdC40Y8g0L4g0L/RgNC+0LLQtdC00LXQvdC40Lgg0YHQvtCx0YDQsNC90LjRjyDQviDRgdC+0LPQu9Cw0YHQvtCy0LDQvdC40Lgg0LzQtdGB0YLQvtC/0L7Qu9C+0LbQtdC90LjRjyDQs9GA0LDQvdC40YYnLFxuXHQnNTU4NjAzMDAwMDAwJzogJ9Ca0L7Qv9C40Y8g0YHRgtGA0LDQvdC40YbRiyDQv9C10YfQsNGC0L3QvtCz0L4g0LjQt9C00LDQvdC40Y8sINGB0L7QtNC10YDQttCw0YnQtdC5INC40LfQstC10YnQtdC90LjQtSDQviDQv9GA0L7QstC10LTQtdC90LjQuCDRgdC+0LHRgNCw0L3QuNGPINC+INGB0L7Qs9C70LDRgdC+0LLQsNC90LjQuCDQvNC10YHRgtC+0L/QvtC70L7QttC10L3QuNGPINCz0YDQsNC90LjRhiDQt9C10LzQtdC70YzQvdC+0LPQviDRg9GH0LDRgdGC0LrQsCwg0LLQutC70Y7Rh9Cw0Y8g0L/QtdGA0LLRi9C5INC70LjRgdGCLCDRgdC+0LTQtdGA0LbQsNGJ0LXQs9C+INGA0LXQutCy0LjQt9C40YLRiyDRgtCw0LrQvtCz0L4g0L/QtdGH0LDRgtC90L7Qs9C+INC40LfQtNCw0L3QuNGPJyxcblx0JzU1ODY5OTAwMDAwMCc6ICfQmNC90YvQtSDQtNC+0LrRg9C80LXQvdGC0YssINGB0LLQuNC00LXRgtC10LvRjNGB0YLQstGD0Y7RidC40LUg0L4g0YHQvtCx0LvRjtC00LXQvdC40Lgg0YPRgdGC0LDQvdC+0LLQu9C10L3QvdC+0LPQviDQv9C+0YDRj9C00LrQsCDQuNC30LLQtdGJ0LXQvdC40Y8g0LfQsNC40L3RgtC10YDQtdGB0L7QstCw0L3QvdGL0YUg0LvQuNGGINC+INC/0YDQvtCy0LXQtNC10L3QuNC4INGB0L7QsdGA0LDQvdC40Y8g0L4g0YHQvtCz0LvQsNGB0L7QstCw0L3QuNC4INC80LXRgdGC0L7Qv9C+0LvQvtC20LXQvdC40Y8g0LPRgNCw0L3QuNGGINC30LXQvNC10LvRjNC90L7Qs9C+INGD0YfQsNGB0YLQutCwJ1xufTtcbi8v0KLQtdGA0YDQuNGC0L7RgNC40LDQu9GM0L3Ri9C1INC30L7QvdGLINC4INC30L7QvdGLINGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuVxudmFyIGRab25lID0ge1xuXHQnMjE4MDEwMDAwMDAwJzogJ9Ci0LXRgNGA0LjRgtC+0YDQuNCw0LvRjNC90YvQtSDQt9C+0L3RiycsXG5cdCcyMTgwMTAwMTAwMDAnOiAn0JbQuNC70LDRjyDQt9C+0L3QsCcsXG5cdCcyMTgwMTAwMjAwMDAnOiAn0J7QsdGJ0LXRgdGC0LLQtdC90L3Qvi3QtNC10LvQvtCy0LDRjyDQt9C+0L3QsCcsXG5cdCcyMTgwMTAwMzAwMDAnOiAn0J/RgNC+0LjQt9Cy0L7QtNGB0YLQstC10L3QvdCw0Y8g0LfQvtC90LAsINC30L7QvdCwINC40L3QttC10L3QtdGA0L3QvtC5INC4INGC0YDQsNC90YHQv9C+0YDRgtC90L7QuSDQuNC90YTRgNCw0YHRgtGA0YPQutGC0YPRgCcsXG5cdCcyMTgwMTAwNDAwMDAnOiAn0JfQvtC90LAg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPJyxcblx0JzIxODAxMDA1MDAwMCc6ICfQl9C+0L3QsCDRgNC10LrRgNC10LDRhtC40L7QvdC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzIxODAxMDA2MDAwMCc6ICfQl9C+0L3QsCDQvtGB0L7QsdC+INC+0YXRgNCw0L3Rj9C10LzRi9GFINGC0LXRgNGA0LjRgtC+0YDQuNC5Jyxcblx0JzIxODAxMDA3MDAwMCc6ICfQl9C+0L3QsCDRgdC/0LXRhtC40LDQu9GM0L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMjE4MDEwMDgwMDAwJzogJ9CX0L7QvdCwINGA0LDQt9C80LXRidC10L3QuNGPINCy0L7QtdC90L3Ri9GFINC+0LHRitC10LrRgtC+0LInLFxuXHQnMjE4MDEwMDkwMDAwJzogJ9CY0L3QsNGPINC30L7QvdCwJyxcblx0JzIxODAyMDAwMDAwMCc6ICfQl9C+0L3RiyDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LgnLFxuXHQnMjE4MDIwMDEwMDAwJzogJ9CX0L7QvdGLINC+0YXRgNCw0L3RiyDQv9GA0LjRgNC+0LTQvdGL0YUg0L7QsdGK0LXQutGC0L7QsicsXG5cdCcyMTgwMjAwMTAwMDEnOiAn0KLQtdGA0YDQuNGC0L7RgNC40Y8g0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80L7Qs9C+INC/0YDQuNGA0L7QtNC90L7Qs9C+INC+0LHRitC10LrRgtCwJyxcblx0JzIxODAyMDAxMDAwMic6ICfQntGF0YDQsNC90L3QsNGPINC30L7QvdCwINC+0YHQvtCx0L4g0L7RhdGA0LDQvdGP0LXQvNC+0LPQviDQv9GA0LjRgNC+0LTQvdC+0LPQviDQvtCx0YrQtdC60YLQsCcsXG5cdCcyMTgwMjAwMTAwMDMnOiAn0JLQvtC00L7QvtGF0YDQsNC90L3QsNGPINC30L7QvdCwJyxcblx0JzIxODAyMDAxMDAwNCc6ICfQn9GA0LjQsdGA0LXQttC90LDRjyDQt9Cw0YnQuNGC0L3QsNGPINC/0L7Qu9C+0YHQsCcsXG5cdCcyMTgwMjAwMTAwMDUnOiAn0JfQvtC90LAg0YHQsNC90LjRgtCw0YDQvdC+0Lkg0L7RhdGA0LDQvdGLINC40YHRgtC+0YfQvdC40LrQvtCyINCy0L7QtNC+0YHQvdCw0LHQttC10L3QuNGPINC4INCy0L7QtNC+0L/RgNC+0LLQvtC00L7QsiDQv9C40YLRjNC10LLQvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMjE4MDIwMDEwMDA2JzogJ9Ce0YHQvtCx0L4g0YbQtdC90L3Ri9C1INC30LXQvNC70LgnLFxuXHQnMjE4MDIwMDIwMDAwJzogJ9CX0L7QvdGLINC+0YXRgNCw0L3RiyDQuNGB0LrRg9GB0YHRgtCy0LXQvdC90YvRhSDQvtCx0YrQtdC60YLQvtCyJyxcblx0JzIxODAyMDAyMDAwMSc6ICfQotC10YDRgNC40YLQvtGA0LjRjyDQvtCx0YrQtdC60YLQsCDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8nLFxuXHQnMjE4MDIwMDIwMDAyJzogJ9CX0L7QvdCwINC+0YXRgNCw0L3RiyDQvtCx0YrQtdC60YLQsCDQutGD0LvRjNGC0YPRgNC90L7Qs9C+INC90LDRgdC70LXQtNC40Y8nLFxuXHQnMjE4MDIwMDIwMDAzJzogJ9Ce0YXRgNCw0L3QvdCw0Y8g0LfQvtC90LAg0LPQtdC+0LTQtdC30LjRh9C10YHQutC+0LPQviDQv9GD0L3QutGC0LAnLFxuXHQnMjE4MDIwMDIwMDA0JzogJ9Ce0YXRgNCw0L3QvdCw0Y8g0LfQvtC90LAg0YHRgtCw0YbQuNC+0L3QsNGA0L3QvtCz0L4g0L/Rg9C90LrRgtCwINC90LDQsdC70Y7QtNC10L3QuNC5INC30LAg0YHQvtGB0YLQvtGP0L3QuNC10Lwg0L7QutGA0YPQttCw0Y7RidC10Lkg0L/RgNC40YDQvtC00L3QvtC5INGB0YDQtdC00YsnLFxuXHQnMjE4MDIwMDIwMDA1JzogJ9Ce0YXRgNCw0L3QvdCw0Y8g0LfQvtC90LAg0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuXHQnMjE4MDIwMDIwMDA2JzogJ9Ce0YXRgNCw0L3QvdCw0Y8g0LfQvtC90LAg0LjQvdC20LXQvdC10YDQvdGL0YUg0LrQvtC80LzRg9C90LjQutCw0YbQuNC5Jyxcblx0JzIxODAyMDAyMDAwNyc6ICfQntGF0YDQsNC90L3QsNGPINC30L7QvdCwINC70LjQvdC40Lkg0Lgg0YHQvtC+0YDRg9C20LXQvdC40Lkg0YHQstGP0LfQuCDQuCDQu9C40L3QuNC5INC4INGB0L7QvtGA0YPQttC10L3QuNC5INGA0LDQtNC40L7RhNC40LrQsNGG0LjQuCcsXG5cdCcyMTgwMjAwMjAwMDgnOiAn0J/RgNC40LTQvtGA0L7QttC90LDRjyDQv9C+0LvQvtGB0LAnLFxuXHQnMjE4MDIwMDMwMDAwJzogJ9CX0L7QvdGLINC30LDRidC40YLRiyDQvdCw0YHQtdC70LXQvdC40Y8nLFxuXHQnMjE4MDIwMDMwMDAxJzogJ9CX0LDQv9GA0LXRgtC90LDRjyDQt9C+0L3QsCDQv9GA0Lgg0LLQvtC10L3QvdC+0Lwg0YHQutC70LDQtNC1Jyxcblx0JzIxODAyMDAzMDAwMic6ICfQl9Cw0L/RgNC10YLQvdGL0Lkg0YDQsNC50L7QvSDQv9GA0Lgg0LLQvtC10L3QvdC+0Lwg0YHQutC70LDQtNC1Jyxcblx0JzIxODAyMDAzMDAwMyc6ICfQl9Cw0LPRgNGP0LfQvdC10L3QvdGL0LUg0LfQtdC80LvQuCcsXG5cdCcyMTgwMjAwMzAwMDQnOiAn0J7RhdGA0LDQvdC90LDRjyDQt9C+0L3QsCDQt9Cw0LPRgNGP0LfQvdC10L3QvdGL0YUg0LfQtdC80LXQu9GMJyxcblx0JzIxODAyMDAzMDAwNSc6ICfQodCw0L3QuNGC0LDRgNC90L4t0LfQsNGJ0LjRgtC90LDRjyDQt9C+0L3QsCDQv9GA0LXQtNC/0YDQuNGP0YLQuNC5LCDRgdC+0L7RgNGD0LbQtdC90LjQuSDQuCDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyJyxcblx0JzIxODAyMDAzMDAwNic6ICfQodCw0L3QuNGC0LDRgNC90YvQuSDRgNCw0LfRgNGL0LIgKNGB0LDQvdC40YLQsNGA0L3QsNGPINC/0L7Qu9C+0YHQsCDQvtGC0YfRg9C20LTQtdC90LjRjyknLFxuXHQnMjE4MDIwMDMwMDA3JzogJ9CX0L7QvdCwINC+0LPRgNCw0L3QuNGH0LXQvdC40Y8g0L7RgiDQv9C10YDQtdC00LDRjtGJ0LXQs9C+INGA0LDQtNC40L7RgtC10YXQvdC40YfQtdGB0LrQvtCz0L4g0L7QsdGK0LXQutGC0LAnLFxuXHQnMjE4MDIwMDMwMDA4JzogJ9Cg0LDQudC+0L0g0L/QsNC00LXQvdC40Y8g0L7RgtC00LXQu9GP0Y7RidC40YXRgdGPINGH0LDRgdGC0LXQuSDRgNCw0LrQtdGCJyxcblx0JzIxODAyMDA0MDAwMCc6ICfQn9GA0L7Rh9C40LUg0LfQvtC90Ysg0YEg0L7RgdC+0LHRi9C80Lgg0YPRgdC70L7QstC40Y/QvNC4INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPINGC0LXRgNGA0LjRgtC+0YDQuNC4Jyxcblx0JzIxODAyMDA0MDAwMSc6ICfQl9C+0L3QsCDQv9GD0LHQu9C40YfQvdC+0LPQviDRgdC10YDQstC40YLRg9GC0LAnLFxuXHQnMjE4MDIwMDQwMDAyJzogJ9CX0L7QvdCwINGA0LXQt9C10YDQstC40YDQvtCy0LDQvdC40Y8g0LfQtdC80LXQu9GMJyxcblx0JzIxODAyMDA0MDAwMyc6ICfQk9C+0YDQvdGL0Lkg0L7RgtCy0L7QtCcsXG5cdCcyMTgwMjAwNDAwMDQnOiAn0J/RgNC40LPQvtGA0L7QtNC90LDRjyDQt9C+0L3QsCcsXG5cdCcyMTgwMjAwNDAwMDUnOiAn0JfQtdC70LXQvdCw0Y8g0LfQvtC90LAnLFxuXHQnMjE4MDIwMDQwMDA2JzogJ9Ce0YHQvtCx0LDRjyDRjdC60L7QvdC+0LzQuNGH0LXRgdC60LDRjyDQt9C+0L3QsCcsXG5cdCcyMTgwMjAwNDAwMDcnOiAn0J/QvtCz0YDQsNC90LjRh9C90LDRjyDQt9C+0L3QsCcsXG5cdCcyMTgwMjAwNDAwMDgnOiAn0KLQtdGA0YDQuNGC0L7RgNC40Y8g0YLRgNCw0LTQuNGG0LjQvtC90L3QvtCz0L4g0L/RgNC40YDQvtC00L7Qv9C+0LvRjNC30L7QstCw0L3QuNGPJyxcblx0JzIxODAyMDA1MDAwMCc6ICfQmNC90YvQtSDQt9C+0L3RiyDRgSDQvtGB0L7QsdGL0LzQuCDRg9GB0LvQvtCy0LjRj9C80Lgg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40Y8g0YLQtdGA0YDQuNGC0L7RgNC40LgnLFxuXHQnMjE4MDIwMDUwMDAxJzogJ9CY0L3QsNGPINC30L7QvdCwINGBINC+0YHQvtCx0YvQvNC4INGD0YHQu9C+0LLQuNGP0LzQuCDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDRgtC10YDRgNC40YLQvtGA0LjQuCdcdFx0XG59O1xuLy8g0JrQu9Cw0YHRgdC40YTQuNC60LDRgtC+0YAg0LLQuNC00L7QsiDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDQt9C10LzQtdC70YxcbnZhciBkVXRpbGl6YXRpb25zID0ge1xuXHQnMTQxMDAwMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjyDQuCDRgdC10LvRjNGB0LrQvtGF0L7Qt9GP0LnRgdGC0LLQtdC90L3Ri9GFINGD0LPQvtC00LjQuScsXG5cdCcxNDEwMDEwMDAwMDAnOiAn0JTQu9GPINGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdC+0LPQviDQv9GA0L7QuNC30LLQvtC00YHRgtCy0LAnLFxuXHQnMTQxMDAxMDEwMDAwJzogJ9CU0LvRjyDQuNGB0L/QvtC70YzQt9C+0LLQsNC90LjRjyDQsiDQutCw0YfQtdGB0YLQstC1INGB0LXQu9GM0YHQutC+0YXQvtC30Y/QudGB0YLQstC10L3QvdGL0YUg0YPQs9C+0LTQuNC5Jyxcblx0JzE0MTAwMTAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LfQtNCw0L3QuNC5LCDRgdGC0YDQvtC10L3QuNC5LCDRgdC+0L7RgNGD0LbQtdC90LjQuSwg0LjRgdC/0L7Qu9GM0LfRg9C10LzRi9GFINC00LvRjyDQv9GA0L7QuNC30LLQvtC00YHRgtCy0LAsINGF0YDQsNC90LXQvdC40Y8g0Lgg0L/QtdGA0LLQuNGH0L3QvtC5INC/0LXRgNC10YDQsNCx0L7RgtC60Lgg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7QuSDQv9GA0L7QtNGD0LrRhtC40LgnLFxuXHQnMTQxMDAxMDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQstC90YPRgtGA0LjRhdC+0LfRj9C50YHRgtCy0LXQvdC90YvRhSDQtNC+0YDQvtCzINC4INC60L7QvNC80YPQvdC40LrQsNGG0LjQuScsXG5cdCcxNDEwMDEwNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCy0L7QtNC90YvRhSDQvtCx0YrQtdC60YLQvtCyJyxcblx0JzE0MTAwMjAwMDAwMCc6ICfQlNC70Y8g0LLQtdC00LXQvdC40Y8g0LrRgNC10YHRgtGM0Y/QvdGB0LrQvtCz0L4gKNGE0LXRgNC80LXRgNGB0LrQvtCz0L4pINGF0L7Qt9GP0LnRgdGC0LLQsCcsXG5cdCcxNDEwMDMwMDAwMDAnOiAn0JTQu9GPINCy0LXQtNC10L3QuNGPINC70LjRh9C90L7Qs9C+INC/0L7QtNGB0L7QsdC90L7Qs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG5cdCcxNDEwMDQwMDAwMDAnOiAn0JTQu9GPINCy0LXQtNC10L3QuNGPINCz0YDQsNC20LTQsNC90LDQvNC4INGB0LDQtNC+0LLQvtC00YHRgtCy0LAg0Lgg0L7Qs9C+0YDQvtC00L3QuNGH0LXRgdGC0LLQsCcsXG5cdCcxNDEwMDUwMDAwMDAnOiAn0JTQu9GPINCy0LXQtNC10L3QuNGPINCz0YDQsNC20LTQsNC90LDQvNC4INC20LjQstC+0YLQvdC+0LLQvtC00YHRgtCy0LAnLFxuXHQnMTQxMDA2MDAwMDAwJzogJ9CU0LvRjyDQtNCw0YfQvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCcsXG5cdCcxNDEwMDcwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC00YDQtdCy0LXRgdC90L4t0LrRg9GB0YLQsNGA0L3QuNC60L7QstC+0Lkg0YDQsNGB0YLQuNGC0LXQu9GM0L3QvtGB0YLQuCwg0L/RgNC10LTQvdCw0LfQvdCw0YfQtdC90L3QvtC5INC00LvRjyDQt9Cw0YnQuNGC0Ysg0LfQtdC80LXQu9GMINC+0YIg0LLQvtC30LTQtdC50YHRgtCy0LjRjyDQvdC10LPQsNGC0LjQstC90YvRhSAo0LLRgNC10LTQvdGL0YUpINC/0YDQuNGA0L7QtNC90YvRhSwg0LDQvdGC0YDQvtC/0L7Qs9C10L3QvdGL0YUg0Lgg0YLQtdGF0L3QvtCz0LXQvdC90YvRhSDRj9Cy0LvQtdC90LjQuScsXG5cdCcxNDEwMDgwMDAwMDAnOiAn0JTQu9GPINC90LDRg9GH0L3Qvi3QuNGB0YHQu9C10LTQvtCy0LDRgtC10LvRjNGB0LrQuNGFINGG0LXQu9C10LknLFxuXHQnMTQxMDA5MDAwMDAwJzogJ9CU0LvRjyDRg9GH0LXQsdC90YvRhSDRhtC10LvQtdC5Jyxcblx0JzE0MTAxMDAwMDAwMCc6ICfQlNC70Y8g0YHQtdC90L7QutC+0YjQtdC90LjRjyDQuCDQstGL0L/QsNGB0LAg0YHQutC+0YLQsCDQs9GA0LDQttC00LDQvdCw0LzQuCcsXG5cdCcxNDEwMTEwMDAwMDAnOiAn0KTQvtC90LQg0L/QtdGA0LXRgNCw0YHQv9GA0LXQtNC10LvQtdC90LjRjycsXG5cdCcxNDEwMTIwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0L7RhdC+0YLQvdC40YfRjNC10LPQviDRhdC+0LfRj9C50YHRgtCy0LAnLFxuXHQnMTQxMDEzMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGA0YvQsdC90L7Qs9C+INGF0L7Qt9GP0LnRgdGC0LLQsCcsXG5cdCcxNDEwMTQwMDAwMDAnOiAn0JTQu9GPINC40L3Ri9GFINCy0LjQtNC+0LIg0YHQtdC70YzRgdC60L7RhdC+0LfRj9C50YHRgtCy0LXQvdC90L7Qs9C+INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPJyxcblx0JzE0MjAwMDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7Qsiwg0YXQsNGA0LDQutGC0LXRgNC90YvRhSDQtNC70Y8g0L3QsNGB0LXQu9GR0L3QvdGL0YUg0L/Rg9C90LrRgtC+0LInLFxuXHQnMTQyMDAxMDAwMDAwJzogJ9CU0LvRjyDQvtCx0YrQtdC60YLQvtCyINC20LjQu9C+0Lkg0LfQsNGB0YLRgNC+0LnQutC4Jyxcblx0JzE0MjAwMTAxMDAwMCc6ICfQlNC70Y8g0LjQvdC00LjQstC40LTRg9Cw0LvRjNC90L7QuSDQttC40LvQvtC5INC30LDRgdGC0YDQvtC50LrQuCcsXG5cdCcxNDIwMDEwMjAwMDAnOiAn0JTQu9GPINC80L3QvtCz0L7QutCy0LDRgNGC0LjRgNC90L7QuSDQt9Cw0YHRgtGA0L7QudC60LgnLFxuXHQnMTQyMDAxMDIwMTAwJzogJ9CU0LvRjyDQvNCw0LvQvtGN0YLQsNC20L3QvtC5INC30LDRgdGC0YDQvtC50LrQuCcsXG5cdCcxNDIwMDEwMjAyMDAnOiAn0JTQu9GPINGB0YDQtdC00L3QtdGN0YLQsNC20L3QvtC5INC30LDRgdGC0YDQvtC50LrQuCcsXG5cdCcxNDIwMDEwMjAzMDAnOiAn0JTQu9GPINC80L3QvtCz0L7RjdGC0LDQttC90L7QuSDQt9Cw0YHRgtGA0L7QudC60LgnLFxuXHQnMTQyMDAxMDIwNDAwJzogJ9CU0LvRjyDQuNC90YvRhSDQstC40LTQvtCyINC20LjQu9C+0Lkg0LfQsNGB0YLRgNC+0LnQutC4Jyxcblx0JzE0MjAwMTAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQtNC+0YjQutC+0LvRjNC90L7Qs9C+LCDQvdCw0YfQsNC70YzQvdC+0LPQviwg0L7QsdGJ0LXQs9C+INC4INGB0YDQtdC00L3QtdCz0L4gKNC/0L7Qu9C90L7Qs9C+KSDQvtCx0YnQtdCz0L4g0L7QsdGA0LDQt9C+0LLQsNC90LjRjycsXG5cdCcxNDIwMDEwNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIsINC00L7Qv9GD0YHRgtC40LzRi9GFINCyINC20LjQu9GL0YUg0LfQvtC90LDRhSDQuCDQvdC1INC/0LXRgNC10YfQuNGB0LvQtdC90L3Ri9GFINCyINC60LvQsNGB0YHQuNGE0LjQutCw0YLQvtGA0LUnLFxuXHQnMTQyMDAyMDAwMDAwJzogJ9CU0LvRjyDQvtCx0YrQtdC60YLQvtCyINC+0LHRidC10YHRgtCy0LXQvdC90L4t0LTQtdC70L7QstC+0LPQviDQt9C90LDRh9C10L3QuNGPJyxcblx0JzE0MjAwMjAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgdC+0YbQuNCw0LvRjNC90L7Qs9C+INC4INC60L7QvNC80YPQvdCw0LvRjNC90L4t0LHRi9GC0L7QstC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCcxNDIwMDIwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LfQtNGA0LDQstC+0L7RhdGA0LDQvdC10L3QuNGPJyxcblx0JzE0MjAwMjAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQutGD0LvRjNGC0YPRgNGLJyxcblx0JzE0MjAwMjA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgtC+0YDQs9C+0LLQu9C4Jyxcblx0JzE0MjAwMjA0MDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgNC+0LfQvdC40YfQvdC+0Lkg0YLQvtGA0LPQvtCy0LvQuCcsXG5cdCcxNDIwMDIwNDAyMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0L7Qv9GC0L7QstC+0Lkg0YLQvtGA0LPQvtCy0LvQuCcsXG5cdCcxNDIwMDIwNTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0L7QsdGJ0LXRgdGC0LLQtdC90L3QvtCz0L4g0L/QuNGC0LDQvdC40Y8nLFxuXHQnMTQyMDAyMDYwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC/0YDQtdC00L/RgNC40L3QuNC80LDRgtC10LvRjNGB0LrQvtC5INC00LXRj9GC0LXQu9GM0L3QvtGB0YLQuCcsXG5cdCcxNDIwMDIwNzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YHRgNC10LTQvdC10LPQviDQv9GA0L7RhNC10YHRgdC40L7QvdCw0LvRjNC90L7Qs9C+INC4INCy0YvRgdGI0LXQs9C+INC/0YDQvtGE0LXRgdGB0LjQvtC90LDQu9GM0L3QvtCz0L4g0L7QsdGA0LDQt9C+0LLQsNC90LjRjycsXG5cdCcxNDIwMDIwODAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCw0LTQvNC40L3QuNGB0YLRgNCw0YLQuNCy0L3Ri9GFINC30LTQsNC90LjQuScsXG5cdCcxNDIwMDIwOTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC90LDRg9GH0L3Qvi3QuNGB0YHQu9C10LTQvtCy0LDRgtC10LvRjNGB0LrQuNGFINGD0YfRgNC10LbQtNC10L3QuNC5Jyxcblx0JzE0MjAwMjEwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LrRg9C70YzRgtC+0LLRi9GFINC30LTQsNC90LjQuScsXG5cdCcxNDIwMDIxMTAwMDAnOiAn0JTQu9GPINGB0YLQvtGP0L3QvtC6INCw0LLRgtC+0LzQvtCx0LjQu9GM0L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuXHQnMTQyMDAyMTIwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC00LXQu9C+0LLQvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8sINCyINGC0L7QvCDRh9C40YHQu9C1INC+0YTQuNGB0L3Ri9GFINGG0LXQvdGC0YDQvtCyJyxcblx0JzE0MjAwMjEzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRhNC40L3QsNC90YHQvtCy0L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzE0MjAwMjE0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LPQvtGB0YLQuNC90LjRhicsXG5cdCcxNDIwMDIxNTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0L7QtNC30LXQvNC90YvRhSDQuNC70Lgg0LzQvdC+0LPQvtGN0YLQsNC20L3Ri9GFINCz0LDRgNCw0LbQtdC5Jyxcblx0JzE0MjAwMjE2MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdC00LjQstC40LTRg9Cw0LvRjNC90YvRhSDQs9Cw0YDQsNC20LXQuScsXG5cdCcxNDIwMDIxNzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0L7QsdGJ0LXRgdGC0LLQtdC90L3Qvi3QtNC10LvQvtCy0L7Qs9C+INC30L3QsNGH0LXQvdC40Y8sINC+0LHQtdGB0L/QtdGH0LjQstCw0Y7RidC40YUg0LbQuNC30L3RjCDQs9GA0LDQttC00LDQvScsXG5cdCcxNDIwMDMwMDAwMDAnOiAn0JTQu9GPINC+0LHRidC10LPQviDQv9C+0LvRjNC30L7QstCw0L3QuNGPICjRg9C70LjRh9C90LDRjyDRgdC10YLRjCknLFxuXHQnMTQyMDA0MDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGB0L/QtdGG0LjQsNC70YzQvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCcxNDIwMDQwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC60LvQsNC00LHQuNGJJyxcblx0JzE0MjAwNDAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LrRgNC10LzQsNGC0L7RgNC40LXQsicsXG5cdCcxNDIwMDQwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGB0LrQvtGC0L7QvNC+0LPQuNC70YzQvdC40LrQvtCyJyxcblx0JzE0MjAwNDA0MDAwMCc6ICfQn9C+0LQg0L7QsdGK0LXQutGC0LDQvNC4INGA0LDQt9C80LXRidC10L3QuNGPINC+0YLRhdC+0LTQvtCyINC/0L7RgtGA0LXQsdC70LXQvdC40Y8nLFxuXHQnMTQyMDA0MDUwMDAwJzogJ9Cf0L7QtCDQuNC90YvQvNC4INC+0LHRitC10LrRgtCw0LzQuCDRgdC/0LXRhtC40LDQu9GM0L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMTQyMDA1MDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutC+0LzQvNGD0L3QsNC70YzQvdGL0YUsINGB0LrQu9Cw0LTRgdC60LjRhSDQvtCx0YrQtdC60YLQvtCyJyxcblx0JzE0MjAwNjAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQttC40LvQuNGJ0L3Qvi3QutC+0LzQvNGD0L3QsNC70YzQvdC+0LPQviDRhdC+0LfRj9C50YHRgtCy0LAnLFxuXHQnMTQyMDA3MDAwMDAwJzogJ9CU0LvRjyDQuNC90YvRhSDQstC40LTQvtCyINC40YHQv9C+0LvRjNC30L7QstCw0L3QuNGPLCDRhdCw0YDQsNC60YLQtdGA0L3Ri9GFINC00LvRjyDQvdCw0YHQtdC70ZHQvdC90YvRhSDQv9GD0L3QutGC0L7QsicsXG5cdCcxNDMwMDAwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0L/RgNC+0LzRi9GI0LvQtdC90L3QvtGB0YLQuCwg0Y3QvdC10YDQs9C10YLQuNC60LgsINGC0YDQsNC90YHQv9C+0YDRgtCwLCDRgdCy0Y/Qt9C4LCDRgNCw0LTQuNC+0LLQtdGJ0LDQvdC40Y8sINGC0LXQu9C10LLQuNC00LXQvdC40Y8sINC40L3RhNC+0YDQvNCw0YLQuNC60LgsINC+0LHQtdGB0L/QtdGH0LXQvdC40Y8g0LrQvtGB0LzQuNGH0LXRgdC60L7QuSDQtNC10Y/RgtC10LvRjNC90L7RgdGC0LgsINC+0LHQvtGA0L7QvdGLLCDQsdC10LfQvtC/0LDRgdC90L7RgdGC0Lgg0Lgg0LjQvdC+0LPQviDRgdC/0LXRhtC40LDQu9GM0L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMTQzMDAxMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9GA0L7QvNGL0YjQu9C10L3QvdGL0YUg0L7QsdGK0LXQutGC0L7QsicsXG5cdCcxNDMwMDEwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0YDQvtC40LfQstC+0LTRgdGC0LLQtdC90L3Ri9GFINC4INCw0LTQvNC40L3QuNGB0YLRgNCw0YLQuNCy0L3Ri9GFINC30LTQsNC90LjQuSwg0YHRgtGA0L7QtdC90LjQuSwg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0L7QsdGB0LvRg9C20LjQstCw0Y7RidC40YUg0LjRhSDQvtCx0YrQtdC60YLQvtCyJyxcblx0JzE0MzAwMTAxMDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/RgNC+0LjQt9Cy0L7QtNGB0YLQstC10L3QvdGL0YUg0LfQtNCw0L3QuNC5Jyxcblx0JzE0MzAwMTAxMDIwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LrQvtC80LzRg9C90LjQutCw0YbQuNC5Jyxcblx0JzE0MzAwMTAxMDMwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/QvtC00YrQtdC30LTQvdGL0YUg0L/Rg9GC0LXQuScsXG5cdCcxNDMwMDEwMTA0MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGB0LrQu9Cw0LTRgdC60LjRhSDQv9C+0LzQtdGJ0LXQvdC40LknLFxuXHQnMTQzMDAxMDEwNTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsNC00LzQuNC90LjRgdGC0YDQsNGC0LjQstC90YvRhSDQt9C00LDQvdC40LknLFxuXHQnMTQzMDAxMDEwNjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQutGD0LvRjNGC0YPRgNC90L4t0LHRi9GC0L7QstGL0YUg0LfQtNCw0L3QuNC5Jyxcblx0JzE0MzAwMTAxMDcwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0YHQvtC+0YDRg9C20LXQvdC40Lkg0L/RgNC+0LzRi9GI0LvQtdC90L3QvtGB0YLQuCcsXG5cdCcxNDMwMDEwMjAwMDAnOiAn0JTQu9GPINC00L7QsdGL0YfQuCDQuCDRgNCw0LfRgNCw0LHQvtGC0LrQuCDQv9C+0LvQtdC30L3Ri9GFINC40YHQutC+0L/QsNC10LzRi9GFJyxcblx0JzE0MzAwMTAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQv9GA0L7QvNGL0YjQu9C10L3QvdC+0YHRgtC4Jyxcblx0JzE0MzAwMjAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRjdC90LXRgNCz0LXRgtC40LrQuCcsXG5cdCcxNDMwMDIwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGN0LvQtdC60YLRgNC+0YHRgtCw0L3RhtC40Lkg0Lgg0L7QsdGB0LvRg9C20LjQstCw0Y7RidC40YUg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0L7QsdGK0LXQutGC0L7QsicsXG5cdCcxNDMwMDIwMTAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCz0LjQtNGA0L7RjdC70LXQutGC0YDQvtGB0YLQsNC90YbQuNC5Jyxcblx0JzE0MzAwMjAxMDIwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LDRgtC+0LzQvdGL0YUg0YHRgtCw0L3RhtC40LknLFxuXHQnMTQzMDAyMDEwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDRj9C00LXRgNC90YvRhSDRg9GB0YLQsNC90L7QstC+0LonLFxuXHQnMTQzMDAyMDEwNDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9GD0L3QutGC0L7QsiDRhdGA0LDQvdC10L3QuNGPINGP0LTQtdGA0L3Ri9GFINC80LDRgtC10YDQuNCw0LvQvtCyINC4INGA0LDQtNC40L7QsNC60YLQuNCy0L3Ri9GFINCy0LXRidC10YHRgtCyINGN0L3QtdGA0LPQtdGC0LjQutC4Jyxcblx0JzE0MzAwMjAxMDUwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YXRgNCw0L3QuNC70LjRiSDRgNCw0LTQuNC+0LDQutGC0LjQstC90YvRhSDQvtGC0YXQvtC00L7QsicsXG5cdCcxNDMwMDIwMTA2MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGC0LXQv9C70L7QstGL0YUg0YHRgtCw0L3RhtC40LknLFxuXHQnMTQzMDAyMDEwNzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDRgtC40L/QvtCyINGN0LvQtdC60YLRgNC+0YHRgtCw0L3RhtC40LknLFxuXHQnMTQzMDAyMDEwODAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YHQu9GD0LbQuNCy0LDRjtGJ0LjRhSDRgdC+0L7RgNGD0LbQtdC90LjQuSDQuCDQvtCx0YrQtdC60YLQvtCyJyxcblx0JzE0MzAwMjAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRjdC70LXQutGC0YDQvtGB0LXRgtC10LLQvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcblx0JzE0MzAwMjAyMDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LLQvtC30LTRg9GI0L3Ri9GFINC70LjQvdC40Lkg0Y3Qu9C10LrRgtGA0L7Qv9C10YDQtdC00LDRh9C4Jyxcblx0JzE0MzAwMjAyMDIwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L3QsNC30LXQvNC90YvRhSDRgdC+0L7RgNGD0LbQtdC90LjQuSDQutCw0LHQtdC70YzQvdGL0YUg0LvQuNC90LjQuSDRjdC70LXQutGC0YDQvtC/0LXRgNC10LTQsNGH0LgnLFxuXHQnMTQzMDAyMDIwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9C+0LTRgdGC0LDQvdGG0LjQuScsXG5cdCcxNDMwMDIwMjA0MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGA0LDRgdC/0YDQtdC00LXQu9C40YLQtdC70YzQvdGL0YUg0L/Rg9C90LrRgtC+0LInLFxuXHQnMTQzMDAyMDIwNTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQtNGA0YPQs9C40YUg0YHQvtC+0YDRg9C20LXQvdC40Lkg0Lgg0L7QsdGK0LXQutGC0L7QsiDRjdC70LXQutGC0YDQvtGB0LXRgtC10LLQvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcblx0JzE0MzAwMjAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDRjdC90LXRgNCz0LXRgtC40LrQuCcsXG5cdCcxNDMwMDMwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuXHQnMTQzMDAzMDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuCDRjdC60YHQv9C70YPQsNGC0LDRhtC40Lgg0L7QsdGK0LXQutGC0L7QsiDQttC10LvQtdC30L3QvtC00L7RgNC+0LbQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG5cdCcxNDMwMDMwMTAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90YvRhSDQv9GD0YLQtdC5INC4INC40YUg0LrQvtC90YHRgtGA0YPQutGC0LjQstC90YvRhSDRjdC70LXQvNC10L3RgtC+0LInLFxuXHQnMTQzMDAzMDEwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQv9C+0LvQvtGBINC+0YLQstC+0LTQsCDQttC10LvQtdC30L3QvtC00L7RgNC+0LbQvdGL0YUg0L/Rg9GC0LXQuScsXG5cdCcxNDMwMDMwMTAzMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPLCDRjdC60YHQv9C70YPQsNGC0LDRhtC40LgsINGA0LDRgdGI0LjRgNC10L3QuNGPINC4INGA0LXQutC+0L3RgdGC0YDRg9C60YbQuNC4INGB0YLRgNC+0LXQvdC40LksINC30LTQsNC90LjQuSwg0YHQvtC+0YDRg9C20LXQvdC40LksINCyINGC0L7QvCDRh9C40YHQu9C1INC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90YvRhSDQstC+0LrQt9Cw0LvQvtCyLCDQttC10LvQtdC30L3QvtC00L7RgNC+0LbQvdGL0YUg0YHRgtCw0L3RhtC40LksINCwINGC0LDQutC20LUg0YPRgdGC0YDQvtC50YHRgtCyINC4INC00YDRg9Cz0LjRhSDQvtCx0YrQtdC60YLQvtCyLCDQvdC10L7QsdGF0L7QtNC40LzRi9GFINC00LvRjyDRjdC60YHQv9C70YPQsNGC0LDRhtC40LgsINGB0L7QtNC10YDQttCw0L3QuNGPLCDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCwg0YDQtdC60L7QvdGB0YLRgNGD0LrRhtC40LgsINGA0LXQvNC+0L3RgtCwLCDRgNCw0LfQstC40YLQuNGPINC90LDQt9C10LzQvdGL0YUg0Lgg0L/QvtC00LfQtdC80L3Ri9GFINC30LTQsNC90LjQuSwg0YHRgtGA0L7QtdC90LjQuSwg0YHQvtC+0YDRg9C20LXQvdC40LksINGD0YHRgtGA0L7QudGB0YLQsiDQuCDQtNGA0YPQs9C40YUg0L7QsdGK0LXQutGC0L7QsiDQttC10LvQtdC30L3QvtC00L7RgNC+0LbQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG5cdCcxNDMwMDMwMTAzMDEnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC20LXQu9C10LfQvdC+0LTQvtGA0L7QttC90YvRhSDQstC+0LrQt9Cw0LvQvtCyJyxcblx0JzE0MzAwMzAxMDMwMic6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LbQtdC70LXQt9C90L7QtNC+0YDQvtC20L3Ri9GFINGB0YLQsNC90YbQuNC5Jyxcblx0JzE0MzAwMzAxMDMwMyc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YPRgdGC0YDQvtC50YHRgtCyINC4INC00YDRg9Cz0LjRhSDQvtCx0YrQtdC60YLQvtCyLCDQvdC10L7QsdGF0L7QtNC40LzRi9GFINC00LvRjyDRjdC60YHQv9C70YPQsNGC0LDRhtC40LgsINGB0L7QtNC10YDQttCw0L3QuNGPLCDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsCwg0YDQtdC60L7QvdGB0YLRgNGD0LrRhtC40LgsINGA0LXQvNC+0L3RgtCwLCDRgNCw0LfQstC40YLQuNGPINC90LDQt9C10LzQvdGL0YUg0Lgg0L/QvtC00LfQtdC80L3Ri9GFINC30LTQsNC90LjQuSwg0YHRgtGA0L7QtdC90LjQuSwg0YHQvtC+0YDRg9C20LXQvdC40LksINGD0YHRgtGA0L7QudGB0YLQsiDQuCDQtNGA0YPQs9C40YUg0L7QsdGK0LXQutGC0L7QsiDQttC10LvQtdC30L3QvtC00L7RgNC+0LbQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG5cdCcxNDMwMDMwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC4INGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCDQvtCx0YrQtdC60YLQvtCyINCw0LLRgtC+0LzQvtCx0LjQu9GM0L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAg0Lgg0L7QsdGK0LXQutGC0L7QsiDQtNC+0YDQvtC20L3QvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcblx0JzE0MzAwMzAyMDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LDQstGC0L7QvNC+0LHQuNC70YzQvdGL0YUg0LTQvtGA0L7QsyDQuCDQuNGFINC60L7QvdGB0YLRgNGD0LrRgtC40LLQvdGL0YUg0Y3Qu9C10LzQtdC90YLQvtCyJyxcblx0JzE0MzAwMzAyMDIwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/QvtC70L7RgSDQvtGC0LLQvtC00LAnLFxuXHQnMTQzMDAzMDIwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC00L7RgNC+0LbQvdC+0LPQviDRgdC10YDQstC40YHQsCDQsiDQv9C+0LvQvtGB0LDRhSDQvtGC0LLQvtC00LAg0LDQstGC0L7QvNC+0LHQuNC70YzQvdGL0YUg0LTQvtGA0L7QsycsXG5cdCcxNDMwMDMwMjA0MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC00L7RgNC+0LbQvdGL0YUg0YHQvtC+0YDRg9C20LXQvdC40LknLFxuXHQnMTQzMDAzMDIwNTAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsNCy0YLQvtCy0L7QutC30LDQu9C+0LIg0Lgg0LDQstGC0L7RgdGC0LDQvdGG0LjQuScsXG5cdCcxNDMwMDMwMjA2MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0LDQstGC0L7QvNC+0LHQuNC70YzQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCDQuCDQtNC+0YDQvtC20L3QvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcblx0JzE0MzAwMzAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0Lgg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4INC+0LHRitC10LrRgtC+0LIg0LzQvtGA0YHQutC+0LPQviwg0LLQvdGD0YLRgNC10L3QvdC10LPQviDQstC+0LTQvdC+0LPQviDRgtGA0LDQvdGB0L/QvtGA0YLQsCcsXG5cdCcxNDMwMDMwMzAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40YHQutGD0YHRgdGC0LLQtdC90L3QviDRgdC+0LfQtNCw0L3QvdGL0YUg0LLQvdGD0YLRgNC10L3QvdC40YUg0LLQvtC00L3Ri9GFINC/0YPRgtC10LknLFxuXHQnMTQzMDAzMDMwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvNC+0YDRgdC60LjRhSDQuCDRgNC10YfQvdGL0YUg0L/QvtGA0YLQvtCyLCDQv9GA0LjRh9Cw0LvQvtCyLCDQv9GA0LjRgdGC0LDQvdC10LknLFxuXHQnMTQzMDAzMDMwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC80L7RgNGB0LrQvtCz0L4sINCy0L3Rg9GC0YDQtdC90L3QtdCz0L4g0LLQvtC00L3QvtCz0L4g0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuXHQnMTQzMDAzMDMwNDAwJzogJ9CU0LvRjyDQstGL0LTQtdC70LXQvdC40Y8g0LHQtdGA0LXQs9C+0LLQvtC5INC/0L7Qu9C+0YHRiycsXG5cdCcxNDMwMDMwNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC4INGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQuCDQvtCx0YrQtdC60YLQvtCyINCy0L7Qt9C00YPRiNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcblx0JzE0MzAwMzA0MDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LDRjdGA0L7Qv9C+0YDRgtC+0LIg0Lgg0LDRjdGA0L7QtNGA0L7QvNC+0LInLFxuXHQnMTQzMDAzMDQwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQsNGN0YDQvtCy0L7QutC30LDQu9C+0LInLFxuXHQnMTQzMDAzMDQwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQstC30LvQtdGC0L3Qvi3Qv9C+0YHQsNC00L7Rh9C90YvRhSDQv9C+0LvQvtGBJyxcblx0JzE0MzAwMzA0MDQwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L3QsNC30LXQvNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINCy0L7Qt9C00YPRiNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcblx0JzE0MzAwMzA1MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0Lgg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4INC+0LHRitC10LrRgtC+0LIg0YLRgNGD0LHQvtC/0YDQvtCy0L7QtNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcblx0JzE0MzAwMzA1MDEwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L3QtdGE0YLQtdC/0YDQvtCy0L7QtNC+0LInLFxuXHQnMTQzMDAzMDUwMjAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQs9Cw0LfQvtC/0YDQvtCy0L7QtNC+0LInLFxuXHQnMTQzMDAzMDUwMzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDRgtGA0YPQsdC+0L/RgNC+0LLQvtC00L7QsicsXG5cdCcxNDMwMDMwNTA0MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0YLRgNGD0LHQvtC/0YDQvtCy0L7QtNC90L7Qs9C+INGC0YDQsNC90YHQv9C+0YDRgtCwJyxcblx0JzE0MzAwMzA2MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0Lgg0Y3QutGB0L/Qu9GD0LDRgtCw0YbQuNC4INC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0YLRgNCw0L3RgdC/0L7RgNGC0LAnLFxuXHQnMTQzMDA0MDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINGB0LLRj9C30LgsINGA0LDQtNC40L7QstC10YnQsNC90LjRjywg0YLQtdC70LXQstC40LTQtdC90LjRjywg0LjQvdGE0L7RgNC80LDRgtC40LrQuCcsXG5cdCcxNDMwMDQwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGN0LrRgdC/0LvRg9Cw0YLQsNGG0LjQvtC90L3Ri9GFINC/0YDQtdC00L/RgNC40Y/RgtC40Lkg0YHQstGP0LfQuCDQuCDQvtCx0YHQu9GD0LbQuNCy0LDQvdC40Y8g0LvQuNC90LjQuSDRgdCy0Y/Qt9C4Jyxcblx0JzE0MzAwNDAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LrQsNCx0LXQu9GM0L3Ri9GFLCDRgNCw0LTQuNC+0YDQtdC70LXQudC90YvRhSDQuCDQstC+0LfQtNGD0YjQvdGL0YUg0LvQuNC90LjQuSDRgdCy0Y/Qt9C4INC4INC70LjQvdC40Lkg0YDQsNC00LjQvtGE0LjQutCw0YbQuNC4INC90LAg0YLRgNCw0YHRgdCw0YUg0LrQsNCx0LXQu9GM0L3Ri9GFINC4INCy0L7Qt9C00YPRiNC90YvRhSDQu9C40L3QuNC5INGB0LLRj9C30Lgg0Lgg0YDQsNC00LjQvtGE0LjQutCw0YbQuNC4INC4INC40YUg0L7RhdGA0LDQvdC90YvQtSDQt9C+0L3RiycsXG5cdCcxNDMwMDQwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0L7QtNC30LXQvNC90YvRhSDQutCw0LHQtdC70YzQvdGL0YUg0Lgg0LLQvtC30LTRg9GI0L3Ri9GFINC70LjQvdC40Lkg0YHQstGP0LfQuCDQuCDRgNCw0LTQuNC+0YTQuNC60LDRhtC40Lgg0Lgg0LjRhSDQvtGF0YDQsNC90L3Ri9C1INC30L7QvdGLJyxcblx0JzE0MzAwNDA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L3QsNC30LXQvNC90YvRhSDQuCDQv9C+0LTQt9C10LzQvdGL0YUg0L3QtdC+0LHRgdC70YPQttC40LLQsNC10LzRi9GFINGD0YHQuNC70LjRgtC10LvRjNC90YvRhSDQv9GD0L3QutGC0L7QsiDQvdCwINC60LDQsdC10LvRjNC90YvRhSDQu9C40L3QuNGP0YUg0YHQstGP0LfQuCDQuCDQuNGFINC+0YXRgNCw0L3QvdGL0LUg0LfQvtC90YsnLFxuXHQnMTQzMDA0MDUwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvdCw0LfQtdC80L3Ri9GFINGB0L7QvtGA0YPQttC10L3QuNC5INC4INC40L3RhNGA0LDRgdGC0YDRg9C60YLRg9GAINGB0L/Rg9GC0L3QuNC60L7QstC+0Lkg0YHQstGP0LfQuCcsXG5cdCcxNDMwMDQwNjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0YHQstGP0LfQuCwg0YDQsNC00LjQvtCy0LXRidCw0L3QuNGPLCDRgtC10LvQtdCy0LjQtNC10L3QuNGPLCDQuNC90YTQvtGA0LzQsNGC0LjQutC4Jyxcblx0JzE0MzAwNTAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7Qsiwg0L/RgNC10LTQvdCw0LfQvdCw0YfQtdC90L3Ri9GFINC00LvRjyDQvtCx0LXRgdC/0LXRh9C10L3QuNGPINC60L7RgdC80LjRh9C10YHQutC+0Lkg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4Jyxcblx0JzE0MzAwNTAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LrQvtGB0LzQvtC00YDQvtC80L7Qsiwg0YHRgtCw0YDRgtC+0LLRi9GFINC60L7QvNC/0LvQtdC60YHQvtCyINC4INC/0YPRgdC60L7QstGL0YUg0YPRgdGC0LDQvdC+0LLQvtC6Jyxcblx0JzE0MzAwNTAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LrQvtC80LDQvdC00L3Qvi3QuNC30LzQtdGA0LjRgtC10LvRjNC90YvRhSDQutC+0LzQv9C70LXQutGB0L7Qsiwg0YbQtdC90YLRgNC+0LIg0Lgg0L/Rg9C90LrRgtC+0LIg0YPQv9GA0LDQstC70LXQvdC40Y8g0L/QvtC70LXRgtCw0LzQuCDQutC+0YHQvNC40YfQtdGB0LrQuNGFINC+0LHRitC10LrRgtC+0LIsINC/0YDQuNC10LzQsCwg0YXRgNCw0L3QtdC90LjRjyDQuCDQv9C10YDQtdGA0LDQsdC+0YLQutC4INC40L3RhNC+0YDQvNCw0YbQuNC4Jyxcblx0JzE0MzAwNTAzMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LHQsNC3INGF0YDQsNC90LXQvdC40Y8g0LrQvtGB0LzQuNGH0LXRgdC60L7QuSDRgtC10YXQvdC40LrQuCcsXG5cdCcxNDMwMDUwNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC/0L7Qu9C40LPQvtC90L7QsiDQv9GA0LjQt9C10LzQu9C10L3QuNGPINC60L7RgdC80LjRh9C10YHQutC40YUg0L7QsdGK0LXQutGC0L7QsiDQuCDQstC30LvQtdGC0L3Qvi3Qv9C+0YHQsNC00L7Rh9C90YvRhSDQv9C+0LvQvtGBJyxcblx0JzE0MzAwNTA1MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRjdC60YHQv9C10YDQuNC80LXQvdGC0LDQu9GM0L3QvtC5INCx0LDQt9GLINC00LvRjyDQvtGC0YDQsNCx0L7RgtC60Lgg0LrQvtGB0LzQuNGH0LXRgdC60L7QuSDRgtC10YXQvdC40LrQuCcsXG5cdCcxNDMwMDUwNjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGG0LXQvdGC0YDQvtCyINC4INC+0LHQvtGA0YPQtNC+0LLQsNC90LjRjyDQtNC70Y8g0L/QvtC00LPQvtGC0L7QstC60Lgg0LrQvtGB0LzQvtC90LDQstGC0L7QsicsXG5cdCcxNDMwMDUwNzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC00YDRg9Cz0LjRhSDQvdCw0LfQtdC80L3Ri9GFINGB0L7QvtGA0YPQttC10L3QuNC5INC4INGC0LXRhdC90LjQutC4LCDQuNGB0L/QvtC70YzQt9GD0LXQvNGL0YUg0L/RgNC4INC+0YHRg9GJ0LXRgdGC0LLQu9C10L3QuNC4INC60L7RgdC80LjRh9C10YHQutC+0Lkg0LTQtdGP0YLQtdC70YzQvdC+0YHRgtC4Jyxcblx0JzE0MzAwNjAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7Qsiwg0L/RgNC10LTQvdCw0LfQvdCw0YfQtdC90L3Ri9GFINC00LvRjyDQvtCx0LXRgdC/0LXRh9C10L3QuNGPINC+0LHQvtGA0L7QvdGLINC4INCx0LXQt9C+0L/QsNGB0L3QvtGB0YLQuCcsXG5cdCcxNDMwMDYwMTAwMDAnOiAn0JTQu9GPINC+0LHQtdGB0L/QtdGH0LXQvdC40Y8g0LfQsNC00LDRhyDQvtCx0L7RgNC+0L3RiycsXG5cdCcxNDMwMDYwMTAxMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCy0L7QtdC90L3Ri9GFINC+0YDQs9Cw0L3QuNC30LDRhtC40LksINGD0YfRgNC10LbQtNC10L3QuNC5INC4INC00YDRg9Cz0LjRhSDQvtCx0YrQtdC60YLQvtCyJyxcblx0JzE0MzAwNjAxMDIwMCc6ICfQlNC70Y8g0LTQuNGB0LvQvtC60LDRhtC40Lgg0LLQvtC50YHQuiDQuCDRgdC40Lsg0YTQu9C+0YLQsCcsXG5cdCcxNDMwMDYwMTAzMDAnOiAn0JTQu9GPINC/0YDQvtCy0LXQtNC10L3QuNGPINGD0YfQtdC90LjQuSDQuCDQuNC90YvRhSDQvNC10YDQvtC/0YDQuNGP0YLQuNC5Jyxcblx0JzE0MzAwNjAxMDQwMCc6ICfQlNC70Y8g0LjRgdC/0YvRgtCw0YLQtdC70YzQvdGL0YUg0L/QvtC70LjQs9C+0L3QvtCyJyxcblx0JzE0MzAwNjAxMDUwMCc6ICfQlNC70Y8g0LzQtdGB0YIg0YPQvdC40YfRgtC+0LbQtdC90LjRjyDQvtGA0YPQttC40Y8g0Lgg0LfQsNGF0L7RgNC+0L3QtdC90LjRjyDQvtGC0YXQvtC00L7QsicsXG5cdCcxNDMwMDYwMTA2MDAnOiAn0JTQu9GPINGB0L7Qt9C00LDQvdC40Y8g0LfQsNC/0LDRgdC+0LIg0LzQsNGC0LXRgNC40LDQu9GM0L3Ri9GFINGG0LXQvdC90L7RgdGC0LXQuSDQsiDQs9C+0YHRg9C00LDRgNGB0YLQstC10L3QvdC+0Lwg0Lgg0LzQvtCx0LjQu9C40LfQsNGG0LjQvtC90L3QvtC8INGA0LXQt9C10YDQstCw0YUgKNGF0YDQsNC90LjQu9C40YnQsCwg0YHQutC70LDQtNGLINC4INC00YDRg9Cz0LjQtSknLFxuXHQnMTQzMDA2MDEwNzAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDQvtCx0YrQtdC60YLQvtCyINC+0LHQvtGA0L7QvdGLJyxcblx0JzE0MzAwNjAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiAo0YLQtdGA0YDQuNGC0L7RgNC40LkpLCDQvtCx0LXRgdC/0LXRh9C40LLQsNGO0YnQuNGFINC30LDRidC40YLRgyDQuCDQvtGF0YDQsNC90YMg0JPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCz0YDQsNC90LjRhtGLINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCcxNDMwMDYwMjAxMDAnOiAn0JTQu9GPINC+0LHRg9GB0YLRgNC+0LnRgdGC0LLQsCDQuCDRgdC+0LTQtdGA0LbQsNC90LjRjyDQuNC90LbQtdC90LXRgNC90L4t0YLQtdGF0L3QuNGH0LXRgdC60LjRhSDRgdC+0L7RgNGD0LbQtdC90LjQuSDQuCDQt9Cw0LPRgNCw0LbQtNC10L3QuNC5Jyxcblx0JzE0MzAwNjAyMDIwMCc6ICfQlNC70Y8g0L7QsdGD0YHRgtGA0L7QudGB0YLQstCwINC4INGB0L7QtNC10YDQttCw0L3QuNGPINC/0L7Qs9GA0LDQvdC40YfQvdGL0YUg0LfQvdCw0LrQvtCyJyxcblx0JzE0MzAwNjAyMDMwMCc6ICfQlNC70Y8g0L7QsdGD0YHRgtGA0L7QudGB0YLQstCwINC4INGB0L7QtNC10YDQttCw0L3QuNGPINC/0L7Qs9GA0LDQvdC40YfQvdGL0YUg0L/RgNC+0YHQtdC6Jyxcblx0JzE0MzAwNjAyMDQwMCc6ICfQlNC70Y8g0L7QsdGD0YHRgtGA0L7QudGB0YLQstCwINC4INGB0L7QtNC10YDQttCw0L3QuNGPINC60L7QvNC80YPQvdC40LrQsNGG0LjQuScsXG5cdCcxNDMwMDYwMjA1MDAnOiAn0JTQu9GPINC+0LHRg9GB0YLRgNC+0LnRgdGC0LLQsCDQuCDRgdC+0LTQtdGA0LbQsNC90LjRjyDQv9GD0L3QutGC0L7QsiDQv9GA0L7Qv9GD0YHQutCwINGH0LXRgNC10Lcg0JPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Rg9GOINCz0YDQsNC90LjRhtGDINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCcxNDMwMDYwMjA2MDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0LTQu9GPINC30LDRidC40YLRiyDQuCDQvtGF0YDQsNC90Ysg0JPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3QvtC5INCz0YDQsNC90LjRhtGLINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCcsXG5cdCcxNDMwMDYwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0LHRitC10LrRgtC+0LIg0L7QsdC+0YDQvtC90Ysg0Lgg0LHQtdC30L7Qv9Cw0YHQvdC+0YHRgtC4Jyxcblx0JzE0MzAwNzAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiDQv9GA0L7QvNGL0YjQu9C10L3QvdC+0YHRgtC4LCDRjdC90LXRgNCz0LXRgtC40LrQuCwg0YLRgNCw0L3RgdC/0L7RgNGC0LAsINGB0LLRj9C30LgsINGA0LDQtNC40L7QstC10YnQsNC90LjRjywg0YLQtdC70LXQstC40LTQtdC90LjRjywg0LjQvdGE0L7RgNC80LDRgtC40LrQuCwg0L7QsdC10YHQv9C10YfQtdC90LjRjyDQutC+0YHQvNC40YfQtdGB0LrQvtC5INC00LXRj9GC0LXQu9GM0L3QvtGB0YLQuCwg0L7QsdC+0YDQvtC90YssINCx0LXQt9C+0L/QsNGB0L3QvtGB0YLQuCDQuCDQuNC90L7Qs9C+INGB0L/QtdGG0LjQsNC70YzQvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCcxNDQwMDAwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0YHQvtCx0L4g0L7RhdGA0LDQvdGP0LXQvNGL0YUg0LjRgdGC0L7RgNC40LrQvi3QutGD0LvRjNGC0YPRgNC90YvRhSDQuCDQv9GA0LjRgNC+0LTQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiAo0YLQtdGA0YDQuNGC0L7RgNC40LkpJyxcblx0JzE0NDAwMTAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80YvRhSDQv9GA0LjRgNC+0LTQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiAo0YLQtdGA0YDQuNGC0L7RgNC40LkpJyxcblx0JzE0NDAwMTAxMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LPQvtGB0YPQtNCw0YDRgdGC0LLQtdC90L3Ri9GFINC/0YDQuNGA0L7QtNC90YvRhSDQt9Cw0L/QvtCy0LXQtNC90LjQutC+0LIgKNCyINGC0L7QvCDRh9C40YHQu9C1INCx0LjQvtGB0YTQtdGA0L3Ri9GFKScsXG5cdCcxNDQwMDEwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCz0L7RgdGD0LTQsNGA0YHRgtCy0LXQvdC90YvRhSDQv9GA0LjRgNC+0LTQvdGL0YUg0LfQsNC60LDQt9C90LjQutC+0LInLFxuXHQnMTQ0MDAxMDMwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvdCw0YbQuNC+0L3QsNC70YzQvdGL0YUg0L/QsNGA0LrQvtCyJyxcblx0JzE0NDAwMTA0MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/RgNC40YDQvtC00L3Ri9GFINC/0LDRgNC60L7QsicsXG5cdCcxNDQwMDEwNTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC00LXQvdC00YDQvtC70L7Qs9C40YfQtdGB0LrQuNGFINC/0LDRgNC60L7QsicsXG5cdCcxNDQwMDEwNjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCx0L7RgtCw0L3QuNGH0LXRgdC60LjRhSDRgdCw0LTQvtCyJyxcblx0JzE0NDAwMTA3MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRgdCw0L3QsNGC0L7RgNC90L7Qs9C+INC4INC60YPRgNC+0YDRgtC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzE0NDAwMTA4MDAwMCc6ICfQotC10YDRgNC40YLQvtGA0LjQuCDQvNC10YHRgtC+0YDQvtC20LTQtdC90LjQuSDQvNC40L3QtdGA0LDQu9GM0L3Ri9GFINCy0L7QtCwg0LvQtdGH0LXQsdC90YvRhSDQs9GA0Y/Qt9C10LksINGA0LDQv9GLINC70LjQvNCw0L3QvtCyINC4INC+0LfQtdGAJyxcblx0JzE0NDAwMTA5MDAwMCc6ICfQlNC70Y8g0YLRgNCw0LTQuNGG0LjQvtC90L3QvtCz0L4g0L/RgNC40YDQvtC00L7Qv9C+0LvRjNC30L7QstCw0L3QuNGPJyxcblx0JzE0NDAwMTEwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7RgdC+0LHQviDQvtGF0YDQsNC90Y/QtdC80YvRhSDQv9GA0LjRgNC+0LTQvdGL0YUg0YLQtdGA0YDQuNGC0L7RgNC40LkgKNC+0LHRitC10LrRgtC+0LIpJyxcblx0JzE0NDAwMjAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiAo0YLQtdGA0YDQuNGC0L7RgNC40LkpINC/0YDQuNGA0L7QtNC+0L7RhdGA0LDQvdC90L7Qs9C+INC90LDQt9C90LDRh9C10L3QuNGPJyxcblx0JzE0NDAwMzAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiAo0YLQtdGA0YDQuNGC0L7RgNC40LkpINGA0LXQutGA0LXQsNGG0LjQvtC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMTQ0MDAzMDEwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQtNC+0LzQvtCyINC+0YLQtNGL0YXQsCwg0L/QsNC90YHQuNC+0L3QsNGC0L7Qsiwg0LrQtdC80L/QuNC90LPQvtCyJyxcblx0JzE0NDAwMzAyMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDRhNC40LfQuNGH0LXRgdC60L7QuSDQutGD0LvRjNGC0YPRgNGLINC4INGB0L/QvtGA0YLQsCcsXG5cdCcxNDQwMDMwMzAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGC0YPRgNC40YHRgtC40YfQtdGB0LrQuNGFINCx0LDQtywg0YHRgtCw0YbQuNC+0L3QsNGA0L3Ri9GFINC4INC/0LDQu9Cw0YLQvtGH0L3Ri9GFINGC0YPRgNC40YHRgtGB0LrQvi3QvtC30LTQvtGA0L7QstC40YLQtdC70YzQvdGL0YUg0LvQsNCz0LXRgNC10LksINC00L7QvNC+0LIg0YDRi9Cx0L7Qu9C+0LLQsCDQuCDQvtGF0L7RgtC90LjQutCwLCDQtNC10YLRgdC60LjRhSDRgtGD0YDQuNGB0YLQuNGH0LXRgdC60LjRhSDRgdGC0LDQvdGG0LjQuScsXG5cdCcxNDQwMDMwNDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGC0YPRgNC40YHRgtC40YfQtdGB0LrQuNGFINC/0LDRgNC60L7QsicsXG5cdCcxNDQwMDMwNTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC70LXRgdC+0L/QsNGA0LrQvtCyJyxcblx0JzE0NDAwMzA2MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0YPRh9C10LHQvdC+LdGC0YPRgNC40YHRgtC40YfQtdGB0LrQuNGFINGC0YDQvtC/INC4INGC0YDQsNGB0YEnLFxuXHQnMTQ0MDAzMDcwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQtNC10YLRgdC60LjRhSDQuCDRgdC/0L7RgNGC0LjQstC90YvRhSDQu9Cw0LPQtdGA0LXQuScsXG5cdCcxNDQwMDMwODAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINGB0LrQstC10YDQvtCyLCDQv9Cw0YDQutC+0LIsINCz0L7RgNC+0LTRgdC60LjRhSDRgdCw0LTQvtCyJyxcblx0JzE0NDAwMzA5MDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L/Qu9GP0LbQtdC5Jyxcblx0JzE0NDAwMzEwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LjQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiAo0YLQtdGA0YDQuNGC0L7RgNC40LkpINGA0LXQutGA0LXQsNGG0LjQvtC90L3QvtCz0L4g0L3QsNC30L3QsNGH0LXQvdC40Y8nLFxuXHQnMTQ0MDA0MDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQvtCx0YrQtdC60YLQvtCyINC40YHRgtC+0YDQuNC60L4t0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0LfQvdCw0YfQtdC90LjRjycsXG5cdCcxNDQwMDQwMTAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC+0LHRitC10LrRgtC+0LIg0LrRg9C70YzRgtGD0YDQvdC+0LPQviDQvdCw0YHQu9C10LTQuNGPINC90LDRgNC+0LTQvtCyINCg0L7RgdGB0LjQudGB0LrQvtC5INCk0LXQtNC10YDQsNGG0LjQuCAo0L/QsNC80Y/RgtC90LjQutC+0LIg0LjRgdGC0L7RgNC40Lgg0Lgg0LrRg9C70YzRgtGD0YDRiyksINCyINGC0L7QvCDRh9C40YHQu9C1INC+0LHRitC10LrRgtC+0LIg0LDRgNGF0LXQvtC70L7Qs9C40YfQtdGB0LrQvtCz0L4g0L3QsNGB0LvQtdC00LjRjycsXG5cdCcxNDQwMDQwMjAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINCy0L7QtdC90L3Ri9GFINC4INCz0YDQsNC20LTQsNC90YHQutC40YUg0LfQsNGF0L7RgNC+0L3QtdC90LjQuScsXG5cdCcxNDQwMDUwMDAwMDAnOiAn0JTQu9GPINGA0LDQt9C80LXRidC10L3QuNGPINC40L3Ri9GFINC+0YHQvtCx0L4g0L7RhdGA0LDQvdGP0LXQvNGL0YUg0LjRgdGC0L7RgNC40LrQvi3QutGD0LvRjNGC0YPRgNC90YvRhSDQuCDQv9GA0LjRgNC+0LTQvdGL0YUg0L7QsdGK0LXQutGC0L7QsiAo0YLQtdGA0YDQuNGC0L7RgNC40LkpJyxcblx0JzE0NTAwMDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQu9C10YHQvdC+0LPQviDRhNC+0L3QtNCwJyxcblx0JzE0NTAwMTAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LvQtdGB0L3QvtC5INGA0LDRgdGC0LjRgtC10LvRjNC90L7RgdGC0LgnLFxuXHQnMTQ1MDAyMDAwMDAwJzogJ9CU0LvRjyDQstC+0YHRgdGC0LDQvdC+0LLQu9C10L3QuNGPINC70LXRgdC90L7QuSDRgNCw0YHRgtC40YLQtdC70YzQvdC+0YHRgtC4Jyxcblx0JzE0NTAwMzAwMDAwMCc6ICfQlNC70Y8g0L/RgNC+0YfQuNGFINC+0LHRitC10LrRgtC+0LIg0LvQtdGB0L3QvtCz0L4g0YXQvtC30Y/QudGB0YLQstCwJyxcblx0JzE0NjAwMDAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0L7QsdGK0LXQutGC0L7QsiDQstC+0LTQvdC+0LPQviDRhNC+0L3QtNCwJyxcblx0JzE0NjAwMTAwMDAwMCc6ICfQn9C+0LQg0LLQvtC00L3Ri9C80Lgg0L7QsdGK0LXQutGC0LDQvNC4Jyxcblx0JzE0NjAwMjAwMDAwMCc6ICfQlNC70Y8g0YDQsNC30LzQtdGJ0LXQvdC40Y8g0LPQuNC00YDQvtGC0LXRhdC90LjRh9C10YHQutC40YUg0YHQvtC+0YDRg9C20LXQvdC40LknLFxuXHQnMTQ2MDAzMDAwMDAwJzogJ9CU0LvRjyDRgNCw0LfQvNC10YnQtdC90LjRjyDQuNC90YvRhSDRgdC+0L7RgNGD0LbQtdC90LjQuSwg0YDQsNGB0L/QvtC70L7QttC10L3QvdGL0YUg0L3QsCDQstC+0LTQvdGL0YUg0L7QsdGK0LXQutGC0LDRhScsXG5cdCcxNDcwMDAwMDAwMDAnOiAn0JfQtdC80LvQuCDQt9Cw0L/QsNGB0LAgKNC90LXQuNGB0L/QvtC70YzQt9GD0LXQvNGL0LUpJ1xufTtcbi8vINCd0LDQt9C90LDRh9C10L3QuNC1INC30LTQsNC90LjQuVxudmFyIGRBc3NCdWlsZGluZyA9IHtcblx0JzIwNDAwMTAwMDAwMCc6ICfQndC10LbQuNC70L7QtSDQt9C00LDQvdC40LUnLFxuXHQnMjA0MDAyMDAwMDAwJzogJ9CW0LjQu9C+0Lkg0LTQvtC8Jyxcblx0JzIwNDAwMzAwMDAwMCc6ICfQnNC90L7Qs9C+0LrQstCw0YDRgtC40YDQvdGL0Lkg0LTQvtC8J1xufTtcblxudmFyIFBhcmNlbFByb3BlcnRpZXM7XG52YXIgQ29uc3RydWN0aW9uUHJvcGVydGllcztcbnZhciBVbmNvbXBsZXRlZFByb3BlcnRpZXM7XG52YXIgQnVpbGRpbmdQcm9wZXJ0aWVzO1xudmFyIFpvbmVQcm9wZXJ0aWVzO1xudmFyIEJvdW5kUHJvcGVydGllcztcblxuZnVuY3Rpb24gZ2V0VmFsdWVGcm9tRGljdChLZXksIERpYykge1xuICAgIGZvciAodmFyIGsgaW4gRGljKSB7XG4gICAgICAgIGlmIChrID09PSBLZXkpIHtcbiAgICAgICAgICAgIHJldHVybiBEaWNba107XG4gICAgICAgIH1cbiAgICB9XG59XG5cbm1vZHVsZS5leHBvcnRzLmdldFByb3BlcnRpZXMgPSBmdW5jdGlvbiAoRmVhdHVyZSwgRmVhdHVyZVR5cGUpIHtcbiAgICBzd2l0Y2ggKEZlYXR1cmVUeXBlKSB7XG4gICAgICAgIGNhc2UgJ1BhcmNlbCcgOlxuICAgICAgICB7XG4gICAgICAgICAgICBQYXJjZWxQcm9wZXJ0aWVzID0ge1xuICAgICAgICAgICAgICAgIFwi0JrQsNC00LDRgdGC0YDQvtCy0YvQuSDQvdC+0LzQtdGAXCI6ICcnLCAvLyByZXF1aXJlXG4gICAgICAgICAgICAgICAgXCLQodGC0LDRgtGD0YFcIjogJzAxJywgLy8gZFN0YXRlcyByZXF1aXJlXG4gICAgICAgICAgICAgICAgXCLQlNCw0YLQsCDRgdC+0LfQtNCw0L3QuNGPXCI6ICcnLFxuICAgICAgICAgICAgICAgIFwi0KLQuNC/INC+0LHRitC10LrRgtCwXCI6ICcnLCAvL2RQYXJjZWxzIHJlcXVpcmVcbiAgICAgICAgICAgICAgICBcItCa0LDRgtC10LPQvtGA0LjRjyDQt9C10LzQtdC70YxcIjogJycsIC8vIGRDYXRlZ29yaWVzIC8vIHJlcXVpcmVcbiAgICAgICAgICAgICAgICBcItCf0LvQvtGJ0LDQtNGMXCI6IHsvLyByZXF1cmVcbiAgICAgICAgICAgICAgICAgICAgXCLQl9C90LDRh9C10L3QuNC1XCI6IDAsIC8vIHJlcXVpcmVcbiAgICAgICAgICAgICAgICAgICAgXCLQtdC0LtC40LfQvFwiOiAnJywgLy9kVW5pdCByZXF1aXJlXG4gICAgICAgICAgICAgICAgICAgIFwi0KLQvtGH0L3QvtGB0YLRjFwiOiAnJyAvLyBkMjBfMlxuICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXCLQoNCw0LfRgNC10YjRkdC90L3QvtC1INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNC1XCI6IHsvLyByZXF1aXJlXG4gICAgICAgICAgICAgICAgICAgIFwi0L/QviDQtNC+0LrRg9C80LXQvdGC0YNcIjogJycsXG4gICAgICAgICAgICAgICAgICAgIFwi0L/QviDRgdC/0YDQsNCy0L7Rh9C90LjQutGDXCI6ICcnIC8vIGRVdGlsaXphdGlvbiByZXF1aXJlXG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfTtcbiAgICAgICAgICAgIFBhcmNlbFByb3BlcnRpZXNbXCLQmtCw0LTQsNGB0YLRgNC+0LLRi9C5INC90L7QvNC10YBcIl0gPSBGZWF0dXJlLkNhZGFzdHJhbE51bWJlcjtcbiAgICAgICAgICAgIFBhcmNlbFByb3BlcnRpZXNbXCLQodGC0LDRgtGD0YFcIl0gPSBnZXRWYWx1ZUZyb21EaWN0KEZlYXR1cmUuU3RhdGUsIGRTdGF0ZXMpO1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllc1tcItCi0LjQvyDQvtCx0YrQtdC60YLQsFwiXSA9IGdldFZhbHVlRnJvbURpY3QoRmVhdHVyZS5OYW1lLCBkUGFyY2Vscyk7XG4gICAgICAgICAgICBQYXJjZWxQcm9wZXJ0aWVzW1wi0JrQsNGC0LXQs9C+0YDQuNGPINC30LXQvNC10LvRjFwiXSA9IGdldFZhbHVlRnJvbURpY3QoRmVhdHVyZS5DYXRlZ29yeSwgZENhdGVnb3JpZXMpO1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllc1tcItCU0LDRgtCwINGB0L7Qt9C00LDQvdC40Y9cIl0gPSBGZWF0dXJlLkRhdGVDcmVhdGVkO1xuICAgICAgICAgICAgUGFyY2VsUHJvcGVydGllc1tcItCg0LDQt9GA0LXRiNGR0L3QvdC+0LUg0LjRgdC/0L7Qu9GM0LfQvtCy0LDQvdC40LVcIl1bXCLQv9C+INGB0L/RgNCw0LLQvtGH0L3QuNC60YNcIl0gPSBcbiAgICAgICAgICAgICAgICAgICAgZ2V0VmFsdWVGcm9tRGljdChGZWF0dXJlLlV0aWxpemF0aW9uLlV0aWxpemF0aW9uLCBkVXRpbGl6YXRpb25zKTtcbiAgICAgICAgICAgIFBhcmNlbFByb3BlcnRpZXNbXCLQoNCw0LfRgNC10YjRkdC90L3QvtC1INC40YHQv9C+0LvRjNC30L7QstCw0L3QuNC1XCJdW1wi0L/QviDQtNC+0LrRg9C80LXQvdGC0YNcIl0gPSBGZWF0dXJlLlV0aWxpemF0aW9uLkJ5RG9jO1xuICAgICAgICAgICAgYnJlYWs7XG4gICAgICAgIH1cbiAgICAgICAgY2FzZSAnQ29uc3RydWN0aW9uJzp7XG4gICAgICAgICAgICBDb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzID0ge1xuICAgICAgICAgICAgICAgIGNhZGFzdHJlTnVtYmVyOiAnJywgLy8gXG4gICAgICAgICAgICAgICAgT2JqZWN0VHlwZTogJycsIC8vIHJlcXVpcmVcbiAgICAgICAgICAgICAgICBBc3NpZ25hdGlvbk5hbWU6ICcnXG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBpZiAoRmVhdHVyZS5DYWRhc3RyYWxOdW1iZXIpIHtcbiAgICAgICAgICAgICAgICBDb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyID0gRmVhdHVyZS5DYWRhc3RyYWxOdW1iZXI7XG4gICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgIENvbnN0cnVjdGlvblByb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIgPSAnJztcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIFxuICAgICAgICAgICAgQ29uc3RydWN0aW9uUHJvcGVydGllcy5Bc3NpZ25hdGlvbk5hbWUgPSBGZWF0dXJlLkFzc2lnbmF0aW9uTmFtZTtcbiAgICAgICAgICAgIENvbnN0cnVjdGlvblByb3BlcnRpZXMuT2JqZWN0VHlwZSA9IGdldFZhbHVlRnJvbURpY3QoRmVhdHVyZS5PYmplY3RUeXBlLCBkWm9uZSk7XG4gICAgICAgIH1cbiAgICAgICAgY2FzZSAnQnVpbGRpbmcnOntcbiAgICAgICAgICAgIENvbnN0cnVjdGlvblByb3BlcnRpZXMgPSB7XG4gICAgICAgICAgICAgICAgY2FkYXN0cmVOdW1iZXI6ICcnLCAvLyBcbiAgICAgICAgICAgICAgICBPYmplY3RUeXBlOiAnJywgLy8gcmVxdWlyZVxuICAgICAgICAgICAgICAgIEFzc2lnbmF0aW9uTmFtZTogJydcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIGlmIChGZWF0dXJlLkNhZGFzdHJhbE51bWJlcikge1xuICAgICAgICAgICAgICAgIENvbnN0cnVjdGlvblByb3BlcnRpZXMuY2FkYXN0cmVOdW1iZXIgPSBGZWF0dXJlLkNhZGFzdHJhbE51bWJlcjtcbiAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgQ29uc3RydWN0aW9uUHJvcGVydGllcy5jYWRhc3RyZU51bWJlciA9ICcnO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgXG4gICAgICAgICAgICBDb25zdHJ1Y3Rpb25Qcm9wZXJ0aWVzLkFzc2lnbmF0aW9uTmFtZSA9IEZlYXR1cmUuQXNzaWduYXRpb25OYW1lO1xuICAgICAgICAgICAgQ29uc3RydWN0aW9uUHJvcGVydGllcy5PYmplY3RUeXBlID0gZ2V0VmFsdWVGcm9tRGljdChGZWF0dXJlLk9iamVjdFR5cGUsIGRab25lKTtcbiAgICAgICAgfVxuICAgICAgICBkZWZhdWx0IDp7XG4gICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ci0LjQvyDQvtCx0YrQtdC60YLQsCDQvdC1INGA0LDRgdC/0L7Qt9C90LDQvScpO1xuICAgICAgICB9XG4gICAgfVxuICAgIHJldHVybiB7XG4gICAgICAgIHBhcmNlbFByb3BlcnRpZXM6IFBhcmNlbFByb3BlcnRpZXMsXG4gICAgICAgIGNvbnN0cnVjdGlvblByb3BlcnRpZXM6IENvbnN0cnVjdGlvblByb3BlcnRpZXMsXG4gICAgICAgIHVuY29tcGxldGVkUHJvcGVydGllczogVW5jb21wbGV0ZWRQcm9wZXJ0aWVzLFxuICAgICAgICBidWlsZGluZ1Byb3BlcnRpZXM6IEJ1aWxkaW5nUHJvcGVydGllcyxcbiAgICAgICAgem9uZVByb3BlcnRpZXM6IFpvbmVQcm9wZXJ0aWVzLFxuICAgICAgICBib3VuZFByb3BlcnRpZXM6IEJvdW5kUHJvcGVydGllc1xuICAgIH07XG59OyIsInZhciBFUyA9IHJlcXVpcmUoJy4vc3BhdGlhbC9FbnRpdHlTcGF0aWFsLmpzJyk7XG52YXIgUHJvcHMgPSByZXF1aXJlKCcuL2NhZFByb3BzJyk7XG5cbnZhciBwcm9qTVNLID0ge1xuICAgICfQnNCh0JpfNzBf0LfQvtC90LBfNCc6ICcrcHJvaj10bWVyYyArbGF0XzA9MCArbG9uXzA9ODMuNzMzMzMzMzMzMzMgK2s9MSAreF8wPTQyNTAwMDAgK3lfMD0tNTkxMjkwMC41NjYgK2VsbHBzPWtyYXNzICt0b3dnczg0PTIzLjU3LC0xNDAuOTUsLTc5LjgsMCwwLjM1LDAuNzksLTAuMjIgK3VuaXRzPW0gK25vX2RlZnMnXG59O1xuXG5tb2R1bGUuZXhwb3J0cy5HZW9KU09OID0gZnVuY3Rpb24gKHhtbERhdGEpIHtcblxuICAgIHZhciBnZW9KU09OUXVhcnRhbCA9IHtcbiAgICAgICAgdHlwZTogXCJGZWF0dXJlQ29sbGVjdGlvblwiLFxuICAgICAgICBmZWF0dXJlczogW11cbiAgICB9O1xuICAgIHZhciBnZW9KU09OQm91bmRzID0ge1xuICAgICAgICB0eXBlOiBcIkZlYXR1cmVDb2xsZWN0aW9uXCIsXG4gICAgICAgIGZlYXR1cmVzOiBbXVxuICAgIH07XG4gICAgdmFyIGdlb0pTT05ab25lcyA9IHtcbiAgICAgICAgdHlwZTogXCJGZWF0dXJlQ29sbGVjdGlvblwiLFxuICAgICAgICBmZWF0dXJlczogW11cbiAgICB9O1xuICAgIHZhciBnZW9KU09OUGFyY2VscyA9IHtcbiAgICAgICAgJ3R5cGUnOiAnRmVhdHVyZUNvbGxlY3Rpb24nLFxuICAgICAgICAnZmVhdHVyZXMnOiBbXVxuICAgIH07XG4gICAgdmFyIGdlb0pTT05SZWFsdHkgPSB7XG4gICAgICAgIHR5cGU6IFwiRmVhdHVyZUNvbGxlY3Rpb25cIixcbiAgICAgICAgZmVhdHVyZXM6IFtdXG4gICAgfTtcbiAgICAvLyDQkiBHZW9KU09OINC90LXRgiDQvtC60YDRg9C20L3QvtGB0YLQtdC5INC4INC+0LHRgNCw0LHQsNGC0YvQstCw0YLRjCDRgdGC0LDQvdC00LDRgNGC0L3Ri9C80Lgg0L/QsNGA0YHQtdGA0LDQvNC4INC90LXQu9GM0LfRj1xuICAgIHZhciBnZW9KU09OUmVhbHR5Q2lyY2xlID0ge1xuICAgICAgICB0eXBlOiBcIkNpcmNsZUNvbGxlY3Rpb25cIixcbiAgICAgICAgZmVhdHVyZXM6IFtdXG4gICAgfTtcbiAgICB2YXIgZ2VvSlNPTk9TTVBvaW50cyA9IHtcbiAgICAgICAgdHlwZTogXCJGZWF0dXJlQ29sbGVjdGlvblwiLFxuICAgICAgICBmZWF0dXJlczogW11cbiAgICB9O1xuXG4gICAgdmFyIEFsbERhdGEgPSAkLnhtbDJqc29uKHhtbERhdGEpLkNhZGFzdHJhbEJsb2Nrcy5DYWRhc3RyYWxCbG9jaztcbiAgICBjb25zb2xlLmxvZyhBbGxEYXRhKTtcblxuICAgIC8vINCe0LHRgNCw0LHQvtGC0LrQsCDQutCy0LDRgNGC0LDQu9CwLiDQndC1INC80L7QttC10YIg0LHRi9GC0Ywg0LzQvdC+0LPQvtC60L7QvdGC0YPRgNC90YvQvCAgICAgICAgICAgXG4gICAgaWYgKEFsbERhdGEuU3BhdGlhbERhdGEgIT09IG51bGwpIHtcbiAgICAgICAgdmFyIHNwT2JqID0gRVMuZ2V0RW50aXR5U3BhdGlhbChBbGxEYXRhLlNwYXRpYWxEYXRhLkVudGl0eVNwYXRpYWwsIHByb2pNU0ssIGZhbHNlKTtcbiAgICAgICAgaWYgKChzcE9iaiA9PT0gdW5kZWZpbmVkKSB8fCAoc3BPYmoubGVuZ3RoID09PSAwKSkge1xuICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDQutCy0LDRgNGC0LDQu9CwINGBINC/0YPRgdGC0L7QuSDQs9C10L7QvNC10YLRgNC40LXQuSEg0J7QsdGK0LXQutGCINCx0YPQtNC10YIg0L/RgNC+0L/Rg9GJ0LXQvS4nKTtcbiAgICAgICAgfVxuICAgICAgICAvLyDQmtCy0LDRgNGC0LDQu1xuICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICd0eXBlJzogJ0ZlYXR1cmUnXG4gICAgICAgIH07XG4gICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgLy8g0J7RgdGC0LDQu9GM0L3Ri9C1INGB0LLQvtC50YHRgtCy0LAuLi4uXG5cbiAgICAgICAgZ2VvSlNPTlF1YXJ0YWwuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICB9IGVsc2Uge1xuICAgICAgICBjb25zb2xlLmxvZygn0J3QtdGCINC+0L/QuNGB0LDQvdC40Y8g0L/RgNC+0YHRgtGA0LDQvdGB0YLQstC10L3QvdC+0Lkg0YHQvtGB0YLQsNCy0LvRj9GO0YnQtdC5INC60LLQsNGA0YLQsNC70LAnKTtcbiAgICB9XG5cbiAgICAvLyDQntCx0YDQsNCx0L7RgtC60LAg0LPRgNCw0L3QuNGGLiDQndC1INC80L7Qs9GD0YIg0LHRi9GC0Ywg0LzQvdC+0LPQvtC60L7QvdGC0YPRgNC90YvQvNC4XG4gICAgaWYgKEFsbERhdGEuQm91bmRzKSB7XG5cbiAgICAgICAgaWYgKEFsbERhdGEuQm91bmRzLkJvdW5kLnNwbGljZSkge1xuICAgICAgICAgICAgZm9yICh2YXIgaSA9IDA7IGkgPCBBbGxEYXRhLkJvdW5kcy5Cb3VuZC5sZW5ndGg7IGkrKykge1xuICAgICAgICAgICAgICAgIGlmIChBbGxEYXRhLkJvdW5kcy5Cb3VuZFtpXS5Cb3VuZGFyaWVzLkJvdW5kYXJ5LnNwbGljZSkge1xuICAgICAgICAgICAgICAgICAgICBmb3IgKHZhciBrID0gMDsgayA8IEFsbERhdGEuQm91bmRzLkJvdW5kW2ldLkJvdW5kYXJpZXMuQm91bmRhcnkubGVuZ3RoOyBrKyspIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIC8vINCT0YDQsNC90LjRhtCwXG4gICAgICAgICAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAndHlwZSc6ICdGZWF0dXJlJ1xuICAgICAgICAgICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGlmIChBbGxEYXRhLkJvdW5kcy5Cb3VuZFtpXS5Cb3VuZGFyaWVzLkJvdW5kYXJ5W2tdLkVudGl0eVNwYXRpYWwgIT09IG51bGwpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB2YXIgc3BPYmogPSBFUy5nZXRFbnRpdHlTcGF0aWFsKEFsbERhdGEuQm91bmRzLkJvdW5kW2ldLkJvdW5kYXJpZXMuQm91bmRhcnlba10uRW50aXR5U3BhdGlhbCwgcHJvak1TSywgZmFsc2UpO1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGlmICgoc3BPYmogPT09IHVuZGVmaW5lZCkgfHwgKHNwT2JqLmxlbmd0aCA9PT0gMCkpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDQk9GA0LDQvdC40YbRiyDRgSDQv9GD0YHRgtC+0Lkg0LPQtdC+0LzQtdGC0YDQuNC10LkhINCe0LHRitC10LrRgiDQsdGD0LTQtdGCINC/0YDQvtC/0YPRidC10L0uJyk7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIGNvbnRpbnVlO1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgLy8g0J7RgdGC0LDQu9GM0L3Ri9C1INGB0LLQvtC50YHRgtCy0LAuLi4uXG5cbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBnZW9KU09OQm91bmRzLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIC8vY29uc29sZS5sb2coJ9Cd0LXRgiDQvtC/0LjRgdCw0L3QuNGPINC/0YDQvtGB0YLRgNCw0L3RgdGC0LLQtdC90L3QvtC5INGB0L7RgdGC0LDQstC70Y/RjtGJ0LXQuSDQs9GA0LDQvdC40YbRiycpO1xuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICAgICAgLy8g0JPRgNCw0L3QuNGG0LBcbiAgICAgICAgICAgICAgICAgICAgdmFyIGZlYXR1cmUgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAndHlwZSc6ICdGZWF0dXJlJ1xuICAgICAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgICAgICB2YXIgc3BPYmogPSBFUy5nZXRFbnRpdHlTcGF0aWFsKEFsbERhdGEuQm91bmRzLkJvdW5kW2ldLkJvdW5kYXJpZXMuQm91bmRhcnkuRW50aXR5U3BhdGlhbCwgcHJvak1TSywgZmFsc2UpO1xuICAgICAgICAgICAgICAgICAgICBpZiAoKHNwT2JqID09PSB1bmRlZmluZWQpIHx8IChzcE9iai5sZW5ndGggPT09IDApKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0J7QsdGK0LXQutGCINCT0YDQsNC90LjRhtGLINGBINC/0YPRgdGC0L7QuSDQs9C10L7QvNC10YLRgNC40LXQuSEg0J7QsdGK0LXQutGCINCx0YPQtNC10YIg0L/RgNC+0L/Rg9GJ0LXQvS4nKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGNvbnRpbnVlO1xuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgICAgICAgICAgICAgLy8g0J7RgdGC0LDQu9GM0L3Ri9C1INGB0LLQvtC50YHRgtCy0LAuLi4uXG5cbiAgICAgICAgICAgICAgICAgICAgZ2VvSlNPTkJvdW5kcy5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgIHZhciBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoQWxsRGF0YS5Cb3VuZHMuQm91bmQuQm91bmRhcmllcy5Cb3VuZGFyeS5FbnRpdHlTcGF0aWFsLCBwcm9qTVNLLCBmYWxzZSk7XG4gICAgICAgICAgICBpZiAoKHNwT2JqID09PSB1bmRlZmluZWQpIHx8IChzcE9iai5sZW5ndGggPT09IDApKSB7XG4gICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Ce0LHRitC10LrRgiDQk9GA0LDQvdC40YbRiyDRgSDQv9GD0YHRgtC+0Lkg0LPQtdC+0LzQtdGC0YDQuNC10LkhINCe0LHRitC10LrRgiDQsdGD0LTQtdGCINC/0YDQvtC/0YPRidC10L0uJyk7XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG4gICAgICAgICAgICAvLyDQntGB0YLQsNC70YzQvdGL0LUg0YHQstC+0LnRgdGC0LLQsC4uLi5cblxuICAgICAgICAgICAgZ2VvSlNPTkJvdW5kcy5mZWF0dXJlcy5wdXNoKGZlYXR1cmUpO1xuICAgICAgICB9XG4gICAgfVxuICAgIC8vINCe0LHRgNCw0LHQvtGC0LrQsCDQt9C+0L0uINCd0LUg0LzQvtCz0YPRgiDQsdGL0YLRjCDQvNC90L7Qs9C+0LrQvtC90YLRg9GA0L3Ri9C80LhcbiAgICBpZiAoQWxsRGF0YS5ab25lcykge1xuXG4gICAgICAgIGlmIChBbGxEYXRhLlpvbmVzLlpvbmUuc3BsaWNlKSB7XG4gICAgICAgICAgICBmb3IgKHZhciBpID0gMDsgaSA8IEFsbERhdGEuWm9uZXMuWm9uZS5sZW5ndGg7IGkrKykge1xuICAgICAgICAgICAgICAgIC8vINCX0L7QvdCwXG4gICAgICAgICAgICAgICAgdmFyIGZlYXR1cmUgPSB7XG4gICAgICAgICAgICAgICAgICAgICd0eXBlJzogJ0ZlYXR1cmUnXG4gICAgICAgICAgICAgICAgfTtcbiAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5ab25lcy5ab25lW2ldLkVudGl0eVNwYXRpYWwgIT09IG51bGwpIHtcbiAgICAgICAgICAgICAgICAgICAgdmFyIHNwT2JqID0gRVMuZ2V0RW50aXR5U3BhdGlhbChBbGxEYXRhLlpvbmVzLlpvbmVbaV0uRW50aXR5U3BhdGlhbCwgcHJvak1TSywgZmFsc2UpO1xuICAgICAgICAgICAgICAgICAgICBpZiAoKHNwT2JqID09PSB1bmRlZmluZWQpIHx8IChzcE9iai5sZW5ndGggPT09IDApKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0J7QsdGK0LXQutGCINCX0L7QvdGLINGBINC/0YPRgdGC0L7QuSDQs9C10L7QvNC10YLRgNC40LXQuSEg0J7QsdGK0LXQutGCINCx0YPQtNC10YIg0L/RgNC+0L/Rg9GJ0LXQvS4nKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGNvbnRpbnVlO1xuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcblxuICAgICAgICAgICAgICAgICAgICBnZW9KU09OWm9uZXMuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0J3QtdGCINC+0L/QuNGB0LDQvdC40Y8g0L/RgNC+0YHRgtGA0LDQvdGB0YLQstC10L3QvdC+0Lkg0YHQvtGB0YLQsNCy0LvRj9GO0YnQtdC5INC30L7QvdGLJyk7XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfVxuICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgaWYgKEFsbERhdGEuWm9uZXMuWm9uZS5FbnRpdHlTcGF0aWFsICE9PSBudWxsKSB7XG4gICAgICAgICAgICAgICAgLy8g0JfQvtC90LBcbiAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICAgICAgICAgJ3R5cGUnOiAnRmVhdHVyZSdcbiAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgIHZhciBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoQWxsRGF0YS5ab25lcy5ab25lLkVudGl0eVNwYXRpYWwsIHByb2pNU0ssIGZhbHNlKTtcbiAgICAgICAgICAgICAgICBpZiAoKHNwT2JqID09PSB1bmRlZmluZWQpIHx8IChzcE9iai5sZW5ndGggPT09IDApKSB7XG4gICAgICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQntCx0YrQtdC60YIg0JfQvtC90Ysg0YEg0L/Rg9GB0YLQvtC5INCz0LXQvtC80LXRgtGA0LjQtdC5ISDQntCx0YrQtdC60YIg0LHRg9C00LXRgiDQv9GA0L7Qv9GD0YnQtdC9LicpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICBmZWF0dXJlLmdlb21ldHJ5ID0gc3BPYmo7XG5cbiAgICAgICAgICAgICAgICBnZW9KU09OWm9uZXMuZmVhdHVyZXMucHVzaChmZWF0dXJlKTtcbiAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgY29uc29sZS5sb2coJ9Cd0LXRgiDQvtC/0LjRgdCw0L3QuNGPINC/0YDQvtGB0YLRgNCw0L3RgdGC0LLQtdC90L3QvtC5INGB0L7RgdGC0LDQstC70Y/RjtGJ0LXQuSDQt9C+0L3RiycpO1xuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuICAgIC8vINCe0LHRgNCw0LHQvtGC0LrQsCDQstGB0LXRhSDQt9C10LzQtdC70YzQvdGL0YUg0YPRh9Cw0YHRgtC60L7QslxuICAgIGZvciAodmFyIGUgPSAwOyBlIDwgQWxsRGF0YS5QYXJjZWxzLlBhcmNlbC5sZW5ndGg7IGUrKykge1xuICAgICAgICB2YXIgc3BPYmogPSBudWxsO1xuICAgICAgICAvLyDQl9C10LzQtdC70YzQvdGL0Lkg0YPRh9Cw0YHRgtC+0LpcbiAgICAgICAgdmFyIGZlYXR1cmUgPSB7XG4gICAgICAgICAgICAndHlwZSc6ICdGZWF0dXJlJ1xuICAgICAgICB9O1xuICAgICAgICBpZiAoQWxsRGF0YS5QYXJjZWxzLlBhcmNlbFtlXS5FbnRpdHlTcGF0aWFsICE9PSB1bmRlZmluZWQpIHtcbiAgICAgICAgICAgIHNwT2JqID0gRVMuZ2V0RW50aXR5U3BhdGlhbChBbGxEYXRhLlBhcmNlbHMuUGFyY2VsW2VdLkVudGl0eVNwYXRpYWwsIHByb2pNU0ssIGZhbHNlKTtcbiAgICAgICAgICAgIGlmICgoc3BPYmogPT09IHVuZGVmaW5lZCkgfHwgKHNwT2JqLmxlbmd0aCA9PT0gMCkpIHtcbiAgICAgICAgICAgICAgICBjb250aW51ZTtcbiAgICAgICAgICAgIH1cblxuICAgICAgICB9XG4gICAgICAgIC8vINCc0L3QvtCz0L7QutC+0L3RgtGD0YDQvdGL0LlcbiAgICAgICAgZWxzZSBpZiAoQWxsRGF0YS5QYXJjZWxzLlBhcmNlbFtlXS5Db250b3Vycykge1xuICAgICAgICAgICAgdmFyIENvbnRvdXJzID0gQWxsRGF0YS5QYXJjZWxzLlBhcmNlbFtlXS5Db250b3Vycy5Db250b3VyO1xuICAgICAgICAgICAgdmFyIG11bHRpUG9seWdvbiA9IFtdO1xuICAgICAgICAgICAgZm9yICh2YXIgYyA9IDA7IGMgPCBDb250b3Vycy5sZW5ndGg7IGMrKykge1xuICAgICAgICAgICAgICAgIHZhciBlcyA9IENvbnRvdXJzW2NdLkVudGl0eVNwYXRpYWw7XG4gICAgICAgICAgICAgICAgdmFyIHAgPSBFUy5nZXRFbnRpdHlTcGF0aWFsKGVzLCBwcm9qTVNLLCB0cnVlKTtcbiAgICAgICAgICAgICAgICBpZiAocCkge1xuICAgICAgICAgICAgICAgICAgICBtdWx0aVBvbHlnb24ucHVzaChwKTtcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICBzcE9iaiA9IHtcbiAgICAgICAgICAgICAgICB0eXBlOiBcIk11bHRpUG9seWdvblwiLFxuICAgICAgICAgICAgICAgIGNvb3JkaW5hdGVzOiBtdWx0aVBvbHlnb25cbiAgICAgICAgICAgIH07XG4gICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQndC10YIg0L7Qv9C40YHQsNC90LjRjyDQv9GA0L7RgdGC0YDQsNC90YHRgtCy0LXQvdC90L7QuSDRgdC+0YHRgtCw0LLQu9GP0Y7RidC10LknKTtcbiAgICAgICAgfVxuXG4gICAgICAgIC8vINCV0YHQu9C4INC90LXRgiDQs9C10L7QvNC10YLRgNC40LgsINGC0L4g0L7QsdGK0LXQutGCINC90LUg0L3Rg9C20LXQvVxuICAgICAgICBpZiAoc3BPYmopIHtcbiAgICAgICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgICAgIC8vINCe0YHRgtCw0LvRjNC90YvQtSDRgdCy0L7QudGB0YLQstCwLi4uLlxuICAgICAgICAgICAgdmFyIHByb3BzID0gUHJvcHMuZ2V0UHJvcGVydGllcyhBbGxEYXRhLlBhcmNlbHMuUGFyY2VsW2VdLCAnUGFyY2VsJyk7XG4gICAgICAgICAgICBpZiAocHJvcHMpIHtcbiAgICAgICAgICAgICAgICBmZWF0dXJlLnByb3BlcnRpZXMgPSBwcm9wcy5wYXJjZWxQcm9wZXJ0aWVzO1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgLy9jb25zb2xlLmxvZygn0J7QsdGK0LXQutGCINGB0L7Qt9C00LDQvS4g0JrQnTonICsgZmVhdHVyZS5wcm9wZXJ0aWVzLmNhZGFzdHJlTnVtYmVyKTtcbiAgICAgICAgICAgIGdlb0pTT05QYXJjZWxzLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgIH1cblxuICAgIH1cbiAgICAvLyDQntCx0YDQsNCx0L7RgtC60LAg0YHRgtGA0L7QtdC90LjQuS4g0J3QtSDQvNC+0LPRg9GCINCx0YvRgtGMINC80L3QvtCz0L7QutC+0L3RgtGD0YDQvdGL0LzQuFxuICAgIGlmIChBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5KSB7XG4gICAgICAgIGlmIChBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5LnNwbGljZSkge1xuXG4gICAgICAgICAgICBmdW5jdGlvbiBwcm9jZXNzRVMoRW50aXR5U3BhdGlhbCkge1xuICAgICAgICAgICAgICAgIHZhciBzcE9iaiA9IEVTLmdldEVudGl0eVNwYXRpYWwoRW50aXR5U3BhdGlhbCwgcHJvak1TSyk7XG4gICAgICAgICAgICAgICAgaWYgKHNwT2JqKSB7XG4gICAgICAgICAgICAgICAgICAgIGZlYXR1cmUuZ2VvbWV0cnkgPSBzcE9iajtcbiAgICAgICAgICAgICAgICAgICAgaWYgKHNwT2JqLnR5cGUgPT09ICdDaXJjbGUnKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICBnZW9KU09OUmVhbHR5Q2lyY2xlLmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0JTQvtCx0LDQstC70LXQvSBnZW9KU09OUmVhbHR5Q2lyY2xlJyk7XG4gICAgICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgICAgICBnZW9KU09OUmVhbHR5LmZlYXR1cmVzLnB1c2goZmVhdHVyZSk7XG4gICAgICAgICAgICAgICAgICAgICAgICBjb25zb2xlLmxvZygn0JTQvtCx0LDQstC70LXQvSBnZW9KU09OUmVhbHR5LiBUeXBlICcgKyBzcE9iai50eXBlKTtcbiAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIH0gZWxzZSB7XG4gICAgICAgICAgICAgICAgICAgIGNvbnNvbGUubG9nKCfQntCa0KEg0YEg0L/Rg9GB0YLQvtC5INCz0LXQvtC80LXRgtGA0LjQtdC5ISDQntCx0YrQtdC60YIg0LHRg9C00LXRgiDQv9GA0L7Qv9GD0YnQtdC9LicpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cblxuICAgICAgICAgICAgZm9yICh2YXIgaSA9IDA7IGkgPCBBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5Lmxlbmd0aDsgaSsrKSB7XG4gICAgICAgICAgICAgICAgdmFyIHNwT2JqID0gbnVsbDtcbiAgICAgICAgICAgICAgICAvLyDQntCa0KFcbiAgICAgICAgICAgICAgICB2YXIgZmVhdHVyZSA9IHtcbiAgICAgICAgICAgICAgICAgICAgJ3R5cGUnOiAnRmVhdHVyZSdcbiAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgICAgIC8vINGB0YLRgNC+0LXQvdC40Y9cbiAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5CdWlsZGluZykge1xuICAgICAgICAgICAgICAgICAgICBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5CdWlsZGluZy5FbnRpdHlTcGF0aWFsKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICB2YXIgcHJvcHMgPSBQcm9wcy5nZXRQcm9wZXJ0aWVzKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uQnVpbGRpbmcsICdCdWlsZGluZycpO1xuICAgICAgICAgICAgICAgICAgICAgICAgaWYgKHByb3BzKSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgZmVhdHVyZS5wcm9wZXJ0aWVzID0gcHJvcHMuYnVpbGRpbmdQcm9wZXJ0aWVzO1xuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICAgcHJvY2Vzc0VTKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uQnVpbGRpbmcuRW50aXR5U3BhdGlhbCk7XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgLy8g0L7QsdGK0LXQutGC0Ysg0L3QtdC30LDQstC10YDRiNGR0L3QvdC+0LPQviDRgdGC0YDQvtC40YLQtdC70YzRgdGC0LLQsFxuICAgICAgICAgICAgICAgIGVsc2UgaWYgKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uVW5jb21wbGV0ZWQpIHtcbiAgICAgICAgICAgICAgICAgICAgaWYgKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uVW5jb21wbGV0ZWQuRW50aXR5U3BhdGlhbCkge1xuICAgICAgICAgICAgICAgICAgICAgICAgdmFyIHByb3BzID0gUHJvcHMuZ2V0UHJvcGVydGllcyhBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLlVuY29tcGxldGVkLCAnVW5jb21wbGV0ZWQnKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGlmIChwcm9wcykge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGZlYXR1cmUucHJvcGVydGllcyA9IHByb3BzLnVuY29tcGxldGVkUHJvcGVydGllcztcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgIHByb2Nlc3NFUyhBbGxEYXRhLk9iamVjdHNSZWFsdHkuT2JqZWN0UmVhbHR5W2ldLlVuY29tcGxldGVkLkVudGl0eVNwYXRpYWwpO1xuICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgIC8vINGB0L7QvtGA0YPQttC10L3QuNGPXG4gICAgICAgICAgICAgICAgZWxzZSBpZiAoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5Db25zdHJ1Y3Rpb24pIHtcbiAgICAgICAgICAgICAgICAgICAgaWYgKEFsbERhdGEuT2JqZWN0c1JlYWx0eS5PYmplY3RSZWFsdHlbaV0uQ29uc3RydWN0aW9uLkVudGl0eVNwYXRpYWwpIHtcbiAgICAgICAgICAgICAgICAgICAgICAgIHZhciBwcm9wcyA9IFByb3BzLmdldFByb3BlcnRpZXMoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5Db25zdHJ1Y3Rpb24sICdDb25zdHJ1Y3Rpb24nKTtcbiAgICAgICAgICAgICAgICAgICAgICAgIGlmIChwcm9wcykge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIGZlYXR1cmUucHJvcGVydGllcyA9IHByb3BzLmNvbnN0cnVjdGlvblByb3BlcnRpZXM7XG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICBwcm9jZXNzRVMoQWxsRGF0YS5PYmplY3RzUmVhbHR5Lk9iamVjdFJlYWx0eVtpXS5Db25zdHJ1Y3Rpb24uRW50aXR5U3BhdGlhbCk7XG4gICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG4gICAgLy8g0J7QsdGA0LDQsdC+0YLQutCwINC/0YPQvdC60YLQvtCyINCe0JzQoVxuXG4gICAgcmV0dXJuIHtcbiAgICAgICAgZ2VvSlNPTlF1YXJ0YWw6IGdlb0pTT05RdWFydGFsLFxuICAgICAgICBnZW9KU09OQm91bmRzOiBnZW9KU09OQm91bmRzLCBcbiAgICAgICAgZ2VvSlNPTlpvbmVzOiBnZW9KU09OWm9uZXMsXG4gICAgICAgIGdlb0pTT05QYXJjZWxzOiBnZW9KU09OUGFyY2VscyxcbiAgICAgICAgZ2VvSlNPTlJlYWx0eTogZ2VvSlNPTlJlYWx0eSxcbiAgICAgICAgZ2VvSlNPTlJlYWx0eUNpcmNsZTogZ2VvSlNPTlJlYWx0eUNpcmNsZVxuICAgIH07XG59O1xuIiwiLyoqXG4gKiDQnNC+0LTRg9C70Ywg0L7QsdGA0LDQsdC+0YLQutC4INCz0LXQvtC80LXRgtGA0LjQuCDRgtC40L/QsCDQv9C+0LvQuNCz0L7QvS5cbiAqINCe0LTQuNC9INCy0L3QtdGI0L3QuNC5INC60L7QvdGC0YPRgCDQuCAwINC40LvQuCDQsdC+0LvQtdC1INCy0L3Rg9GC0YDQtdC90L3QuNGFINC60L7QvdGC0YPRgNC+0LItXCLQtNGL0YDQvtC6XCJcbiAqIFxuICogR2VvSlNPTiBnZW9tZXRyeSDRgtC40L/QsCB0RW50aXR5U3BhdGlhbExhbmRPdXRcbiAqL1xuXG4vL1wiZ2VvbWV0cnlcIjoge1xuLy8gICAgXCJ0eXBlXCI6IFwiUG9seWdvblwiLFxuLy8gICAgXCJjb29yZGluYXRlc1wiOiBbXG4vLyAgICAgIFsgWzEwMC4wLCAwLjBdLCBbMTAxLjAsIDAuMF0sIFsxMDEuMCwgMS4wXSxcbi8vICAgICAgICBbMTAwLjAsIDEuMF0sIFsxMDAuMCwgMC4wXSBdXG4vLyAgICAgIF1cbi8vICB9XG5cblxubW9kdWxlLmV4cG9ydHMuZ2V0RW50aXR5U3BhdGlhbCA9IGZ1bmN0aW9uIChFbnRpdHlTcGF0aWFsT2JqLCBwcm9qLCBwYXJ0T2ZNdWx0dSkge1xuXG4vL1x0dGhpcy5nZW9tZXRyeSA9IHtcbi8vICAgICAgICB0eXBlOiAnJyxcbi8vXHRcdGNvb3JkaW5hdGVzOiBbXVxuLy9cdH07XG5cbiAgICAvL3ZhciBFbnRpdHlTcGF0aWFsID0gW107XG4gICAgdmFyIEFyZWEgPSAwLjA7XG5cbiAgICAvLyDQktGL0YfQuNGB0LvQtdC90LjQtSDQv9C70L7RidCw0LTQuCDQt9Cw0LzQutC90YPRgtC+0LPQviDQutC+0L3RgtGD0YDQsFxuICAgIGZ1bmN0aW9uIHBvbHlnb25BcmVhKFhzLCBZcywgbnVtUG9pbnRzKSB7XG4gICAgICAgIHZhciBhcmVhID0gMDtcbiAgICAgICAgdmFyIGogPSBudW1Qb2ludHMgLSAxO1xuICAgICAgICBmb3IgKHZhciBpID0gMDsgaSA8IG51bVBvaW50czsgaSsrKVxuICAgICAgICB7XG4gICAgICAgICAgICBhcmVhID0gYXJlYSArICgoWHNbal0pICsgKFhzW2ldKSkgKiAoKFlzW2pdKSAtIChZc1tpXSkpO1xuICAgICAgICAgICAgaiA9IGk7ICAvL2ogaXMgcHJldmlvdXMgdmVydGV4IHRvIGlcbiAgICAgICAgfVxuICAgICAgICByZXR1cm4gTWF0aC5hYnMoYXJlYSAvIDIpO1xuICAgIH1cbiAgICBcbiAgICBmdW5jdGlvbiBjb252ZXJ0Q29vcmQoY29vcmQpIHtcbiAgICAgICAgLy8gZ2xvYmFsXG4gICAgICAgIHJldHVybiBwcm9qNChwcm9qW1wi0JzQodCaXzcwX9C30L7QvdCwXzRcIl0sICdFUFNHOjM4NTcnLCBjb29yZCk7XG4gICAgfVxuICAgIFxuICAgIC8vINCh0L7Qt9C00LDQvdC40LUg0L7QtNC90L7Qs9C+INC30LDQvNC60L3Rg9GC0L7Qs9C+INC60L7QvdGC0YPRgNCwXG4gICAgZnVuY3Rpb24gY3JlYXRlQ29udG91cihTcGF0aWFsRWxlbWVudCkge1xuICAgICAgICB2YXIgeHMgPSBbXTtcbiAgICAgICAgdmFyIHlzID0gW107XG4gICAgICAgIHZhciBjb250b3VyID0gW107XG4gICAgICAgIHZhciBjb29yZDtcbiAgICAgICAgdmFyIHJlcHJvamVjdGVkO1xuICAgICAgICAvLyDQv9GA0L7QstC10YDQutCwINC90LAg0L7QutGA0YPQttC90L7RgdGC0YxcbiAgICAgICAgaWYgKChwYXJ0T2ZNdWx0dSA9PT0gdW5kZWZpbmVkKSAmJlxuICAgICAgICAgICAgICAgIChTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0LlIgIT09IHVuZGVmaW5lZCkpIHtcbiAgICAgICAgICAgIGNvb3JkID0gW1NwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXQuT3JkaW5hdGUuWSwgU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5PcmRpbmF0ZS5YXTtcbiAgICAgICAgICAgIHJlcHJvamVjdGVkID0gY29udmVydENvb3JkKGNvb3JkKTtcbiAgICAgICAgICAgIHJldHVybiB7XG4gICAgICAgICAgICAgICAgXG4gICAgICAgICAgICAgICAgJ1InOiBOdW1iZXIoU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5SKSxcbiAgICAgICAgICAgICAgICAnWCc6IE51bWJlcihyZXByb2plY3RlZFswXSksXG4gICAgICAgICAgICAgICAgJ1knOiBOdW1iZXIocmVwcm9qZWN0ZWRbMV0pXG4gICAgICAgICAgICB9O1xuICAgICAgICB9IGVsc2Uge1xuICAgICAgICAgICAgdmFyIGZpcnN0UG9pbnQgPSBTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0WzBdO1xuICAgICAgICAgICAgdmFyIGxhc3RQb2ludCA9IFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXRbU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5sZW5ndGgtMV07XG4gICAgICAgICAgICBpZiAoZmlyc3RQb2ludC5TdU5tYiA9PT0gbGFzdFBvaW50LlN1Tm1iKSB7XG4gICAgICAgICAgICAgICAgTGluZVN0cmluZyA9IGZhbHNlO1xuICAgICAgICAgICAgICAgIGZvciAodmFyIGogPSAwOyBqIDwgU3BhdGlhbEVsZW1lbnQuU3BlbGVtZW50VW5pdC5sZW5ndGg7IGorKykge1xuICAgICAgICAgICAgICAgICAgICB2YXIgcG9pbnQgPSBTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0W2pdO1xuICAgICAgICAgICAgICAgICAgICB2YXIgeHkgPSBbXTtcbiAgICAgICAgICAgICAgICAgICAgeHMucHVzaChwYXJzZUZsb2F0KHBvaW50Lk9yZGluYXRlLlkpKTtcbiAgICAgICAgICAgICAgICAgICAgeXMucHVzaChwYXJzZUZsb2F0KHBvaW50Lk9yZGluYXRlLlgpKTtcbiAgICAgICAgICAgICAgICAgICAgY29vcmQgPSBbcGFyc2VGbG9hdChwb2ludC5PcmRpbmF0ZS5ZKSwgcGFyc2VGbG9hdChwb2ludC5PcmRpbmF0ZS5YKV07XG4gICAgICAgICAgICAgICAgICAgIHJlcHJvamVjdGVkID0gY29udmVydENvb3JkKGNvb3JkKTtcbiAgICAgICAgICAgICAgICAgICAgeHkucHVzaChyZXByb2plY3RlZFswXSk7XG4gICAgICAgICAgICAgICAgICAgIHh5LnB1c2gocmVwcm9qZWN0ZWRbMV0pO1xuICAgICAgICAgICAgICAgICAgICBjb250b3VyLnB1c2goeHkpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICBBcmVhID0gcG9seWdvbkFyZWEoeHMsIHlzLCB4cy5sZW5ndGgpO1xuICAgICAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgICAgICBMaW5lU3RyaW5nID0gdHJ1ZTtcbiAgICAgICAgICAgICAgICBmb3IgKHZhciBqID0gMDsgaiA8IFNwYXRpYWxFbGVtZW50LlNwZWxlbWVudFVuaXQubGVuZ3RoLTE7IGorKykge1xuICAgICAgICAgICAgICAgICAgICB2YXIgcG9pbnQgPSBTcGF0aWFsRWxlbWVudC5TcGVsZW1lbnRVbml0W2pdO1xuICAgICAgICAgICAgICAgICAgICB2YXIgeHkgPSBbXTtcbiAgICAgICAgICAgICAgICAgICAgeHMucHVzaChwYXJzZUZsb2F0KHBvaW50Lk9yZGluYXRlLlkpKTtcbiAgICAgICAgICAgICAgICAgICAgeXMucHVzaChwYXJzZUZsb2F0KHBvaW50Lk9yZGluYXRlLlgpKTtcbiAgICAgICAgICAgICAgICAgICAgY29vcmQgPSBbcGFyc2VGbG9hdChwb2ludC5PcmRpbmF0ZS5ZKSwgcGFyc2VGbG9hdChwb2ludC5PcmRpbmF0ZS5YKV07XG4gICAgICAgICAgICAgICAgICAgIHJlcHJvamVjdGVkID0gY29udmVydENvb3JkKGNvb3JkKTtcbiAgICAgICAgICAgICAgICAgICAgeHkucHVzaChyZXByb2plY3RlZFswXSk7XG4gICAgICAgICAgICAgICAgICAgIHh5LnB1c2gocmVwcm9qZWN0ZWRbMV0pO1xuICAgICAgICAgICAgICAgICAgICBjb250b3VyLnB1c2goeHkpO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIC8vY29uc29sZS5sb2coQXJlYSk7XG4gICAgICAgICAgICByZXR1cm4gY29udG91cjtcbiAgICAgICAgfVxuICAgIH1cblxuICAgIGlmICgoRW50aXR5U3BhdGlhbE9iaiAhPT0gdW5kZWZpbmVkKSAmJiAoRW50aXR5U3BhdGlhbE9iaiAhPT0gbnVsbCkpIHtcbiAgICAgICAgdmFyIGNudHJzID0gW107XG4gICAgICAgIC8vINCj0YLQuNC90L3QsNGPINGC0LjQv9C40LfQsNGG0LjRjyDQtNC70Y8g0L/RgNC+0LLQtdGA0LrQuCDQvdCw0LvQuNGH0LjRjyDQtNGL0YDQvtC6INCyINC/0L7Qu9C40LPQvtC90LVcbiAgICAgICAgLy8g0JIg0KDQvtGB0YDQtdC10YHRgtGA0LUg0L3QtSDRgdC70LXQtNGP0YIg0LfQsCDQv9C+0YDRj9C00LrQvtC8INC60L7QvdGC0YPRgNC+0LIg0L/QvtC70LjQs9C+0L3QsFxuICAgICAgICBpZiAoRW50aXR5U3BhdGlhbE9iai5TcGF0aWFsRWxlbWVudC5zcGxpY2UpIHtcbiAgICAgICAgICAgIC8vY29uc29sZS5sb2coJ9Cf0L7Qu9C40LPQvtC9INGBINC00YvRgNC60LDQvNC4Jyk7XG5cbiAgICAgICAgICAgIHZhciBNYXhBcmVhO1xuICAgICAgICAgICAgdmFyIE1heEFyZWFJZHggPSAwO1xuICAgICAgICAgICAgZm9yICh2YXIgayA9IDA7IGsgPCBFbnRpdHlTcGF0aWFsT2JqLlNwYXRpYWxFbGVtZW50Lmxlbmd0aDsgaysrKSB7XG4gICAgICAgICAgICAgICAgdmFyIGNvbnRvdXIgPSBFbnRpdHlTcGF0aWFsT2JqLlNwYXRpYWxFbGVtZW50W2tdO1xuICAgICAgICAgICAgICAgIHZhciBjbnQgPSBjcmVhdGVDb250b3VyKGNvbnRvdXIpO1xuICAgICAgICAgICAgICAgIGlmIChjbnQpXG4gICAgICAgICAgICAgICAgICAgIGNudHJzLnB1c2goY250KTtcbiAgICAgICAgICAgICAgICBpZiAoQXJlYSA+IE1heEFyZWEpIHtcbiAgICAgICAgICAgICAgICAgICAgTWF4QXJlYSA9IEFyZWE7XG4gICAgICAgICAgICAgICAgICAgIE1heEFyZWFJZHggPSBrO1xuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIC8vINCf0LXRgNC10LzQtdGJ0LDQtdC8INC+0YHQvdC+0LLQvdC+0LkgKNC90LDRgNGD0LbQvdC40LkpINC60L7QvdGC0YPRgCDQsiDQvdCw0YfQsNC70L4g0LzQsNGB0YHQuNCy0LBcbiAgICAgICAgICAgIGlmIChNYXhBcmVhSWR4ID4gMCkge1xuICAgICAgICAgICAgICAgIHZhciBtYWluQ250ID0gY250cnMuc3BsaWNlKE1heEFyZWFJZHgsIDEpO1xuICAgICAgICAgICAgICAgIGNudHJzLnNwbGljZSgwLCAwLCBtYWluQ250KTtcbiAgICAgICAgICAgICAgICAvL2NvbnNvbGUubG9nKCfQndC+0LzQtdGAINC+0YHQvdC+0LLQvdC+0LPQviDQutC+0L3RgtGD0YDQsCDQsdGL0LsgJyArIE1heEFyZWFJZHgpO1xuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgICAvLyDQldGB0LvQuCDRjdGC0L4g0LTQu9GPINC80L3QvtCz0L7QutC+0L3RgtGD0YDQvdC+0LPQviDQvtCx0YrQtdC60YLQsCwg0YLQviDQstC+0LfQstGA0LDRidC10Lwg0LzQsNGB0YHQuNCyINC60L7QvdGC0YPRgNC+0LJcbiAgICAgICAgICAgIGlmIChwYXJ0T2ZNdWx0dSkge1xuICAgICAgICAgICAgICAgIHJldHVybiBjbnRycztcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIC8vINC00LvRjyDQntCa0KEuINCi0L7Qu9GM0LrQviDQvtC00LjQvSDQutC+0L3RgtGD0YBcbiAgICAgICAgICAgIGVsc2UgaWYgKHBhcnRPZk11bHR1ID09PSB1bmRlZmluZWQpIHtcbiAgICAgICAgICAgICAgICBpZiAoY250cnNbMF0uUikge1xuICAgICAgICAgICAgICAgICAgICByZXR1cm4ge1xuICAgICAgICAgICAgICAgICAgICAgICAgXCJ0eXBlXCI6IFwiQ2lyY2xlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBcImNvb3JkaW5hdGVzXCI6IFtjbnRyc1swXS5YLCBjbnRyc1swXS5ZXSxcbiAgICAgICAgICAgICAgICAgICAgICAgIFwicmFkaXVzXCI6IGNudHJzWzBdLlIsXG4gICAgICAgICAgICAgICAgICAgICAgICBcInByb3BlcnRpZXNcIjoge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgIFwicmFkaXVzX3VuaXRzXCI6IFwibVwiXG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgfSAvLyDQn9C+0LvQuNC70LjQvdGPINC70L7RjyDQntCa0KFcbiAgICAgICAgICAgIGVsc2UgaWYgKChwYXJ0T2ZNdWx0dSA9PT0gdW5kZWZpbmVkKSAmJiAoTGluZVN0cmluZykpIHtcbiAgICAgICAgICAgICAgICByZXR1cm4ge1xuICAgICAgICAgICAgICAgICAgICBcInR5cGVcIjogXCJNdWx0aUxpbmVTdHJpbmdcIixcbiAgICAgICAgICAgICAgICAgICAgXCJjb29yZGluYXRlc1wiOiBjbnRyc1xuICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICB9XG4gICAgICAgICAgICAvLyDQldGB0LvQuCDRjdGC0L4g0LTQu9GPINC/0YDQvtGB0YLQvtCz0L4g0L7QsdGK0LXQutGC0LAsINGC0L4g0LLQvtC30LLRgNCw0YnQtdC8INC+0LHRitC10LrRgiBnZW9tZXRyeVxuICAgICAgICAgICAgZWxzZSB7XG4gICAgICAgICAgICAgICAgcmV0dXJuIHtcbiAgICAgICAgICAgICAgICAgICAgdHlwZTogXCJQb2x5Z29uXCIsXG4gICAgICAgICAgICAgICAgICAgIGNvb3JkaW5hdGVzOiBjbnRyc1xuICAgICAgICAgICAgICAgIH07XG4gICAgICAgICAgICB9XG5cbiAgICAgICAgfSBlbHNlIHtcbiAgICAgICAgICAgIHZhciBjb250b3VyID0gRW50aXR5U3BhdGlhbE9iai5TcGF0aWFsRWxlbWVudDtcbiAgICAgICAgICAgIHZhciBwb2x5Z29uID0gY3JlYXRlQ29udG91cihjb250b3VyKTtcbiAgICAgICAgICAgIGNudHJzLnB1c2gocG9seWdvbik7XG4gICAgICAgICAgICAvLyDQldGB0LvQuCDRjdGC0L4g0LTQu9GPINC80L3QvtCz0L7QutC+0L3RgtGD0YDQvdC+0LPQviDQvtCx0YrQtdC60YLQsCwg0YLQviDQstC+0LfQstGA0LDRidC10Lwg0LzQsNGB0YHQuNCyINC60L7QvdGC0YPRgNC+0LJcbiAgICAgICAgICAgIGlmIChwYXJ0T2ZNdWx0dSkge1xuICAgICAgICAgICAgICAgIHJldHVybiBjbnRycztcbiAgICAgICAgICAgIH1cbiAgICAgICAgICAgIC8vINC00LvRjyDQntCa0KEuINCe0LrRgNGD0LbQvdC+0YHRgtGMXG4gICAgICAgICAgICBlbHNlIGlmICgocGFydE9mTXVsdHUgPT09IHVuZGVmaW5lZCkgJiYgKGNudHJzWzBdLlIpKSB7XG4gICAgICAgICAgICAgICAgcmV0dXJuIHtcbiAgICAgICAgICAgICAgICAgICAgXCJ0eXBlXCI6IFwiQ2lyY2xlXCIsXG4gICAgICAgICAgICAgICAgICAgIFwiY29vcmRpbmF0ZXNcIjogW2NudHJzWzBdLlgsIGNudHJzWzBdLlldLFxuICAgICAgICAgICAgICAgICAgICBcInJhZGl1c1wiOiBjbnRyc1swXS5SLFxuICAgICAgICAgICAgICAgICAgICBcInByb3BlcnRpZXNcIjoge1xuICAgICAgICAgICAgICAgICAgICAgICAgXCJyYWRpdXNfdW5pdHNcIjogXCJtXCJcbiAgICAgICAgICAgICAgICAgICAgfSBcbiAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgfSAvLyDQn9C+0LvQuNC70LjQvdGPINC70L7RjyDQntCa0KFcbiAgICAgICAgICAgIGVsc2UgaWYgKChwYXJ0T2ZNdWx0dSA9PT0gdW5kZWZpbmVkKSAmJiAoTGluZVN0cmluZykpIHtcbiAgICAgICAgICAgICAgICByZXR1cm4ge1xuICAgICAgICAgICAgICAgICAgICBcInR5cGVcIjogXCJMaW5lU3RyaW5nXCIsXG4gICAgICAgICAgICAgICAgICAgIFwiY29vcmRpbmF0ZXNcIjogY250cnNbMF1cbiAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgfVxuICAgICAgICAgICAgLy8g0JXRgdC70Lgg0Y3RgtC+INC00LvRjyDQv9GA0L7RgdGC0L7Qs9C+INC+0LHRitC10LrRgtCwLCDRgtC+INCy0L7Qt9Cy0YDQsNGJ0LXQvCDQvtCx0YrQtdC60YIgZ2VvbWV0cnlcbiAgICAgICAgICAgIGVsc2Uge1xuICAgICAgICAgICAgICAgIHJldHVybiB7XG4gICAgICAgICAgICAgICAgICAgIHR5cGU6IFwiUG9seWdvblwiLFxuICAgICAgICAgICAgICAgICAgICBjb29yZGluYXRlczogY250cnNcbiAgICAgICAgICAgICAgICB9O1xuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxufTtcbiJdfQ==
